
#Область ОсновнаяТочкаВхода

// Функция - Сформировать ссылку на оплату
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьСсылкуНаОплату(СтруктураПараметров) Экспорт
	
	СтруктураВозврата	= Новый Структура("ВыполненоУспешно, ОписаниеОшибки, СсылкаНаОплату, ВремяДействителенДо, НомерЗаказа", Ложь, Неопределено, Неопределено, Неопределено, Неопределено);	
	ПараметрыПШ			= СтруктураПараметров.ЭквайринговыйТерминал.ПараметрыПлатежногоШлюза.Получить();
	emailCompany		= КонтактнаяИнформацияВызовСервераСтома.ПолучитьКонтактнуюИнформацию(СтруктураПараметров.СтруктурнаяЕдиница, Ложь).Email;		
		
	Если ТипЗнч(ПараметрыПШ) <> Тип("Структура") Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не заполнены параметры платежного шлюза"; 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ТипБанка				= СтруктураПараметров.ЭквайринговыйТерминал.ТипБанка;
	ПараметрыПШ.ВремяЖизни	= ?(ЗначениеЗаполнено(ПараметрыПШ.ВремяЖизни), ПараметрыПШ.ВремяЖизни, 72); 
	
	СтруктураПараметров.Вставить("ПараметрыПШ"		, ПараметрыПШ); 
	СтруктураПараметров.Вставить("ТипБанка"			, ТипБанка);
	СтруктураПараметров.Вставить("СтруктураВозврата", СтруктураВозврата);
	
	Если ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСДМ И Не ЗначениеЗаполнено(emailCompany) Тогда
		СтруктураВозврата.ОписаниеОшибки = "В контактной информации структурной единицы не заполнен email"; 
		Возврат СтруктураВозврата;		
	КонецЕсли;
		
	Если ТипБанка = Перечисления.ПлатежныеШлюзы.СБПТинькофф Тогда
		Возврат Тинькофф_ЗарегистрироватьQR(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк Тогда
		Возврат АльфаБанк_ЗарегистрироватьQR(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСбербанк ИЛИ ТипБанка = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR Тогда
		Возврат Сбербанк_ЗарегистрироватьQR(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк Тогда 
		Возврат РайффайзенБанк_ЗарегистрироватьQR(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.Сбербанк Тогда
		Возврат СформироватьСсылкуОплатыСбербанк(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСДМ Тогда
		Возврат СДМ_ЗарегистрироватьQR(СтруктураПараметров);
	Иначе
		СтруктураВозврата.ОписаниеОшибки = "Платежный шлюз не поддерживается"; 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции

// Функция - Отменить ссылку на оплату
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтменитьСсылкуНаОплату(СтруктураПараметров) Экспорт
	
	СтруктураВозврата	= Новый Структура("ВыполненоУспешно, ОписаниеОшибки, СсылкаНаОплату", Ложь, Неопределено, Неопределено);	
	ПараметрыПШ			= СтруктураПараметров.ЭквайринговыйТерминал.ПараметрыПлатежногоШлюза.Получить();
	ТипБанка			= СтруктураПараметров.ЭквайринговыйТерминал.ТипБанка;
	
	Если ТипЗнч(ПараметрыПШ) <> Тип("Структура") Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не заполнены параметры платежного шлюза"; 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ПараметрыПШ"		, ПараметрыПШ); 
	СтруктураПараметров.Вставить("ТипБанка"			, СтруктураПараметров.ЭквайринговыйТерминал.ТипБанка);
	СтруктураПараметров.Вставить("СтруктураВозврата", СтруктураВозврата);
	
	Если ТипБанка = Перечисления.ПлатежныеШлюзы.СБПТинькофф Тогда
		Возврат Тинькофф_ОтменитьQRКод(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк Тогда
		Возврат АльфаБанк_ОтменитьQRКод(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСбербанк ИЛИ ТипБанка = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR Тогда
		Возврат Сбербанк_ОтменитьQRКод(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк Тогда 
		Возврат РайффайзенБанк_ОтменитьQRКод(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСДМ Тогда 
		Возврат СДМ_ОтменитьQRКод(СтруктураПараметров);
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.Сбербанк Тогда
		Возврат Сбербанк_ОтменитьСсылку(СтруктураПараметров);
	Иначе
		Возврат ОтменитьСсылкуНаОплатуОбщая(СтруктураПараметров);
	КонецЕсли;
	
КонецФункции

// Функция - Отменить ссылку на оплату общая
// 
// Возвращаемое значение:
//   - 
//
 Функция ОтменитьСсылкуНаОплатуОбщая(СтруктураПараметров)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОплатыЗаказов.НомерЗаказа КАК НомерЗаказа,
	|	СтатусыОплатыЗаказов.Основание КАК Основание
	|ИЗ
	|	РегистрСведений.СтатусыОплатыЗаказов КАК СтатусыОплатыЗаказов
	|ГДЕ
	|	СтатусыОплатыЗаказов.СсылкаОплаты = &СсылкаНаОплату");
	
	Запрос.УстановитьПараметр("СсылкаНаОплату", СтруктураПараметров.СсылкаНаОплату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеСтатуса  = НСтр("ru='Платеж отменен пользователем ';en='Payment canceled by user '") + Строка(ПараметрыСеанса.ТекущийПользователь);
		
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		Выборка.Основание,,,,
		Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ,,
		Выборка.НомерЗаказа,,,,,,,
		ОписаниеСтатуса);
		
	КонецЦикла;
	
	СтруктураПараметров.СтруктураВозврата.ВыполненоУспешно = Истина;
	
	Возврат СтруктураПараметров.СтруктураВозврата;
	
КонецФункции

// Функция - Сформировать возврат по СБП
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьВозвратПоСБП(Знач СтруктураПараметров) Экспорт
	
	СтруктураВозврата	= Новый Структура("ВыполненоУспешно, ОписаниеОшибки", Ложь, Неопределено);	
	ПараметрыПШ			= СтруктураПараметров.ЭквайринговыйТерминал.ПараметрыПлатежногоШлюза.Получить();	
	ОтветJSON			= Неопределено;
	
	Если ТипЗнч(ПараметрыПШ) <> Тип("Структура") Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не заполнены параметры платежного шлюза"; 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если РегистрыСведений.СтатусыОплатыЗаказов.УжеСформированВозвратПоОснованию(СтруктураПараметров.ВозвратОтПокупателя, СтруктураПараметров.ЭквайринговыйТерминал) Тогда
		СтруктураВозврата.ОписаниеОшибки = "Уже сформирован возврат, который в процессе подтверждения банком, необходимо дождаться завершения"; 
		Возврат СтруктураВозврата;	
	КонецЕсли;
	
	ЗадолженностьПоДокументу = СтруктураПараметров.ВозвратОтПокупателя.СуммаДокумента - СтруктураПараметров.ВозвратОтПокупателя.СуммаОплачено;
	
	Если ЗадолженностьПоДокументу = 0 Тогда
		СтруктураВозврата.ОписаниеОшибки = "Задолженность по документу равна нулю"; 
		Возврат СтруктураВозврата;	
	КонецЕсли;
	
	Если СтруктураПараметров.СуммаВозвратаВРублях > ЗадолженностьПоДокументу Тогда
		СтруктураВозврата.ОписаниеОшибки = "Сумма возврата превышает задолженность по документу"; 
		Возврат СтруктураВозврата;	
	КонецЕсли;
	
	ДанныеЗаказа = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьДанныеЗаказа(СтруктураПараметров.ВозвратОтПокупателя, СтруктураПараметров.ЭквайринговыйТерминал);
	
	Если ДанныеЗаказа = Неопределено Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не найден заказ для осуществления возврата"; 
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	Если СтруктураПараметров.СуммаВозвратаВРублях > ДанныеЗаказа.Сумма Тогда
		СтруктураВозврата.ОписаниеОшибки = "Сумма возврата превышает оплаченную сумму по заказу"; 
		Возврат СтруктураВозврата;	
	КонецЕсли;
		
	ТипБанка				= СтруктураПараметров.ЭквайринговыйТерминал.ТипБанка;
	ПараметрыПШ.ВремяЖизни	= ?(ЗначениеЗаполнено(ПараметрыПШ.ВремяЖизни), ПараметрыПШ.ВремяЖизни, 72); 
	
	СтруктураПараметров.Вставить("ПараметрыПШ"				, ПараметрыПШ); 
	СтруктураПараметров.Вставить("ТипБанка"					, ТипБанка);
	СтруктураПараметров.Вставить("УИДВозврата"				, Строка(Новый УникальныйИдентификатор()));
	СтруктураПараметров.Вставить("НомерЗаказа"				, ДанныеЗаказа.НомерЗаказа);
	СтруктураПараметров.Вставить("ИдСБП"					, ДанныеЗаказа.ИдЗаказа);
	СтруктураПараметров.Вставить("ПараметрыJSON"			, ДанныеЗаказа.ПараметрыJSON);
	СтруктураПараметров.Вставить("СтруктураВозврата"		, СтруктураВозврата);
	СтруктураПараметров.Вставить("Сотрудник"				, ПараметрыСеанса.ТекущийПользователь);
	СтруктураПараметров.Вставить("ПредставлениеСотрудника"	, ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктураПараметров.Сотрудник,"Представление"));	
	
	Статус = Неопределено;
	Если ТипБанка = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк Тогда 
		
		ТипСсылкиНаОплату	= Перечисления.ТипыСсылокНаОплату.СБПРайффайзенБанк;
		РезультатЗапроса	= РайффайзенБанк_ВозвратЗаказа(СтруктураПараметров);
		
		Если РезультатЗапроса.ВыполненоУспешно Тогда
			ОбщегоНазначенияБТС.Пауза(3);
			РезультатЗапроса = РайффайзенБанк_ПолучитьИнформациюПоВозврату(СтруктураПараметров, ОтветJSON);
			Если РезультатЗапроса.ВыполненоУспешно Тогда
				Статус = РезультатЗапроса.ПараметрыРезультата.refundStatus;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПТинькофф Тогда
		
		ТипСсылкиНаОплату	= Перечисления.ТипыСсылокНаОплату.СБПТинькофф;
		РезультатЗапроса 	= Тинькофф_ОтменитьQRКодЗапрос(ДанныеЗаказа.ИдЗаказа, ПараметрыПШ, ОтветJSON);
		
		Если РезультатЗапроса.ВыполненоУспешно Тогда
			Статус = РезультатЗапроса.ПараметрыРезультата.Status;
		КонецЕсли;
		
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСДМ Тогда
		
		ТипСсылкиНаОплату	= Перечисления.ТипыСсылокНаОплату.СБПСДМ;
		РезультатЗапроса 	= СДМ_ОтменитьQRКодЗапрос(ДанныеЗаказа.ИдЗаказа, ПараметрыПШ, ОтветJSON);
		
		Если РезультатЗапроса.ВыполненёоУспешно Тогда
			Статус = РезультатЗапроса.ПараметрыРезультата.Status;
		КонецЕсли;
		
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк Тогда
		
		ТипСсылкиНаОплату	= Перечисления.ТипыСсылокНаОплату.СБПАльфаБанк;
		РезультатЗапроса 	= АльфаБанк_ВозвратПлатежа(СтруктураПараметров, ОтветJSON);
		
		Если РезультатЗапроса.ВыполненоУспешно Тогда
			ОбщегоНазначенияБТС.Пауза(3);
			РезультатЗапроса = АльфаБанк_ПолучитьСтатусПлатежаРасширенный(СтруктураПараметров, ОтветJSON);
			Если РезультатЗапроса.ВыполненоУспешно Тогда
				Статус = РезультатЗапроса.ПараметрыРезультата.orderStatus;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСбербанк ИЛИ ТипБанка = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR Тогда
				
		ТипСсылкиНаОплату	= ?(ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСбербанк, Перечисления.ТипыСсылокНаОплату.СБПСбербанк, Перечисления.ТипыСсылокНаОплату.СбербанкПлатиQR);
		РезультатЗапроса 	= Сбербанк_OrderCancelQr(СтруктураПараметров, ОтветJSON);
		
		Если РезультатЗапроса.ВыполненоУспешно Тогда
			Статус = ?(РезультатЗапроса.ПараметрыРезультата.Свойство("order_status"), РезультатЗапроса.ПараметрыРезультата.order_status, "NEW");
		КонецЕсли;
		
	Иначе
		ОтменитьТранзакцию();
		СтруктураВозврата.ОписаниеОшибки = "Платежный шлюз не поддерживается"; 		
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		Возврат СформироватьДокументСписанияИПробить(СтруктураПараметров, Статус, ТипСсылкиНаОплату, ОтветJSON);
			
	Иначе
		СтруктураВозврата.ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки; 
		Возврат СтруктураВозврата; 
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ВиджетЛК

// Функция, формирует ссылку на оплату для оплаты из виджета ЛК.
//
Функция СформироватьСсылкуНаОплатуВиджетЛК(СтруктураПараметров)
	
	ТаблицаЗадолженностей 	= СтруктураПараметров.ТаблицаЗадолженностей;
	ЭквайринговыйТерминал 	= СтруктураПараметров.ЭквайринговыйТерминал;
    СтруктурнаяЕдиница 		= СтруктураПараметров.СтруктурнаяЕдиница;
	СуммаОплаты 			= СтруктураПараметров.СуммаОплаты;
	СтруктураВозврата		= СтруктураПараметров.СтруктураВозврата;
	КороткаяСсылка			= "";
	ВнешняяСистема			= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистемуВиджета(Перечисления.ТипыВнешнихСистем.ВиджетРасписания, СтруктурнаяЕдиница);

	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		
		АдресЛичногоКабинета = Справочники.ВнешниеСистемы.ПолучитьАдресСтраницыЛичногоКабинета(ВнешняяСистема);
		
		Если ЗначениеЗаполнено(АдресЛичногоКабинета) Тогда
			
			Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл 
				
				Реализация 		= СтрокаТ.ДокументЗадолженности;
				СсылкаНаОплату 	= АдресЛичногоКабинета + "?getPayFormDebts=Y&id=" + Строка(Реализация.УникальныйИдентификатор());
				КороткаяСсылка 	= ПолучитьКороткуюСсылку(СсылкаНаОплату);
				
				РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
				СтрокаТ.ДокументЗадолженности,
				СтрокаТ.Задолженность,,
				КороткаяСсылка,
				Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено,
				ЭквайринговыйТерминал,
				РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьМассимальныйНомерЗаказа(Перечисления.ТипыСсылокНаОплату.ВиджетЛК) + 1,,,
				Реализация.Контрагент,,
				СтруктурнаяЕдиница,
				ТекущаяДатаСеанса(),,
				Перечисления.ТипыСсылокНаОплату.ВиджетЛК
				);
				
			КонецЦикла;
		
		Иначе			
			СтруктураВозврата.ОписаниеОшибки = "Не заполнен адрес личного кабинета"; 
			Возврат СтруктураВозврата;
		КонецЕсли;
		
	Иначе
		СтруктураВозврата.ОписаниеОшибки = "Не найдена внешняя система виджета ЛК"; 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата.СсылкаНаОплату	= КороткаяСсылка;
	СтруктураВозврата.ВыполненоУспешно	= Истина;
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область РайффайзенБанк

// Функция - Райффайзен банк зарегистрировать QR
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РайффайзенБанк_ЗарегистрироватьQR(СтруктураПараметров)
	
	СуммаОплаты	= СтруктураПараметров.СуммаОплаты;	
	НомерЗаказа	= СформироватьНомерЗаказаСБП();
	ЛогинБанка	= СтруктураПараметров.ПараметрыПШ.ЛогинБанка;
	ВремяЖизни	= СтруктураПараметров.ПараметрыПШ.ВремяЖизни;
	ПараметрыПШ	= СтруктураПараметров.ПараметрыПШ;
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("order"				, НомерЗаказа);
	ПараметрыЗапроса.Вставить("amount"				, СуммаОплаты);
	ПараметрыЗапроса.Вставить("qrType"				, "QRDynamic");
	ПараметрыЗапроса.Вставить("sbpMerchantId"		, ЛогинБанка);
	ПараметрыЗапроса.Вставить("qrExpirationDate"	, ТекущаяДатаСеанса() + ВремяЖизни*3600);

	ТекстЗапроса = "";
	РезультатЗапроса = РайффайзенБанк_ЗарегистрироватьQRЗапрос(ПараметрыЗапроса, ПараметрыПШ, ТекстЗапроса);
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл	
			
			КороткаяСсылка 	= РезультатЗапроса.ПараметрыРезультата.payload; //ОбщегоНазначения.ПолучитьКороткуюСсылку(РезультатЗапроса.ПараметрыРезультата.payload);
			
			РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
				СтрокаТ.ДокументЗадолженности,
				СтрокаТ.Задолженность,
				РезультатЗапроса.ПараметрыРезультата.qrId,
				КороткаяСсылка,
				Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено,
				СтруктураПараметров.ЭквайринговыйТерминал,
				НомерЗаказа,ТекстЗапроса,,
				СтруктураПараметров.Контрагент,,
				СтруктураПараметров.СтруктурнаяЕдиница,
				ТекущаяДатаСеанса(),,
				Перечисления.ТипыСсылокНаОплату.СБПРайффайзенБанк,
				ПараметрыСеанса.ТекущийПользователь,
				ТекущаяДатаСеанса() + ВремяЖизни*3600
				);
						
		КонецЦикла;
		
		РезультатЗапроса.Вставить("СсылкаНаОплату"		, КороткаяСсылка);
		РезультатЗапроса.Вставить("ВремяДействителенДо"	, ТекущаяДатаСеанса() + ВремяЖизни*3600);
		РезультатЗапроса.Вставить("НомерЗаказа"			, НомерЗаказа);
		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция - Райффайзен банк зарегистрировать QRЗапрос
//
// Параметры:
//  ПараметрыЗапроса - 	 - 
//  ПараметрыПШ		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РайффайзенБанк_ЗарегистрироватьQRЗапрос(ПараметрыЗапроса, ПараметрыПШ, ТекстЗапроса = "")
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	ЗаголовкиHTTP.Вставить("Authorization"		, "Bearer " + ПараметрыПШ.ПарольБанка);
	
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты 	 = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса,, НастройкиСериализацииJSON);
	
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "test.ecom.raiffeisen.ru", "e-commerce.raiffeisen.ru"); 
	Соединение 		= Новый HTTPСоединение(АдресСервера,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос 		= Новый HTTPЗапрос("/api/sbp/v1/qr/register", ЗаголовкиHTTP);			
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса, КодСостояния);
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Райффайзен банк отменить QRКод
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РайффайзенБанк_ОтменитьQRКод(СтруктураПараметров)
	
	РезультатОперации = СтруктураПараметров.СтруктураВозврата;
	
	ДокументыЗадолженности = Новый Массив;
	Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл
		ДокументыЗадолженности.Добавить(СтрокаТ.ДокументЗадолженности);	
	КонецЦикла;
	
	ПараметрыПШ = СтруктураПараметров.ПараметрыПШ;
	НомерЗаказа = ?(СтруктураПараметров.Свойство("НомерЗаказа"), СтруктураПараметров.НомерЗаказа, Неопределено);
	
	ТаблицаЗаказов = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьЗаказыПоДокументам(ДокументыЗадолженности, СтруктураПараметров.ЭквайринговыйТерминал, НомерЗаказа);
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		РезультатОперации.ОписаниеОшибки = "Не найдено неоплаченных заказов по данной ссылке";
		Возврат РезультатОперации;	
	КонецЕсли;
	
	МассивИдСБП = Новый Массив;
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		
		Если МассивИдСБП.Найти(СтрокаЗаказа.ИдЗаказа) = Неопределено Тогда
			
			РезультатОперации = РайффайзенБанк_ОтменитьQRКодЗапрос(СтрокаЗаказа.ИдЗаказа, ПараметрыПШ);
			
			Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
				Возврат РезультатОперации;	
			КонецЕсли;
			
			МассивИдСБП.Добавить(СтрокаЗаказа.ИдЗаказа);
			
		КонецЕсли;
		
		ОписаниеСтатуса  = НСтр("ru='Платеж отменен пользователем ';en='Payment canceled by user '") + Строка(ПараметрыСеанса.ТекущийПользователь);
		
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		СтрокаЗаказа.Основание,,,,
		Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ,,
		СтрокаЗаказа.НомерЗаказа,,,,,,,
		ОписаниеСтатуса);
		
	КонецЦикла;
		
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Райффайзен банк отменить QRКод запрос
//
// Параметры:
//  ИдЗаказа	 - 	 - 
//  ПараметрыПШ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РайффайзенБанк_ОтменитьQRКодЗапрос(ИдЗаказа, ПараметрыПШ)
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	ЗаголовкиHTTP.Вставить("Authorization"		, "Bearer " + ПараметрыПШ.ПарольБанка);
	
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "test.ecom.raiffeisen.ru", "e-commerce.raiffeisen.ru");
	Соединение 		= Новый HTTPСоединение(АдресСервера,,,,,10, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос 		= Новый HTTPЗапрос("/api/sbp/v2/qrs/" + ИдЗаказа, ЗаголовкиHTTP);					
	
	Попытка
		
		HTTPОтвет	 = Соединение.Удалить(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 Тогда
			РезультатЗапроса = Новый Структура("code", "SUCCESS");	
		ИначеЕсли КодСостояния = 400 Тогда	
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса, КодСостояния);
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Райффайзен банк получить статус платежа
//
// Параметры:
//  ИдЗаказа	 - 	 - 
//  ПараметрыПШ	 - 	 - 
//  ТелоОтвета	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РайффайзенБанк_ПолучитьСтатусПлатежа(ИдЗаказа, ПараметрыПШ, ТелоОтвета = Неопределено) Экспорт
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	ЗаголовкиHTTP.Вставить("Authorization"		, "Bearer " + ПараметрыПШ.ПарольБанка);
		
	АдресСервера = ?(ПараметрыПШ.ТестовыйРежим, "test.ecom.raiffeisen.ru", "e-commerce.raiffeisen.ru");
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,3, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить("/api/sbp/v1/qr/{qrId}/payment-info", "{qrId}", ИдЗаказа), ЗаголовкиHTTP);
		
	Попытка
		
		HTTPОтвет	 = Соединение.Получить(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			
			ИменаСвойствСоЗначениямиДата = Новый Массив;
			ИменаСвойствСоЗначениямиДата.Добавить("transactionDate");
			ИменаСвойствСоЗначениямиДата.Добавить("createDate");
			ИменаСвойствСоЗначениямиДата.Добавить("qrExpirationDate");
			
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета, ИменаСвойствСоЗначениямиДата);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
  		
		РезультатОперации = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса, КодСостояния);
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Райффайзен банк возврат заказа
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РайффайзенБанк_ВозвратЗаказа(СтруктураПараметров, ТелоОтвета = Неопределено) Экспорт
	
	ПараметрыПШ = СтруктураПараметров.ПараметрыПШ;
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	ЗаголовкиHTTP.Вставить("Authorization"		, "Bearer " + ПараметрыПШ.ПарольБанка);
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("amount"			, СтруктураПараметров.СуммаВозвратаВРублях);
	ПараметрыЗапроса.Вставить("order" 			, СтруктураПараметров.НомерЗаказа);
	ПараметрыЗапроса.Вставить("paymentDetails"	, СтрШаблон("Запрос на возврат денежных средств сотрудником %1", СтруктураПараметров.ПредставлениеСотрудника));
	ПараметрыЗапроса.Вставить("refundId"		, СтруктураПараметров.УИДВозврата);
		
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);
	
	АдресСервера = ?(ПараметрыПШ.ТестовыйРежим, "pay-test.raif.ru", "pay.raif.ru");
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/api/sbp/v1/refund", ЗаголовкиHTTP);			
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса, КодСостояния);
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
		
КонецФункции

// Функция - Райффайзен банк получить информацию по возврату
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РайффайзенБанк_ПолучитьИнформациюПоВозврату(СтруктураПараметров, ТелоОтвета = Неопределено) Экспорт
	
	ПараметрыПШ = СтруктураПараметров.ПараметрыПШ;
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	ЗаголовкиHTTP.Вставить("Authorization"		, "Bearer " + ПараметрыПШ.ПарольБанка);
	
	АдресСервера = ?(ПараметрыПШ.ТестовыйРежим, "pay-test.raif.ru", "pay.raif.ru");
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,3, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос(СтрЗаменить("/api/sbp/v1/refund/{refundId}", "{refundId}", СтруктураПараметров.УИДВозврата), ЗаголовкиHTTP);						
	
	Попытка
		
		HTTPОтвет	 = Соединение.Получить(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса, КодСостояния);
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

#КонецОбласти

#Область Тинькофф

// Функция - Тинькофф зарегистрировать QR
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Тинькофф_ЗарегистрироватьQR(СтруктураПараметров)
	
	ПараметрыПШ                 = СтруктураПараметров.ПараметрыПШ;
	СуммаОплаты 				= СтруктураПараметров.СуммаОплаты;	
	КлючТерминалаТинькофф  		= СтруктураПараметров.ПараметрыПШ.КлючТерминалаТинькофф;
	СекретныйКлючТинькофф  		= СтруктураПараметров.ПараметрыПШ.СекретныйКлючТинькофф;
	ВремяЖизни					= СтруктураПараметров.ПараметрыПШ.ВремяЖизни;
	
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктураПараметров.ЭквайринговыйТерминал, "ТипФискализации") = Перечисления.ТипыФискализации.ВТинькофф Тогда
		СтруктураTinkoffReceipt = СтруктураTinkoffReceipt(СтруктураПараметров);
	КонецЕсли;
	
	РезультатЗапроса = Тинькофф_ИнициализацияПлатежнойСессии(ПараметрыПШ, СуммаОплаты, СтруктураTinkoffReceipt);
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		ПараметрыЗапроса = Новый Структура();
		ПараметрыЗапроса.Вставить("TerminalKey"	, КлючТерминалаТинькофф);
		ПараметрыЗапроса.Вставить("PaymentId"	, РезультатЗапроса.ПараметрыРезультата.PaymentId);
		
		ОбязательностьПодписиЗапросаТинькофф = Истина;	
		Если ОбязательностьПодписиЗапросаТинькофф Тогда
			ПараметрыЗапроса.Вставить("Token", Тинькофф_СформироватьПодписьЗапроса(ПараметрыЗапроса, СекретныйКлючТинькофф));	
		КонецЕсли;
		
		ТекстЗапроса = "";
		РезультатЗапроса = Тинькофф_ЗарегистрироватьQRЗапрос(ПараметрыЗапроса, ПараметрыПШ, ТекстЗапроса);
		
		Если РезультатЗапроса.ВыполненоУспешно Тогда
			
			Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл	
				
				КороткаяСсылка 	= РезультатЗапроса.ПараметрыРезультата.Data; //ОбщегоНазначения.ПолучитьКороткуюСсылку(РезультатЗапроса.ПараметрыРезультата.Data);
				
				РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
				СтрокаТ.ДокументЗадолженности,
				СтрокаТ.Задолженность,
				Формат(РезультатЗапроса.ПараметрыРезультата.PaymentId, "ЧГ=100"),
				КороткаяСсылка,
				Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено,
				СтруктураПараметров.ЭквайринговыйТерминал,
				РезультатЗапроса.ПараметрыРезультата.OrderId,ТекстЗапроса,,
				СтруктураПараметров.Контрагент,,
				СтруктураПараметров.СтруктурнаяЕдиница,
				ТекущаяДатаСеанса(),,
				Перечисления.ТипыСсылокНаОплату.СБПТинькофф,
				ПараметрыСеанса.ТекущийПользователь,
				ТекущаяДатаСеанса() + ВремяЖизни*3600
				);
				
			КонецЦикла;
			
			РезультатЗапроса.Вставить("СсылкаНаОплату"		, КороткаяСсылка);
			РезультатЗапроса.Вставить("ВремяДействителенДо"	, ТекущаяДатаСеанса() + ВремяЖизни*3600);
			РезультатЗапроса.Вставить("НомерЗаказа"			, РезультатЗапроса.ПараметрыРезультата.OrderId);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция - Тинькофф инициализация платежной сессии
// 
// Возвращаемое значение:
//   - 
//
Функция Тинькофф_ИнициализацияПлатежнойСессии(ПараметрыПШ, СуммаОплаты, СтруктураTinkoffReceipt = Неопределено) Экспорт
		
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
		
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты 	 = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	НомерЗаказа = СформироватьНомерЗаказаСБП();
	ДатаСтрокой = ЗаписатьДатуJSON(ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);	
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("TerminalKey"		, ПараметрыПШ.КлючТерминалаТинькофф);
	ПараметрыЗапроса.Вставить("Amount"			, СуммаОплаты*100); // Сумма в копейках 
	ПараметрыЗапроса.Вставить("OrderId"			, НомерЗаказа);
	ПараметрыЗапроса.Вставить("RedirectDueDate" , ДатаСтрокой);
	
	Если ЗначениеЗаполнено(СтруктураTinkoffReceipt) Тогда 		
		ПараметрыЗапроса.Вставить("Receipt", СтруктураTinkoffReceipt);
	КонецЕсли;
	
	ОбязательностьПодписиЗапросаТинькофф = Истина;	
	Если ОбязательностьПодписиЗапросаТинькофф И ЗначениеЗаполнено(СтруктураTinkoffReceipt) Тогда
		ПараметрыЗапроса.Вставить("Token", Тинькофф_СформироватьПодписьЗапроса(ПараметрыЗапроса, ПараметрыПШ.СекретныйКлючТинькофф));	
	КонецЕсли;
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса,, НастройкиСериализацииJSON);
	
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "rest-api-test.tinkoff.ru", "securepay.tinkoff.ru");
	Соединение		= Новый HTTPСоединение(АдресСервера,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос		= Новый HTTPЗапрос("/v2/Init/", ЗаголовкиHTTP);			
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Success И НРег(РезультатЗапроса.Status) = НРег("NEW");
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
			РезультатЗапроса.message + ?(РезультатЗапроса.Свойство("details"), " " + ?(РезультатЗапроса.details = "{request.validate.expected.receipt}", "Необходимо включить в эквайринговом терминале фискализацию на стороне тинькофф", РезультатЗапроса.details), ""), ТелоОтвета);
			
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Тинькофф зарегистрировать QRЗапрос
//
// Параметры:
//  ПараметрыЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Тинькофф_ЗарегистрироватьQRЗапрос(ПараметрыЗапроса, ПараметрыПШ, ТекстЗапроса = "")
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
			
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);

	АдресСервера	= ?(ПараметрыПШ.ТестовыйРежим, "rest-api-test.tinkoff.ru", "securepay.tinkoff.ru");
	Соединение 		= Новый HTTPСоединение(АдресСервера,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос 		= Новый HTTPЗапрос("/v2/GetQr", ЗаголовкиHTTP);			
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Success;
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
			РезультатЗапроса.message + ?(РезультатЗапроса.Свойство("details"), " " + РезультатЗапроса.details, ""), ТелоОтвета);
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Сформировать подпись запроса тинькофф
//
// Параметры:
//  ПараметрыЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Тинькофф_СформироватьПодписьЗапроса(ПараметрыЗапроса, СекретныйКлючТинькофф)
		
	Если ТипЗнч(ПараметрыЗапроса) <> Тип("Структура") ИЛИ Не ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Password", СекретныйКлючТинькофф);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Ключ");
	ТЗ.Колонки.Добавить("Значение");
	
	Для Каждого ЭлСтруктуры Из ПараметрыЗапроса Цикл
		НоваяСтрока				= ТЗ.Добавить();
		НоваяСтрока.Ключ		= ЭлСтруктуры.Ключ;
		НоваяСтрока.Значение	= ЭлСтруктуры.Значение;
	КонецЦикла;
	
	ТЗ.Сортировать("Ключ");
	
	ПараметрыЗапроса.Очистить();
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		ПараметрыЗапроса.Вставить(СтрокаТЗ.Ключ, СтрокаТЗ.Значение);
	КонецЦикла;
	
	ПараметрыСтрокой = "";
	
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		
		Если НРег(ПараметрЗапроса.Ключ) = НРег("Shops") ИЛИ НРег(ПараметрЗапроса.Ключ) = НРег("Receipt") 
			ИЛИ НРег(ПараметрЗапроса.Ключ) = НРег("DATA") ИЛИ НРег(ПараметрЗапроса.Ключ) = НРег("paymentType") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ПараметрЗапроса.Значение) = Тип("Число") Тогда
			ПараметрЗначение = Формат(ПараметрЗапроса.Значение, "ЧГ=100");
		ИначеЕсли ТипЗнч(ПараметрЗапроса.Значение) = Тип("Булево") Тогда 
			ПараметрЗначение = Формат(ПараметрЗапроса.Значение, "БЛ=false; БИ=true");
		Иначе
			ПараметрЗначение = ПараметрЗапроса.Значение
		КонецЕсли;
		
		ПараметрыСтрокой = ПараметрыСтрокой + ПараметрЗначение;
		
	КонецЦикла;
	
	ПараметрыЗапроса.Удалить("Password");
	
	Возврат IPТелефония.SHA256(ПараметрыСтрокой);
	
КонецФункции

// Функция - Тинькофф отменить QRКод
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Тинькофф_ОтменитьQRКод(СтруктураПараметров)
	
	ДокументыЗадолженности = Новый Массив;
	Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл
		ДокументыЗадолженности.Добавить(СтрокаТ.ДокументЗадолженности);	
	КонецЦикла;

	РезультатОперации	= СтруктураПараметров.СтруктураВозврата;
	ПараметрыПШ			= СтруктураПараметров.ПараметрыПШ;	
	НомерЗаказа			= ?(СтруктураПараметров.Свойство("НомерЗаказа"), СтруктураПараметров.НомерЗаказа, Неопределено);
	
	ТаблицаЗаказов = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьЗаказыПоДокументам(ДокументыЗадолженности, СтруктураПараметров.ЭквайринговыйТерминал, НомерЗаказа);
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		РезультатОперации.ОписаниеОшибки = "Не найдено неоплаченных заказов по данной ссылке";
		Возврат РезультатОперации;	
	КонецЕсли;
	
	МассивИдСБП = Новый Массив;
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		
		Если МассивИдСБП.Найти(СтрокаЗаказа.ИдЗаказа) = Неопределено Тогда
									
			РезультатОперации = Тинькофф_ОтменитьQRКодЗапрос(СтрокаЗаказа.ИдЗаказа, ПараметрыПШ);
			
			Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
				Возврат РезультатОперации;	
			КонецЕсли;
			
			МассивИдСБП.Добавить(СтрокаЗаказа.ИдЗаказа);
			
		КонецЕсли;
		
		ОписаниеСтатуса  = НСтр("ru='Платеж отменен пользователем ';en='Payment canceled by user '") + Строка(ПараметрыСеанса.ТекущийПользователь);
		
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		СтрокаЗаказа.Основание,,,,
		Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ,,
		СтрокаЗаказа.НомерЗаказа,,,,,,,
		ОписаниеСтатуса);
		
	КонецЦикла;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Тинькофф отменить QRКод запрос
//
// Параметры:
//  ИдСБП		 - 	 - 
//  ПараметрыПШ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Тинькофф_ОтменитьQRКодЗапрос(ИдСБП, ПараметрыПШ, ТелоОтвета = Неопределено)
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("TerminalKey"	, ПараметрыПШ.КлючТерминалаТинькофф);
	ПараметрыЗапроса.Вставить("PaymentId"	, Число(ИдСБП));
	
	ОбязательностьПодписиЗапросаТинькофф = Истина;	
	Если ОбязательностьПодписиЗапросаТинькофф Тогда
		ПараметрыЗапроса.Вставить("Token", Тинькофф_СформироватьПодписьЗапроса(ПараметрыЗапроса, ПараметрыПШ.СекретныйКлючТинькофф));	
	КонецЕсли;	
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);
	
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "rest-api-test.tinkoff.ru", "securepay.tinkoff.ru");
	Соединение		= Новый HTTPСоединение(АдресСервера,,,,,10, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос		= Новый HTTPЗапрос("/v2/Cancel", ЗаголовкиHTTP);					
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);			
								
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Success;
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
			РезультатЗапроса.message + ?(РезультатЗапроса.Свойство("details"), " " + РезультатЗапроса.details, ""), ТелоОтвета);
			
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Тинькофф получить статус платежа
//
// Параметры:
//  ИдСБП		 - 	 - 
//  ПараметрыПШ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Тинькофф_ПолучитьСтатусПлатежа(ИдСБП, ПараметрыПШ, ТелоОтвета = Неопределено) Экспорт
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("TerminalKey"	, ПараметрыПШ.КлючТерминалаТинькофф);
	ПараметрыЗапроса.Вставить("PaymentId"	, ИдСБП);
	
	ОбязательностьПодписиЗапросаТинькофф = Истина;	
	Если ОбязательностьПодписиЗапросаТинькофф Тогда
		ПараметрыЗапроса.Вставить("Token", Тинькофф_СформироватьПодписьЗапроса(ПараметрыЗапроса, ПараметрыПШ.СекретныйКлючТинькофф));	
	КонецЕсли;	
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);
	
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "rest-api-test.tinkoff.ru", "securepay.tinkoff.ru");
	Соединение		= Новый HTTPСоединение(АдресСервера,,,,,3, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос		= Новый HTTPЗапрос("/v2/GetState", ЗаголовкиHTTP);					
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);			
								
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Success;
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
			РезультатЗапроса.message + ?(РезультатЗапроса.Свойство("details"), " " + РезультатЗапроса.details, ""), ТелоОтвета);
			
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

#КонецОбласти

#Область АльфаБанк

// Функция - Альфа банк зарегистрировать QR
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция АльфаБанк_ЗарегистрироватьQR(СтруктураПараметров)
	
	СуммаОплаты = СтруктураПараметров.СуммаОплаты;	
	ПараметрыПШ	= СтруктураПараметров.ПараметрыПШ;
	
	РезультатЗапроса = АльфаБанк_РегистрацияЗаказа(ПараметрыПШ, СуммаОплаты);
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		ИдСБП		= РезультатЗапроса.ПараметрыРезультата.orderId; 
		НомерЗаказа = РезультатЗапроса.ПараметрыРезультата.orderNumber;
	
		ПараметрыЗапроса = Новый Структура();
		ПараметрыЗапроса.Вставить("userName"	, ПараметрыПШ.ЛогинБанка);
		ПараметрыЗапроса.Вставить("password"	, КодироватьСтроку(ПараметрыПШ.ПарольБанка, СпособКодированияСтроки.КодировкаURL));
		ПараметрыЗапроса.Вставить("mdOrder"		, ИдСБП);
		
		ТекстЗапроса = "";
		РезультатЗапроса = АльфаБанк_ПолучитьQRЗапрос(ПараметрыЗапроса, ПараметрыПШ, ТекстЗапроса);
		
		Если РезультатЗапроса.ВыполненоУспешно Тогда
			
			Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл	
				
				КороткаяСсылка 	= РезультатЗапроса.ПараметрыРезультата.payload; //ОбщегоНазначения.ПолучитьКороткуюСсылку(РезультатЗапроса.ПараметрыРезультата.payload);
				
				РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
				СтрокаТ.ДокументЗадолженности,
				СтрокаТ.Задолженность,
				ИдСБП,
				КороткаяСсылка,
				Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено,
				СтруктураПараметров.ЭквайринговыйТерминал,
				НомерЗаказа,ТекстЗапроса,,
				СтруктураПараметров.Контрагент,,
				СтруктураПараметров.СтруктурнаяЕдиница,
				ТекущаяДатаСеанса(),,
				Перечисления.ТипыСсылокНаОплату.СБПАльфаБанк,
				ПараметрыСеанса.ТекущийПользователь,
				ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600,
				РезультатЗапроса.ПараметрыРезультата.qrId
				);
								
			КонецЦикла;
			
			РезультатЗапроса.Вставить("СсылкаНаОплату"		, КороткаяСсылка);
			РезультатЗапроса.Вставить("ВремяДействителенДо"	, ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600);
			РезультатЗапроса.Вставить("НомерЗаказа"			, НомерЗаказа);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция - Альфа банк регистрация заказа
//
// Параметры:
//  ПараметрыПШ	 - 	 - 
//  СуммаОплаты	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция АльфаБанк_РегистрацияЗаказа(ПараметрыПШ, СуммаОплаты)
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
		
	НомерЗаказа = СформироватьНомерЗаказаСБП();
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("userName"		, ПараметрыПШ.ЛогинБанка);
	ПараметрыЗапроса.Вставить("password"		, КодироватьСтроку(ПараметрыПШ.ПарольБанка, СпособКодированияСтроки.КодировкаURL));
	ПараметрыЗапроса.Вставить("orderNumber"		, НомерЗаказа);
	ПараметрыЗапроса.Вставить("amount"			, Формат(СуммаОплаты*100, "ЧГ=100"));
	ПараметрыЗапроса.Вставить("returnUrl"		, "https://qr.nspk.ru/");
	ПараметрыЗапроса.Вставить("expirationDate"	, ЗаписатьДатуJSON(ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600, ФорматДатыJSON.ISO));

	ПараметрыЗапросаСтрокой = "";
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ПараметрыЗапросаСтрокой = ПараметрыЗапросаСтрокой + ?(Не ЗначениеЗаполнено(ПараметрыЗапросаСтрокой), "?", "&") + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение;			
	КонецЦикла;
	
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "web.rbsuat.com/ab/rest", ?(СтрНачинаетсяС(ПараметрыПШ.ЛогинБанка, "r-"), "payment.alfabank.ru/payment/rest/", "pay.alfabank.ru/payment/rest"));
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/register.do" + ПараметрыЗапросаСтрокой, ЗаголовкиHTTP);					
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Свойство("orderId") И РезультатЗапроса.Свойство("formUrl");   
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("errorMessage"), РезультатЗапроса.errorMessage, ТелоОтвета);
		
		Если РезультатОперации.ВыполненоУспешно = Истина Тогда
			РезультатОперации.ПараметрыРезультата.Вставить("orderNumber", НомерЗаказа);	
		КонецЕсли;
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Альфа банк получить QRЗапрос
//
// Параметры:
//  ПараметрыЗапроса - 	 - 
//  ПараметрыПШ		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция АльфаБанк_ПолучитьQRЗапрос(ПараметрыЗапроса, ПараметрыПШ, ПараметрыЗапросаСтрокой = "")
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/x-www-form-urlencoded");
	
	ПараметрыЗапросаСтрокой = "";
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ПараметрыЗапросаСтрокой = ПараметрыЗапросаСтрокой + ?(Не ЗначениеЗаполнено(ПараметрыЗапросаСтрокой), "?", "&") + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение;			
	КонецЦикла;
	
	АдресСервера = ?(ПараметрыПШ.ТестовыйРежим, "web.rbsuat.com/ab/rest", ?(СтрНачинаетсяС(ПараметрыПШ.ЛогинБанка, "r-"), "payment.alfabank.ru/payment/rest/", "pay.alfabank.ru/payment/rest"));
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/sbp/c2b/qr/dynamic/get.do" + ПараметрыЗапросаСтрокой, ЗаголовкиHTTP);					
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Свойство("payload") И РезультатЗапроса.Свойство("qrId");
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("errorMessage"), РезультатЗапроса.errorMessage, ТелоОтвета);
			
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Альфа банк отменить QRКод
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция АльфаБанк_ОтменитьQRКод(СтруктураПараметров)
	
	ДокументыЗадолженности = Новый Массив;
	Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл
		ДокументыЗадолженности.Добавить(СтрокаТ.ДокументЗадолженности);	
	КонецЦикла;

	РезультатОперации	= СтруктураПараметров.СтруктураВозврата;
	НомерЗаказа			= ?(СтруктураПараметров.Свойство("НомерЗаказа"), СтруктураПараметров.НомерЗаказа, Неопределено);
	
	ТаблицаЗаказов = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьЗаказыПоДокументам(ДокументыЗадолженности, СтруктураПараметров.ЭквайринговыйТерминал, НомерЗаказа);
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		РезультатОперации.ОписаниеОшибки = "Не найдено неоплаченных заказов по данной ссылке";
		Возврат РезультатОперации;	
	КонецЕсли;	
		
	МассивИдСБП = Новый Массив;
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		
		Если МассивИдСБП.Найти(СтрокаЗаказа.ИдЗаказа) = Неопределено Тогда
									
			РезультатОперации = АльфаБанк_ПолучитьСтатусПлатежа(СтрокаЗаказа.ИдЗаказа, СтруктураПараметров.ПараметрыПШ, СтрокаЗаказа.ИдентификаторQRКода);
			
			Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
				Возврат РезультатОперации;	
			КонецЕсли;
			
			МассивИдСБП.Добавить(СтрокаЗаказа.ИдЗаказа);
			
		КонецЕсли;
		
		Если РезультатОперации.ПараметрыРезультата.Свойство("transactionState") И НРег(РезультатОперации.ПараметрыРезультата.transactionState) <> НРег("DEPOSITED") Тогда
			
			ОписаниеСтатуса  = НСтр("ru='Платеж отменен пользователем ';en='Payment canceled by user '") + Строка(ПараметрыСеанса.ТекущийПользователь);
			
			РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
			СтрокаЗаказа.Основание,,,,
			Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ,,
			СтрокаЗаказа.НомерЗаказа, РезультатОперации.ТелоЗапроса,,,,,,
			ОписаниеСтатуса);
			
		Иначе
			
			РезультатОперации.ВыполненоУспешно = Ложь;
			РезультатОперации.ОписаниеОшибки = "Заказ оплачен и не может быть отменен";
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Альфа банк получить статус платежа по QR
//
// Параметры:
//  ИдСБП				 - 	 - 
//  ПараметрыПШ			 - 	 - 
//  ИдентификаторQRКода	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция АльфаБанк_ПолучитьСтатусПлатежа(ИдСБП, ПараметрыПШ, ИдентификаторQRКода, ТелоОтвета = Неопределено) Экспорт
		
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("userName"	, ПараметрыПШ.ЛогинБанка);
	ПараметрыЗапроса.Вставить("password"	, КодироватьСтроку(ПараметрыПШ.ПарольБанка, СпособКодированияСтроки.КодировкаURL));
	ПараметрыЗапроса.Вставить("mdOrder"		, ИдСБП);
	ПараметрыЗапроса.Вставить("qrId"		, ИдентификаторQRКода);
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/x-www-form-urlencoded");
	
	ПараметрыЗапросаСтрокой = "";
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ПараметрыЗапросаСтрокой = ПараметрыЗапросаСтрокой + ?(Не ЗначениеЗаполнено(ПараметрыЗапросаСтрокой), "?", "&") + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение;			
	КонецЦикла;
	
	АдресСервера = ?(ПараметрыПШ.ТестовыйРежим, "web.rbsuat.com/ab/rest", ?(СтрНачинаетсяС(ПараметрыПШ.ЛогинБанка, "r-"), "payment.alfabank.ru/payment/rest/", "pay.alfabank.ru/payment/rest"));
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,3, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/sbp/c2b/qr/status.do" + ПараметрыЗапросаСтрокой, ЗаголовкиHTTP);								
								
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Свойство("qrStatus") И РезультатЗапроса.Свойство("transactionState");
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("errorMessage"), РезультатЗапроса.errorMessage, ТелоОтвета);
		РезультатОперации.ТелоЗапроса			= ТелоОтвета;		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Альфа банк получить статус платежа по QR
//
// Параметры:
//  ИдСБП				 - 	 - 
//  ПараметрыПШ			 - 	 - 
//  ИдентификаторQRКода	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция АльфаБанк_ВозвратПлатежа(СтруктураПараметров, ТелоОтвета = Неопределено) Экспорт
	
	ПараметрыПШ = СтруктураПараметров.ПараметрыПШ;
	ИдСБП		= СтруктураПараметров.ИдСБП;
	Сумма		= СтруктураПараметров.СуммаВозвратаВРублях*100;
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("userName"	, ПараметрыПШ.ЛогинБанка);
	ПараметрыЗапроса.Вставить("password"	, КодироватьСтроку(ПараметрыПШ.ПарольБанка, СпособКодированияСтроки.КодировкаURL));
	ПараметрыЗапроса.Вставить("orderId"		, ИдСБП);
	ПараметрыЗапроса.Вставить("amount"		, Сумма);
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/x-www-form-urlencoded");
	
	ПараметрыЗапросаСтрокой = "";
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ПараметрыЗапросаСтрокой = ПараметрыЗапросаСтрокой + ?(Не ЗначениеЗаполнено(ПараметрыЗапросаСтрокой), "?", "&") + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение;			
	КонецЦикла;
	
	АдресСервера = ?(ПараметрыПШ.ТестовыйРежим, "web.rbsuat.com/ab/rest", ?(СтрНачинаетсяС(ПараметрыПШ.ЛогинБанка, "r-"), "payment.alfabank.ru/payment/rest/", "pay.alfabank.ru/payment/rest"));
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/refund.do" + ПараметрыЗапросаСтрокой, ЗаголовкиHTTP);							
								
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Свойство("errorCode") И РезультатЗапроса.errorCode = "0";
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("errorMessage"), РезультатЗапроса.errorMessage, ТелоОтвета);
		РезультатОперации.ТелоЗапроса			= ТелоОтвета;		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Альфа банк получить статус платежа по QR
//
// Параметры:
//  ИдСБП				 - 	 - 
//  ПараметрыПШ			 - 	 - 
//  ИдентификаторQRКода	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция АльфаБанк_ПолучитьСтатусПлатежаРасширенный(СтруктураПараметров, ТелоОтвета = Неопределено) Экспорт
	
	ПараметрыПШ = СтруктураПараметров.ПараметрыПШ;
	ИдСБП		= СтруктураПараметров.ИдСБП;
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("userName"	, ПараметрыПШ.ЛогинБанка);
	ПараметрыЗапроса.Вставить("password"	, КодироватьСтроку(ПараметрыПШ.ПарольБанка, СпособКодированияСтроки.КодировкаURL));
	ПараметрыЗапроса.Вставить("orderId"		, ИдСБП);
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/x-www-form-urlencoded");
	
	ПараметрыЗапросаСтрокой = "";
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ПараметрыЗапросаСтрокой = ПараметрыЗапросаСтрокой + ?(Не ЗначениеЗаполнено(ПараметрыЗапросаСтрокой), "?", "&") + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение;			
	КонецЦикла;
	
	АдресСервера = ?(ПараметрыПШ.ТестовыйРежим, "web.rbsuat.com/ab/rest", ?(СтрНачинаетсяС(ПараметрыПШ.ЛогинБанка, "r-"), "payment.alfabank.ru/payment/rest/", "pay.alfabank.ru/payment/rest"));
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,3, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/getOrderStatusExtended.do" + ПараметрыЗапросаСтрокой, ЗаголовкиHTTP);								
								
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Свойство("orderStatus") И РезультатЗапроса.Свойство("errorCode") И РезультатЗапроса.errorCode = "0";
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("errorMessage"), РезультатЗапроса.errorMessage, ТелоОтвета);
		РезультатОперации.ТелоЗапроса			= ТелоОтвета;		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

#КонецОбласти

#Область СбербанкСБП

// Функция - Сбербанк зарегистрировать QR
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_ЗарегистрироватьQR(СтруктураПараметров)
	
	ПараметрыПШ = СтруктураПараметров.ПараметрыПШ;
	ТипБанка	= СтруктураПараметров.ТипБанка;
	
	СтруктураПараметров.Вставить("НомерЗаказа", СформироватьНомерЗаказаСБП());
	СтруктураПараметров.Вставить("id_qr"	  , ?(ТипБанка = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR, ПараметрыПШ.IDQR, ПараметрыПШ.IDТерминала));
	
	ТекстЗапроса = "";
	РезультатЗапроса = Сбербанк_OrderCreateQr(СтруктураПараметров, ТекстЗапроса);
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл	
			
			КороткаяСсылка 	= РезультатЗапроса.ПараметрыРезультата.order_form_url; //ОбщегоНазначения.ПолучитьКороткуюСсылку(РезультатЗапроса.ПараметрыРезультата.order_form_url);
				
				РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
				СтрокаТ.ДокументЗадолженности,
				СтрокаТ.Задолженность,
				РезультатЗапроса.ПараметрыРезультата.order_id,
				КороткаяСсылка,
				Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено,
				СтруктураПараметров.ЭквайринговыйТерминал,
				РезультатЗапроса.ПараметрыРезультата.order_number,ТекстЗапроса,,
				СтруктураПараметров.Контрагент,,
				СтруктураПараметров.СтруктурнаяЕдиница,
				ТекущаяДатаСеанса(),,
				?(ТипБанка = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR, Перечисления.ТипыСсылокНаОплату.СбербанкПлатиQR, Перечисления.ТипыСсылокНаОплату.СБПСбербанк),
				ПараметрыСеанса.ТекущийПользователь,
				ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600
				);
			
		КонецЦикла;
		
		РезультатЗапроса.Вставить("СсылкаНаОплату"		, КороткаяСсылка);
		РезультатЗапроса.Вставить("ВремяДействителенДо"	, ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600);
		РезультатЗапроса.Вставить("НомерЗаказа"			, РезультатЗапроса.ПараметрыРезультата.order_number);
		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция - Сбербанк order create qr
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_OrderCreateQr(СтруктураПараметров, ТекстЗапроса = "") 

	RqUID			= СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");	
	ДатаСтрокой		= ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);	
			
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("rq_uid"				, RqUID);
	ПараметрыЗапроса.Вставить("rq_tm"				, ДатаСтрокой);
	ПараметрыЗапроса.Вставить("member_id"			, "00000937");
	ПараметрыЗапроса.Вставить("order_number"		, СтруктураПараметров.НомерЗаказа);
	ПараметрыЗапроса.Вставить("order_create_date"	, ДатаСтрокой);
	ПараметрыЗапроса.Вставить("order_params_type"	, Сбербанк_order_params_type(СтруктураПараметров.ТаблицаЗадолженностей));
	ПараметрыЗапроса.Вставить("id_qr"				, СтруктураПараметров.id_qr);
	ПараметрыЗапроса.Вставить("description"			, "Оплата по структурной единице: " + Строка(СтруктураПараметров.СтруктурнаяЕдиница));
	ПараметрыЗапроса.Вставить("order_sum"			, СтруктураПараметров.СуммаОплаты*100);
	ПараметрыЗапроса.Вставить("currency"			, "643");
	
	Если СтруктураПараметров.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСбербанк Тогда
		ПараметрыЗапроса.Вставить("sbp_member_id", "100000000111");                     
	КонецЕсли;
		
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса, Ложь);
	
	Соединение = Новый HTTPСоединение("cloud.1c.fitness",,,,, 5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/api/hs/api/sbp/sbp_sber_OrderCreateQr");
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.error_code = "000000";
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		
		Если КодСостояния = 200 Тогда
			
			РезультатОперации.ОписаниеОшибки = ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("error_description"), 
				РезультатЗапроса.error_description, Неопределено);	
			
		Иначе
			
			РезультатОперации.ОписаниеОшибки = ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
				РезультатЗапроса.httpMessage + ?(РезультатЗапроса.Свойство("moreInformation"), " " + РезультатЗапроса.moreInformation, ""),
				СтрШаблон("Код ответа: %1. Описание ошибки: %2", КодСостояния, ТелоОтвета));
			
		КонецЕсли;
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;	
	
КонецФункции

// Функция - Сбербанк отменить QRКод
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_ОтменитьQRКод(СтруктураПараметров)
	
	ДокументыЗадолженности = Новый Массив;
	Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл
		ДокументыЗадолженности.Добавить(СтрокаТ.ДокументЗадолженности);	
	КонецЦикла;

	РезультатОперации	= СтруктураПараметров.СтруктураВозврата;
	НомерЗаказа			= ?(СтруктураПараметров.Свойство("НомерЗаказа"), СтруктураПараметров.НомерЗаказа, Неопределено);	
	ТаблицаЗаказов		= РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьЗаказыПоДокументам(ДокументыЗадолженности, СтруктураПараметров.ЭквайринговыйТерминал, НомерЗаказа);
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		РезультатОперации.ОписаниеОшибки = "Не найдено неоплаченных заказов по данной ссылке";
		Возврат РезультатОперации;	
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура();
	
	МассивИдСБП = Новый Массив;
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		
		Если МассивИдСБП.Найти(СтрокаЗаказа.ИдЗаказа) = Неопределено Тогда
			
			ПараметрыЗапроса.Вставить("order_id", СтрокаЗаказа.ИдЗаказа);
			
			РезультатОперации = Сбербанк_OrderRevokeQr(ПараметрыЗапроса);
			
			Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
				Возврат РезультатОперации;	
			КонецЕсли;
			
			МассивИдСБП.Добавить(СтрокаЗаказа.ИдЗаказа);
			
		КонецЕсли;
		
		ОписаниеСтатуса  = НСтр("ru='Платеж отменен пользователем ';en='Payment canceled by user '") + Строка(ПараметрыСеанса.ТекущийПользователь);
		
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		СтрокаЗаказа.Основание,,,,
		Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ,,
		СтрокаЗаказа.НомерЗаказа,,,,,,,
		ОписаниеСтатуса);
		
	КонецЦикла;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Сбербанк order revoke qr
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_OrderRevokeQr(СтруктураПараметров)
	
	RqUID			= СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");	
	ДатаСтрокой		= ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);	
		
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("rq_uid"		, RqUID);
	ПараметрыЗапроса.Вставить("rq_tm"		, ДатаСтрокой);
	ПараметрыЗапроса.Вставить("order_id"	, СтруктураПараметров.order_id);
			
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);
	
	Соединение = Новый HTTPСоединение("cloud.1c.fitness",,,,, 10, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/api/hs/api/sbp/sbp_sber_OrderRevokeQr");
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.error_code = "000000";
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		
		Если КодСостояния = 200 Тогда
			
			РезультатОперации.ОписаниеОшибки = ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("error_description"), 
				РезультатЗапроса.error_description, Неопределено);	
			
		Иначе
			
			РезультатОперации.ОписаниеОшибки = ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
				РезультатЗапроса.httpMessage + ?(РезультатЗапроса.Свойство("moreInformation"), " " + РезультатЗапроса.moreInformation, ""),
				СтрШаблон("Код ответа: %1. Описание ошибки: %2", КодСостояния, ТелоОтвета));
			
		КонецЕсли;
			
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Сбербанк order cancel qr
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_OrderCancelQr(СтруктураПараметров, ТелоОтвета = Неопределено)
	 
	ПараметрыОперации = Сбербанк_ПолучитьПараметрыОперацииДляВозврата(СтруктураПараметров.ПараметрыJSON, СтруктураПараметров.СуммаВозвратаВРублях);	
	Если Не ЗначениеЗаполнено(ПараметрыОперации.operation_id) ИЛИ Не ЗначениеЗаполнено(ПараметрыОперации.auth_code) Тогда
		СтруктураВозврата = СтруктураСтандартныхПараметровРезОперации();
		СтруктураВозврата.ОписаниеОшибки = "Не удалось получить параметры операции";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ПараметрыПШ		= СтруктураПараметров.ПараметрыПШ;
	RqUID			= СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");	
	ДатаСтрокой		= ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);	
		
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("rq_uid"					, RqUID);
	ПараметрыЗапроса.Вставить("rq_tm"					, ДатаСтрокой);
	ПараметрыЗапроса.Вставить("order_id"				, СтруктураПараметров.ИдСБП);
	ПараметрыЗапроса.Вставить("operation_type"			, "REFUND");
	ПараметрыЗапроса.Вставить("operation_id"			, ПараметрыОперации.operation_id);
	ПараметрыЗапроса.Вставить("auth_code"				, ПараметрыОперации.auth_code); 
	ПараметрыЗапроса.Вставить("id_qr"					, ?(СтруктураПараметров.ТипБанка = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR, ПараметрыПШ.IDQR, ПараметрыПШ.IDТерминала));
	ПараметрыЗапроса.Вставить("tid"						, ПараметрыПШ.IDТерминала);
	ПараметрыЗапроса.Вставить("cancel_operation_sum"	, СтруктураПараметров.СуммаВозвратаВРублях*100);
	ПараметрыЗапроса.Вставить("operation_currency"		, "643");
	ПараметрыЗапроса.Вставить("operation_description"	, "Возврат по структурной единице: " + Строка(СтруктураПараметров.СтруктурнаяЕдиница));
	
	//Если СтруктураПараметров.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСбербанк Тогда
	//	НомерТелефона  = Справочники.Контрагенты.ПолучитьНомерТелефонаДляРассылки(СтруктураПараметров.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
	//	Если ЗначениеЗаполнено(НомерТелефона) Тогда
	//		ПараметрыЗапроса.Вставить("sbp_payer_id", ?(СтрНачинаетсяС("+", НомерТелефона), НомерТелефона, "+" + НомерТелефона));
	//	КонецЕсли;
	//КонецЕсли;

	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);
	
	Соединение = Новый HTTPСоединение("cloud.1c.fitness",,,,, 10, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/api/hs/api/sbp/sbp_sber_OrderCancelQr");			
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);	
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И (РезультатЗапроса.error_code = "000000" ИЛИ РезультатЗапроса.error_code = "130000");
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		
		Если КодСостояния = 200 Тогда
			
			РезультатОперации.ОписаниеОшибки = ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("error_description"), 
				РезультатЗапроса.error_description, Неопределено);	
			
		Иначе
			
			РезультатОперации.ОписаниеОшибки = ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
				РезультатЗапроса.httpMessage + ?(РезультатЗапроса.Свойство("moreInformation"), " " + РезультатЗапроса.moreInformation, ""),
				СтрШаблон("Код ответа: %1. Описание ошибки: %2", КодСостояния, ТелоОтвета));
			
		КонецЕсли;	
		
	Исключение	
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Сбербанк order status request qr
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
//  ТелоОтвета			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_ПолучитьСтатусПлатежа(СтруктураПараметров, ТелоОтвета, ЭтоРучнаяПроверка = Ложь, ЭтоВозврат = Ложь) Экспорт
	
	RqUID			= СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");		
	ДатаСтрокой		= ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);	
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("rq_uid"				, RqUID);
	ПараметрыЗапроса.Вставить("rq_tm"				, ДатаСтрокой);
	ПараметрыЗапроса.Вставить("order_id"			, СтруктураПараметров.order_id);
	ПараметрыЗапроса.Вставить("tid"					, СтруктураПараметров.tid); 
	ПараметрыЗапроса.Вставить("partner_order_number", СтруктураПараметров.partner_order_number);
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса, Ложь);
	
	Соединение = Новый HTTPСоединение("cloud.1c.fitness",,,,, 3, Новый ЗащищенноеСоединениеOpenSSL()); 	
	HTTPЗапрос = Новый HTTPЗапрос(СтрШаблон("/api/hs/api/sbp/sbp_sber_%1", ?(ЭтоРучнаяПроверка ИЛИ ЭтоВозврат, "OrderStatusCheckRequestQr", "OrderStatusRequestQr")));	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.error_code = "000000";
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		
		Если КодСостояния = 200 Тогда
			
			РезультатОперации.ОписаниеОшибки = ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("error_description"), 
				РезультатЗапроса.error_description, Неопределено);	
			
		Иначе
			
			РезультатОперации.ОписаниеОшибки = ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
				РезультатЗапроса.httpMessage + ?(РезультатЗапроса.Свойство("moreInformation"), " " + РезультатЗапроса.moreInformation, ""),
				СтрШаблон("Код ответа: %1. Описание ошибки: %2", КодСостояния, ТелоОтвета));
			
		КонецЕсли;	
		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Сбербанк получить параметры операции для возврата
//
// Параметры:
//  ПараметрыJSON	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_ПолучитьПараметрыОперацииДляВозврата(ПараметрыJSON, СуммаВозвратаВРублях)
	
	СтруктураВозврата = Новый Структура("operation_id, auth_code");
	
	Попытка
		ПараметрыJSON = ДекодироватьИзJSON(ПараметрыJSON);
		
		Для Каждого СтрокаОперации Из ПараметрыJSON.order_operation_params Цикл
			
			Если НРег(СтрокаОперации.operation_type) = НРег("PAY") И СтрокаОперации.operation_sum >= СуммаВозвратаВРублях*100 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтрокаОперации);
				Возврат СтруктураВозврата;
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	Возврат СтруктураВозврата;
		
КонецФункции

#КонецОбласти

#Область Апекс

// Функция, формирует ссылку на оплату основание и возвращает её. 
//
Функция СформироватьСсылкуОплатыАпекс(СтруктураПараметров)	
	
	// http://docs.paygateway.ru/pages/viewpage.action?pageId=21332167#id-%D0%9C%D0%95%D0%A0%D0%A7%D0%90%D0%9D%D0%A2-%D0%98%D0%9D%D0%A2%D0%95%D0%A0%D0%A4%D0%95%D0%99%D0%A1%D0%B4%D0%BB%D1%8F%D0%B2%D0%BD%D0%B5%D1%88%D0%BD%D0%B8%D1%85%D0%BC%D0%B0%D0%B3%D0%B0%D0%B7%D0%B8%D0%BD%D0%BE%D0%B2-%D0%97%D0%B0%D0%BF%D1%80%D0%BE%D1%81%D0%BD%D0%B0%D0%B2%D1%8B%D1%81%D1%82%D0%B0%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5%D1%81%D1%87%D1%91%D1%82%D0%B0%D0%BF%D0%BB%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%89%D0%B8%D0%BA%D1%83%D0%BF%D0%BE%D1%8D%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%BE%D0%BD%D0%BD%D0%BE%D0%B9%D0%BF%D0%BE%D1%87%D1%82%D0%B5/SMS	
		
	СтруктураВозврата		= СтруктураПараметров.СтруктураВозврата; 
    ПараметрыПШ				= СтруктураПараметров.ПараметрыПШ;
	СуммаОплаты 			= СтруктураПараметров.СуммаОплаты;
	ТаблицаЗадолженностей	= СтруктураПараметров.ТаблицаЗадолженностей;
	
	Если ТипЗнч(ПараметрыПШ) <> Тип("Структура") Или Не ЗначениеЗаполнено(ПараметрыПШ.ЛицевойСчетАпекс)
		Или Не ЗначениеЗаполнено(ПараметрыПШ.СекретныйКлюч1Апекс) Или Не ЗначениеЗаполнено(ПараметрыПШ.СекретныйКлюч2Апекс) Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не заполнены параметры эквайрингового терминала.";
		Возврат СтруктураВозврата;
		
	КонецЕсли;	
   
	СтруктураДанных = СформироватьСтруктуруДанных(СтруктураПараметров);

	ОписаниеОшибки = "";
	Ответ = ВызовМетода(СтруктураДанных, ПараметрыПШ, ОписаниеОшибки); 

	Если Ответ = Неопределено Или ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке ссылки на оплату в Апекс. " + ОписаниеОшибки;	
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Если ТипЗнч(Ответ) <> Тип("Соответствие") Или Ответ["status"] = Неопределено Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не верный ответ.";
		Возврат СтруктураВозврата;
		
	КонецЕсли;	
		
	status = Ответ["status"];
	
	Если status = "error" Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке ссылки на оплату в Апекс. " + Ответ["errorcode"] + " " + Ответ["errortext"];
		Возврат СтруктураВозврата;

	КонецЕсли;

	КороткаяСсылкаНаОплату = Ответ["payURL"]; 
	Если Не ЗначениеЗаполнено(КороткаяСсылкаНаОплату) Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не передана ссылка на оплату.";
		Возврат СтруктураВозврата;

	КонецЕсли;
	
	СтруктураВозврата.СсылкаНаОплату = КороткаяСсылкаНаОплату;
	СтруктураВозврата.ВыполненоУспешно = Истина;
	
	НомерЗаказа = Число(Ответ["transID"]);
	
	Для Каждого СтрокаТ Из ТаблицаЗадолженностей Цикл
		
	РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		СтрокаТ.ДокументЗадолженности, 
		СтрокаТ.Задолженность, 
		Ответ["number"], 
		КороткаяСсылкаНаОплату, 
		Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено, 
		СтруктураПараметров.ЭквайринговыйТерминал, 
		НомерЗаказа,
		,
		Не ЗначениеЗаполнено(СтрокаТ.ДокументЗадолженности),
		СтруктураПараметров.Контрагент,,
		СтруктураПараметров.СтруктурнаяЕдиница,
		ТекущаяДатаСеанса(),
		"Заказ зарегистрирован, но не оплачен",
		Перечисления.ТипыСсылокНаОплату.Апекс);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Сформировать структуру данных
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьСтруктуруДанных(СтруктураПараметров)
	
	ТаблицаЗадолженностей	= СтруктураПараметров.ТаблицаЗадолженностей;
	Сумма					= СтруктураПараметров.СуммаОплаты;
	ПараметрыПШ				= СтруктураПараметров.ПараметрыПШ;
	Контрагент				= СтруктураПараметров.Контрагент;
	email					= СтруктураПараметров.АдресЭПКонтрагента;
	
	СтруктураДанных = Новый Структура();
	Сумма = Формат(Сумма, "ЧРД=.; ЧГ=");                  // сумма в копейках.
	СтруктураДанных.Вставить("amount", Сумма);     // стоимость товара в валюте оплаты (amountcurr)
	СтруктураДанных.Вставить("amountcurr", "RUB"); // валюта, в которой задана стоимость товара (amount)
	СтруктураДанных.Вставить("paysys", "MBC");     // VISA/MasterCard
	ДатаЗаказа  = ТекущаяДатаСеанса();
	ЭтоРеализация = ТипЗнч(ТаблицаЗадолженностей[0].ДокументЗадолженности) = Тип("ДокументСсылка.Реализация");
	НомерЗаказа = СформироватьНомерЗаказаСБП();
	НомерЗаказа = СтрЗаменить(НомерЗаказа, ":", "");
	СтруктураДанных.Вставить("number", НомерЗаказа); // уникальный внутренний номер заказа магазина
	
	Описание      = "";
	ПервыйЭлемент = Истина;
	Массивitems = Новый Массив;
	
	Если ЭтоРеализация Тогда
		Для Каждого Основание Из ТаблицаЗадолженностей Цикл 
			Для Каждого СтрокаТЧ Из Основание.ДокументЗадолженности.Запасы Цикл 
				
				Если Не ПервыйЭлемент Тогда
					Описание = Описание + ", "	
				КонецЕсли;		
				НаименованиеНоменкалтуры = ПолучитьЗначенияРеквизитовПоСсылке(СтрокаТЧ.Номенклатура, "Наименование");
				Описание = НаименованиеНоменкалтуры + " x" + СтрокаТЧ.Количество;			
				
				СтруктураТовара = Новый Структура;
				СтруктураТовара.Вставить("title", НаименованиеНоменкалтуры); 
				СтруктураТовара.Вставить("price", Строка(СтрокаТЧ.Цена));
				СтруктураТовара.Вставить("qty", Строка(СтрокаТЧ.Количество));
				Массивitems.Добавить(СтруктураТовара);			
				
				ПервыйЭлемент = Ложь;
				
			КонецЦикла;
		КонецЦикла;
		
	Иначе 
		Описание = "Взнос на лицевой счет";
	КонецЕсли;
	
	Описание = СформироватьОписаниеЗаказа(Описание);
	Описание = СтрЗаменить(Описание, ":", "");
	Описание = КодироватьСтроку(Описание, СпособКодированияСтроки.КодировкаURL);
	
	СтруктураДанных.Вставить("description", Описание); // текстовое описание заказа, представленное в виде URL-encoded строки (минимум – 6 символов) 
	СтруктураДанных.Вставить("validity", "");	
	
	first_name = ?(ЗначениеЗаполнено(Контрагент.Имя), Контрагент.Имя, Контрагент.Наименование);
	СтруктураДанных.Вставить("first_name", first_name);  // имя плательщика
	last_name = ?(ЗначениеЗаполнено(Контрагент.Имя) И ЗначениеЗаполнено(Контрагент.Фамилия), Контрагент.Фамилия, "");
	middle_name = ?(ЗначениеЗаполнено(Контрагент.Имя) И ЗначениеЗаполнено(Контрагент.Отчество), Контрагент.Отчество, "");
	СтруктураДанных.Вставить("last_name"  , last_name);    // Фамилия плательщика
	СтруктураДанных.Вставить("middle_name", middle_name);  // отчество  плательщика

	Если ЗначениеЗаполнено(email) Тогда
		СтруктураДанных.Вставить("email", email);
		СтруктураДанных.Вставить("notify_email", 0);
	КонецЕсли;
	
	СтруктураДанных.Вставить("backURL", ""); //  URL возврата на сайт магазина после оплаты			
	СтруктураДанных.Вставить("account", ПараметрыПШ.ЛицевойСчетАпекс);  //номер счёта магазина в Системе paygateway (сообщается при регистрации и отображается в Личном кабинете владельца магазина)
			
	Для Каждого Элемент Из СтруктураДанных Цикл
		signature = ?(ЗначениеЗаполнено(signature), signature + ":" + Элемент.Значение, Элемент.Значение); 
	КонецЦикла;
	
	// если в лк в настройках MD5
	signature = signature + ":" +  ПараметрыПШ.СекретныйКлюч1Апекс + ":" + ПараметрыПШ.СекретныйКлюч2Апекс; 
	Если ПараметрыПШ.Свойство("HMACАпекс") И ПараметрыПШ.HMACАпекс Тогда
		signature = ОбщегоНазначения.ПолучитьХешСумму(ПараметрыПШ.СекретныйКлюч1Апекс +  ПараметрыПШ.СекретныйКлюч2Апекс, signature, "sha256");
	Иначе
		signature = ПолучитьMD5(signature);
	КонецЕсли;	
	signature = Строка(signature);
	СтруктураДанных.Вставить("signature", signature);
	
	Структураfiscal_data = Новый Структура; 		
	Массивfiscal_data = Новый Массив; 
	Структураfiscal_data.Вставить("items", Массивitems);
	Массивfiscal_data.Добавить(Структураfiscal_data);
	СтруктураДанных.Вставить("fiscal_data", Массивfiscal_data);	
	
	Возврат СтруктураДанных;
	
КонецФункции

// Функция, формирует описание заказа
Функция СформироватьОписаниеЗаказа(Описание)
	
	Описание = СтрЗаменить(Описание, "%", "");
	Описание = СтрЗаменить(Описание, "+", "");
	
	Возврат Лев(СокрЛП(Описание), 128); 
	
КонецФункции

// Функция - Вызов Метода
// 
// Возвращаемое значение:
//   - 
//
Функция ВызовМетода(СтруктураДанных, ПараметрыПШ, ОписаниеОшибки)
	
	//Попытка
	//	
	//	Логин              = ПараметрыПШ.ЛогинБанка;
	//	Пароль             = ПараметрыПШ.ПарольБанка; 
	//	ТестовыйРежим      = ПараметрыПШ.ТестовыйРежим;
	//	АдресAPI           = ?(ПараметрыПШ.ТестовыйРежим, "https://secure.test.paygateway.ru/api/payment/invoice/", "https://secure.paygateway.ru/api/payment/invoice/");
	//	АдресAPI           = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресAPI);	
	//    ОтветСервиса       = Неопределено;
	//	
	//	ЗаписьJSON      = Новый ЗаписьJSON;
	//	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	//	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	//	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	//	ТелоЗапроса = ЗаписьJSON.Закрыть();
	//	
	//	HTTPСоединение = Новый HTTPСоединение(АдресAPI.Хост,, Логин, Пароль,,20, Новый ЗащищенноеСоединениеOpenSSL());
	//	ЗаголовкиHTTP = Новый Соответствие;
	//	ЗаголовкиHTTP.Вставить("Content-Type",  "application/json");
	//	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	//		
	//	HTTPЗапрос = Новый HTTPЗапрос("/" + АдресAPI.ПутьНаСервере, ЗаголовкиHTTP);
	//	HTTPЗапрос.Заголовки = ЗаголовкиHTTP;
	//	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	//	
	//	ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	//
	//    ОтветСервера = ОтветHTTP.ПолучитьТелоКакСтроку();		
	//	ЧтениеJSON = Новый ЧтениеJSON;
	//	ЧтениеJSON.УстановитьСтроку(ОтветСервера);
	//	ОтветСервиса = ПрочитатьJSON(ЧтениеJSON, Истина);
	//	КодОтвета = ОтветHTTP.КодСостояния;
	//	
	//Исключение
	//	
	//	ОтветСервиса   = ОписаниеОшибки();
	//	ОписаниеОшибки = ОтветСервиса;
	//	КодОтвета      = 500;
	//	
	//КонецПопытки;

	//// Логирование
	//ЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();	
	//
	//Если ЛогироватьСобытие > 0 Тогда
	//	
	//	СтруктураЛогирования   = ОбщегоНазначения.СформироватьСтруктуруЛогирования(HTTPЗапрос, , "Apex", 
	//		Перечисления.HTTPСервисы.Apex, Истина);
	//	ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//	ВремяВыполнения        = (ВремяОкончанияОперации - СтруктураЛогирования.ВремяНачалаОперации) / 1000;
	//	СтатусСобытия		   = ?(КодОтвета = 200, Перечисления.СтасусыЗапросов.Выполнен, Перечисления.СтасусыЗапросов.ЗавершенСОшибками);
	//	ОтветСтрока            = ОтветСервиса;
	//	Если ТипЗнч(ОтветСервиса) = Тип("Соответствие") Тогда
	//		
	//		ОтветСтрока = "";
	//		Для Каждого Элемент Из ОтветСервиса Цикл
	//			 ОтветСтрока = ОтветСтрока + Символы.ПС + Элемент.Ключ + ": " + Элемент.Значение; 
	//		КонецЦикла;
	//		
	//	КонецЕсли;

	//	ОбщегоНазначения.ЛогироватьЗапрос(ОтветСтрока, СтруктураЛогирования, СтатусСобытия, КодОтвета, Истина);
	//			
	//КонецЕсли;
	//
	//Возврат ОтветСервиса;
	
КонецФункции

// Функция возвращает хеш строки
//
Функция ПолучитьMD5(Текст)
	
	ОбъектХеш = Новый ХешированиеДанных(ХешФункция.MD5);
	ОбъектХеш.Добавить(Текст);
	ХешСумма = Строка(ОбъектХеш.ХешСумма);
	Возврат СтрЗаменить(ХешСумма, " ", "");
	
КонецФункции

#КонецОбласти

#Область BePaid

 // Функция, формирует ссылку на оплату основание и возвращает её. 
//
Функция СформироватьСсылкуОплатыBePaid(СтруктураПараметров) 

	// https://docs.bepaid.by/ru/products#get-payment-link
	
	СтруктураВозврата		= СтруктураПараметров.СтруктураВозврата; 
	ПараметрыПШ				= СтруктураПараметров.ПараметрыПШ;
	СуммаОплаты 			= СтруктураПараметров.СуммаОплаты;
	ТаблицаЗадолженностей	= СтруктураПараметров.ТаблицаЗадолженностей;

	Если ТипЗнч(ПараметрыПШ) <> Тип("Структура")
		Или Не ЗначениеЗаполнено(ПараметрыПШ.IdМагазинаBePaid)
		Или Не ЗначениеЗаполнено(ПараметрыПШ.СекретныйКлючBePaid) Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не заполнены параметры эквайрингового терминала.";
		Возврат СтруктураВозврата;
	КонецЕсли;	
		
	СтруктураДанных = СформироватьСтруктуруДанныхСозданиеПродуктаBePaid(ТаблицаЗадолженностей, ПараметрыПШ);

	ОписаниеОшибки = "";
	КодОтвета      = ""; 
	product_id     = ВызовМетодаСозданиеПродуктаBePaid(СтруктураДанных, ПараметрыПШ, ОписаниеОшибки, КодОтвета); 

	Если КодОтвета <> 201 Или ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке ссылки на оплату в BePaid. " + ОписаниеОшибки;;
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	// отправить ссылку на оплату
	КороткаяСсылкаНаОплату = "https://api.bepaid.by/products/" + product_id + "/pay";
	
	СтруктураВозврата.Вставить("СсылкаНаОплату"	 , КороткаяСсылкаНаОплату);
	СтруктураВозврата.Вставить("ВыполненоУспешно", Истина);
	
	НомерЗаказа = ПолучитьНомерЗаказа(ТаблицаЗадолженностей[0].ДокументЗадолженности);

	Для Каждого СтрокаТ Из ТаблицаЗадолженностей Цикл
		
	РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		СтрокаТ.ДокументЗадолженности, 
		СтрокаТ.Задолженность, 
		product_id, 
		КороткаяСсылкаНаОплату, 
		Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено, 
		СтруктураПараметров.ЭквайринговыйТерминал, 
		НомерЗаказа,
		,
		Не ЗначениеЗаполнено(СтрокаТ.ДокументЗадолженности),
		СтруктураПараметров.Контрагент,
		СтрокаТ.ДокументЗадолженности.ВидЦен,
		СтруктураПараметров.СтруктурнаяЕдиница,
		ТекущаяДатаСеанса(),
		"Заказ зарегистрирован, но не оплачен",
		Перечисления.ТипыСсылокНаОплату.BePaid);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Сформировать структуру данных be paid
//
// Параметры:
//  Основание	 - 	 - 
//  Сумма		 - 	 - 
//  ПараметрыПШ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьСтруктуруДанныхСозданиеПродуктаBePaid(ТаблицаЗадолженностей, ПараметрыПШ)
			
	СтрокаТЧ = ТаблицаЗадолженностей[0].ДокументЗадолженности.Запасы[0];
	Валюта = Константы.ВалютаУчета.Получить();   
	Если Валюта.Код = "643" Тогда
		currency = "RUB";
	Иначе 
		currency = Валюта.Наименование;	
	КонецЕсли;
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("name"       , Строка(СтрокаТЧ.Номенклатура));
	СтруктураДанных.Вставить("description", Строка(СтрокаТЧ.Номенклатура.НаименованиеПолное));
	СтруктураДанных.Вставить("currency"   , currency);
	СтруктураДанных.Вставить("amount"     , СтрокаТЧ.Всего * 100);	
    СтруктураДанных.Вставить("quantity"   , СтрокаТЧ.Количество);
	СтруктураДанных.Вставить("infinite"   , Ложь);
	СтруктураДанных.Вставить("test"       , ПараметрыПШ.ТестовыйРежим);
	СтруктураДанных.Вставить("immortal"   , Истина); // Устанавливается в true, если время оплаты не ограничено.
	Если ЗначениеЗаполнено(ПараметрыПШ.UrlRedirect) Тогда
		СтруктураДанных.Вставить("return_url", ПараметрыПШ.UrlRedirect);  // URL, на который будет перенаправлен клиент после завершения оплаты 
	КонецЕсли;
	СтруктураДанных.Вставить("shop_id", ПараметрыПШ.IdМагазинаBePaid);
	СтруктураДанных.Вставить("transaction_type", "payment");
	СтруктураДанных.Вставить("language", "ru");
    СтруктураДанных.Вставить("notification_url", ПараметрыПШ.URLWebhooksBePaid);
	
	product = Новый Структура(); 	
	product.Вставить("shop_id", ПараметрыПШ.IdМагазинаBePaid);
	product.Вставить("name"   , Строка(СтрокаТЧ.Номенклатура));
	product.Вставить("description", Строка(СтрокаТЧ.Номенклатура.НаименованиеПолное));
	product.Вставить("currency"   , Валюта.Код);
	product.Вставить("amount"     , СтрокаТЧ.Всего * 100); 	
	product.Вставить("quantity"   , СтрокаТЧ.Количество);
	product.Вставить("infinite"   , Ложь);
	product.Вставить("test"       , ПараметрыПШ.ТестовыйРежим);
	product.Вставить("immortal"   , Истина); // Устанавливается в true, если время оплаты не ограничено.
	Если ЗначениеЗаполнено(ПараметрыПШ.UrlRedirect) Тогда
		СтруктураДанных.Вставить("return_url", ПараметрыПШ.UrlRedirect);  // URL, на который будет перенаправлен клиент после завершения оплаты 
	КонецЕсли;
	product.Вставить("transaction_type", "payment");
	product.Вставить("language", "ru");  
	product.Вставить("notification_url", ПараметрыПШ.URLWebhooksBePaid);
    
	СтруктураДанных.Вставить("product", product);
	
	Возврат СтруктураДанных; 
	
КонецФункции

// Функция - Вызов Метода
// 
// Возвращаемое значение:
//   - 
//
Функция ВызовМетодаСозданиеПродуктаBePaid(СтруктураДанных, ПараметрыПШ, ОписаниеОшибки, КодОтвета)
	
	//Попытка
	//	
	//	Логин              = ПараметрыПШ.IdМагазинаBePaid;
	//	Пароль             = ПараметрыПШ.СекретныйКлючBePaid;	
	//	ТестовыйРежим      = ПараметрыПШ.ТестовыйРежим;
	//	АдресAPI           = ОбщегоНазначенияКлиентСервер.СтруктураURI("https://api.bepaid.by/products");	
	//    ОтветСервиса       = Неопределено;
	//	
	//	ЗаписьJSON      = Новый ЗаписьJSON;
	//	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	//	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	//	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	//	ТелоЗапроса = ЗаписьJSON.Закрыть();
	//	
	//	HTTPСоединение = Новый HTTPСоединение(АдресAPI.Хост,, Логин, Пароль,,20, Новый ЗащищенноеСоединениеOpenSSL());
	//	ЗаголовкиHTTP = Новый Соответствие;
	//	ЗаголовкиHTTP.Вставить("Content-Type",  "application/json");
	//	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	//		
	//	HTTPЗапрос = Новый HTTPЗапрос("/" + АдресAPI.ПутьНаСервере, ЗаголовкиHTTP);
	//	HTTPЗапрос.Заголовки = ЗаголовкиHTTP;
	//	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	//	
	//	ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	//
	//    ОтветСервера = ОтветHTTP.ПолучитьТелоКакСтроку();		
	//	ЧтениеJSON = Новый ЧтениеJSON;
	//	ЧтениеJSON.УстановитьСтроку(ОтветСервера);
	//	ОтветСервиса = ПрочитатьJSON(ЧтениеJSON, Истина);
	//	КодОтвета = ОтветHTTP.КодСостояния;
	//	
	//Исключение
	//	
	//	ОтветСервиса   = ОписаниеОшибки();
	//	ОписаниеОшибки = ОтветСервиса;
	//	КодОтвета      = 500;
	//	
	//КонецПопытки;
	//
	//Если ТипЗнч(ОтветСервиса) = Тип("Соответствие") Тогда
	//	
	//	ОтветСтрока = "";
	//	Для Каждого Элемент Из ОтветСервиса Цикл 
	//		Если Элемент.Ключ = "id" Тогда
	//			ОтветСтрока = Элемент.Значение;  
	//		ИначеЕсли Элемент.Ключ = "message" Тогда
	//			ОтветСтрока    = Элемент.Значение; 
	//			ОписаниеОшибки = ОтветСтрока;
	//		КонецЕсли;	
	//	КонецЦикла;
	//	
	//КонецЕсли;

	//// Логирование
	//ЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();	
	//
	//Если ЛогироватьСобытие > 0 Тогда
	//	
	//	СтруктураЛогирования   = ОбщегоНазначения.СформироватьСтруктуруЛогирования(HTTPЗапрос, , "BePaid", 
	//		Перечисления.HTTPСервисы.BePaid, Истина);
	//	ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//	ВремяВыполнения        = (ВремяОкончанияОперации - СтруктураЛогирования.ВремяНачалаОперации) / 1000;
	//	СтатусСобытия		   = ?(КодОтвета = 201, Перечисления.СтасусыЗапросов.Выполнен, Перечисления.СтасусыЗапросов.ЗавершенСОшибками);
	//	
	//	ОбщегоНазначения.ЛогироватьЗапрос(ОтветСтрока, СтруктураЛогирования, СтатусСобытия, КодОтвета, Истина);
	//			
	//КонецЕсли;
	//
	//Возврат ОтветСтрока;
	
КонецФункции

// Функция - Получить номер заказа
//
// Параметры:
//  Основание	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНомерЗаказа(Основание)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОплатыЗаказов.Основание КАК Основание,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтатусыОплатыЗаказов.НомерЗаказа) КАК Количество
	|ИЗ
	|	РегистрСведений.СтатусыОплатыЗаказов КАК СтатусыОплатыЗаказов
	|ГДЕ
	|	СтатусыОплатыЗаказов.Основание = &Основание
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыОплатыЗаказов.Основание");
	
	Запрос.УстановитьПараметр("Основание", Основание);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Количество + 1, 1);
	
КонецФункции

#КонецОбласти

#Область CloudPayments

// Функция, формирует ссылку на оплату основание и возвращает её. 
//
Функция СформироватьСсылкуОплатыCloudPayments(СтруктураПараметров)

	//https://developers.cloudpayments.ru/#sozdanie-scheta-dlya-otpravki-po-pochte 
	
	СтруктураВозврата		= СтруктураПараметров.СтруктураВозврата; 
	ПараметрыПШ				= СтруктураПараметров.ПараметрыПШ;
	СуммаОплаты 			= СтруктураПараметров.СуммаОплаты;
	ТаблицаЗадолженностей	= СтруктураПараметров.ТаблицаЗадолженностей;
    Валюта                  = СтруктураПараметров.СтруктурнаяЕдиница.Валюта;
	
	Если ТипЗнч(ПараметрыПШ) <> Тип("Структура")
		Или Не ЗначениеЗаполнено(ПараметрыПШ.ОткрытыйКлючCloudPayments)
		Или Не ЗначениеЗаполнено(ПараметрыПШ.ПарольCloudPayments) Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не заполнены параметры эквайрингового терминала.";
		Возврат СтруктураВозврата;
	КонецЕсли;	
   
	СтруктураДанных = СформироватьСтруктуруДанныхCloudPayments(ТаблицаЗадолженностей, СуммаОплаты, ПараметрыПШ, Валюта);

	ОписаниеОшибки = "";
	Ответ = ВызовМетодаCloudPayments(СтруктураДанных, ПараметрыПШ, ОписаниеОшибки); 

	Если Ответ = Неопределено Или ЗначениеЗаполнено(ОписаниеОшибки) Тогда		
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке ссылки на оплату в CloudPayments. " + ОписаниеОшибки;
		Возврат СтруктураВозврата;		
	КонецЕсли;
		
	Если ТипЗнч(Ответ) <> Тип("Соответствие") Или Ответ["Success"] = Неопределено Тогда		
		СтруктураВозврата.ОписаниеОшибки = "Не верный ответ.";
		Возврат СтруктураВозврата;		
	КонецЕсли;	
		
	Success = Ответ["Success"];
	
	Если Success = Ложь Тогда
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке ссылки на оплату в CloudPayments. " + Ответ["Message"];
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	КороткаяСсылкаНаОплату = Ответ["Model"]["Url"]; 
	
	Если Не ЗначениеЗаполнено(КороткаяСсылкаНаОплату) Тогда		
		СтруктураВозврата.ОписаниеОшибки = "Не передана ссылка на оплату.";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("СсылкаНаОплату"		, КороткаяСсылкаНаОплату);
	СтруктураВозврата.Вставить("ВыполненоУспешно"	, Истина);
	
	НомерЗаказа = Число(Ответ["Model"]["Number"]);
	
	Для Каждого СтрокаТ Из ТаблицаЗадолженностей Цикл
		
	РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		СтрокаТ.ДокументЗадолженности, 
		СтрокаТ.Задолженность, 
		СтруктураДанных.InvoiceId, 
		КороткаяСсылкаНаОплату, 
		Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено, 
		СтруктураПараметров.ЭквайринговыйТерминал, 
		НомерЗаказа,
		,
		Не ЗначениеЗаполнено(СтрокаТ.ДокументЗадолженности),
		СтруктураПараметров.Контрагент,,
		СтруктураПараметров.СтруктурнаяЕдиница,
		ТекущаяДатаСеанса(),
		"Заказ зарегистрирован, но не оплачен",
		Перечисления.ТипыСсылокНаОплату.CloudPayments);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Сформировать структуру данных
//
// Параметры:
//  Основание	 - 	 - 
//  Сумма		 - 	 - 
//  ПараметрыПШ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьСтруктуруДанныхCloudPayments(ТаблицаЗадолженностей, Сумма, ПараметрыПШ, Валюта)
		
	СтруктураДанных = Новый Структура();
	Сумма = Формат(Сумма, "ЧРД=.; ЧГ=");                  // сумма в копейках.
	СтруктураДанных.Вставить("Amount", Сумма);     // стоимость товара в валюте оплаты (amountcurr)   
	ВалютаНаименование = ?(ЗначениеЗаполнено(Валюта), Валюта.Наименование, "RUB");
	СтруктураДанных.Вставить("Currency", ВалютаНаименование);   // валюта, в которой задана стоимость товара (amount)
	ЭтоРеализация = ТипЗнч(ТаблицаЗадолженностей[0].ДокументЗадолженности) = Тип("ДокументСсылка.Реализация");
	
	Описание      = "";
	ПервыйЭлемент = Истина;
	
	Если ЭтоРеализация Тогда
		Для Каждого Основание Из ТаблицаЗадолженностей Цикл
			Для Каждого СтрокаТЧ Из Основание.ДокументЗадолженности.Запасы Цикл 
				
				Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда		
					Если Не ПервыйЭлемент Тогда
						Описание = Описание + ", "	
					КонецЕсли;		
					Описание = Описание + СтрокаТЧ.Номенклатура.Наименование;
					ПервыйЭлемент = Ложь;
				КонецЕсли;	
			КонецЦикла;	  
		КонецЦикла;
	Иначе
		Описание = "Взнос на лицевой счет";	
	КонецЕсли;
	
	СтруктураДанных.Вставить("Description", Описание); //Назначение платежа в свободной форме 
	
	ДатаЗаказа  = ТекущаяДатаСеанса();
	НомерЗаказа = СформироватьНомерЗаказаСБП();
	НомерЗаказа = СтрЗаменить(НомерЗаказа, ":", "");

	СтруктураДанных.Вставить("InvoiceId", НомерЗаказа); // Номер заказа в вашей системе
	СтруктураДанных.Вставить("SuccessRedirectUrl", ПараметрыПШ.PayУведомлениеCloudPayments);	
	
	Возврат СтруктураДанных;
	
КонецФункции

// Функция - Вызов Метода
// 
// Возвращаемое значение:
//   - 
//
Функция ВызовМетодаCloudPayments(СтруктураДанных, ПараметрыПШ, ОписаниеОшибки)
	
	//Попытка
	//	
	//	Логин              = ПараметрыПШ.ОткрытыйКлючCloudPayments;
	//	Пароль             = ПараметрыПШ.ПарольCloudPayments; 
	//	АдресAPI           = "https://api.cloudpayments.ru/orders/create/";
	//	АдресAPI           = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресAPI);	
	//    ОтветСервиса       = Неопределено;
	//	
	//	ЗаписьJSON      = Новый ЗаписьJSON;
	//	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	//	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	//	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	//	ТелоЗапроса = ЗаписьJSON.Закрыть();
	//	
	//	HTTPСоединение = Новый HTTPСоединение(АдресAPI.Хост,, Логин, Пароль,,20, Новый ЗащищенноеСоединениеOpenSSL());
	//	ЗаголовкиHTTP = Новый Соответствие;
	//	ЗаголовкиHTTP.Вставить("Content-Type",  "application/json");
	//	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	//		
	//	HTTPЗапрос = Новый HTTPЗапрос("/" + АдресAPI.ПутьНаСервере, ЗаголовкиHTTP);
	//	HTTPЗапрос.Заголовки = ЗаголовкиHTTP;
	//	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	//	
	//	ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	//
	//    ОтветСервера = ОтветHTTP.ПолучитьТелоКакСтроку();		
	//	ЧтениеJSON = Новый ЧтениеJSON;
	//	ЧтениеJSON.УстановитьСтроку(ОтветСервера);
	//	ОтветСервиса = ПрочитатьJSON(ЧтениеJSON, Истина);
	//	КодОтвета = ОтветHTTP.КодСостояния;
	//	
	//Исключение
	//	
	//	ОтветСервиса   = ОписаниеОшибки();
	//	ОписаниеОшибки = ОтветСервиса;
	//	КодОтвета      = 500;
	//	
	//КонецПопытки;

	// Логирование
	//ЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();	
	//
	//Если ЛогироватьСобытие > 0 Тогда
	//	
	//	СтруктураЛогирования   = ОбщегоНазначения.СформироватьСтруктуруЛогирования(HTTPЗапрос, , "CloudPayments", 
	//		Перечисления.HTTPСервисы.CloudPayments, Истина);
	//	ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//	ВремяВыполнения        = (ВремяОкончанияОперации - СтруктураЛогирования.ВремяНачалаОперации) / 1000;
	//	СтатусСобытия		   = ?(КодОтвета = 200, Перечисления.СтасусыЗапросов.Выполнен, Перечисления.СтасусыЗапросов.ЗавершенСОшибками);
	//	ОтветСтрока            = ОтветСервиса;
	//	Если ТипЗнч(ОтветСервиса) = Тип("Соответствие") Тогда
	//		
	//		ОтветСтрока = "";
	//		Для Каждого Элемент Из ОтветСервиса Цикл
	//			 ОтветСтрока = ОтветСтрока + Символы.ПС + Элемент.Ключ + ": " + Элемент.Значение; 
	//		КонецЦикла;
	//		
	//	КонецЕсли;

	//	ОбщегоНазначения.ЛогироватьЗапрос(ОтветСтрока, СтруктураЛогирования, СтатусСобытия, КодОтвета, Истина);
	//			
	//КонецЕсли;
	//
	//Возврат ОтветСервиса;
	
КонецФункции

#КонецОбласти

#Область ЮКасса

// Функция - Сформировать ссылку оплаты ЮКасса
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьСсылкуОплатыЮКасса(СтруктураПараметров)
	
	// Документация
	// https://yookassa.ru/developers/payment-acceptance/getting-started/quick-start#create-payment 
	
	// 1. Проверка параметров эквайринга
	ПередаваемаяСтруктура	= Новый Структура; 
	СтруктураВозврата		= СтруктураПараметров.СтруктураВозврата; 
	ПараметрыПШ				= СтруктураПараметров.ПараметрыПШ;
	СуммаОплаты 			= СтруктураПараметров.СуммаОплаты;
	ТаблицаЗадолженностей	= СтруктураПараметров.ТаблицаЗадолженностей;
    ОснованиеПлатежа		= ТаблицаЗадолженностей[0].ДокументЗадолженности;
	
	Если ТипЗнч(ПараметрыПШ) <> Тип("Структура")
		Или Не ЗначениеЗаполнено(ПараметрыПШ.ЛогинБанка)
		Или Не ЗначениеЗаполнено(ПараметрыПШ.ПарольБанка)
		Или Не ЗначениеЗаполнено(ПараметрыПШ.UrlRedirect) Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не заполнены параметры эквайрингового терминала.";
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	ТекстОшибки             = "";
	КороткаяСсылкаНаОплату  = "";
	УИДПлатежа              = "";
	
	Попытка
		
		// 2. Формирвоание соединения и передача заголовков	
		Соединение    = Новый HTTPСоединение("api.yookassa.ru",, ПараметрыПШ.ЛогинБанка, ПараметрыПШ.ПарольБанка,,5, Новый ЗащищенноеСоединениеOpenSSL());
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type", "application/json"); 	
		УИД = Строка(ОснованиеПлатежа.УникальныйИдентификатор());
		ЗаголовкиHTTP.Вставить("Idempotence-Key", УИД);  
		
		// 3. Формирвоание структуры данных и тела запроса		
		amount = Новый Структура("value, currency", СуммаОплаты, "RUB"); 
		ПередаваемаяСтруктура.Вставить("amount", amount);
		ПередаваемаяСтруктура.Вставить("capture", Истина);
		ОснованиеПлатежаСтрокой = Строка(ОснованиеПлатежа);
		ПередаваемаяСтруктура.Вставить("description", ОснованиеПлатежаСтрокой);
		confirmation = Новый Структура("type, return_url", "redirect", ПараметрыПШ.UrlRedirect);
		ПередаваемаяСтруктура.Вставить("confirmation", confirmation);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		ЗаписатьJSON(ЗаписьJSON, ПередаваемаяСтруктура);
		ТелоЗапроса = ЗаписьJSON.Закрыть();	
			
		// 4. Отправка данных в сервис    
		HTTPЗапрос = Новый HTTPЗапрос("/v3/payments", ЗаголовкиHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		Запрос    = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТекстJSON = Запрос.ПолучитьТелоКакСтроку();
		
		// 5. Обработка ответа
		ЧтениеJSON    = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);  
		
		Если ПараметрыJSON.Свойство("type") Тогда
			Если ПараметрыJSON.type = "error" Тогда 
				Если ПараметрыJSON.Свойство("description") Тогда
					ТекстОшибки = ПараметрыJSON.description;
				Иначе
					ТекстОшибки = "Ошибка при отправке данных в сервис ЮКасса на получение ссылки на оплату по " + ОснованиеПлатежаСтрокой;
				КонецЕсли;
			КонецЕсли; 		
		Иначе
			Если ПараметрыJSON.Свойство("id") Тогда
				УИДПлатежа = ПараметрыJSON.id;			
			КонецЕсли;			
			Если ПараметрыJSON.Свойство("confirmation") Тогда
				Если ПараметрыJSON.confirmation.Свойство("confirmation_url") Тогда 
					КороткаяСсылкаНаОплату = ПараметрыJSON.confirmation.confirmation_url; 
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;		
	Исключение  		
		ТекстОшибки       = "Ошибка при отправке данных в сервис ЮКасса на получение ссылки на оплату по " 
			+ ОснованиеПлатежаСтрокой + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(КороткаяСсылкаНаОплату) Или Не ЗначениеЗаполнено(УИДПлатежа) Тогда 
		ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки, "Ошибка при отправке данных в сервис ЮКасса на получение ссылки на оплату по " 
			+ ОснованиеПлатежаСтрокой + Символы.ПС);
        ТекстОшибки = ТекстОшибки + ?(Не ЗначениеЗаполнено(КороткаяСсылкаНаОплату), "Не передана ссылка на оплату.", "Не передано значение id.");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда		
		СтруктураВозврата.ОписаниеОшибки = ТекстОшибки;
		Возврат СтруктураВозврата;		
	КонецЕсли;
	
	СтруктураВозврата.Вставить("СсылкаНаОплату"		, КороткаяСсылкаНаОплату);
	СтруктураВозврата.Вставить("ВыполненоУспешно"	, Истина);
	
	// 6. Добавление в регистр Статусы оплаты заказов новой записи со статусом Не оплачено 
	НомерЗаказа = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьМассимальныйНомерЗаказа(Перечисления.ТипыСсылокНаОплату.ЮКасса) + 1;
	
	Для Каждого СтрокаТ Из ТаблицаЗадолженностей Цикл
		
	РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		СтрокаТ.ДокументЗадолженности, 
		СтрокаТ.Задолженность, 
		УИДПлатежа, 
		КороткаяСсылкаНаОплату, 
		Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено, 
		СтруктураПараметров.ЭквайринговыйТерминал, 
		НомерЗаказа,
		ТелоЗапроса,
		Не ЗначениеЗаполнено(СтрокаТ.ДокументЗадолженности),
		СтруктураПараметров.Контрагент,,
		СтруктураПараметров.СтруктурнаяЕдиница,
		ТекущаяДатаСеанса(),
		"Заказ зарегистрирован, но не оплачен",
		Перечисления.ТипыСсылокНаОплату.ЮКасса);
		
	КонецЦикла;
		
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область СбербанкИPaymo

// Функция, формирует ссылку на оплату основание и возвращает её. 
//
// В случае если параметр sessionTimeoutSecs не задан, будет использовано значение, указанное в настройках мерчанта или время по умолчанию (1200 секунд = 20 минут).
// 
// expirationDate Дата и время окончания жизни заказа. Формат: yyyy-MM-ddTHH:mm:ss.
// Если этот параметр не передаётся в запросе, то для определения времени окончания жизни заказа используется sessionTimeoutSecs.
// Если в запросе присутствует параметр expirationDate, то значение параметра sessionTimeoutSecs не учитывается.
Функция СформироватьСсылкуОплатыСбербанк(СтруктураПараметров)
			
	СтруктураВозврата		= СтруктураПараметров.СтруктураВозврата; 
	ПараметрыПШ				= СтруктураПараметров.ПараметрыПШ;
	СуммаОплаты 			= СтруктураПараметров.СуммаОплаты;
	ТаблицаЗадолженностей	= СтруктураПараметров.ТаблицаЗадолженностей;	
	НомерЗаказа 			= СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	Сумма              		= Формат(СуммаОплаты*100, "ЧГ="); // сумма в копейках.
	ДатаЗаказа         		= ТекущаяДатаСеанса();
	СтруктурнаяЕдиница 		= СтруктураПараметров.СтруктурнаяЕдиница;
	ПлатежныйШлюз      		= СтруктураПараметров.ТипБанка;
	Клиент              	= СтруктураПараметров.Контрагент;
	EmailКлиента			= СтруктураПараметров.АдресЭПКонтрагента;
	НомерТелефона	        = СтруктураПараметров.НомерТелефона;
	ЭквайринговыйТерминал   = СтруктураПараметров.ЭквайринговыйТерминал;
	ФискализацияВСбербанке  = ЭквайринговыйТерминал.ТипФискализации = Перечисления.ТипыФискализации.ВСбербанке;
	Основание               = ТаблицаЗадолженностей[0].ДокументЗадолженности;
	
	Если ТипЗнч(ПараметрыПШ) <> Тип("Структура") ИЛИ Не ЗначениеЗаполнено(ПлатежныйШлюз) Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не заполнены параметры эквайрингового терминала.";
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	URlRedirect        = ПараметрыПШ.UrlRedirect;
	Логин              = ПараметрыПШ.ЛогинБанка;
	Пароль             = ПараметрыПШ.ПарольБанка; 
	ВремяЖизниВЧасах   = ПараметрыПШ.ВремяЖизни;
	ВремяЖизниВСекундах = ?(ЗначениеЗаполнено(ВремяЖизниВЧасах), ВремяЖизниВЧасах*3600, 72*3600); // По умолчанию, если время не заполнено - 3 дня.
	
	Описание      = "";	
	Если ТаблицаЗадолженностей.Количество() > 0 И ТипЗнч(ТаблицаЗадолженностей[0].ДокументЗадолженности) = Тип("ДокументСсылка.Реализация") Тогда 
		ПервыйЭлемент = Истина;
		Для Каждого ОснованиеД Из ТаблицаЗадолженностей Цикл 
			Для Каждого СтрокаТЧ Из ОснованиеД.ДокументЗадолженности.Запасы Цикл						
				Если Не ПервыйЭлемент Тогда
					Описание = Описание + ", "	
				КонецЕсли;		
				НаименованиеНоменкалтуры = ПолучитьЗначенияРеквизитовПоСсылке(СтрокаТЧ.Номенклатура, "Наименование");
				Описание = НаименованиеНоменкалтуры + " x" + СтрокаТЧ.Количество;			
				ПервыйЭлемент = Ложь;			
			КонецЦикла;
		КонецЦикла;
	КонецЕсли; 
	
	Если ФискализацияВСбербанке = Истина Тогда 
		
		ЭтоЧастичнаяОплата = Ложь;
		orderBundle = Сбербанк_СформироватьМассивЭлементовДляФискализации(ТаблицаЗадолженностей, СтруктураПараметров, ЭтоЧастичнаяОплата);
		
		Если ЭтоЧастичнаяОплата = Истина Тогда 
			СтруктураВозврата.ОписаниеОшибки = "При фискализации на стороне сбербанка запрещены частичные оплаты.";
			Возврат СтруктураВозврата;
		КонецЕсли;	
		
	КонецЕсли;
	
	// https://securepayments.sberbank.ru/wiki/doku.php/integration:api:rest:requests:register
	НомерЗаказаВШлюзе = СформироватьНомерЗаказаСБП();
	
	ПараметрыЗапроса = "language=ru&orderNumber={OrderNumber}&returnUrl={URL}&amount={Amount}&password={Password}&userName={Login}&pageView=DESKTOP&description={Description}&sessionTimeoutSecs={SessionTimeoutSecs}&jsonParams={jsonParams}";
	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{OrderNumber}"       , НомерЗаказаВШлюзе);	
	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{Amount}"            , Сумма);               
	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{URL}"               , URlRedirect);
	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{Login}"             , Логин);
	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{Password}"          , КодироватьСтроку(Пароль, СпособКодированияСтроки.КодировкаURL)); 
	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{Description}"       , СформироватьОписаниеЗаказа(Описание));
	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{SessionTimeoutSecs}", Формат(ВремяЖизниВСекундах, "ЧГ="));
	
	ПараметрыJson = Новый Структура("ClubID, phone, orderPhone, orderEmail, UserID, GoogleClientID, YandexClientID, ClubName");
	ClubName = СокрЛП(СтруктурнаяЕдиница);
	ClubName = СтрЗаменить(ClubName, """", "");
	ПараметрыJson.orderPhone = КодироватьСтроку(НомерТелефона, СпособКодированияСтроки.КодировкаURL);
	ПараметрыJson.phone 	 = КодироватьСтроку(НомерТелефона, СпособКодированияСтроки.КодировкаURL);
	ПараметрыJson.orderEmail = КодироватьСтроку(EmailКлиента  , СпособКодированияСтроки.КодировкаURL);
	ПараметрыJson.UserID     = КодироватьСтроку(Клиент.УникальныйИдентификатор(), СпособКодированияСтроки.КодировкаURL);
	ПараметрыJson.ClubID     = КодироватьСтроку(СтруктурнаяЕдиница.УникальныйИдентификатор(), СпособКодированияСтроки.КодировкаURL);
	ПараметрыJson.ClubName   = КодироватьСтроку(ClubName, СпособКодированияСтроки.КодировкаURL);
	
	Если ЗначениеЗаполнено(EmailКлиента) Тогда
		ПараметрыJson.Вставить("email", КодироватьСтроку(EmailКлиента, СпособКодированияСтроки.КодировкаURL));
	КонецЕсли;
	
	ПараметрыЗаявки = ПолучитьПараметрыЗаявкиДляРегистрацииЗаказа(Клиент);
	
	ПараметрыJson.GoogleClientID = КодироватьСтроку(ПараметрыЗаявки.ga_cid, СпособКодированияСтроки.КодировкаURL); 
	ПараметрыJson.YandexClientID = КодироватьСтроку(ПараметрыЗаявки.ym_cid, СпособКодированияСтроки.КодировкаURL);
	
	ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{jsonParams}", КодироватьВJSON(ПараметрыJson, Ложь));
	
	Если ФискализацияВСбербанке = Истина И ЗначениеЗаполнено(orderBundle) Тогда
		ПараметрыЗапроса = ПараметрыЗапроса + orderBundle;	
	КонецЕсли;
	
	Попытка
		ОтветОтСервера  = ВыполнитьGETЗапроскСбербанку(ПараметрыЗапроса, ПараметрыПШ.ТестовыйРежим);
	Исключение
		ОтветОтСервера = Неопределено;
	КонецПопытки;
	
	Если ОтветОтСервера = Неопределено Тогда
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при обращении к серверу";	
	ИначеЕсли ОтветОтСервера.Свойство("errorCode")  Тогда
		СтруктураВозврата.ОписаниеОшибки = ОтветОтСервера.errorMessage;
	Иначе		
		
		КороткаяСсылкаНаОплату = ПолучитьКороткуюСсылку(ОтветОтСервера.formUrl);
		Если ЗначениеЗаполнено(КороткаяСсылкаНаОплату) Тогда
			СтруктураВозврата.ВыполненоУспешно = Истина;
		КонецЕсли;
		СтруктураВозврата.Вставить("СсылкаНаОплату", КороткаяСсылкаНаОплату);
		СтруктураВозврата.Вставить("НомерЗаказа"   , НомерЗаказа);

		Для Каждого СтрокаТ Из ТаблицаЗадолженностей Цикл
			
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
			СтрокаТ.ДокументЗадолженности, 
			СтрокаТ.Задолженность, 
			ОтветОтСервера.orderId, 
			КороткаяСсылкаНаОплату, 
			Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено, 
			СтруктураПараметров.ЭквайринговыйТерминал, 
			НомерЗаказа,
			ПараметрыЗапроса,
			Не ЗначениеЗаполнено(СтрокаТ.ДокументЗадолженности),
			СтруктураПараметров.Контрагент,,
			СтруктураПараметров.СтруктурнаяЕдиница,
			ДатаЗаказа,
			"Заказ зарегистрирован, но не оплачен",
			Перечисления.ТипыСсылокНаОплату.Сбербанк,,
			ТекущаяДатаСеанса() + ВремяЖизниВСекундах);
			
		КонецЦикла;
			
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Сбербанк отменить ссылку на оплату
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_ОтменитьСсылку(СтруктураПараметров) 
	
	ДокументыЗадолженности = Новый Массив;
	Если СтруктураПараметров.Свойство("ТаблицаЗадолженностей") Тогда
		Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл
			ДокументыЗадолженности.Добавить(СтрокаТ.ДокументЗадолженности);	
		КонецЦикла; 
	ИначеЕсли СтруктураПараметров.Свойство("ДокументыЗадолженности") Тогда
		ДокументыЗадолженности = СтруктураПараметров.ДокументыЗадолженности 	
	КонецЕсли;
	
	РезультатОперации			= СтруктураПараметров.СтруктураВозврата;
	ПараметрыПШ  				= СтруктураПараметров.ПараметрыПШ;
	НомерЗаказа					= ?(СтруктураПараметров.Свойство("НомерЗаказа"), СтруктураПараметров.НомерЗаказа, Неопределено);

	ТаблицаЗаказов = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьЗаказыПоДокументам(ДокументыЗадолженности, СтруктураПараметров.ЭквайринговыйТерминал, НомерЗаказа);
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		РезультатОперации.ОписаниеОшибки = "Не найдено неоплаченных заказов по данной ссылке";
		Возврат РезультатОперации;	
	КонецЕсли;
	
	МассивИдЗаказов = Новый Массив;
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		
		Если МассивИдЗаказов.Найти(СтрокаЗаказа.ИдЗаказа) = Неопределено Тогда
			
			ПараметрыПШ = СтруктураПараметров.ЭквайринговыйТерминал.ПараметрыПлатежногоШлюза.Получить();
			Если ТипЗнч(ПараметрыПШ) <> Тип("Структура") Тогда
				
				РезультатОперации = Новый Структура;
				РезультатОперации.Вставить("ВыполненоУспешно" , Ложь);
				РезультатОперации.Вставить("ОписаниеОшибки" , "Не заполнены параметры эквайрингового терминала.");
				Возврат РезультатОперации;   
				
			КонецЕсли;	
			
			ПараметрыЗапроса = "userName={Login}&password={Password}&language=ru&orderNumber={OrderNumber}";
			ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{OrderNumber}"       , СтрокаЗаказа.ИдЗаказа);	
			ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{Login}"             , ПараметрыПШ.ЛогинБанка);
			ПараметрыЗапроса = СтрЗаменить(ПараметрыЗапроса, "{Password}"          , КодироватьСтроку(ПараметрыПШ.ПарольБанка, СпособКодированияСтроки.КодировкаURL)); 
			
			Попытка
				ОтветОтСервера  = ВыполнитьPOSTЗапроскСбербанку(ПараметрыЗапроса, ПараметрыПШ.ТестовыйРежим, "/payment/rest/decline.do?");
			Исключение
				ОтветОтСервера = Неопределено;
			КонецПопытки;
			
			РезультатОперации = СтруктураСтандартныхПараметровРезОперации();
			Если ОтветОтСервера = Неопределено Тогда
				РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
				РезультатОперации.Вставить("ОписаниеОшибки", "Ошибка при обращении к серверу");
			ИначеЕсли ОтветОтСервера.Свойство("errorCode")  Тогда
				
				РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
				
				Если СтрНайти(ОтветОтСервера.errorMessage, "Пользователь не имеет разрешения на отклонение заказов") > 0 Тогда
					РезультатОперации.Вставить("ОписаниеОшибки", ОтветОтСервера.errorMessage + ". Пожалуйста, обратитесь в банк");	
				Иначе
					РезультатОперации.Вставить("ОписаниеОшибки", ОтветОтСервера.errorMessage);	
				КонецЕсли;
				
			Иначе		
				РезультатОперации.Вставить("ВыполненоУспешно", Истина);
			КонецЕсли;
			
			Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
				Возврат РезультатОперации;	
			КонецЕсли;
			
			МассивИдЗаказов.Добавить(СтрокаЗаказа.ИдЗаказа);
			
		КонецЕсли;
		
		ОписаниеСтатуса  = НСтр("ru='Платеж отменен';en='Payment canceled'");
		
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
			СтрокаЗаказа.Основание,,,,
			Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ,,
			СтрокаЗаказа.НомерЗаказа,,,,,,,
			ОписаниеСтатуса);
		
	КонецЦикла;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Альфа банк получить статус платежа по QR
//
// Параметры:
//  ИдСБП				 - 	 - 
//  ПараметрыПШ			 - 	 - 
//  ИдентификаторQRКода	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_ПолучитьСтатусПлатежаРасширенный(СтруктураПараметров, ПараметрыПШ, ТелоОтвета = Неопределено) Экспорт 
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("orderId"	   , СтруктураПараметров.ИдСБП);
	ПараметрыЗапроса.Вставить("orderNumber", СтруктураПараметров.НомерЗаказа);	
	ПараметрыЗапроса.Вставить("userName"   , ПараметрыПШ.ЛогинБанка);
	ПараметрыЗапроса.Вставить("password"   , КодироватьСтроку(ПараметрыПШ.ПарольБанка, СпособКодированияСтроки.КодировкаURL));
	
	ПараметрыЗапросаСтрокой = "";
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ПараметрыЗапросаСтрокой = ПараметрыЗапросаСтрокой + ?(Не ЗначениеЗаполнено(ПараметрыЗапросаСтрокой), "?", "&") + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение;			
	КонецЦикла;	
	
	АдресСервера = ?(ПараметрыПШ.ТестовыйРежим, "3dsec.sberbank.ru", "securepayments.sberbank.ru");
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,3, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/payment/rest/getOrderStatusExtended.do" + ПараметрыЗапросаСтрокой);								
	
    Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Свойство("orderStatus") И РезультатЗапроса.Свойство("errorCode") И РезультатЗапроса.errorCode = "0";
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь И РезультатЗапроса.Свойство("errorMessage"), РезультатЗапроса.errorMessage, ТелоОтвета);
		РезультатОперации.ТелоЗапроса			= ТелоОтвета;		
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации; 
		
КонецФункции

// Функция, возвращает параметры заявки для регистрации заказа в разрезе контрагента.
//
Функция ПолучитьПараметрыЗаявкиДляРегистрацииЗаказа(Клиент)
	
	ПараметрыЗаявки = Новый Структура("ga_cid, ym_cid", "", "");
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Заявки.ga_cid КАК ga_cid,
	|	Заявки.ym_cid КАК ym_cid
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.ga_cid <> """"
	|	И Заявки.ym_cid <> """"
	|	И Заявки.ОсновнойКлиент = &ОсновнойКлиент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заявки.ДатаСоздания УБЫВ");
	
	Запрос.УстановитьПараметр("ОсновнойКлиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаявки, Выборка);		
	КонецЕсли;
	
	Возврат ПараметрыЗаявки;
	
КонецФункции

// Функция - Выполнить GETЗапроск сбербанку
//
// Параметры:
//  Параметры		 - 	 - 
//  ТестовыйРежим	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьGETЗапроскСбербанку(Параметры = "", ТестовыйРежим = Ложь)
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();  
	
	HTTPСоединение = Новый HTTPСоединение(?(ТестовыйРежим, "3dsec.sberbank.ru", "securepayments.sberbank.ru"),,,,,5, ЗащищенноеСоединение); 
	HTTPЗапрос     = Новый HTTPЗапрос("/payment/rest/register.do?" + Параметры);  // https://securepayments.sberbank.ru/wiki/doku.php/integration:api:rest:requests:register_cart

	Запрос = HTTPСоединение.Получить(HTTPЗапрос);
	ТекстJSON  = Запрос.ПолучитьТелоКакСтроку(); 
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	Возврат ПараметрыJSON;

КонецФункции

// Функция, выполняет POST запрос к сбербанку.
//
Функция ВыполнитьPOSTЗапроскСбербанку(Параметры = "", ТестовыйРежим = Ложь, Метод)
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();  
	
	HTTPСоединение = Новый HTTPСоединение(?(ТестовыйРежим, "3dsec.sberbank.ru", "securepayments.sberbank.ru"),,,,,10, ЗащищенноеСоединение); 
	HTTPЗапрос     = Новый HTTPЗапрос(Метод + Параметры);

	Запрос = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	ТекстJSON  = Запрос.ПолучитьТелоКакСтроку(); 
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	Возврат ПараметрыJSON;

КонецФункции

// Функция - Получить строку из структуры
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтрокуИзСтруктуры(СтруктураПараметров)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);		
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);	
	ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);     	
	
	мОтвет = ЗаписьJSON.Закрыть(); 
	Возврат мОтвет;
	
КонецФункции

// Функция,выыполняет POST запрос к сбербанку.
//
Функция ВыполнитьPostЗапросКPaymo(Параметры)
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();  
	
	HTTPСоединение = Новый HTTPСоединение("paymo.ru",,,,,5, ЗащищенноеСоединение); 
	HTTPЗапрос     = Новый HTTPЗапрос("/rest/merchant/invoice/");

	HTTPЗапрос.УстановитьТелоИзСтроки(Параметры);
	
	Запрос = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ТекстJSON  = Запрос.ПолучитьТелоКакСтроку(); 
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	Возврат ПараметрыJSON;
	
КонецФункции

// Функция - Сформировать массив элементов для фискализации сбербанк
//
// Параметры:
//  ТаблицаЗадолженностей	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_СформироватьМассивЭлементовДляФискализации(ТаблицаЗадолженностей, СтруктураПараметров, ЭтоЧастичнаяОплата = Ложь) Экспорт
   	
	Если ЗначениеЗаполнено(ТаблицаЗадолженностей) И ТипЗнч(ТаблицаЗадолженностей[0].ДокументЗадолженности) = Тип("ДокументСсылка.Реализация") Тогда 
		
		ТаблицаЧека 				= ПолучитьТаблицуЗапасовРеализаций(ТаблицаЗадолженностей);
		
		items 	   = Новый Массив;
		positionId = 1;   // Индекс товара к корзине
		
		СуммаПоТаблицеЗапасов = 0;
		Для Каждого ДокументПродажи Из ТаблицаЗадолженностей Цикл
			
			СуммаОплаты = ДокументПродажи.Задолженность;
			
			МассивЗапасов = Документы.Реализация.ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ(ДокументПродажи.ДокументЗадолженности, СтруктураПараметров.КассаОплаты, СуммаОплаты, ДокументПродажи.Оплачено = 0,, Истина);
			НовыйМассивЗапасов = ФорматоЛогическийКонтрольРаздленияСтрок(МассивЗапасов);
			
			Для Каждого СтрокаТЧ Из НовыйМассивЗапасов Цикл
								
				НайденнаяСтрока = ТаблицаЧека.Найти(СтрокаТЧ.Номенклатура, "Номенклатура");
				
				СтрокаТЧ.Вставить("ВидУслуги"			, ?(НайденнаяСтрока <> Неопределено, НайденнаяСтрока.ВидУслуги, Неопределено));
				СтрокаТЧ.Вставить("ТипНоменклатуры"		, ?(НайденнаяСтрока <> Неопределено, НайденнаяСтрока.ТипНоменклатуры, Неопределено));
				СтрокаТЧ.Вставить("СписыватьПриПродаже"	, ?(НайденнаяСтрока <> Неопределено, НайденнаяСтрока.СписыватьПриПродаже, Неопределено));
					
				ПризнакСпособаРасчета	= Сбербанк_ПризнакСпособаРасчетаПриПродажеИлиВозвратеУслугиТовара(СтрокаТЧ);
				ПризнакПредметаРасчета	= Сбербанк_ПризнакПредметаРасчетаПриПродажеИлиВозврате(СтрокаТЧ);
				
				// Количество
				quantity = Новый Структура;
				quantity.Вставить("value"  , СтрокаТЧ.Количество);
				quantity.Вставить("measure", "шт.");
				
				// Ставка НДС
				tax = Новый Структура;
				//tax.Вставить("taxType", api_ОбщегоНазначения.ПолучитьПредставлениеСтавкиНДС_v3(СтрокаТЧ.СтавкаНДС, СтрокаТЧ.СуммаВключаетНДС));
                tax.Вставить("taxSum" , СтрокаТЧ.СуммаНДС);
				
				// Признак способа расчета 
				paymentMethod = Новый Структура;
				paymentMethod.Вставить("name", "paymentMethod");
				paymentMethod.Вставить("value", ПризнакСпособаРасчета); 
				
				// Признак предмета расчета
				paymentObject = Новый Структура;
				paymentObject.Вставить("name", "paymentObject");
				paymentObject.Вставить("value", ПризнакПредметаРасчета); 
				
				attributes = Новый Массив;
				attributes.Добавить(paymentMethod);
				attributes.Добавить(paymentObject);
				
				itemAttributes = Новый Структура;
				itemAttributes.Вставить("attributes", attributes);
				
				СтруктураТовара = Новый Структура;
				СтруктураТовара.Вставить("positionId"	 , positionId); 
				СтруктураТовара.Вставить("name"			 , СформироватьОписаниеЗаказа(СтрокаТЧ.Наименование));
				СтруктураТовара.Вставить("quantity"		 , quantity); 
				СтруктураТовара.Вставить("itemCode"		 , Строка(СтрокаТЧ.Номенклатура.УникальныйИдентификатор()));
				СтруктураТовара.Вставить("tax"			 , tax);
				СтруктураТовара.Вставить("itemPrice"	 , СтрокаТЧ.ЦенаСоСкидками*100); 
				СтруктураТовара.Вставить("itemAmount"	 , СтрокаТЧ.Сумма*100);	
				СтруктураТовара.Вставить("itemAttributes", itemAttributes); 
				
				СуммаПоТаблицеЗапасов = СуммаПоТаблицеЗапасов + СтрокаТЧ.Сумма;
				
				items.Добавить(СтруктураТовара);
				
				positionId = positionId + 1;
				
			КонецЦикла;
		КонецЦикла;
				
		cartItems = Новый Структура;
		cartItems.Вставить("items", items);
		
		orderBundle = Новый Структура;
		orderBundle.Вставить("cartItems", cartItems);
		
		Payments = СформироватьВидыОплат(ТаблицаЗадолженностей, СуммаПоТаблицеЗапасов);		
		ЭтоЧастичнаяОплата = Payments.Credit > 0;
		
		ПараметрыOrderBundle = КодироватьВJSON(orderBundle, Ложь);
		
		ПараметрыЗапроса = "&orderBundle=" + ПараметрыOrderBundle;
		
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

// Функция - Получить признак способа расчета для Сбербанка.
//
// Параметры:
//  СтрокаТЧ					 - 	 - 
//  АвансоваяСхемаПробитияУслуг	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
// 1 - полная предварительная оплата до момента передачи предмета расчёта;
// 2 - частичная предварительная оплата до момента передачи предмета расчёта;
// 3 - аванс;
// 4 - полная оплата в момент передачи предмета расчёта;
// 5 - частичная оплата предмета расчёта в момент его передачи с последующей оплатой в кредит;
// 6 - передача предмета расчёта без его оплаты в момент его передачи с последующей оплатой в кредит;
// 7 - оплата предмета расчёта после его передачи с оплатой в кредит.
//
Функция Сбербанк_ПризнакСпособаРасчетаПриПродажеИлиВозвратеУслугиТовара(СтрокаТЧ)  
	
	PaymentMethod = ПризнакСпособаРасчетаПриПродажеИлиВозвратеУслугиТовара(СтрокаТЧ); 
	
	Если PaymentMethod = "advance" Тогда        	 // Аванс
		Возврат 3;
	ИначеЕсли PaymentMethod = "credit_payment" Тогда // Кредит 
		Возврат 7;
	ИначеЕсли PaymentMethod = "full_payment" Тогда   // ВыплатаПлатеж
		Возврат 4;
	ИначеЕсли PaymentMethod = "partial_payment" Тогда
		Возврат 2; 
	ИначеЕсли PaymentMethod = "full_prepayment" Тогда
		Возврат 1;
	КонецЕсли;
	
КонецФункции

// Функция - Получить признак предмета расчета для Сбербанка.
//
// Параметры:
//  СтрокаТЧ					 - 	 - 
//  АвансоваяСхемаПробитияУслуг	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
// 1 - товар;
// 2 - подакцизный товар;
// 3 - работа;
// 4 - услуга;
// 5 - ставка азартной игры;
// 6 - выигрыш азартной игры;
// 7 - лотерейный билет;
// 8 - выигрыш лотереи;
// 9 - предоставление РИД;
// 10 - платеж;
// 11 - агентское вознаграждение;
// 12 - составной предмет расчёта;
// 13 - иной предмет расчёта;
// 14 - имущественное право;
// 15 - внереализационный доход;
// 16 - страховые взносы: о суммах расходов, уменьшающих сумму налога (авансовых платежей) в соответствии с пунктом 3.1 статьи 346.21 Налогового кодекса Российской Федерации;
// 17 - торговый сбор: о суммах уплаченного торгового сбора;
// 18 - курортный сбор.
//
Функция Сбербанк_ПризнакПредметаРасчетаПриПродажеИлиВозврате(СтрокаТЧ) Экспорт 
	
	PaymentObject = ПризнакПредметаРасчетаПриПродажеИлиВозврате(СтрокаТЧ); 
	
	Если PaymentObject = "service" Тогда        // Услуга
		Возврат 4;
	ИначеЕсли PaymentObject = "commodity" Тогда // Товар 
		Возврат 1;
	ИначеЕсли PaymentObject = "payment" Тогда   // ВыплатаПлатеж
		Возврат 10;
	Иначе
		Возврат 1;								
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СДМ

// Функция - СДМ зарегистрировать QR
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СДМ_ЗарегистрироватьQR(СтруктураПараметров)
	
	ПараметрыПШ	= СтруктураПараметров.ПараметрыПШ;
	НомерЗаказа = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьМассимальныйНомерЗаказа(Перечисления.ТипыСсылокНаОплату.СБПСДМ) + 1;
	НомерЗаказа = ?(НомерЗаказа = 1, 1000000, НомерЗаказа); // Номер заказа начинается от 7ми цифр
	
	НомерИтерации = 0;
	Пока НомерИтерации < 20 Цикл // На случай, если данный номер заказа уже создан каким-то чудом в СДМ банке.
		
		РезультатЗапроса = СДМ_СозданиеЗаказа(СтруктураПараметров, НомерЗаказа);
				
		Если РезультатЗапроса.ВыполненоУспешно = Ложь И РезультатЗапроса.ПараметрыРезультата <> Неопределено 
			И РезультатЗапроса.ПараметрыРезультата.Свойство("errorCode") И НРег(РезультатЗапроса.ПараметрыРезультата.errorCode) = НРег("P003") Тогда
			НомерЗаказа = НомерЗаказа + 1;		
		Иначе
			Прервать;	
		КонецЕсли;
		
		НомерИтерации = НомерИтерации + 1;
		
	КонецЦикла;
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл	
			
			КороткаяСсылка 	= РезультатЗапроса.ПараметрыРезультата.paymentUrl; //ОбщегоНазначения.ПолучитьКороткуюСсылку(РезультатЗапроса.ПараметрыРезультата.Data);
			
			РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
			СтрокаТ.ДокументЗадолженности,
			СтрокаТ.Задолженность,
			Формат(РезультатЗапроса.ПараметрыРезультата.PaymentId,"ЧГ=0"),
			КороткаяСсылка,
			Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено,
			СтруктураПараметров.ЭквайринговыйТерминал,
			НомерЗаказа,,,
			СтруктураПараметров.Контрагент,,
			СтруктураПараметров.СтруктурнаяЕдиница,
			ТекущаяДатаСеанса(),,
			Перечисления.ТипыСсылокНаОплату.СБПСДМ,
			ПараметрыСеанса.ТекущийПользователь,
			ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600
			);
			
		КонецЦикла;
		
		РезультатЗапроса.Вставить("СсылкаНаОплату"		, КороткаяСсылка);
		РезультатЗапроса.Вставить("ВремяДействителенДо"	, ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600);
		РезультатЗапроса.Вставить("НомерЗаказа"			, НомерЗаказа);
		
	КонецЕсли;
	
	Возврат РезультатЗапроса;	
	
КонецФункции

// Функция - СДМ создание заказа
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СДМ_СозданиеЗаказа(СтруктураПараметров, НомерЗаказа)
	
	ПараметрыПШ 	= СтруктураПараметров.ПараметрыПШ;
	СуммаОплаты 	= СтруктураПараметров.СуммаОплаты;
	ВнешняяСистема	= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.СистемаБыстрыхПлатежей, Истина);
	
	ЗаголовкиHTTP = Новый Соответствие;		
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
		
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты 	 = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ecommKey"		, Число(ПараметрыПШ.КлючМерчанта));
	ПараметрыЗапроса.Вставить("amount"			, СуммаОплаты); 
	ПараметрыЗапроса.Вставить("orderId"			, НомерЗаказа);
	ПараметрыЗапроса.Вставить("description"		, "Оплата по структурной единице: " + Строка(СтруктураПараметров.СтруктурнаяЕдиница));
	ПараметрыЗапроса.Вставить("dueDate"			, ТекущаяДатаСеанса() + ПараметрыПШ.ВремяЖизни*3600); // Максимальный срок - 30 дней. Значение по умолчанию - 1 день.	
	ПараметрыЗапроса.Вставить("paymentType"		, "SBP"); 
	ПараметрыЗапроса.Вставить("notificationUrl"	, "https://cloud.stoma1c.ru/api/hs/api/sbp/" + ВнешняяСистема.КлючПриложения);
	
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктураПараметров.ЭквайринговыйТерминал, "ТипФискализации") = Перечисления.ТипыФискализации.ВСДМБанке Тогда
		
		ЭтоЧастичнаяОплата = Ложь;
		ПараметрыReceipt = СтруктураTinkoffReceipt(СтруктураПараметров, Истина, ЭтоЧастичнаяОплата);	
		
		Если ЭтоЧастичнаяОплата = Истина Тогда
			РезультатОперации = СтруктураСтандартныхПараметровРезОперации();
			РезультатОперации.ОписаниеОшибки = "При фискализации на стороне СДМ банка запрещены частичные оплаты.";
			Возврат РезультатОперации;			
		Иначе 
			ПараметрыЗапроса.Вставить("receipt", ПараметрыReceipt);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("token", Тинькофф_СформироватьПодписьЗапроса(ПараметрыЗапроса, ПараметрыПШ.ПарольКлючаМерчанта));
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса,, НастройкиСериализацииJSON);
		
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "payment-test.sdm.ru", "payment.sdm.ru");
	Соединение		= Новый HTTPСоединение(АдресСервера,,,,,5, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос		= Новый HTTPЗапрос("/init/", ЗаголовкиHTTP);			
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И РезультатЗапроса.Success И НРег(РезультатЗапроса.Status) = НРег("NEW");
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
			РезультатЗапроса.message, ТелоОтвета);
			
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - СДМ отменить QRКод
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СДМ_ОтменитьQRКод(СтруктураПараметров)
	
	ДокументыЗадолженности = Новый Массив;
	Для Каждого СтрокаТ Из СтруктураПараметров.ТаблицаЗадолженностей Цикл
		ДокументыЗадолженности.Добавить(СтрокаТ.ДокументЗадолженности);	
	КонецЦикла;
	
	РезультатОперации			= СтруктураПараметров.СтруктураВозврата;
	ПараметрыПШ  				= СтруктураПараметров.ПараметрыПШ;
	НомерЗаказа					= ?(СтруктураПараметров.Свойство("НомерЗаказа"), СтруктураПараметров.НомерЗаказа, Неопределено);
	
	ТаблицаЗаказов = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьЗаказыПоДокументам(ДокументыЗадолженности, СтруктураПараметров.ЭквайринговыйТерминал, НомерЗаказа);
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		РезультатОперации.ОписаниеОшибки = "Не найдено неоплаченных заказов по данной ссылке";
		Возврат РезультатОперации;	
	КонецЕсли;
	
	МассивИдСБП = Новый Массив;
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		
		Если МассивИдСБП.Найти(СтрокаЗаказа.ИдЗаказа) = Неопределено Тогда
									
			РезультатОперации = СДМ_ОтменитьQRКодЗапрос(СтрокаЗаказа.ИдЗаказа, ПараметрыПШ);
			
			Если РезультатОперации.ВыполненоУспешно = Ложь Тогда
				Возврат РезультатОперации;	
			КонецЕсли;
			
			МассивИдСБП.Добавить(СтрокаЗаказа.ИдЗаказа);
			
		КонецЕсли;
		
		ОписаниеСтатуса  = НСтр("ru='Платеж отменен пользователем ';en='Payment canceled by user '") + Строка(ПараметрыСеанса.ТекущийПользователь);
		
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
		СтрокаЗаказа.Основание,,,,
		Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ,,
		СтрокаЗаказа.НомерЗаказа,,,,,,,
		ОписаниеСтатуса);
				
	КонецЦикла;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - СДМ отменить QRКод запрос
//
// Параметры:
//  ИдСБП		 - 	 - 
//  ПараметрыПШ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СДМ_ОтменитьQRКодЗапрос(ИдСБП, ПараметрыПШ, ТелоОтвета = Неопределено)
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ecommKey"	, ПараметрыПШ.КлючМерчанта);
	ПараметрыЗапроса.Вставить("paymentId"	, Число(ИдСБП));
	
	ОбязательностьПодписиЗапросаТинькофф = Истина;	
	Если ОбязательностьПодписиЗапросаТинькофф Тогда
		ПараметрыЗапроса.Вставить("token", Тинькофф_СформироватьПодписьЗапроса(ПараметрыЗапроса, ПараметрыПШ.ПарольКлючаМерчанта));	
	КонецЕсли;	
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);
	
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "payment-test.sdm.ru", "payment.sdm.ru");
	Соединение		= Новый HTTPСоединение(АдресСервера,,,,,10, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос		= Новый HTTPЗапрос("/cancel", ЗаголовкиHTTP);					
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);			
								
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И (РезультатЗапроса.Success ИЛИ НРег(РезультатЗапроса.status) = НРег("REJECTED"));
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
			РезультатЗапроса.message, ТелоОтвета);
			
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - СДМ статус заказа запрос
//
// Параметры:
//  ИдСБП		 - 	 - 
//  ПараметрыПШ	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СДМ_ПолучитьСтатусПлатежа(ИдСБП, ПараметрыПШ, ТелоОтвета = Неопределено) Экспорт
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ecommKey"	, ПараметрыПШ.КлючМерчанта);
	ПараметрыЗапроса.Вставить("paymentId"	, Число(ИдСБП));
	
	ОбязательностьПодписиЗапросаТинькофф = Истина;	
	Если ОбязательностьПодписиЗапросаТинькофф Тогда
		ПараметрыЗапроса.Вставить("token", Тинькофф_СформироватьПодписьЗапроса(ПараметрыЗапроса, ПараметрыПШ.ПарольКлючаМерчанта));	
	КонецЕсли;	
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);
	
	АдресСервера 	= ?(ПараметрыПШ.ТестовыйРежим, "payment-test.sdm.ru", "payment.sdm.ru");
	Соединение		= Новый HTTPСоединение(АдресСервера,,,,,3, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос		= Новый HTTPЗапрос("/status", ЗаголовкиHTTP);					
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);			
								
	Попытка
		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ТелоОтвета	 = HTTPОтвет.ПолучитьТелоКакСтроку();	
		КодСостояния = HTTPОтвет.КодСостояния;
		
		Если КодСостояния = 200 ИЛИ СтрНачинаетсяС(ТелоОтвета, "{") Тогда 
			РезультатЗапроса = ДекодироватьИзJSON(ТелоОтвета);
		Иначе
			РезультатЗапроса = ТелоОтвета;
		КонецЕсли;
		
		РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
		РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И (РезультатЗапроса.Success ИЛИ НРег(РезультатЗапроса.status) = НРег("REJECTED"));
		РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
		РезультатОперации.КодОшибки       		= КодСостояния;
		РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатОперации.ВыполненоУспешно = Ложь, 
			РезультатЗапроса.message, ТелоОтвета);
			
	Исключение		
		РезультатОперации = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), HTTPОтвет);	
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

// Функция - Сформировать номер заказа
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьНомерЗаказаСБП()
	
	ГСЧ				= Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	СлучайнаяСтрока = "";
	
	Для Сч = 1 по 20 Цикл        
		
		Набор = ГСЧ.СлучайноеЧисло(1,3);    
		Если Набор = 1 Тогда
			СлучайныйСимвол = ГСЧ.СлучайноеЧисло(0,9);    
		ИначеЕсли Набор = 2 Тогда
			СлучайныйСимвол = Символ(ГСЧ.СлучайноеЧисло(65,90));
		ИначеЕсли Набор = 3 Тогда
			СлучайныйСимвол = Символ(ГСЧ.СлучайноеЧисло(97,122));
		КонецЕсли;
		СлучайнаяСтрока = СлучайнаяСтрока + СлучайныйСимвол;
		
	КонецЦикла;
	
	Возврат НРег(СлучайнаяСтрока);
	
КонецФункции

// Функция - Обработать стандартный результат HTTPЗапроса
//
// Параметры:
//  РезультатЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса, КодСостояния)
	
	РезультатОперации                     	= СтруктураСтандартныхПараметровРезОперации();		
	РезультатОперации.ВыполненоУспешно		= КодСостояния = 200 И ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатЗапроса.Свойство("code") И НРег(РезультатЗапроса.code) = НРег("SUCCESS");
	РезультатОперации.ПараметрыРезультата	= РезультатЗапроса;	
	РезультатОперации.КодОшибки       		= КодСостояния;
	РезультатОперации.ОписаниеОшибки 		= ?(ТипЗнч(РезультатЗапроса) = Тип("Структура") И РезультатЗапроса.Свойство("message"), РезультатЗапроса.message, РезультатЗапроса);
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Обработать исключение при выполнении HTTPЗапроса
//
// Параметры:
//  ДанныеИсключения - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработатьИсключениеПриВыполненииHTTPЗапроса(ДанныеИсключения, HTTPОтвет = Неопределено)
	
	РезультатОперации = СтруктураСтандартныхПараметровРезОперации();
	
	Описание = СтрШаблон(
	"Описание: %1
	|ИмяМодуля: %2
	|НомерСтроки: %3
	|ИсходнаяСтрока: %4
	|Причина: %5",
	ДанныеИсключения.Описание,
	ДанныеИсключения.ИмяМодуля,
	ДанныеИсключения.НомерСтроки,
	ДанныеИсключения.ИсходнаяСтрока,
	ДанныеИсключения.Причина);
	
	РезультатОперации.КодОшибки       = ?(HTTPОтвет <> Неопределено, HTTPОтвет.КодСостояния, Неопределено);
	РезультатОперации.ОписаниеОшибки  = ?(HTTPОтвет <> Неопределено, HTTPОтвет.ПолучитьТелоКакСтроку(), "") + Символы.ПС + Описание;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Структура стандартынх параметров рез операции
// 
// Возвращаемое значение:
//   - 
//
Функция СтруктураСтандартныхПараметровРезОперации()	
	Возврат Новый Структура("ВыполненоУспешно, ПараметрыРезультата, КодОшибки, ОписаниеОшибки, ТелоЗапроса", Ложь, Неопределено, Неопределено, Неопределено, Неопределено);	
КонецФункции

// Функция - Структура tinkoff receipt
//
// Параметры:
//  ТаблицаЧека	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СтруктураTinkoffReceipt(СтруктураПараметров, ЭтоСДМБанк = Ложь, ЭтоЧастичнаяОплата = Ложь)
	
	ТаблицаЗадолженностей				= СтруктураПараметров.ТаблицаЗадолженностей;
	Организация							= СтруктураПараметров.Организация;	
	СтруктураОрганизации				= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Организация, "СистемаНалогообложенияДляАвансов, СистемаНалогообложения");
	СистемаНалогообложенияДляАвансов	= СтруктураОрганизации.СистемаНалогообложенияДляАвансов;
	СистемаНалогообложения				= СтруктураОрганизации.СистемаНалогообложения;
	
	// Обязательно должен быть заполнен или Телефон, или ЭлектроннаяПочта.
	Если ЭтоСДМБанк Тогда
		СведенияОЧеке = Новый Структура("email, phone, emailCompany, taxation, items",,,,, Новый Массив);
	Иначе
		СведенияОЧеке = Новый Структура("Email, Phone, Taxation, Items",,,, Новый Массив);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.АдресЭПКонтрагента) Тогда 
		СведенияОЧеке.email = СтруктураПараметров.АдресЭПКонтрагента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.НомерТелефона) Тогда
		СведенияОЧеке.phone = СтруктураПараметров.НомерТелефона;
	КонецЕсли;
	
	Если ЭтоСДМБанк Тогда
		emailCompany = КонтактнаяИнформацияВызовСервераСтома.ПолучитьКонтактнуюИнформацию(СтруктураПараметров.СтруктурнаяЕдиница, Ложь).Email;		
		СведенияОЧеке.emailCompany = emailCompany;
	КонецЕсли;
	
	СуммаКОплате = 0;
	ТаблицаЧека = ПолучитьТаблицуЗапасовРеализаций(СтруктураПараметров.ТаблицаЗадолженностей);			
	Для Каждого ДокументПродажи Из ТаблицаЗадолженностей Цикл
		
		ЭтоВзносНаЛс = ТипЗнч(ДокументПродажи.ДокументЗадолженности) = Тип("СправочникСсылка.ВидыЛицевыхСчетов") ИЛИ ТипЗнч(ДокументПродажи.ДокументЗадолженности) = Тип("ДокументСсылка.НарядЗаказ") ИЛИ ТипЗнч(ДокументПродажи.ДокументЗадолженности) = Тип("ДокументСсылка.ПланЛечения");		
		СуммаОплаты = ДокументПродажи.Задолженность;		
		
		Если ЭтоВзносНаЛс Тогда
			
			Если ЭтоСДМБанк Тогда
				ЭлементДанных = Новый Структура("name, price, quantity, amount, paymentMethod, paymentObject, tax");
			Иначе
				ЭлементДанных = Новый Структура("Name, Price, Quantity, Amount, PaymentMethod, PaymentObject, Tax");
			КонецЕсли;
			
			ЭлементДанных.Name			= "Взнос на лицевой счет";
			ЭлементДанных.Quantity		= 1;
			ЭлементДанных.Amount		= ?(ЭтоСДМБанк, СуммаОплаты, СуммаОплаты*100);
			ЭлементДанных.Price			= ЭлементДанных.Amount;
			ЭлементДанных.Tax			= ПолучитьСтавкуНДС(МенеджерОборудованияВызовСервера.ПолучитьНДСПриВзносеНаЛицевойСчет(Организация));
			ЭлементДанных.PaymentMethod	= "advance";
			ЭлементДанных.PaymentObject	= "payment";
			
			СведенияОЧеке.items.Добавить(ЭлементДанных);	
			
		Иначе
			
			ОплаченоРанее = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьСуммуОплатыПоДокументу(ДокументПродажи.ДокументЗадолженности);		
			МассивЗапасов = Обработки.ПомощникПроведенияОплаты.ПолучитьМассивПараметровТоваровККТ(ДокументПродажи.ДокументЗадолженности, ОплаченоРанее, СуммаОплаты, СтруктураПараметров.КассаОплаты); 
			
			НовыйМассивЗапасов = ФорматоЛогическийКонтрольРаздленияСтрок(МассивЗапасов);
			
			Для Каждого СтрокаТЧ Из НовыйМассивЗапасов Цикл
				
				Если ЭтоСДМБанк Тогда
					ЭлементДанных = Новый Структура("name, price, quantity, amount, paymentMethod, paymentObject, tax");
				Иначе
					ЭлементДанных = Новый Структура("Name, Price, Quantity, Amount, PaymentMethod, PaymentObject, Tax");
				КонецЕсли;
				
				НайденнаяСтрока = ТаблицаЧека.Найти(СтрокаТЧ.Номенклатура, "Номенклатура");
				
				СтрокаТЧ.Вставить("ТипНоменклатуры", ?(НайденнаяСтрока <> Неопределено, НайденнаяСтрока.ТипНоменклатуры, Неопределено));
					
				ЭлементДанных.Name			= СтрокаТЧ.Наименование;;
				ЭлементДанных.Quantity		= СтрокаТЧ.Количество;
				ЭлементДанных.Price			= ?(ЭтоСДМБанк, СтрокаТЧ.ЦенаСоСкидками, СтрокаТЧ.ЦенаСоСкидками*100);
				ЭлементДанных.Amount		= ?(ЭтоСДМБанк, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма*100);
				
				ЭлементДанных.Tax			= ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС, СтрокаТЧ.СуммаВключаетНДС);
				ЭлементДанных.PaymentMethod	= ПризнакСпособаРасчетаПриПродажеИлиВозвратеУслугиТовара(СтрокаТЧ);
				ЭлементДанных.PaymentObject	= ПризнакПредметаРасчетаПриПродажеИлиВозврате(СтрокаТЧ);
				
				СуммаКОплате = СуммаКОплате + СтрокаТЧ.Сумма;
				
				СведенияОЧеке.Items.Добавить(ЭлементДанных);
				
			КонецЦикла;
					
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоВзносНаЛс Тогда
		ВидНалога = ?(ЗначениеЗаполнено(СистемаНалогообложенияДляАвансов), СистемаНалогообложенияДляАвансов, СистемаНалогообложения);
	Иначе
		ВидНалога = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТаблицаЗадолженностей[0].ДокументЗадолженности, "ВидНалога");
	КонецЕсли;
	
	КодСистемыНалогообложения	= МенеджерОборудованияВызовСервера.КодСистемыНалогообложения(Организация, ВидНалога); 		
	СведенияОЧеке.taxation		= ПолучитьТипыСистемНалогообложенияККТ(КодСистемыНалогообложения);	
		
	Если ЭтоВзносНаЛс = Ложь Тогда
		
		Payments			= СформироватьВидыОплат(ТаблицаЗадолженностей, СуммаКОплате);		
		ЭтоЧастичнаяОплата	= Payments.Credit > 0;
		
		Если ЭтоСДМБанк = Ложь Тогда
			СведенияОЧеке.Вставить("Payments", Payments);		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СведенияОЧеке;
	
КонецФункции

// Функция - Формато логический контроль раздления строка
//
// Параметры:
//  МассивТоварныхПозиций	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ФорматоЛогическийКонтрольРаздленияСтрок(МассивТоварныхПозиций)

	НовыеПозицииЧека = Новый Массив;
	
	Для ИндексМассива = 0 По МассивТоварныхПозиций.Количество() - 1 Цикл
		
		ТекущаяПозиция = МассивТоварныхПозиций[ИндексМассива];
		ТекущаяПозиция.Вставить("ЦенаСоСкидками", Неопределено);
		ТекущаяПозиция.Вставить("СуммаСкидок", ТекущаяПозиция.СуммаСкидки);
		ТекущаяПозиция.Вставить("Сумма", ТекущаяПозиция.СтоимостьСоСкидкой);
		
		Наименование = ТекущаяПозиция.Наименование;
		Количество = ?(ТекущаяПозиция.Количество = 0, 1, ТекущаяПозиция.Количество);
		
		Если Количество = 1 Тогда
			НоваяПозиция = ФорматноЛогическийКонтрольКлиентСервер.СкопироватьСтруктуру(ТекущаяПозиция);
			НоваяПозиция.ЦенаСоСкидками = ТекущаяПозиция.СтоимостьСоСкидкой/Количество;
			НовыеПозицииЧека.Добавить(НоваяПозиция);
			Продолжить;
		КонецЕсли;
		
		ДопустимоеРасхождение = 0;
		Сумма = ТекущаяПозиция.СтоимостьСоСкидкой;
		НомерСекции = ТекущаяПозиция.НомерСекции;
		СтавкаНДС = ТекущаяПозиция.СтавкаНДС;
		РасчетнаяЦена = Окр(Сумма / Количество, 2, 1);
		НоваяСумма = Окр(Количество * РасчетнаяЦена, 2, 1);
		РазницаСумм = НоваяСумма - Сумма;
		
		Если РазницаСумм >= -ДопустимоеРасхождение И РазницаСумм <= ДопустимоеРасхождение Тогда
			НоваяПозиция = ФорматноЛогическийКонтрольКлиентСервер.СкопироватьСтруктуру(ТекущаяПозиция);
			НоваяПозиция.ЦенаСоСкидками = РасчетнаяЦена;
			НовыеПозицииЧека.Добавить(НоваяПозиция);
			Продолжить;
		Иначе
			ФорматноЛогическийКонтрольКлиентСервер.РазделитьФискальнуюСтроку(ТекущаяПозиция, НовыеПозицииЧека, РасчетнаяЦена, РазницаСумм);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НовыеПозицииЧека;
	
КонецФункции

// Функция - Получить типы систем налогообложения ККТ
//
// Параметры:
//  КодСистемыНалогообложения	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТипыСистемНалогообложенияККТ(КодСистемыНалогообложения)
	
	//osn — общая
	//usn_income — упрощенная (доходы)
	//usn_income_outcome — упрощенная (доходы минус расходы)
	//patent — патентная
	//envd — единый налог на вмененный доход
	//esn — единый сельскохозяйственный налог
	
	Если КодСистемыНалогообложения = 0 Тогда
		Возврат "osn"; // Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	ИначеЕсли КодСистемыНалогообложения = 1 Тогда
		Возврат "usn_income"; // Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
	ИначеЕсли КодСистемыНалогообложения = 2 Тогда
		Возврат "usn_income_outcome"; // Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;	
	ИначеЕсли КодСистемыНалогообложения = 3 Тогда
		Возврат "envd"; // Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
	ИначеЕсли КодСистемыНалогообложения = 4 Тогда
		Возврат "esn"; // Перечисления.ТипыСистемНалогообложенияККТ.ЕСН;
	ИначеЕсли КодСистемыНалогообложения = 5 Тогда
		Возврат "patent"; // Перечисления.ТипыСистемНалогообложенияККТ.Патент;                           
	Иначе
		Возврат "osn"; // Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	КонецЕсли;
	
КонецФункции

// Функция - Получить таблицу запасов реализаций
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуЗапасовРеализаций(ТаблицаЗадолженностей)
	
	МассивДокументов = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТаблицаЗадолженностей Цикл
		МассивДокументов.Добавить(СтрокаТЗ.ДокументЗадолженности);	
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияЗапасы.Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	|	РеализацияЗапасы.КоличествоУпаковок КАК Количество,
	|	РеализацияЗапасы.Всего КАК Всего,
	|	РеализацияЗапасы.Ссылка КАК Ссылка,
	|	РеализацияЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	РеализацияЗапасы.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	|ГДЕ
	|	РеализацияЗапасы.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Номенклатура.Наименование,
	|	РеализацияУслуги.КоличествоУпаковок,
	|	РеализацияУслуги.Всего,
	|	РеализацияУслуги.Ссылка,
	|	РеализацияУслуги.Номенклатура.ТипНоменклатуры,
	|	РеализацияУслуги.Номенклатура
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЗапасы.Номенклатура.Наименование,
	|	ПриемЗапасы.КоличествоУпаковок,
	|	ПриемЗапасы.Всего,
	|	ПриемЗапасы.Ссылка,
	|	ПриемЗапасы.Номенклатура.ТипНоменклатуры,
	|	ПриемЗапасы.Номенклатура
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЛечение.Номенклатура.Наименование,
	|	ПриемЛечение.КоличествоУпаковок,
	|	ПриемЛечение.Всего,
	|	ПриемЛечение.Ссылка,
	|	ПриемЛечение.Номенклатура.ТипНоменклатуры,
	|	ПриемЛечение.Номенклатура
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемЛечение
	|ГДЕ
	|	ПриемЛечение.Ссылка В(&МассивДокументов)");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить ставку НДС
//
// Параметры:
//  СтавкаНДС		 - 	 - 
//  СуммаВключаетНДС - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтавкуНДС(СтавкаНДС, СуммаВключаетНДС = Истина)
	
	//none — без НДС
	//vat0 — 0%
	//vat10 — 10%
	//vat18 — 18%
	//vat110 — 10/110
	//vat118 — 18/118
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат "none";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Возврат "vat0";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат "vat10";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат "vat18";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат "vat20";
	КонецЕсли;
	
КонецФункции

// Функция - Сбербанк order params type
//
// Параметры:
//  ТаблицаЗадолженностей	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Сбербанк_order_params_type(ТаблицаЗадолженностей)
			
	ТаблицаЧека   = ПолучитьТаблицуЗапасовРеализаций(ТаблицаЗадолженностей);				
	МассивТоваров = Новый Массив;	
	
	Для Каждого ДокументПродажи Из ТаблицаЗадолженностей Цикл
		
		ЭтоВзносНаЛс = ТипЗнч(ДокументПродажи) = Тип("СправочникСсылка.ВидыЛицевыхСчетов") ИЛИ ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.НарядЗаказ") ИЛИ ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ПланЛечения");		
		СуммаОплаты = ДокументПродажи.Задолженность*100;
		
		Если ЭтоВзносНаЛс Тогда
			
			ЭлементДанных = Новый Структура("position_name, position_count, position_sum, position_description");			
			
			ЭлементДанных.position_name			= "Взнос на лицевой счет";
			ЭлементДанных.position_count		= 1;
			ЭлементДанных.position_sum			= СуммаОплаты;
			ЭлементДанных.position_description	= "Взнос на лицевой счет";
			
			МассивТоваров.Добавить(ЭлементДанных);	
			
		Иначе
			
			МассивНайденныхСтрок = ТаблицаЧека.НайтиСтроки(Новый Структура("Ссылка", ДокументПродажи.ДокументЗадолженности));		
			
			Для Каждого СтрокаТЧ Из МассивНайденныхСтрок Цикл
				
				ЭлементДанных						= Новый Структура("position_name, position_count, position_sum");
				ЭлементДанных.position_name			= ОбработатьНаименованиеНоменклатуры(СтрокаТЧ.НаименованиеНоменклатуры);
				ЭлементДанных.position_count		= Окр(СтрокаТЧ.Количество + 0.5, 0, 0);
				Всего								= СтрокаТЧ.Всего*100;
				ЭлементДанных.position_sum			= ?(СуммаОплаты >= Всего, Всего, СуммаОплаты);
				
				СуммаОплаты = СуммаОплаты - ЭлементДанных.position_sum;
				
				МассивТоваров.Добавить(ЭлементДанных);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивТоваров;
	
КонецФункции

// Функция - Обработать наименование номенклатуры
//
// Параметры:
//  Наименование - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработатьНаименованиеНоменклатуры(Наименование)
	
	НовоеНаименование = "";
	ДопустимыеСимволы = "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯabcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	ПервыйСимволПолучен = Ложь;
	Для НомерСимвола = 1 по СтрДлина(Наименование) Цикл
		
		Символ = Сред(Наименование, НомерСимвола, 1);
		
		Если СтрНайти(ДопустимыеСимволы, Символ) = 0 И СтрДлина(НовоеНаименование) = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		НовоеНаименование = НовоеНаименование + Символ;
				
	КонецЦикла;
	
	Возврат НовоеНаименование;
	
КонецФункции

// Функция - Признак предмета расчета при продаже или возврате
//
// Параметры:
//  Номенклатура				 - 	 - 
//  ЭтоОплатаКредита			 - 	 - 
//  АвансоваяСхемаПробитияУслуг	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПризнакПредметаРасчетаПриПродажеИлиВозврате(СтрокаТЧ) Экспорт
	
	ЭтоОплатаКредита = СтрокаТЧ.ЭтоОплатаКредита;
	ТипНоменклатуры = СтрокаТЧ.ТипНоменклатуры;
	
	Если ЭтоОплатаКредита <> Истина
		И (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
		ИЛИ ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор) Тогда
		
		Возврат "service"; // Возврат Перечисления.ПризнакиПредметаРасчета.Услуга;
		
	ИначеЕсли ЭтоОплатаКредита <> Истина
		И (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
		ИЛИ ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал) Тогда
		
		Возврат "commodity"; // Возврат Перечисления.ПризнакиПредметаРасчета.Товар;

	ИначеЕсли ЭтоОплатаКредита = Истина 
		ИЛИ ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
		
	    Возврат "payment"; //Возврат Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;

	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

// Функция - Признак способа расчета при продаже
//
// Параметры:
//  СуммаКОплате	 - 	 - 
//  СуммаПлатежа	 - 	 - 
//  ЭтоОплатаКредита - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПризнакСпособаРасчетаПриПродажеИлиВозвратеУслугиТовара(СтрокаТЧ)
	
	ЭтоОплатаКредита	= СтрокаТЧ.ЭтоОплатаКредита;
	ТипНоменклатуры		= СтрокаТЧ.ТипНоменклатуры;
	СуммаКОплате		= СтрокаТЧ.СтоимостьСоСкидкой;
	СуммаПлатежа		= СтрокаТЧ.СуммаОплачено;
			
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
		
		Возврат "advance"; //Перечисления.ПризнакиСпособаРасчета.Аванс;
		
	ИначеЕсли ЭтоОплатаКредита = Истина Тогда
		
		Возврат "credit_payment"; //Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;	
		
	ИначеЕсли СуммаКОплате <= СуммаПлатежа Тогда
		
		Возврат "full_payment"; //Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		
	ИначеЕсли СуммаПлатежа > 0 И СуммаПлатежа < СуммаКОплате Тогда
		
		Возврат "partial_payment"; // Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой;
				
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции

// Функция - Сформировать виды оплат
//
// Параметры:
//  МассивОплат	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьВидыОплат(ТаблицаЗадолженностей, СуммаКОплате)
	
	СуммаКОплате					= СуммаКОплате*100;
	ОплачиваемаяСумма				= ТаблицаЗадолженностей.Итог("Задолженность")*100;
	ВозвращаемаяСтруктура			= Новый Структура("Cash, Electronic, AdvancePayment, Credit, Provision", 0, ОплачиваемаяСумма, 0, 0, 0);
	ВозвращаемаяСтруктура.Credit	= ?(СуммаКОплате > ОплачиваемаяСумма, СуммаКОплате - ОплачиваемаяСумма, ВозвращаемаяСтруктура.Credit);
	
	Возврат ВозвращаемаяСтруктура;
	
КонецФункции

// Функция - Создать возврат оплаты электронными средствами
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьВозвратОплатыЭлектроннымиСредствами(СтруктураПараметров) Экспорт
	
	ДокументОплаты = Документы.СписаниеДенежныхСредств.СоздатьДокумент();
	
	ДокументОплаты.Дата						= ТекущаяДатаСеанса();
	ДокументОплаты.ТипДенежныхСредств 		= Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта;
	ДокументОплаты.ВидОперации 				= Перечисления.ВидыОпераций.ВозвратОплатыКлиенту;
	ДокументОплаты.Статья					= Справочники.СтатьиДоходовИРасходов.ВозвратОплатыКлиенту;
	ДокументОплаты.Контрагент				= СтруктураПараметров.Контрагент;
	ДокументОплаты.СтруктурнаяЕдиница		= СтруктураПараметров.СтруктурнаяЕдиница;
	ДокументОплаты.Организация				= СтруктураПараметров.СтруктурнаяЕдиница.Организация;
	ДокументОплаты.Касса					= СтруктураПараметров.КассаОплаты;
	ДокументОплаты.ЭквайрингТерминал		= СтруктураПараметров.ЭквайринговыйТерминал;
	ДокументОплаты.НомерВходящегоДокумента	= СтруктураПараметров.УИДВозврата;
	
	НоваяСтрокаТЧ						= ДокументОплаты.РасшифровкаПлатежа.Добавить();	
	НоваяСтрокаТЧ.ДокументОснования		= СтруктураПараметров.ВозвратОтПокупателя;
	НоваяСтрокаТЧ.Статья				= Справочники.СтатьиДоходовИРасходов.ВозвратОплатыКлиенту;		                                                
	НоваяСтрокаТЧ.Сумма					= СтруктураПараметров.СуммаВозвратаВРублях;			
	ДокументОплаты.СуммаДокумента		= ДокументОплаты.РасшифровкаПлатежа.Итог("Сумма");	
	
	Возврат ДокументОплаты;
	
КонецФункции

// Функция - Сформировать документ возврата и пробить
//
// Параметры:
//  Статус	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьДокументСписанияИПробить(СтруктураПараметров, Статус, ТипСсылкиНаОплату = Неопределено, ОтветJSON = Неопределено) Экспорт
	
	ПроверкаПоРегламенту = ТипСсылкиНаОплату = Неопределено;
	СтруктураВозврата	 = СтруктураПараметров.СтруктураВозврата;
	
	Если НРег(Статус) = НРег("COMPLETED") ИЛИ НРег(Статус) = НРег("REFUNDED") ИЛИ НРег(Статус) = НРег("FULL_REVERSAL") ИЛИ Статус = 4 Тогда
		  
		Статус = Перечисления.СтатусыЗаказовОнлайнОплаты.Оплачено;
		
	ИначеЕсли НРег(Статус) = НРег("DECLINED") ИЛИ НРег(Статус) = НРег("REJECTED") ИЛИ НРег(Статус) = НРег("EXPIRED") 
		ИЛИ НРег(Статус) = НРег("REVOKED") ИЛИ НРег(Статус) = НРег("REVERSED") ИЛИ НРег(Статус) = НРег("DEADLINE_EXPIRED") 
		ИЛИ НРег(Статус) = НРег("CANCELED") ИЛИ Статус = 3 ИЛИ Статус = 6 Тогда
		
		Статус = Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ;
		
	Иначе
		
		Статус = Перечисления.СтатусыЗаказовОнлайнОплаты.ОжидаетВозврата;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Если Статус = Перечисления.СтатусыЗаказовОнлайнОплаты.Оплачено Тогда
		
		Если ПроверитьНаДубликатСписания(СтруктураПараметров.УИДВозврата) Тогда
			ОтменитьТранзакцию();
			РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(СтруктураПараметров.ВозвратОтПокупателя,,,, Статус,, СтруктураПараметров.УИДВозврата, ОтветJSON);
			СтруктураВозврата.ВыполненоУспешно = Истина;
			Возврат СтруктураВозврата;
		КонецЕсли;
	
		ПараметрыФискализации = Неопределено;
		СтруктураПараметров.КассаОплаты = Справочники.Кассы.ПолучитьКассуОплатыИПараметрыФискализации(СтруктураПараметров.ЭквайринговыйТерминал, ПараметрыФискализации);
		СписаниеДС = СоздатьВозвратОплатыЭлектроннымиСредствами(СтруктураПараметров);
		
		Попытка
			СписаниеДС.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОтменитьТранзакцию();
			СтруктураВозврата.ОписаниеОшибки = ОписаниеОшибки();
			Возврат СтруктураВозврата;
		КонецПопытки;
		
		ТипФискализации = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктураПараметров.ЭквайринговыйТерминал, "ТипФискализации");
		Если ТипФискализации <> Перечисления.ТипыФискализации.ВСДМБанке И ТипФискализации <> Перечисления.ТипыФискализации.ВТинькофф Тогда 
			МассивФискализации = Новый Массив;
			МассивФискализации.Добавить(СписаниеДС.Ссылка);
			ФискализироватьПлатежи(МассивФискализации, СтруктураПараметров.КассаОплаты, ПараметрыФискализации);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПроверкаПоРегламенту = Ложь Тогда
		
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(
			СтруктураПараметров.ВозвратОтПокупателя, 
			СтруктураПараметров.СуммаВозвратаВРублях, 
			СтруктураПараметров.ИдСБП,, 
			Статус,
			СтруктураПараметров.ЭквайринговыйТерминал,
			СтруктураПараметров.УИДВозврата,
			ОтветJSON,,
			СтруктураПараметров.Контрагент,,
			СтруктураПараметров.СтруктурнаяЕдиница,
			ТекущаяДатаСеанса(),
			СтрШаблон("Сформирован возврат по заказу %1 сотрудником %2", СтруктураПараметров.НомерЗаказа, СтруктураПараметров.ПредставлениеСотрудника),
			ТипСсылкиНаОплату,
			СтруктураПараметров.Сотрудник,,,
			Истина);
		
	Иначе
		РегистрыСведений.СтатусыОплатыЗаказов.СоздатьИлиОбновитьЗапись(СтруктураПараметров.ВозвратОтПокупателя,,,, Статус,, СтруктураПараметров.УИДВозврата, ОтветJSON);	
	КонецЕсли;
	
	ЗафиксироватьТранзакцию(); 
	
	Если Статус = Перечисления.СтатусыЗаказовОнлайнОплаты.Оплачено Тогда
			
		ИспользоватьСистемуВзаимодействия	= ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
		АктивныеСотрудники					= ОбсужденияСистемыВзаимодействия.ПолучитьМассивАктивныхСотрудников(,,, СтруктураПараметров.СтруктурнаяЕдиница);
		
		Если ЗначениеЗаполнено(АктивныеСотрудники) Тогда			
			
			Если ИспользоватьСистемуВзаимодействия Тогда
				
				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("Ключ"					, "СБП_ВозвратОплаты");
				ДанныеСообщения.Вставить("ОснованиеОплаты"		, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(СписаниеДС.Ссылка));
				ДанныеСообщения.Вставить("transaction_id"		, СтруктураПараметров.УИДВозврата);
				ДанныеСообщения.Вставить("СтруктурнаяЕдиница"	, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(СтруктураПараметров.СтруктурнаяЕдиница));
				ДанныеСообщения.Вставить("Контрагент"			, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(СтруктураПараметров.Контрагент));
				ДанныеСообщения.Вставить("СтрокаОснований"		, Строка(СписаниеДС.Ссылка.УникальныйИдентификатор()));
				
				ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, АктивныеСотрудники);
				
			Иначе
				
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(СписаниеДС.Ссылка);
				МассивПараметров.Добавить(СтруктураПараметров.УИДВозврата);
				МассивПараметров.Добавить(СтруктураПараметров.СтруктурнаяЕдиница);
				МассивПараметров.Добавить(СтруктураПараметров.Контрагент);	
				МассивПараметров.Добавить(Строка(СписаниеДС.Ссылка.УникальныйИдентификатор()));
				
				Для Каждого АктивныйСотрудник Из АктивныеСотрудники Цикл					
					РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(АктивныйСотрудник, СтруктураПараметров.СтруктурнаяЕдиница, "СБП_ВозвратОплаты",,,,, МассивПараметров);								
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	СтруктураВозврата.ВыполненоУспешно = Истина;
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Проверить на дубликат списания
//
// Параметры:
//  transaction_id	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьНаДубликатСписания(transaction_id) Экспорт
	
	// Получение поступлений
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СписаниеДенежныхСредств.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеДенежныхСредств КАК СписаниеДенежныхСредств
	|ГДЕ
	|	НЕ СписаниеДенежныхСредств.ПометкаУдаления
	|	И СписаниеДенежныхСредств.НомерВходящегоДокумента = &transaction_id");
	
	Запрос.УстановитьПараметр("transaction_id", transaction_id);
		
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#Область ОбработатьВебХукСБП

// Функция - Обработать веб хук СБП
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  ПараметрыJSON	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработатьОплатуПоСсылкуИСБП(ПараметрыЗапроса, ТекстЗапроса) Экспорт
	
	ЭтоТинькофф			= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПТинькофф;
	ЭтоРайффайзенБанк	= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк;
	ЭтоАльфаБанк		= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк;	
	ЭтоСБПСбербанк		= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСбербанк;
	ЭтоСбербанкПлатиQR	= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR;
	ЭтоСДМБанк			= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСДМ;
	ЭтоСбербанк			= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.Сбербанк;
	
	ДатаПоступления		= Неопределено;
	
	Если ЭтоТинькофф ИЛИ ЭтоСДМБанк Тогда
		
		Статус			= ПараметрыЗапроса.Status; 
		ИдСБП			= Формат(ПараметрыЗапроса.PaymentId, "ЧГ=100");
		НомерЗаказа		= ПараметрыЗапроса.OrderId;
		transaction_id	= Формат(ПараметрыЗапроса.PaymentId, "ЧГ=100"); 
		СуммаКОплате	= ?(ЭтоСДМБанк, ПараметрыЗапроса.amount, ПараметрыЗапроса.amount/100);
		
	ИначеЕсли ЭтоРайффайзенБанк Тогда
		
		Статус			= ПараметрыЗапроса.paymentStatus;
		ИдСБП			= ПараметрыЗапроса.qrId;
		НомерЗаказа		= ПараметрыЗапроса.order;
		transaction_id	= Формат(ПараметрыЗапроса.transactionId, "ЧГ=100");
		ДатаПоступления = ?(ПараметрыЗапроса.Свойство("transactionDate"), ПараметрыЗапроса.transactionDate, Неопределено);
		СуммаКОплате 	= ПараметрыЗапроса.amount;
		
	ИначеЕсли ЭтоСБПСбербанк ИЛИ ЭтоСбербанкПлатиQR Тогда
		
		// Ничего не делаем:
		// CREATED(СОЗДАН)			- создан или в привязке к заказу есть неуспешные авторизации.
		// AUTHORIZED(АВТОРИЗОВАН) 	- после 1й стадии двухстадийной оплаты.
		// ON_PAYMENT(НА ОПЛАТЕ)	- для QR СБП ожидает подтверждения платежа от СБП.
		// CONFIRMED(ПОДТВЕРЖДЕН) 	- после 2й стадии двухстадийной оплаты.
		
		// Пишем статус:
		// DECLINED(ОТКЛОНЕНО)		- отклонено банком.
		// EXPIRED(ИСТЕК)			- истек срок жизни заказа.
		// REVOKED(ОТМЕНЕНО)		- отменен до проведения финансовой операции.
		
		// Возврат и оплата:
		// REVERSED(ОБРАТНЫЙ)		- это отмена, производится в день оплаты.
		// REFUNDED(ВОЗВРАТ)		- это возврат,производится в последующие дни после оплаты.
		// PAID(ОПЛАЧЕНО)			- успешная операция покупки на сумму заказа.
		
		НайденнаяСтрокаОплаты 	= ?(ПараметрыЗапроса.Свойство("order_operation_params"), ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(ПараметрыЗапроса.order_operation_params, "operation_type", "PAY"), Неопределено);
		Статус					= ПараметрыЗапроса.order_state;
		ИдСБП					= ПараметрыЗапроса.order_id;
		НомерЗаказа				= ПараметрыЗапроса.НомерЗаказа;
		ДатаПоступления 		= ?(НайденнаяСтрокаОплаты <> Неопределено, ПрочитатьДатуJSON(НайденнаяСтрокаОплаты.operation_date_time, ФорматДатыJSON.ISO), Неопределено);
		СуммаКОплате 			= ?(НайденнаяСтрокаОплаты <> Неопределено, НайденнаяСтрокаОплаты.operation_sum/100, Неопределено);
		
		Если ЭтоСБПСбербанк И ПараметрыЗапроса.Свойство("sbp_operation_params") И ПараметрыЗапроса.sbp_operation_params.Свойство("sbp_operation_id") Тогда
			transaction_id = ПараметрыЗапроса.sbp_operation_params.sbp_operation_id;
		ИначеЕсли НайденнаяСтрокаОплаты <> Неопределено Тогда
			transaction_id = НайденнаяСтрокаОплаты.operation_id;
		Иначе
			transaction_id = ПараметрыЗапроса.order_id;
		КонецЕсли;
		
	ИначеЕсли ЭтоСбербанк Тогда
		
		Статус			= ПараметрыЗапроса.paymentAmountInfo.paymentState;
		ИдСБП			= ПараметрыЗапроса.mdOrder;
		НомерЗаказа 	= ПараметрыЗапроса.НомерЗаказа;
	    transaction_id	= ПараметрыЗапроса.mdOrder;
		СуммаКОплате 	= ПараметрыЗапроса.amount/100;
		
	Иначе
		
		Статус			= ПараметрыЗапроса.operation;
		ИдСБП			= ПараметрыЗапроса.mdOrder;
		НомерЗаказа 	= ПараметрыЗапроса.orderNumber;
		transaction_id	= ПараметрыЗапроса.mdOrder;
		СуммаКОплате 	= Неопределено;
		
	КонецЕсли;
	
	Если НРег(Статус) = НРег("SUCCESS") ИЛИ НРег(Статус) = НРег("CONFIRMED") ИЛИ НРег(Статус) = НРег("PAID") ИЛИ НРег(Статус) = НРег("FULL_PAID") ИЛИ НРег(Статус) = НРег("DEPOSITED") Тогда
		СтатусЗаказа = Перечисления.СтатусыЗаказовОнлайнОплаты.Оплачено;
	ИначеЕсли НРег(Статус) = НРег("DECLINED") ИЛИ НРег(Статус) = НРег("REJECTED") ИЛИ НРег(Статус) = НРег("EXPIRED") 
		ИЛИ НРег(Статус) = НРег("REVOKED") ИЛИ (Не ЭтоТинькофф И НРег(Статус) = НРег("REVERSED")) ИЛИ НРег(Статус) = НРег("REFUNDED") 
		ИЛИ НРег(Статус) = НРег("DEADLINE_EXPIRED") ИЛИ НРег(Статус) = НРег("CANCELED") Тогда   
		СтатусЗаказа = Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ;	
	Иначе 		
		СтатусЗаказа = Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено;
	КонецЕсли;
	
	Если СтатусЗаказа <> Перечисления.СтатусыЗаказовОнлайнОплаты.НеОплачено Тогда // Статус заказа изменен	
		РегистрыСведений.СтатусыОплатыЗаказов.ОбновитьЗаписьПоЗаказу(НомерЗаказа, ТекстЗапроса, ?(СтатусЗаказа = Перечисления.СтатусыЗаказовОнлайнОплаты.Отказ, СтатусЗаказа, Неопределено));  
	КонецЕсли;
	
	Если НРег(Статус) = НРег("REVERSED") ИЛИ НРег(Статус) = НРег("REFUNDED") ИЛИ НРег(Статус) = НРег("FULL_REVERSAL") ИЛИ НРег(Статус) = НРег("PARTIAL_REVERSAL") Тогда
		// Необходимо создать возврат дс.
		Возврат Новый Структура("result", Истина);
	ИначеЕсли СтатусЗаказа <> Перечисления.СтатусыЗаказовОнлайнОплаты.Оплачено Тогда
		Возврат Новый Структура("result", Истина);
	КонецЕсли;
	
	ТаблицаЗаказов = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьЗаказыПоИд(ИдСБП, НомерЗаказа);	
	
	Если ТаблицаЗаказов.Количество() = 0 Тогда
		Возврат ПолучитьСтруктуруВозврата(,1129);
	КонецЕсли;
	
	МассивПоступлений		  = Новый Массив;
	ЭквайринговыйТерминал 	  = ТаблицаЗаказов[0].ЭквайринговыйТерминал;
	СтруктурнаяЕдиница		  = ТаблицаЗаказов[0].СтруктурнаяЕдиница;
	Контрагент				  = ТаблицаЗаказов[0].Контрагент;
	Сотрудник				  = ТаблицаЗаказов[0].Сотрудник;
	ПараметрыФискализации	  = Неопределено;
	КассаОплаты				  = Справочники.Кассы.ПолучитьКассуОплатыИПараметрыФискализации(ЭквайринговыйТерминал, ПараметрыФискализации);
	Организация				  = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭквайринговыйТерминал, "Организация");
	СуммаКОплате			  = ?(СуммаКОплате = Неопределено, ТаблицаЗаказов.Итог("СуммаЗаказа"), СуммаКОплате); // АльфаБанк не передает сумму оплаты, берем ее из заказа 
	
	Если (ЭтоТинькофф ИЛИ ЭтоСДМБанк) И ПараметрыЗапроса.Свойство("Token") ИЛИ ЭтоАльфаБанк И ПараметрыЗапроса.Свойство("checksum") Тогда
		
		ПодписьВерна = ПроверитьПодписьЗапроса(ПараметрыЗапроса, ЭквайринговыйТерминал);
		
		Если Не ПодписьВерна Тогда
			Возврат ПолучитьСтруктуруВозврата(,1130);		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(transaction_id) Тогда
		Возврат ПолучитьСтруктуруВозврата(,1012);
	ИначеЕсли Не ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		Возврат ПолучитьСтруктуруВозврата(,1014);
	ИначеЕсли Не ЗначениеЗаполнено(КассаОплаты) Тогда
		Возврат ПолучитьСтруктуруВозврата(,1057);
	ИначеЕсли Не ЗначениеЗаполнено(Организация) Тогда
		Возврат ПолучитьСтруктуруВозврата(1120); 
	ИначеЕсли Не ЗначениеЗаполнено(ПараметрыФискализации) Тогда
		Возврат ПолучитьСтруктуруВозврата(4058);		
	КонецЕсли;
	
	НачатьТранзакцию();	
	УстановитьБлокировку("Документ.ПоступлениеДенежныхСредств", "НомерВходящегоДокумента", transaction_id);	
	
	Если ПроверитьНаДубликатПоступления(Организация, transaction_id) Тогда
		ОтменитьТранзакцию();
		Возврат Новый Структура("result", Истина);
	КонецЕсли;
	
	ДатаПоступления = ?(ЗначениеЗаполнено(ДатаПоступления), ДатаПоступления, ТекущаяДатаСеанса());
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация"				, Организация);	
	СтруктураПараметров.Вставить("Контрагент"				, Контрагент);
	СтруктураПараметров.Вставить("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
	СтруктураПараметров.Вставить("Дата"						, ДатаПоступления);
	СтруктураПараметров.Вставить("ЭквайрингТерминал"		, ЭквайринговыйТерминал);
	СтруктураПараметров.Вставить("Касса"					, КассаОплаты);
	СтруктураПараметров.Вставить("НомерВходящегоДокумента"	, transaction_id);
	СтруктураПараметров.Вставить("ВидЛицевогоСчета"			, ТаблицаЗаказов[0].Основание);
	СтруктураПараметров.Вставить("СуммаДокумента"			, СуммаКОплате);	 
	СтруктураПараметров.Вставить("ОплатаПоСсылке"			, ПараметрыЗапроса.ТипБанка);
	
	Если ТипЗнч(ТаблицаЗаказов[0].Основание) = Тип("СправочникСсылка.ВидыЛицевыхСчетов") Тогда		
		ПоступлениеДС = СоздатьПоступлениеДенежныхСредствНаЛицевойСчет(СтруктураПараметров);							
	Иначе
		ПоступлениеДС = СоздатьПоступлениеДенежныхСредств(СтруктураПараметров, ТаблицаЗаказов);   	
	КонецЕсли;
	МассивПоступлений.Добавить(ПоступлениеДС);
	
	МассивФискализации = Новый Массив;
	Для Каждого ПоступлениеОбъект Из МассивПоступлений Цикл
				
		Попытка
			ПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			РегистрыСведений.СтатусыОплатыЗаказов.ОбновитьЗаписьПоЗаказу(НомерЗаказа, ТекстЗапроса, СтатусЗаказа);
			МассивФискализации.Добавить(ПоступлениеОбъект.Ссылка);
		Исключение
			ОтменитьТранзакцию();
			ТекстОшибки = ОписаниеОшибки();
			Возврат ПолучитьСтруктуруВозвратаОшибки(1000, ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
	ФискализироватьПлатежи(МассивФискализации, КассаОплаты, ПараметрыФискализации);
	ЗафиксироватьТранзакцию();
	
	ИспользоватьСистемуВзаимодействия	= ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
	АктивныеСотрудники					= ОбсужденияСистемыВзаимодействия.ПолучитьМассивАктивныхСотрудников(,,, СтруктурнаяЕдиница);
		
	Если ЗначениеЗаполнено(АктивныеСотрудники) Тогда
		
		СтрокаОснований = "";
		Для Каждого Заказ Из ТаблицаЗаказов Цикл
			Если ЗначениеЗаполнено(Заказ.Основание) И ТипЗнч(Заказ.Основание) <> Тип("СправочникСсылка.ВидыЛицевыхСчетов") Тогда
				СтрокаОснований = СтрокаОснований + ?(ЗначениеЗаполнено(СтрокаОснований), ",", "") + Заказ.Основание.УникальныйИдентификатор();
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ПоступлениеДС Из МассивФискализации Цикл					
			
			Если ИспользоватьСистемуВзаимодействия Тогда
				
				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("Ключ"					, "СБП_УспешнаяОплата");
				ДанныеСообщения.Вставить("ОснованиеОплаты"		, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(ПоступлениеДС));
				ДанныеСообщения.Вставить("transaction_id"		, transaction_id);
				ДанныеСообщения.Вставить("СтруктурнаяЕдиница"	, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(СтруктурнаяЕдиница));
				ДанныеСообщения.Вставить("Контрагент"			, ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(Контрагент));
				ДанныеСообщения.Вставить("СтрокаОснований"		, СтрокаОснований);
				
				ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, АктивныеСотрудники);
				
			Иначе
				
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(ПоступлениеДС);
				МассивПараметров.Добавить(transaction_id);
				МассивПараметров.Добавить(СтруктурнаяЕдиница);
				МассивПараметров.Добавить(Контрагент);	
				МассивПараметров.Добавить(СтрокаОснований);
				
				Для Каждого АктивныйСотрудник Из АктивныеСотрудники Цикл					
					РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(АктивныйСотрудник, СтруктурнаяЕдиница, "СБП_УспешнаяОплата",,,,, МассивПараметров);								
				КонецЦикла;
				
			КонецЕсли;					
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый Структура("result", Истина);
	
КонецФункции

// Функция - Проверить подпись запроса
//
// Параметры:
//  ПараметрыЗапроса		 - 	 - 
//  ЭквайринговыйТерминал	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьПодписьЗапроса(ПараметрыЗапроса, ЭквайринговыйТерминал)
	
	ЭтоТинькофф		= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПТинькофф;
	ЭтоАльфаБанк	= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк;
	ЭтоСДМБанк		= ПараметрыЗапроса.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСДМ;
	
	ПараметрыТерминала = ЭквайринговыйТерминал.ПараметрыПлатежногоШлюза.Получить();
	
	Если ЭтоТинькофф Тогда						
		
		Если ПараметрыТерминала = Неопределено 
			ИЛИ Не ПараметрыТерминала.Свойство("СекретныйКлючТинькофф") 
			ИЛИ Не ЗначениеЗаполнено(ПараметрыТерминала.СекретныйКлючТинькофф) Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
		ПараметрыЗапроса.Вставить("Password", ПараметрыТерминала.СекретныйКлючТинькофф);
		
		Sign = ПараметрыЗапроса.Token;
		
	ИначеЕсли ЭтоСДМБанк Тогда						
		
		Если ПараметрыТерминала = Неопределено 
			ИЛИ Не ПараметрыТерминала.Свойство("ПарольКлючаМерчанта") 
			ИЛИ Не ЗначениеЗаполнено(ПараметрыТерминала.ПарольКлючаМерчанта) Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
		ПараметрыЗапроса.Вставить("Password", ПараметрыТерминала.ПарольКлючаМерчанта);
		
		Sign = ПараметрыЗапроса.Token;
	
	Иначе
		
		Если ПараметрыТерминала = Неопределено 
			ИЛИ Не ПараметрыТерминала.Свойство("ЗакрытыйКлюч") 
			ИЛИ Не ЗначениеЗаполнено(ПараметрыТерминала.ЗакрытыйКлюч) Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
		Sign = ПараметрыЗапроса.checksum;
		
	КонецЕсли;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Ключ");
	ТЗ.Колонки.Добавить("Значение");
	
	Для Каждого ЭлСтруктуры Из ПараметрыЗапроса Цикл
		
		Если НРег(ЭлСтруктуры.Ключ) = НРег("Token") ИЛИ НРег(ЭлСтруктуры.Ключ) = НРег("ТипБанка") 
			ИЛИ НРег(ЭлСтруктуры.Ключ) = НРег("checksum") ИЛИ НРег(ЭлСтруктуры.Ключ) = НРег("sign_alias") ИЛИ НРег(ЭлСтруктуры.Ключ) = НРег("repeater") Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлСтруктуры.Значение) = Тип("Число") Тогда
			ПараметрЗначение = Формат(ЭлСтруктуры.Значение, "ЧГ=100");
		ИначеЕсли ТипЗнч(ЭлСтруктуры.Значение) = Тип("Булево") Тогда 
			ПараметрЗначение = Формат(ЭлСтруктуры.Значение, "БЛ=false; БИ=true");
		Иначе
			ПараметрЗначение = ЭлСтруктуры.Значение
		КонецЕсли;
		
		НоваяСтрока				= ТЗ.Добавить();
		НоваяСтрока.Ключ		= ЭлСтруктуры.Ключ;
		НоваяСтрока.Значение	= ПараметрЗначение;
		
	КонецЦикла;
	
	ТЗ.Сортировать("Ключ");
	
	ПараметрыСтрокой = "";
	Для Каждого ПараметрЗапроса Из ТЗ Цикл
		Если ЭтоТинькофф ИЛИ ЭтоСДМБанк Тогда
			ПараметрыСтрокой = ПараметрыСтрокой + ПараметрЗапроса.Значение;
		Иначе
			ПараметрыСтрокой = ПараметрыСтрокой + ПараметрЗапроса.Ключ + ";" + ПараметрЗапроса.Значение + ";";
		КонецЕсли;	
	КонецЦикла;
	
	Попытка
		
		Если ЭтоТинькофф ИЛИ ЭтоСДМБанк Тогда
			ВычисленныйSign = IPТелефония.SHA256(ПараметрыСтрокой);	
		Иначе 
			КлючШифрования  = ПараметрыТерминала.ЗакрытыйКлюч;
			ВычисленныйSign = ВРег(ОбщегоНазначения.ПолучитьХешСумму(КлючШифрования, ПараметрыСтрокой, "SHA256"));
		КонецЕсли;
		
		Возврат ВРег(ВычисленныйSign) = ВРег(Sign); 		
		
	Исключение
		Возврат Ложь;		
	КонецПопытки;
	
КонецФункции

// Функция, добавления (изменения или удаления) структурной единицы
// 
Функция ПроверитьНаДубликатПоступления(Организация, IDTransaction) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеДенежныхСредств.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	|ГДЕ
	|	ПоступлениеДенежныхСредств.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеДенежныхСредств.Организация = &Организация
	|	И ПоступлениеДенежныхСредств.НомерВходящегоДокумента = &IDTransaction");
	
	Запрос.УстановитьПараметр("Организация"  , Организация);
	Запрос.УстановитьПараметр("IDTransaction", IDTransaction);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция, возвращает стурктуру возврата для http методов.
//
Функция ПолучитьСтруктуруВозврата(parameters = Неопределено, КодОшибки = 0, ОписаниеОшибки = "")
	
	message = ?(КодОшибки <> 0, ПолучитьОписаниеОшибки(КодОшибки, ОписаниеОшибки), "");
	Возврат Новый Структура("parameters, errors", parameters, Новый Структура("code, message", КодОшибки, message));
	
КонецФункции

// Функция, возвращает структуру возврата ошибки. 
// 
Функция ПолучитьСтруктуруВозвратаОшибки(КодОшибки = Неопределено, ОписаниеОшибки = "", ВернутьПустуюСтруктуру = Ложь) Экспорт
	
	Если ВернутьПустуюСтруктуру Тогда
		Возврат Новый Структура("code, message", 0, "");
	КонецЕсли;
	
	СтруктураОшибки = Новый Структура("code, message", КодОшибки, ПолучитьОписаниеОшибки(КодОшибки, ОписаниеОшибки));
	Возврат Новый Структура("Parameters, Errors",, СтруктураОшибки);
	
КонецФункции

// Функция, возвращает описание ошибки по коду.
// 
Функция ПолучитьОписаниеОшибки(КодОшибки, ДополнительноеОписание = "")
	
	Если КодОшибки = 1000 Тогда
		Возврат "Ошибка работы с базой данных. " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1001 Тогда
		Возврат "Информация о клиенте не обновлена. " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1002 Тогда
		Возврат "Пользователь с таким номером телефона или электронной почтой не зарегистрирован в системе";
	ИначеЕсли КодОшибки = 1012 Тогда
		Возврат "Не указано id транзакции";
	ИначеЕсли КодОшибки = 1013 Тогда
		Возврат "Не указана сумма пополнения счета";
	ИначеЕсли КодОшибки = 1014 Тогда
		Возврат "Не указан эквайринговый терминал оплаты";
	ИначеЕсли КодОшибки = 1015 Тогда
		Возврат "Обнаружено дублирования id транзакции";
	ИначеЕсли КодОшибки = 1016 Тогда
		Возврат "Прерывание транзакции, при пополнении лицевого счета: " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1017 Тогда
		Возврат "Не найден лицевой счет";	
	ИначеЕсли КодОшибки = 1040 Тогда
		Возврат "Не найден метод";
	ИначеЕсли КодОшибки = 1050 Тогда
		Возврат "Не найден сотрудник";
	ИначеЕсли КодОшибки = 1051 Тогда
		Возврат "Не найдена номенклатура";
	ИначеЕсли КодОшибки = 1052 Тогда
		Возврат "Не задан временной интервал";
	ИначеЕсли КодОшибки = 1053 Тогда
		Возврат "Онлайн-запись недоступна";
	ИначеЕсли КодОшибки = 1054 Тогда
		Возврат "Неверный формат даты";
	ИначеЕсли КодОшибки = 1055 Тогда
		Возврат "Не найден салон";
	ИначеЕсли КодОшибки = 1056 Тогда
		Возврат "Не найден визит";
	ИначеЕсли КодОшибки = 1057 Тогда
		Возврат "Не найдена касса";
	ИначеЕсли КодОшибки = 1058 Тогда
		Возврат "Не найдена кассовая смена";
	ИначеЕсли КодОшибки = 1059 Тогда
		Возврат "Не задан номер чека";
	ИначеЕсли КодОшибки = 1060 Тогда
		Возврат "Неверная структура массива оплат";
	ИначеЕсли КодОшибки = 1061 Тогда
		Возврат "Не указано время начала визита";
	ИначеЕсли КодОшибки = 1062 Тогда
		Возврат "Не указан ключ авторизации";
	ИначеЕсли КодОшибки = 1063 Тогда
		Возврат "Неверный ключ авторизации";
	ИначеЕсли КодОшибки = 1064 Тогда
		Возврат "Не указан логин";
	ИначеЕсли КодОшибки = 1065 Тогда
		Возврат "Неверный код подтверждения";
	ИначеЕсли КодОшибки = 1066 Тогда
		Возврат "Не указан ключ клиента";
	ИначеЕсли КодОшибки = 1067 Тогда
		Возврат "Неверный ключ клиента";
	ИначеЕсли КодОшибки = 1068 Тогда
		Возврат "Код подтверждения не действителен";
	ИначеЕсли КодОшибки = 1069 Тогда
		Возврат "Неверный Email";
	ИначеЕсли КодОшибки = 1070 Тогда
		Возврат "Неверное время настройки напоминания о визите";
	ИначеЕсли КодОшибки = 1071 Тогда
		Возврат "Не задан массив записи";
	ИначеЕсли КодОшибки = 1072 Тогда
		Возврат "Неверный параметр rating";
	ИначеЕсли КодОшибки = 1073 Тогда
		Возврат "Неверный формат параметра page";
	ИначеЕсли КодОшибки = 1074 Тогда
		Возврат "Неверный формат структуры оплаты";
	ИначеЕсли КодОшибки = 1075 Тогда
		Возврат "Неверный формат длительности записи";
	ИначеЕсли КодОшибки = 1076 Тогда
		Возврат "Не верно указан(ы) входной(ые) параметр(ы)";
	ИначеЕсли КодОшибки = 1077 Тогда
		Возврат "Неверный формат параметра master_ids";
	ИначеЕсли КодОшибки = 1078 Тогда
		Возврат "Неверный формат параметра visit_ids";
	ИначеЕсли КодОшибки = 1079 Тогда
		Возврат "Передана неверная оценка визита";
	ИначеЕсли КодОшибки = 1080 Тогда
		Возврат "Не найдено сотрудников, способных оказать переданный массив услуг";
	ИначеЕсли КодОшибки = 1081 Тогда
		Возврат "Не найдено свободных ресурсов для оказания услуг";
	ИначеЕсли КодОшибки = 1082 Тогда
		Возврат "Неверная подпись";
	ИначеЕсли КодОшибки = 1083 Тогда
		Возврат "Неверный тип номенклатуры";
	ИначеЕсли КодОшибки = 1084 Тогда
		Возврат "Передан неверный список покупок";
	ИначеЕсли КодОшибки = 1085 Тогда
		Возврат "Не найден вид цен";
	ИначеЕсли КодОшибки = 1086 Тогда
		Возврат "Лицевой счет """ + ДополнительноеОписание + """ закрыт";
	ИначеЕсли КодОшибки = 1087 Тогда
		Возврат "Клиент не может произвести оплату с лицевого счета: """ + ДополнительноеОписание + """";
	ИначеЕсли КодОшибки = 1088 Тогда
		Возврат "Недостаточно средств на лицевом счету" + ?(ЗначениеЗаполнено(ДополнительноеОписание), " """ + ДополнительноеОписание + """", "");
	ИначеЕсли КодОшибки = 1089 Тогда
		Возврат "Бонусный счет """ + ДополнительноеОписание + """ закрыт";
	ИначеЕсли КодОшибки = 1090 Тогда
		Возврат "Клиент не может произвести оплату с бонусного счета: """ + ДополнительноеОписание + """";
	ИначеЕсли КодОшибки = 1091 Тогда
		Возврат "Не найден сформированный заказ";
	ИначеЕсли КодОшибки = 1100 Тогда
		Возврат "Один из сотрудников не оказывает выбранную услугу";
	ИначеЕсли КодОшибки = 1101 Тогда
		Возврат "Один из сотрудников не может оказать услугу в выбранное время";
	ИначеЕсли КодОшибки = 1102 Тогда
		Возврат "Один из сотрудников не работает в указанное время";
	ИначеЕсли КодОшибки = 1103 Тогда
		Возврат "К сожалению, запись невозможна, так как выбраны услуги, которые не могут быть оказаны одновременно";
	ИначеЕсли КодОшибки = 1104 Тогда
		Возврат "Одна из услуг недоступна для онлайн-записи";
	ИначеЕсли КодОшибки = 1105 Тогда
		Возврат "Невозможно перенести выбранный визит на указанное время";
	ИначеЕсли КодОшибки = 1106 Тогда
		Возврат "Нет сотрудников, способных оказать услугу " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1107 Тогда
		Возврат "Визит не является долговым";
	ИначеЕсли КодОшибки = 1108 Тогда
		Возврат "Клиент не имеет доступ к визитам другово клиента";
	ИначеЕсли КодОшибки = 1109 Тогда
		Возврат "Визит недоступен для изменения";
	ИначеЕсли КодОшибки = 1110 Тогда
		Возврат "Не удалось отправить СМС-сообщение с кодом подтверждения";
	ИначеЕсли КодОшибки = 1111 Тогда
		Возврат "Остатка на лицевом счете клиента недостаточно для оплаты";
	ИначеЕсли КодОшибки = 1112 Тогда
		Возврат "Не удалось обновить информацию о клиенте" + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1113 Тогда
		Возврат "Визит недоступен для отмены";
	ИначеЕсли КодОшибки = 1114 Тогда
		Возврат "Массив переданных услуг нельзя оказывать одновременно";
	ИначеЕсли КодОшибки = 1115 Тогда
		Возврат ?(Не ЗначениеЗаполнено(ДополнительноеОписание), "Услуга недоступна для записи в выбранное время", ДополнительноеОписание);
	ИначеЕсли КодОшибки = 1116 Тогда
		Возврат "Параметр amount должен быть больше нуля";	
	ИначеЕсли КодОшибки = 1117 Тогда
		Возврат "Не найдена группа онлайн продажи";
	ИначеЕсли КодОшибки = 1118 Тогда
		Возврат "Строка поиска передана неверно";
	ИначеЕсли КодОшибки = 1119 Тогда
		Возврат "Строка поиска должна содержать хотя бы 3 символа";
	ИначеЕсли КодОшибки = 1120 Тогда
		Возврат "Не удалось отправить сообщение в мессенджер с кодом подтверждения по причине: " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1121 Тогда
		Возврат "Неверный тип внешней системы.";
	ИначеЕсли КодОшибки = 1122 Тогда
		Возврат "Сумма визита больше, чем переданная сумма оплаты";
	ИначеЕсли КодОшибки = 1123 Тогда
		Возврат "Визит не требует предоплаты";
	ИначеЕсли КодОшибки = 1124 Тогда
		Возврат "Бонусный счет не найден";
	ИначеЕсли КодОшибки = 1125 Тогда
		Возврат "Передан неверный визит";
	ИначеЕсли КодОшибки = 1126 Тогда
		Возврат "Для использования предоплаты услуг необходимо включить соотвествующую настройку в структурной единице";
	ИначеЕсли КодОшибки = 1127 Тогда
		Возврат "Ошибка при записи в регистр Рекламные данные " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1128 Тогда
		Возврат "Не удалось отправить письмо на почту с кодом подтверждения по причине: " + ДополнительноеОписание;
	ИначеЕсли КодОшибки = 1129 Тогда
		Возврат "Не найдено заказов по данному id";
	ИначеЕсли КодОшибки = 1130 Тогда
		Возврат "Подпись запроса не верна";
	ИначеЕсли КодОшибки = 1131 Тогда
		Возврат "Не удалось совершить звонок для подтверждения номера.";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Процедура, устанавливает блокировку.
//
Процедура УстановитьБлокировку(БлокируемыйДокумент, РеквизитБлокировки, ЗначениеРеквизита) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(БлокируемыйДокумент);
	ЭлементБлокировки.УстановитьЗначение(РеквизитБлокировки, ЗначениеРеквизита);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
КонецПроцедуры

// Функция - Создать поступление денежных средств на лицевой счет
//
// Параметры:
//  СтруктурнаяЕдиница		 - 	 - 
//  Клиент					 - 	 - 
//  ТипОплаты				 - 	 - 
//  ЛицевойСчет				 - 	 - 
//  ЭквайринговыйТерминал	 - 	 - 
//  КассаОплаты				 - 	 - 
//  ИдТранзакции			 - 	 - 
//  СуммаДокумента			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьПоступлениеДенежныхСредствНаЛицевойСчет(ДанныеЗаполнения) Экспорт
	
	ПоступлениеНаСчет                             = Документы.ПоступлениеДенежныхСредств.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ПоступлениеНаСчет, ДанныеЗаполнения);
	
	ПоступлениеНаСчет.Дата							= ТекущаяДатаСеанса();
	ПоступлениеНаСчет.ТипДенежныхСредств			= Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта;
	ПоступлениеНаСчет.ВидОперации					= Перечисления.ВидыОпераций.ВзносНаЛицевойСчет;
	ПоступлениеНаСчет.Статья						= Справочники.СтатьиДоходовИРасходов.ВзносНаЛицевойСчет;
	ПоступлениеНаСчет.ЛицевойСчетКонтрагента		= ДанныеЗаполнения.ВидЛицевогоСчета;
	ПоступлениеНаСчет.ДатаВходящегоДокумента		= ТекущаяДатаСеанса();
	ПоступлениеНаСчет.Комментарий					= "Оплата через внешнюю платежную систему";
	ПоступлениеНаСчет.АвторДокумента				= ПараметрыСеанса.ТекущийПользователь;

	Возврат ПоступлениеНаСчет;
	
КонецФункции

// Функция, создаёт поступление денежных средств.
//
Функция СоздатьПоступлениеДенежныхСредств(СтруктураПараметровЗаполнения, ТаблицаОснований = Неопределено) Экспорт
	
	//СтруктураПараметровЗаполнения = {Организация, СтруктурнаяЕдиница, Контрагент, Дата, ЭквайрингТерминал, Касса, НомерВходящегоДокумента, ДокументАванса, ТипРасчета, Основание,СуммаДокумента}
		
	ПоступлениеДС                         = Документы.ПоступлениеДенежныхСредств.СоздатьДокумент();		
	ЗаполнитьЗначенияСвойств(ПоступлениеДС, СтруктураПараметровЗаполнения);
	ПоступлениеДС.АвторДокумента          = ПараметрыСеанса.ТекущийПользователь;
	ПоступлениеДС.Сотрудник               = ПараметрыСеанса.ТекущийПользователь;
	ПоступлениеДС.ДатаВходящегоДокумента  = ПоступлениеДС.Дата;
	ПоступлениеДС.ТипДенежныхСредств      = Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта;
	ПоступлениеДС.ВидОперации             = Перечисления.ВидыОпераций.ОплатаОтКлиента;
	ПоступлениеДС.Статья               	  = Справочники.СтатьиДоходовИРасходов.ОплатаОтКлиента;	
	ПоступлениеДС.Комментарий			  = "Оплата через внешнюю платежную систему";
	СуммаОплачено						  = СтруктураПараметровЗаполнения.СуммаДокумента;
	
	Если ТаблицаОснований = Неопределено Тогда
		
		НоваяСтрока 		       			  = ПоступлениеДС.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ДокументОснования 		  = ?(СтруктураПараметровЗаполнения.Свойство("Основание"), СтруктураПараметровЗаполнения.Основание, Неопределено);
		НоваяСтрока.ДокументАванса 			  = ?(СтруктураПараметровЗаполнения.Свойство("ДокументАванса"), СтруктураПараметровЗаполнения.ДокументАванса, Неопределено);
		НоваяСтрока.Статья      			  = Справочники.СтатьиДоходовИРасходов.ОплатаОтКлиента; 
		НоваяСтрока.Сумма          			  = СуммаОплачено;				
		
	Иначе	
		
		Для Каждого СтрокаОснования Из ТаблицаОснований Цикл
			
			СуммаНаДокументОснования = СтрокаОснования.СуммаЗаказа;	
			Сумма = ?(СуммаОплачено >= СуммаНаДокументОснования, СуммаНаДокументОснования, СуммаОплачено);   
			ЭтоАванс = ТипЗнч(СтрокаОснования.Основание) = Тип("ДокументСсылка.НарядЗаказ") ИЛИ ТипЗнч(СтрокаОснования.Основание) = Тип("ДокументСсылка.ПланЛечения");
			
			НоваяСтрока = ПоступлениеДС.РасшифровкаПлатежа.Добавить();
			
			Если ЭтоАванс Тогда
				НоваяСтрока.ДокументАванса = СтрокаОснования.Основание;
				НоваяСтрока.Статья      			  = Справочники.СтатьиДоходовИРасходов.ВзносАвансаОтКлиента;
			Иначе
				НоваяСтрока.ДокументОснования = СтрокаОснования.Основание;
				НоваяСтрока.Статья      			  = Справочники.СтатьиДоходовИРасходов.ОплатаОтКлиента;
			КонецЕсли;			
			
			
			НоваяСтрока.ЭтоАванс     			  = ЭтоАванс;
			НоваяСтрока.Сумма          			  = Сумма;
			
			СуммаОплачено = СуммаОплачено - Сумма;
			
		КонецЦикла;
			
	КонецЕсли;
	
    ПоступлениеДС.СуммаДокумента = ПоступлениеДС.РасшифровкаПлатежа.Итог("Сумма");
	
	Возврат ПоступлениеДС;
	
КонецФункции

#КонецОбласти

#Область ФискализацияОплат

// Процедура - Фискализировать платежи
//
// Параметры:
//  МассивФискализации	 - 	 - 
//  КассаОплаты			 - 	 - 
//
Процедура ФискализироватьПлатежи(МассивФискализации, КассаОплаты, ПараметрыФискализации) Экспорт
	
	Если Не ЗначениеЗаполнено(КассаОплаты) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыФискализации.КассовыйСерверИспользуется Тогда
		ДобавитьДокументОплатыВОчередьКассовогоСервера(МассивФискализации, КассаОплаты);
	//ИначеЕсли ПараметрыФискализации.ОтправлятьДанныеВLifePay Тогда
	//	ОтправитьДокументыВLifePay(МассивФискализации, КассаОплаты);
	//ИначеЕсли ПараметрыФискализации.ОтправлятьДанныеВЭвотор Тогда
	//	ФискализацияЧекаЭвотор(МассивФискализации, КассаОплаты); 
	//ИначеЕсли ПараметрыФискализации.ОтправлятьДанныеВCheckbox Тогда  
	//	ОтправитьДокументыВCheckbox(МассивФискализации, КассаОплаты);
	КонецЕсли;
		
КонецПроцедуры

// Функция - Кассовый сервер используется для данной кассы
//
// Параметры:
//  КассаОплаты	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользуетсяКассовыйСервер(КассаОплаты)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Параметры КАК Параметры
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоИспользуется = ИСТИНА
	|	И ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ)
	|	И ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверКассовогоСервера""");
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл
		
		ПараметрыКассовогоСервера = СтрокаТЗ.Параметры.Получить();
		
		Если ПараметрыКассовогоСервера.КассаОплаты = КассаОплаты Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Процедура, добавляет переданные документы оплаты в очередь кассового сервера.
//
Процедура ДобавитьДокументОплатыВОчередьКассовогоСервера(МассивФискализации, КассаОплаты)
	
	Для Каждого ДокументОплаты Из МассивФискализации Цикл 
		
		Попытка
			РегистрыСведений.ОчередьКассовогоСервера.ДобавитьДокументОплатыВОчередь_v3(ДокументОплаты, КассаОплаты);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДинамическихЭлементовДокументов

&НаСервере
// Процедура - Обновить информацию по использованию ссылки на оплату.
//
Процедура ОбновитьИнформациюПоИспользованиюСсылкиНаОплату(ЭтаФорма) Экспорт
		
	Элементы = ЭтаФорма.Элементы;
	Объект = ЭтаФорма.Объект;
	Элементы.ГруппаСсылкаНаОплату_Шаблон.Видимость = Ложь;
	
	Если Объект.Ссылка.Пустая() ИЛИ Объект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	МассивУдаляемых = Новый Массив;
	Для Каждого УдаляемыйЭлемент Из Элементы.ГруппаСсылокНаОплату.ПодчиненныеЭлементы Цикл
		МассивУдаляемых.Добавить(УдаляемыйЭлемент);
	КонецЦикла;
	Для Каждого УдаляемыйЭлемент Из МассивУдаляемых Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
		
	ТаблицаЗаказов = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьНеОплаченныеЗаказыПоДокументу(Объект.Ссылка);
	
	Для Каждого СтрокаТ Из ТаблицаЗаказов Цикл
		
		КартинкаПлатёжногоШлюза = УправлениеСвойствами.ПолучитьКартинкуПШ(СтрокаТ.ТипБанка);
		
		СуммаОплаты		= РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьСуммуОплатыПоЗаказу(СтрокаТ.СсылкаОплаты);
		Валюта			= ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		ЗаголовокЗаказа = "Ожидает оплаты: " + Формат(СуммаОплаты, "ЧДЦ=2; ЧН=0") + Валюта;
		ГруппаКнопки 	= УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ГруппаСсылкаНаОплату_Шаблон, СтрокаТ.НомерЗаказа, Элементы.ГруппаСсылокНаОплату);
		КнопкаЗаказа 	= УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Элементы.КнопкаСсылкаНаОплату_Шаблон, СтрокаТ.НомерЗаказа, ГруппаКнопки,, ЗаголовокЗаказа,,, КартинкаПлатёжногоШлюза);
		КнопкаОтмены 	= УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Элементы.ОтменитьСсылку_Шаблон, СтрокаТ.НомерЗаказа, ГруппаКнопки);
	
	КонецЦикла;
		                                                        
	Если ТаблицаЗаказов.Количество() > 0 Тогда		
		ДокументОплачен = Объект.Проведен И (?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "СуммаОплаченоПродажи"), Объект.СуммаОплаченоПродажи, Объект.СуммаОплачено) >= Объект.СуммаДокумента);
		Элементы.ГруппаСсылкаОплаты.Видимость = НЕ ДокументОплачен;		
	Иначе
		Элементы.ГруппаСсылкаОплаты.Видимость = Ложь;
	КонецЕсли;
	
	//Если ОбщегоНазначенияСтоматология.ЕстьРеквизитФормы(Элементы, "Группа_Кнопки_Оплаты") Тогда
	//	Элементы.Переместить(Элементы.ГруппаСсылкаОплаты, Элементы.ГруппаИнформацияПоОплатеПодробно, Элементы.Группа_Кнопки_Оплаты);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Функция, формирует коротку ссылку.
//
Функция ПолучитьКороткуюСсылку(СсылкаНаОплату, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	link = СсылкаНаОплату;		
	
	ДеталиСсылки = Новый Структура;
	ДеталиСсылки.Вставить("domainUriPrefix", "https://glk.me");	
	ДеталиСсылки.Вставить("link", link);		
	
	ДанныеСсылки = Новый Структура("dynamicLinkInfo, suffix", ДеталиСсылки, Новый Структура("option", "SHORT"));	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);		
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);	
	ЗаписатьJSON(ЗаписьJSON, ДанныеСсылки); 	
	ДанныеJSON = ЗаписьJSON.Закрыть();
	
	Попытка		
		HTTPСоединение = Новый HTTPСоединение("firebasedynamiclinks.googleapis.com",,,,,3,Новый ЗащищенноеСоединениеOpenSSL());
		ЗаголовкиHTTP  = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
		
		HTTPЗапрос = Новый HTTPЗапрос("/v1/shortLinks/?key=AIzaSyAoS1PL4lwzRZWxMlPY1fGex4OC1L65jhw", ЗаголовкиHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(ДанныеJSON); 		
		
		Запрос = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ТекстJSON  = Запрос.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	Если Запрос.КодСостояния = 200 Тогда
		Возврат ПараметрыJSON.shortLink;
	Иначе
		ОписаниеОшибки = НСтр("ru= 'Код состояния: ';en= 'Status code: '") + Запрос.КодСостояния + Символы.ПС + ТекстJSON;
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
