
// Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ(ДокументОплаты, Касса) Экспорт
	
	МассивТоваров = Новый Массив;
	
	Если ДокументОплаты.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда
		
		МассивТоваров = ПолучитьМассивТоваровЧекаВзносаНаЛицСчетДляККТ(ДокументОплаты);
				
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДокументОплаты.РасшифровкаПлатежа Цикл
			
			ВременныйМассив = Новый Массив;
			
			Если СтрокаТЧ.ЭтоАванс И (ТипЗнч(СтрокаТЧ.ДокументАванса) = Тип("ДокументСсылка.НарядЗаказ") ИЛИ ТипЗнч(СтрокаТЧ.ДокументАванса) = Тип("ДокументСсылка.ПланЛечения")) Тогда
				
				ВременныйМассив = ПолучитьМассивТоваровЧекаВзносаНаЛицСчетДляККТ(СтрокаТЧ.ДокументАванса, ДокументОплаты.СуммаДокумента); 
				
			ИначеЕсли ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.Реализация") ИЛИ ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.Прием") Тогда 
				СуммаОплаты = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьСуммуОплатыПоДокументу(СтрокаТЧ.ДокументОснования, ДокументОплаты);			
				ВременныйМассив = Обработки.ПомощникПроведенияОплаты.ПолучитьМассивПараметровТоваровККТ(СтрокаТЧ.ДокументОснования, СуммаОплаты, СтрокаТЧ.Сумма, Касса);
				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТоваров, ВременныйМассив);			
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДокументОплаты.РасшифровкаПлатежа Цикл
			
			ВременныйМассив = Новый Массив;
			
			Если ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.ВозвратОтПокупателя") И СтрокаТЧ.ЭтоАванс = Ложь Тогда
				
				ОплаченоПоДокументу = 0;
				Если ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) Тогда
					Если ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.НарядЗаказ") Тогда
						ОплаченоПоДокументу = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "СуммаОплаченоПродажи") - СтрокаТЧ.Сумма;
					ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СуммаОплачено", СтрокаТЧ.ДокументОснования.Метаданные()) = Истина Тогда 
						ОплаченоПоДокументу = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "СуммаОплачено") - СтрокаТЧ.Сумма;
					КонецЕсли;
				КонецЕсли;
								
				ВременныйМассив = Обработки.ПомощникПроведенияОплаты.ПолучитьМассивПараметровТоваровККТ(СтрокаТЧ.ДокументОснования, ОплаченоПоДокументу, СтрокаТЧ.Сумма, Касса);				
				
				Для Каждого ЭлементМ Из ВременныйМассив Цикл
					ЭлементМ.Вставить("ВидДокумента", "ВозвратОтПокупателя");					
				КонецЦикла;           
				
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТоваров, ВременныйМассив);
				
			КонецЕсли;		
			
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат МассивТоваров;
	
КонецФункции

//Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровЧекаВзносаНаЛицСчетДляККТ(ДокументОснования, Знач ОплатаВнесено = Неопределено) // ОплатаВнесено, Организация 
	
	МассивТоваров	= Новый Массив;
	Контрагент 		= ДокументОснования.Контрагент;
	ОплатаВнесено	= ?(ОплатаВнесено <> Неопределено, ОплатаВнесено, ДокументОснования.СуммаДокумента);
	Организация		= ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснования, "Организация"), ДокументОснования.Организация, 
		ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснования.СтруктурнаяЕдиница, "Организация"));
	
	СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
	
	СтрокаТовара.Наименование           = ?(ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств"), "Взнос на лицевой счет", "Аванс от: " +  Контрагент); 
	СтрокаТовара.СтоимостьБезСкидки     = ОплатаВнесено;
	СтрокаТовара.СуммаСкидки            = 0;
	СтрокаТовара.СтоимостьСоСкидкой     = ОплатаВнесено;
	СтрокаТовара.Количество             = 1;
	СтрокаТовара.СтавкаНДС              = МенеджерОборудованияВызовСервера.ПолучитьНДСПриВзносеНаЛицевойСчет(Организация);
	СтрокаТовара.СуммаНДС               = Ценообразование.РассчитатьСуммуНДС(ОплатаВнесено, СтрокаТовара.СтавкаНДС);
	СтрокаТовара.НомерСекции            = 2;
	СтрокаТовара.Штрихкод               = null;
	СтрокаТовара.СуммаОплачено			= ОплатаВнесено;
	СтрокаТовара.ЭтоОплатаКредита       = Ложь;  
	
	МассивТоваров.Добавить(СтрокаТовара);
		
	Возврат МассивТоваров;
	
КонецФункции
