
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
	
	Для Каждого Значение Из Перечисления.ОперацииАгрегированияИТрансформацииУпаковокМДЛП Цикл
		СписокОпераций.Добавить(Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбораОперации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьОперацию(Команда)
	
	ОбработкаВыбораОперации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВыбораОперации()
	
	СтрокаТаблицы = Элементы.СписокОпераций.ТекущиеДанные;
	Если СтрокаТаблицы <> Неопределено Тогда
		Если ТипЗнч(ЗначенияЗаполнения) <> Тип("Структура") Тогда
			ЗначенияЗаполнения = Новый Структура;
		КонецЕсли;
		ЗначенияЗаполнения.Вставить("Операция", СтрокаТаблицы.Значение);
		Закрыть();
		ОткрытьФорму("Документ.УведомлениеОбАгрегированииИТрансформацииУпаковокМДЛП.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
