	
#Область ОбработчикиСобытийФормы	
	
&НаСервере
// Обработчик при создании формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ДанныеАнкеты                   = Обработки.РегистрацияПрограммногоПродукта.ПолучитьДанныеРегистрационнойАнкеты();
	ПеремДатаОкончанияПоддержки    = Неопределено;
	АнкетаСтатус                   = "Нет данных."; 
	АнкетаСостояниеПоддержки       = "Нет данных.";
	АнкетаПоследнийКодСостояния    = Неопределено;
	Если ДанныеАнкеты <> Неопределено Тогда
		ДанныеАнкеты.Свойство("АнкетаСтатус"                  ,АнкетаСтатус);
		ДанныеАнкеты.Свойство("АнкетаСтатусПодробно"          ,АнкетаСтатусПодробно);
		ДанныеАнкеты.Свойство("АнкетаСостояниеПоддержки"      ,АнкетаСостояниеПоддержки);
		ДанныеАнкеты.Свойство("АнкетаДатаОкончанияПоддержки"  ,ПеремДатаОкончанияПоддержки);
		ДанныеАнкеты.Свойство("АнкетаПоследнийКодСостояния"   ,АнкетаПоследнийКодСостояния);
	Иначе
		АнкетаСтатусПодробно = "Анкета не зарегистрирована.";
	КонецЕсли;    
	Если АнкетаПоследнийКодСостояния = 301 ИЛИ АнкетаПоследнийКодСостояния = 303  Тогда
		 Элементы.АнкетаСтатус.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли АнкетаПоследнийКодСостояния = 300 ИЛИ АнкетаПоследнийКодСостояния = 302 Тогда
		 Элементы.АнкетаСтатус.ЦветТекста         = WebЦвета.Красный;
		 Элементы.АнкетаСтатусПодробно.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПеремДатаОкончанияПоддержки) тогда
		АнкетаДатаОкончанияПоддержки = "Нет данных.";
	Иначе
		АнкетаДатаОкончанияПоддержки = Формат(ПеремДатаОкончанияПоддержки,"ДЛФ=DD");
	КонецЕсли;
	Элементы.АнкетаСтатусПодробно.Видимость = ЗначениеЗаполнено(АнкетаСтатусПодробно);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Открвть форму анкеты
Процедура ОткрытьФормуАнкеты(Команда)
	ОткрытьФорму("Обработка.РегистрацияПрограммногоПродукта.Форма.ФормаАнкеты");
КонецПроцедуры

&НаКлиенте
// Закрыть форму
Процедура Ок(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти