
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("UrlRedirect"			, ЭтотОбъект.UrlRedirect);
	Параметры.Свойство("ЭквайринговыйТерминал"	, ЭтотОбъект.ЭквайринговыйТерминал);
	
	Если Параметры.Свойство("АдресШаблона") И ЗначениеЗаполнено(Параметры.АдресШаблона) Тогда
		ПолеТабличногоДокумента = ПолучитьИзВременногоХранилища(Параметры.АдресШаблона); 	
	ИначеЕсли ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		ПолеТабличногоДокумента = ЭтотОбъект.ЭквайринговыйТерминал.Шаблон.Получить();
	КонецЕсли;
	
	ЭтотОбъект.UrlRedirect = ЭтотОбъект.UrlRedirect + СформироватьПараметрыДляЗапросаСтрокой();
	
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(ЭтотОбъект.UrlRedirect, 0, 200);
	
	Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда			
		СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	Иначе
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сгенерировать QR-код, повторите попытку позже.");
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента.РазмерСтраницы = "A4";
		
КонецПроцедуры

&НаСервере
// Функция - Сформировать параметры для запроса строкой
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьПараметрыДляЗапросаСтрокой()
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("method"		, "redirect_sbp");	
	ПараметрыЗапроса.Вставить("acquiring_id", Строка(ЭквайринговыйТерминал.УникальныйИдентификатор()));
	
	СтрокаПараметров = "";
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса Цикл
		СтрокаПараметров = СтрокаПараметров + ?(Не ЗначениеЗаполнено(СтрокаПараметров), "/?", "&") + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение;			
	КонецЦикла;
	
	Возврат СтрокаПараметров;
	
КонецФункции

&НаКлиенте
// Обработчик кнопки добавления картинки
Процедура ДобавитьКартинку(Команда)
	
	Модифицированность	= Истина;	
	ПолеШаблон			= ПолеТабличногоДокумента.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);       
	Индекс				= ПолеТабличногоДокумента.Рисунки.Индекс(ПолеШаблон); 	
	
	ПолеТабличногоДокумента.Рисунки[Индекс].Расположить(ПолеТабличногоДокумента.Область("R2C2"));
	
	ПолеТабличногоДокумента.Рисунки[Индекс].Имя    = "QR" + Индекс;	
	ПолеТабличногоДокумента.Рисунки[Индекс].Высота = 50;
	ПолеТабличногоДокумента.Рисунки[Индекс].Ширина = 50;
	ПолеТабличногоДокумента.Рисунки[Индекс].Линия  = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);	
	
	ПолеШаблон.РазмерКартинки	= РазмерКартинки.Пропорционально;
	ПолеШаблон.Картинка			= Новый Картинка(ДанныеQRКода);
		
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить надпись
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьНадпись(Команда)
	
	Модифицированность	  = Истина;	
	ПолеШаблон            = ПолеТабличногоДокумента.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);       
	ПолеШаблон.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	Индекс                = ПолеТабличногоДокумента.Рисунки.Индекс(ПолеШаблон); 	
	
	ПолеТабличногоДокумента.Рисунки[Индекс].Имя   = "Поле" + Индекс;
	ПолеТабличногоДокумента.Рисунки[Индекс].Текст = "Поле" + Индекс;	
	ПолеТабличногоДокумента.Рисунки[Индекс].Узор  = ТипУзораТабличногоДокумента.БезУзора;
	ПолеТабличногоДокумента.Рисунки[Индекс].Расположить(ПолеТабличногоДокумента.Область("R2C2"));
	ПолеТабличногоДокумента.Рисунки[Индекс].Высота = 10;
	ПолеТабличногоДокумента.Рисунки[Индекс].Ширина = 30;
	ПолеТабличногоДокумента.Рисунки[Индекс].Линия  = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	АдресШаблона = ПоместитьВоВременноеХранилище(ЭтотОбъект.ПолеТабличногоДокумента, Новый УникальныйИдентификатор);	
	Закрыть(Новый Структура("АдресШаблона", АдресШаблона));
	
КонецПроцедуры

#КонецОбласти

