
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипВнешнейСистемы				 = Перечисления.ТипыВнешнихСистем.ЯндексМетрика;
		Объект.КлючПриложения					 = Строка(Новый УникальныйИдентификатор);
		СформироватьНаименование(); 
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	КонецЕсли;
	
	ЗаполнитьСоответствияДоменамСЕ();

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
	СтруктураОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	Оповестить("ЗаписанаВнешняяСистема", СтруктураОповещения);  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();

	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет соответствия доменным именам структурных единиц.
//
Процедура ЗаполнитьСоответствияДоменамСЕ()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|	И НЕ СтруктурныеЕдиницы.ПометкаУдаления");
	
	СписокСЕ = Запрос.Выполнить().Выгрузить();
		
	МассивСтруктурныхЕдиниц = Новый Массив;
		
	СтруктураПараметров = Объект.Ссылка.Параметры.Получить();
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") И СтруктураПараметров.Свойство("МассивСтруктурныхЕдиниц") Тогда				
		МассивСтруктурныхЕдиниц = СтруктураПараметров.МассивСтруктурныхЕдиниц;		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из СписокСЕ Цикл
		
		НоваяСтрока = ЭтотОбъект.СоответствиеСЕИдентификаторамресурса.Добавить();
		НоваяСтрока.СтруктурнаяЕдиница = СтрокаТЧ.Ссылка;
		
		Если ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) Тогда
			
			Для Каждого ЭлементМ Из МассивСтруктурныхЕдиниц Цикл
				
				Если СтрокаТЧ.Ссылка = ЭлементМ.СтруктурнаяЕдиница Тогда
					НоваяСтрока.Счетчик = ЭлементМ.Счетчик;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	МассивСтруктурныхЕдиниц = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СоответствиеСЕИдентификаторамресурса Цикл			
		МассивСтруктурныхЕдиниц.Добавить(Новый Структура("СтруктурнаяЕдиница, Счетчик", СтрокаТч.СтруктурнаяЕдиница, СтрокаТч.Счетчик)); 			
	КонецЦикла;	
	
	ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы = Неопределено Тогда
		ПараметрыВнешнейСистемы = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыВнешнейСистемы.Свойство("МассивСтруктурныхЕдиниц") Тогда
		ПараметрыВнешнейСистемы.МассивСтруктурныхЕдиниц = МассивСтруктурныхЕдиниц;
	Иначе
		ПараметрыВнешнейСистемы.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	КонецЕсли;

	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы); 
	
КонецПроцедуры

 &НаКлиенте
 // Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
 //
 Процедура УдалитьИЗакрыть(Команда)
	 
	 Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	 ЭтотОбъект);	
	 
	 ПоказатьВопрос(Оповещение,
	 "Вы точнохотите пометить на удаление данный элемент справочника?",
	 РежимДиалогаВопрос.ДаНетОтмена,
	 0, 
	 КодВозвратаДиалога.Да
	 );    
	 
	 
 КонецПроцедуры
 
 &НаКлиенте
 // Процедура, помечает внешнюю систему на удаление или снимает пометку.
 //
 Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	 
	 Если Результат = КодВозвратаДиалога.Да Тогда
		 
		 ПометитьНаУдаление();
		 
		 ПараметрыОповещения = Новый Структура;
		 ПараметрыОповещения.Вставить("ВнешняяСистема"	 , Объект.Ссылка);
		 ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		 
		 Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		 
		 ЭтаФорма.Закрыть();
	 КонецЕсли;	
	 
 КонецПроцедуры 
 
 &НаСервере
 // Процедура, помечает внешнюю систему на удаление или снимает пометку.
 //
 Процедура ПометитьНаУдаление()
	 
	 ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
	 ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
	 ВнешняяСистемаОбъект.Используется = Ложь;
	 
	 Попытка
		 ВнешняяСистемаОбъект.Записать();
	 Исключение 
	 КонецПопытки;
	 
 КонецПроцедуры

#КонецОбласти
