
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Клиент"	, Клиент);
	Параметры.Свойство("Касса"	, Касса); 
	
	Печать = ?(ЗначениеЗаполнено(Касса), Не ОбщегоНазначения.ПолучитьЗначениеРеквизита(Касса, "ПриоритетЭлектронногоЧека"), Истина);

	Если ЗначениеЗаполнено(Клиент) Тогда
		КонтактнаяИнформация = МенеджерОборудованияВызовСервера.ПолучитьКонтактнуюИнформацию(Клиент,, Касса);
		ПокупательПочта = КонтактнаяИнформация.Email;
		ПокупательНомер = КонтактнаяИнформация.Телефон;		
	КонецЕсли;
	
	Если ЭтотОбъект.Печать = Истина Тогда
    	ПоEMail 	= Ложь;
	    ПоSMS 		= Ложь;
	Иначе
		
		Если ЗначениеЗаполнено(ПокупательПочта) Тогда
			ПоEMail 								= Истина;
			ПоSMS 									= Ложь; 
			Элементы.ПокупательПочта.Доступность 	= Истина;
		ИначеЕсли ЗначениеЗаполнено(ПокупательНомер) Тогда
			ПоEMail 								= Ложь;
			ПоSMS 									= Истина;
			Элементы.ПокупательНомер.Доступность 	= Истина;
		Иначе
			ЭтотОбъект.Печать = Истина;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	ФорматироватьТелефон();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, обработчик события "ПоSMSПриИзменении".
//
Процедура ПоSMSПриИзменении(Элемент)
		
	Если ЭтотОбъект.Печать = Ложь И ПоSMS = Ложь Тогда
		
		Если ЗначениеЗаполнено(ПокупательПочта) Тогда
			ПоEMail 								= Истина;
			Элементы.ПокупательПочта.Доступность 	= Истина;
		Иначе
			ЭтотОбъект.Печать = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нужно указать почту или телефон клиента для отправки электронного чека.'; en = 'You must specify the client's mail or phone number to send an electronic receipt.'"));
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ПокупательНомер.Доступность = ПоSMS;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПоSMSПриИзменении".
//
Процедура ПоEMailПриИзменении(Элемент)
	
	Если ЭтотОбъект.Печать = Ложь И ПоEMail = Ложь Тогда
		
		Если ЗначениеЗаполнено(ПокупательНомер) Тогда
			ПоSMS 									= Истина;
			Элементы.ПокупательНомер.Доступность 	= Истина;
		Иначе
			ЭтотОбъект.Печать = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нужно указать почту или телефон клиента для отправки электронного чека.'; en = 'You must specify the client's mail or phone number to send an electronic receipt.'"));
		КонецЕсли;
		
	КонецЕсли;

	Элементы.ПокупательПочта.Доступность = ПоEMail;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПечатьПриИзменении(Элемент)
	
	Если ЭтотОбъект.Печать = Ложь Тогда
    	Если ЗначениеЗаполнено(ПокупательПочта) Тогда
			ПоEMail 								= Истина;
			ПоSMS 									= Ложь;
			Элементы.ПокупательПочта.Доступность 	= Истина;
			Элементы.ПокупательНомер.Доступность 	= Ложь;
		ИначеЕсли ЗначениеЗаполнено(ПокупательНомер) Тогда
			ПоEMail 								= Ложь;
			ПоSMS 									= Истина;
			Элементы.ПокупательПочта.Доступность 	= Ложь;
			Элементы.ПокупательНомер.Доступность 	= Истина;
		Иначе
			ЭтотОбъект.Печать = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нужно указать почту или телефон клиента для отправки электронного чека.'; en = 'You must specify the client's mail or phone number to send an electronic receipt.'"));
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОперацияПродолжить".
//
Процедура ОперацияПродолжить(Команда)
	
	Если Не Печать И Не ПоSMS И НЕ ПоEMail Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не выбран способ предоставление чека.'"));
	Иначе
		РезультатВыполнения = Новый Структура();
		РезультатВыполнения.Вставить("Печать", Печать);
		Если ПоEMail Тогда 
			РезультатВыполнения.Вставить("ПокупательEmail", ПокупательПочта);
		КонецЕсли;
		Если ПоSMS Тогда 
			РезультатВыполнения.Вставить("ПокупательНомер", НомерТелефонаОФД);
		КонецЕсли;
		Закрыть(РезультатВыполнения); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОперацияОтмена".
//
Процедура ОперацияОтмена(Команда)
	
	Закрыть(Неопределено); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, форматирует телефон.
//
Процедура ФорматироватьТелефон()
	
	СписокПолей = Новый СписокЗначений;
	УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(ПокупательНомер, СписокПолей, Касса); 
	НомерТелефонаОФД = СписокПолей[0].Значение + СписокПолей[1].Значение + СписокПолей[2].Значение;
	ПокупательНомер = НомерТелефонаОФД;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ПокупательНомерПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ПокупательНомер) Тогда	
		Возврат;	
	КонецЕсли;                                       	
	
	СписокПолей = Новый СписокЗначений;
	УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(ПокупательНомер, СписокПолей); 
	НомерТелефонаОФД = СписокПолей[1].Значение + СписокПолей[2].Значение;
	
КонецПроцедуры


#КонецОбласти
