////////////////////////////////////////////////////////////////////////////////
// Проверка одного или нескольких контрагентов при помощи веб-сервиса ФНС
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область Проверка

#Область ПроверкаОдногоКонтрагента

// Подписка на событие. Добавление в регистр набора ИНН и КПП для последующей проверки рег заданием
// 
Процедура СохранитьРезультатПроверкиКонтрагентаПриЗаписи(КонтрагентОбъект, Отказ) Экспорт 
	
	Если КонтрагентОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	АдресХранилища = Неопределено;
	КонтрагентОбъект.ДополнительныеСвойства.Свойство("АдресХранилища", АдресХранилища);
	СохранитьРезультатПроверкиКонтрагента(КонтрагентОбъект, АдресХранилища);
	
КонецПроцедуры

// Процедура сохранияет результат проверки контрагента.
// 
Процедура СохранитьРезультатПроверкиКонтрагента(КонтрагентОбъект, АдресХранилища) Экспорт 
	
	// Проверяем условия, при которых не требуется запись в регистр
	Если НЕ ПроверкаКонтрагентовВызовСервера.ИспользованиеПроверкиВозможно() ИЛИ КонтрагентОбъект.ЭтоГруппа Тогда 
	 	Возврат;
	КонецЕсли;
	
	// Вместо объекта получаем ссылку
	КонтрагентСсылка 	= КонтрагентОбъект.Ссылка;
	ИНН 				= КонтрагентОбъект.ИНН;
	КПП 				= КонтрагентОбъект.КПП;
	
	Если ЗначениеЗаполнено(АдресХранилища) И ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		// Это запись с открытием формы
		ПеренестиРезультатыПроверкиИзХранилищаВРегистр(КонтрагентСсылка, ИНН, КПП, АдресХранилища);
	Иначе
		// Вы эту ветку попадем, если это запись контрагента:
		// 1. без открытия формы
		// 2. c открытием формы, но фоновое задание по определению состояния контрагента еще не завершилось
		
		// Если контрагент уже записан в регистр, то не записываем его
		// АдресХранилища в функцию ТекущееСостояниеКонтрагента не передаем, так как если мы в этой ветке, значит хранилище не содержит нужных данных
		СостояниеКонтрагента = ПроверкаКонтрагентовВызовСервера.ТекущееСостояниеКонтрагента(КонтрагентСсылка, ИНН, КПП);
		Если ЗначениеЗаполнено(СостояниеКонтрагента) Тогда 
		 	Возврат;
		КонецЕсли;
		
		// Запись в регистр выполняется с пустым состоянием
		// Состояние будет определено позже регламентным заданием
		ЗаписатьКонтрагентаСПустымСостоянием(КонтрагентСсылка, ИНН, КПП);
		
	КонецЕсли;
		
КонецПроцедуры

// Часть фонового задания по проверке контрагента из формы контрагента
// 
Процедура ПроверитьКонтрагентаФоновоеЗадание(Параметры) Экспорт 
	
	// Присвоение даты находится здесь, так как ТекущаяДатаСеанса работает только на сервере
	Если НЕ Параметры.Свойство("Дата") Тогда
		Параметры.Вставить("Дата", НачалоДня(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	Попытка
		ПроверитьКонтрагента(Параметры, Параметры.АдресХранилища);
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка контрагентов.Проверка контрагента из карточки контрагента'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
	КонецПопытки;
	
КонецПроцедуры

// Проверка одного контрагента по ИНН, КПП и Дате
// 
Процедура ПроверитьКонтрагента(Параметры, АдресХранилища = Неопределено) Экспорт 
	
	// Готовим данные в нужном формате для передачи на проверку
	ДанныеКонтрагентов = ПустаяТипизированнаяТаблицаШаблон();
	
	НоваяСтрока = ДанныеКонтрагентов.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры);
	
	ПроверитьКонтрагентов(ДанныеКонтрагентов, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаНесколькихКонтрагентов

// Регламентное задание
// Для модели сервиса обновляет состояния
// Для локального режима обновляет состояния и записывает недостающие ИНН и КПП
Процедура ПроверитьКонтрагентовРегламентноеЗадание() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПроверкаКонтрагентов);
	// Проверяем, включен ли механизм
	Если НЕ ПроверкаКонтрагентовВключена() Тогда
		ОбщегоНазначения.ПриОкончанииВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПроверкаКонтрагентов);
		Возврат;
	КонецЕсли;
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СостоянияКонтрагентов.Контрагент,
		|	СостоянияКонтрагентов.ИНН,
		|	СостоянияКонтрагентов.КПП,
		|	&Дата КАК Дата
		|ИЗ
		|	РегистрСведений.СостоянияКонтрагентов КАК СостоянияКонтрагентов
		|ГДЕ
		|	СостоянияКонтрагентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных)";
		
		// Указываем дату, на которую будет выполняться проверка
		Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
		ДанныеКонтрагентов = Запрос.Выполнить().Выгрузить();
		
		// Выполняется проверка только тех ИНН и КПП, которые записаны в регистр
		ПроверитьКонтрагентов(ДанныеКонтрагентов);
		
		// Дозаписываем недостающие ИНН и КПП в регистр в локальном режиме
		Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
			ПроверитьНепроверенныхКонтрагентов(Ложь);
		КонецЕсли;
		ОбщегоНазначения.ПриОкончанииВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПроверкаКонтрагентов);			
	Исключение
		ОписаниеОшибкиВыполнения = ОписаниеОшибки();
		ОбщегоНазначения.ПриОкончанииВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПроверкаКонтрагентов, ОписаниеОшибкиВыполнения);		
	КонецПопытки;
	
КонецПроцедуры

// Заполняет регистр на основе справочника контрагентов 
// Заполнение выполняется:
// 1. После ручного включения проверки фоновым заданием
// 2. В режиме сервисов - обновлением ИБ в каждой области отдельно
Процедура ПроверитьКонтрагентовПослеВключенияПроверки(Параметры = Неопределено) Экспорт
	
	ЭтоОбновлениеИБВМоделиСервиса = Ложь;
	РазмерПорции = 1000;
	
	Если Параметры = Неопределено Тогда
		// Это заполнение регистра после включения проверки
	Иначе
		// Это обновление ИБ.
		// Обновление должно выполняться только в модели сервиса
		Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
			ЭтоОбновлениеИБВМоделиСервиса = Истина;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьНепроверенныхКонтрагентов(ЭтоОбновлениеИБВМоделиСервиса, Параметры);
	
КонецПроцедуры

// Запускается после включения проверки в предложении на подключение или из настроек
// 
Процедура ПроверитьКонтрагентовПослеВключенияПроверкиФоновоеЗадание() Экспорт
	
	Попытка
	
		ФоновыеЗадания.Выполнить("ПроверкаКонтрагентов.ПроверитьКонтрагентовПослеВключенияПроверки", 
		, "ПроверкаПослеВключенияМеханизма", НСтр("ru = 'Проверка контрагентов'"));

	Исключение
		
		// Исключение возникнет при попытке запуска фонового задания, пока не отработало предыдущее фоновое задание
		// Спецальной обработки не требуется
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка контрагентов.Проверка контрагентов в фоновом задании'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
	КонецПопытки;
	
КонецПроцедуры

// Процедура определяет недействующих контрагентов.
// 
Процедура ОпределитьНедействующихКонтрагентов(ПроверяемыеКонтрагенты) Экспорт 
	
	// Подготавливаем данные для проверки
	ДанныеКонтрагентов = ПроверяемыеКонтрагенты.Скопировать();
	
	// Удаляем пустую колонку из исходной таблицы
	Если ПроверяемыеКонтрагенты.Колонки.Найти("Состояние") <> Неопределено Тогда
		ПроверяемыеКонтрагенты.Колонки.Удалить("Состояние");
	КонецЕсли;
	
	// Проверка веб-сервисом ФНС
	ПроверитьКонтрагентов(ДанныеКонтрагентов,,Ложь);
	
	Состояния = ПроверкаКонтрагентовКлиентСервер.СостоянияНедействующегоКонтрагента(Истина, Истина);
	
	ЗаполнитьСостояния(ПроверяемыеКонтрагенты, ДанныеКонтрагентов, Состояния);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область НастройкиПроверки

// Установка значения константе ИспользоватьПроверкуКонтрагентов 
// 
Процедура СохранитьЗначенияНастроек(ИспользоватьСервис) Экспорт
	
	// Устанавливаем значение константы 
	Константы.ИспользоватьПроверкуКонтрагентов.Установить(ИспользоватьСервис);

КонецПроцедуры

// Функция возвращает значения настроек.
// 
Функция ЗначенияНастроек() Экспорт
	
	// заполняем общие настройки
	ИспользоватьСервис 	= Константы.ИспользоватьПроверкуКонтрагентов.Получить();
	АдресСервиса 		= "http://npchk.nalog.ru/FNSNDSCAWS?wsdl";
	
	Возврат Новый Структура("ИспользоватьСервис, АдресСервиса", ИспользоватьСервис, АдресСервиса);
	
КонецФункции

// Функция возвращает свойство включения проверки контрагентов.
// 
Функция ПроверкаКонтрагентовВключена() Экспорт
	
	// Проверка, что сервис включен
	НастройкиСервиса = ПроверкаКонтрагентов.ЗначенияНастроек();
	ИспользоватьСервис = НастройкиСервиса.ИспользоватьСервис;

	Возврат ИспользоватьСервис;
	
КонецФункции

// Функция проверяет наличие права на использование проверки.
// 
Функция ЕстьПравоНаИспользованиеПроверки() Экспорт
	
	Возврат ?(Метаданные.Роли.Найти("БазовыеПрава") <> Неопределено И РольДоступна("БазовыеПрава") Или РольДоступна("ПолныеПрава"), Истина, Ложь);
	
КонецФункции

// Функция проверяет наличие права на редактирование настроек.
// 
Функция ЕстьПравоНаРедактированиеНастроек() Экспорт
	
	Возврат ?(Метаданные.Роли.Найти("Администратор") <> Неопределено И РольДоступна("Администратор") Или РольДоступна("ПолныеПрава"), Истина, Ложь);
	
КонецФункции

// Функция возвращает WS прокси сервиса.
// 
Функция ПроксиСервиса(ОписаниеОшибки = "") Экспорт
	
	WSПрокси = Неопределено;
	Попытка
	
		НастройкиСервиса = ЗначенияНастроек();
		АдресСервиса = НастройкиСервиса.АдресСервиса;
		
		Если НЕ ЗначениеЗаполнено(АдресСервиса) Тогда
			ОписаниеОшибки = НСтр("ru = 'Не указан адрес сервиса проверки данных по контрагенту'");
		Иначе
			WSПрокси = ПолучитьWSПрокси(АдресСервиса);
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка контрагентов.Ошибка доступа к веб-сервису проверки контрагентов'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		ОписаниеОшибки = ИнформацияОбОшибке.Описание;

	КонецПопытки; 
	
	Возврат WSПрокси;
	
КонецФункции

// Функция проверяет наличие доступа к веб срвису ФНС.
// 
Функция ЕстьДоступКВебСервисуФНС() Экспорт
	
	Прокси = ПроксиСервиса();
	Возврат Прокси <> Неопределено;
	
КонецФункции

// Функция возвращает значение настройки "БольшеНеПоказыватьПредложениеПодключиться".
// 
Функция БольшеНеПоказыватьПредложениеПодключиться() Экспорт
	
	Возврат ХранилищеОбщихНастроек.Загрузить("ПроверкаКонтрагентов_БольшеНеПоказыватьПредложениеИспользоватьСервис") = Истина;
	
КонецФункции

// Процедура сохраняет дату последнего отображения предложения подключиться.
// 
Процедура СохранитьДатуПоследнегоОтображенияПредложенияПодключиться() Экспорт
	
	ХранилищеОбщихНастроек.Сохранить("ПроверкаКонтрагентов_ДатаПоследнегоОтображенияПредложенияНаВключениеСервиса", , ТекущаяДатаСеанса());
	
КонецПроцедуры

#КонецОбласти

#Область Надписи

// Текст предупреждения про тестовый режим работы сервиса.
// 
Функция ТекстПредупрежденияПроТестовыйРежимРаботыСервиса() Экспорт
	
	Возврат НСтр("ru = 'В настоящее время веб-сервис ФНС работает в тестовом режиме'");
	
КонецФункции

// Процедура установки надписи в панели отчета при создании на сервере.
// 
Процедура УстановитьНадписиВПанелиОтчетаПриСозданииНаСервере(Форма) Экспорт
	
	СсылкаНаИнструкцию = Новый ФорматированнаяСтрока(" ", ПроверкаКонтрагентовКлиентСервер.СсылкаНаИнструкцию());
	
	// Все контрагенты корректны
	ЭлементФормы = Форма.Элементы.Найти("ТекстПриКорректныхКонтрагентах");
	Если ЭлементФормы <> Неопределено Тогда
		ЭлементФормы.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Проверка контрагентов по данным ФНС выполнена успешно'"), СсылкаНаИнструкцию);
	КонецЕсли;
	
	// Есть некорректные контрагенты
	ЭлементФормы = Форма.Элементы.Найти("ТекстПриНекорректныхКонтрагентах");
	Если ЭлементФормы <> Неопределено Тогда
		ЭлементФормы.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Обнаружены недействующие контрагенты по данным ФНС'"), СсылкаНаИнструкцию);
	КонецЕсли;
	
	// Выполняется проверка
	ЭлементФормы = Форма.Элементы.Найти("ТекстПриПроверкеВПроцессеВыполнения");
	Если ЭлементФормы <> Неопределено Тогда
		ЭлементФормы.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Выполняется проверка контрагентов согласно данным ФНС'"), СсылкаНаИнструкцию);
	КонецЕсли;
	
	// Нет доступа к сервису
	ЭлементФормы = Форма.Элементы.Найти("ТекстНетДоступаКСервису");
	Если ЭлементФормы <> Неопределено Тогда
		ЭлементФормы.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Не удалось произвести проверку контрагентов: сервис ФНС временно недоступен'"), СсылкаНаИнструкцию);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

// Процедура переноса результата проверки из хранилища в регистр.
// 
Процедура ПеренестиРезультатыПроверкиИзХранилищаВРегистр(Знач КонтрагентСсылка, ИНН, КПП, АдресХранилища) Экспорт
	
	ДанныеКонтрагентов = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если НЕ ЗначениеЗаполнено(ДанныеКонтрагентов) Тогда
		ЗаписатьКонтрагентаСПустымСостоянием(КонтрагентСсылка, ИНН, КПП);
		Возврат;
	КонецЕсли;
	
	ДанныеКонтрагента = ДанныеКонтрагентов[0];
	
	// Проверяем, что данные в хранилище еще не устарели 
	Если ИНН = ДанныеКонтрагента.ИНН И КПП = ДанныеКонтрагента.КПП Тогда
		ДанныеКонтрагента.Контрагент = КонтрагентСсылка;
		// Переносим результат проверки из хранилище в регистр
		СохранитьРезультатыПроверкиВРегистр(ДанныеКонтрагентов);
	Иначе
		ЗаписатьКонтрагентаСПустымСостоянием(КонтрагентСсылка, ИНН, КПП);
	Конецесли;
	
КонецПроцедуры

// Функция возвращает адрес хранилища с восстановленным состоянием контрагента.
// 
Функция АдресХранилищаСВосстановленнымСостояниемКонтрагента(КонтрагентСсылка, ИНН, КПП, УникальныйИдентификатор) Экспорт
	
	Состояние = Перечисления.СостоянияСуществованияКонтрагента.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СостоянияКонтрагентов.Состояние,
	               |	СостоянияКонтрагентов.ИНН,
	               |	СостоянияКонтрагентов.КПП,
	               |	СостоянияКонтрагентов.Контрагент
	               |ИЗ
	               |	РегистрСведений.СостоянияКонтрагентов КАК СостоянияКонтрагентов
	               |ГДЕ
	               |	СостоянияКонтрагентов.Контрагент = &Контрагент
	               |	И СостоянияКонтрагентов.ИНН = &ИНН
	               |	И СостоянияКонтрагентов.КПП = &КПП";

	Запрос.УстановитьПараметр("ИНН",		ИНН);
	Запрос.УстановитьПараметр("КПП", 		КПП);
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	// Определяем состояние из регистра
	ДанныеКонтрагентов = ПустаяТипизированнаяТаблицаШаблон();
	НоваяСтрока = ДанныеКонтрагентов.Добавить();

	Если РезультатЗапроса.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЗапроса);
	Иначе
		НоваяСтрока.Контрагент 	= КонтрагентСсылка;
		НоваяСтрока.ИНН 		= ИНН;
		НоваяСтрока.КПП 		= КПП;
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеКонтрагентов, УникальныйИдентификатор);
		
КонецФункции

// Функция возвращает пустая типизированная таблица.
// 
Функция ПустаяТипизированнаяТаблицаШаблон() Экспорт
	
	// Создаем таблицу
	ДанныеКонтрагентов = Новый ТаблицаЗначений;
	ДанныеКонтрагентов.Колонки.Добавить("Контрагент", 	Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДанныеКонтрагентов.Колонки.Добавить("ИНН", 			Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12)));
	ДанныеКонтрагентов.Колонки.Добавить("КПП", 			Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(9)));
	ДанныеКонтрагентов.Колонки.Добавить("Дата", 		Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ДанныеКонтрагентов.Колонки.Добавить("Состояние", 	Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияСуществованияКонтрагента"));
	
	Возврат ДанныеКонтрагентов;
	
КонецФункции

// Процедура сохраняет результаты проверки в хранилище.
// 
Процедура СохранитьРезультатыПроверкиВХранилище(ДанныеКонтрагентов, АдресХранилища = Неопределено) Экспорт
	
	// Если контрагент новый, то при изменении ИНН и КПП у нас еще нет ссылки и записать в регистр невозможно
	// Поэтому сохраняем результат в хранилище, а при записи контрагента, когда появится ссылка, переносим результаты проверки в регистр
	Если ДанныеКонтрагентов.Количество() = 1 И ЗначениеЗаполнено(АдресХранилища) Тогда
		ПоместитьВоВременноеХранилище(ДанныеКонтрагентов, АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проверка

// Проверка нескольких контрагентов
// 
Процедура ПроверитьКонтрагентов(ДанныеКонтрагентов, АдресХранилища = Неопределено, ЭтоПроверкаСправочникаКонтрагентов = Истина)
	
	// Если нет доступа к веб-сервису, то проверку не выполняем
	Если НЕ ПроверкаКонтрагентов.ЕстьДоступКВебСервисуФНС() Тогда
		Возврат;
	КонецЕсли;
	
	// Если по некоторым контрагентам можно определить, что они не существуют, не обращаясь к сервису, то к сервису по ним обращаться не будем
	Если ЭтоПроверкаСправочникаКонтрагентов Тогда
		ПолучитьСостоянияКонтрагентовИзКэша(ДанныеКонтрагентов);
	КонецЕсли;
	
	// Приведение данных к нужному формату, выявление записей с ошибками 
	ПодготовитьДанныеКПроверке(ДанныеКонтрагентов);
	
	// Получение результатов проверки от веб-сервиса
	// Проверяем только тех контрагентов, у которых неопределено состояние существования и у которых нет ошибок
	Отбор = Новый Структура();
	Отбор.Вставить("Состояние", Перечисления.СостоянияСуществованияКонтрагента.ПустаяСсылка());
	ПолучитьРезультатПроверкиВебСервисом(ДанныеКонтрагентов, Отбор);
	
	Если ЭтоПроверкаСправочникаКонтрагентов Тогда
		Если ЗначениеЗаполнено(АдресХранилища) Тогда
			СохранитьРезультатыПроверкиВХранилище(ДанныеКонтрагентов, АдресХранилища);
		Иначе
			СохранитьРезультатыПроверкиВРегистр(ДанныеКонтрагентов);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

// Процедура проверяет контрагентов в документе.
// 
Процедура ПроверитьКонтрагентовВДокументе(Параметры) Экспорт
	
	ПроверяемыеКонтрагенты 	= Параметры.ДанныеКонтрагентов;
	АдресХранилища 			= Параметры.АдресРезультатаПроверкиКонтрагентов;
	
	// Если нет доступа к веб-сервису, то проверку не выполняем
	Если ПроверкаКонтрагентов.ЕстьДоступКВебСервисуФНС() Тогда
		
		ДанныеКонтрагентов = ПроверяемыеКонтрагенты.Скопировать();
		ПроверитьКонтрагентов(ДанныеКонтрагентов, АдресХранилища, Ложь);
		
		ЗаполнитьСостояния(ПроверяемыеКонтрагенты, ДанныеКонтрагентов);
		
		Результат = Новый Структура;
		Результат.Вставить("ДанныеКонтрагентов", ПроверяемыеКонтрагенты);
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("НетДоступаКВебСервисуФНС", Истина);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьВРегистрСведений

Процедура СохранитьРезультатыПроверкиВРегистр(ДанныеКонтрагентов)
	
	Для каждого ДанныеКонтрагента Из ДанныеКонтрагентов Цикл
		
		Если НЕ ЗначениеЗаполнено(ДанныеКонтрагента.ИНН) Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			Контрагент							= ДанныеКонтрагента.Контрагент;
					
			// Записываем данные в регистр
			НаборЗаписей = РегистрыСведений.СостоянияКонтрагентов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
			НаборЗаписей.Очистить();
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ДанныеКонтрагента); 
			
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Проверка контрагентов.Запись результатов проверки контрагентов в регистр'"), 
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьКонтрагентаСПустымСостоянием(КонтрагентСсылка, ИНН, КПП) 
	
	// Формируем данные для записи в регистр
	ДанныеКонтрагентов = ПустаяТипизированнаяТаблицаШаблон();
	
	НоваяСтрока = ДанныеКонтрагентов.Добавить();
	НоваяСтрока.Контрагент 	= КонтрагентСсылка;
	НоваяСтрока.ИНН 		= ИНН;
	НоваяСтрока.КПП 		= КПП;
	
	СохранитьРезультатыПроверкиВРегистр(ДанныеКонтрагентов);
		
КонецПроцедуры

#КонецОбласти

#Область РаботаСВебСервисом

// Получение результата проверки веб сервисом.
// 
Процедура ПолучитьРезультатПроверкиВебСервисом(ДанныеКонтрагентов, Отбор) Экспорт
	
	// Проверяем только тех контрагентов, которые соответствуют указанному отбору
	ДанныеКонтрагентовДляПроверкиСервисом = ДанныеКонтрагентов.НайтиСтроки(Отбор);
	КоличествоКонтрагентов = ДанныеКонтрагентовДляПроверкиСервисом.Количество();

	Если КоличествоКонтрагентов = 0 Тогда
		// Нет данных для проверки
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверкаКонтрагентов.ЕстьДоступКВебСервисуФНС() Тогда
		// Нет доступа к веб-сервису
		Возврат;
	КонецЕсли;
	
	Прокси = ПроверкаКонтрагентов.ПроксиСервиса();
	
	ПространствоИмен = "http://ws.unisoft/FNSNDSCAWS/Request";
	
	РазмерПорции = 10000;
	
	// Разбиваем всю таблицу на блоки запросов 
	КоличествоЗапросов = ?(КоличествоКонтрагентов % РазмерПорции = 0, КоличествоКонтрагентов / РазмерПорции, Цел(КоличествоКонтрагентов / РазмерПорции) + 1);
		
	// Выполняем несколько запросов. В каждом запросе не более 10000 строк
	Для НомерПорции = 1 По КоличествоЗапросов Цикл 
		
		МинимальныйНомерКонтрагента 	= Мин(РазмерПорции * (НомерПорции - 1), КоличествоКонтрагентов);
		МаксимальныйНомерКонтрагента 	= Мин(РазмерПорции * НомерПорции, КоличествоКонтрагентов) - 1;

		WSЗапрос = Прокси.ФабрикаXDTO.Создать(Прокси.ФабрикаXDTO.Тип(ПространствоИмен, "NdsRequest"));
		
		Для ИндексТекущегоКонтрагента = МинимальныйНомерКонтрагента По МаксимальныйНомерКонтрагента Цикл
			
			ДанныеКонтрагента = ДанныеКонтрагентовДляПроверкиСервисом[ИндексТекущегоКонтрагента];
			ДобавитьКонтрагентаВЗапросКСервису(WSЗапрос, Прокси, ПространствоИмен, ДанныеКонтрагента); 
			
		КонецЦикла;
		
		Если WSЗапрос.NP.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем результат проверки от сервиса
		NdsResponse = Прокси.NdsRequest(WSЗапрос);
		ОбработатьОтветСервиса(NdsResponse, ДанныеКонтрагентовДляПроверкиСервисом, МинимальныйНомерКонтрагента, МаксимальныйНомерКонтрагента);
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ДобавитьКонтрагентаВЗапросКСервису(WSЗапрос, Прокси, ПространствоИмен, ДанныеКонтрагента)
	
	Попытка
	
		WSКонтрагент = Прокси.ФабрикаXDTO.Создать(Прокси.ФабрикаXDTO.Тип(ПространствоИмен, "NdsRequest_NP"));
	
		// Указываем ИНН, КПП и Дату
		WSКонтрагент.INN = ДанныеКонтрагента.ИНН;
		Если ЗначениеЗаполнено(ДанныеКонтрагента.КПП) Тогда
			WSКонтрагент.KPP = ДанныеКонтрагента.КПП;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКонтрагента.Дата)Тогда
			WSКонтрагент.DT = ДатаСтрокой(ДанныеКонтрагента.Дата);
		КонецЕсли;
		
		// Добавляем данные по контрагенту в список на проверку
		WSЗапрос.NP.Добавить(WSКонтрагент);

	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ДанныеКонтрагента.Состояние = Перечисления.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных;
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка контрагентов.Формирование данных для обращения к сервису ФНС'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки; 
				
КонецПроцедуры

Процедура ОбработатьОтветСервиса(NdsResponse, ДанныеКонтрагентовДляПроверкиСервисом, МинимальныйНомерКонтрагента, МаксимальныйНомерКонтрагента)
	
	ИндексТекущегоОтвета = 0;
	Для ИндексТекущегоКонтрагента = МинимальныйНомерКонтрагента По МаксимальныйНомерКонтрагента Цикл 
		ДанныеКонтрагента = ДанныеКонтрагентовДляПроверкиСервисом[ИндексТекущегоКонтрагента];
		Если ДанныеКонтрагента.Состояние <> Перечисления.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных Тогда
			
			Попытка

				// Ответ от сервиса
				ОтветПоКонтрагенту 			= NdsResponse.NP[ИндексТекущегоОтвета];
				СостояниеВОтвете 			= ОтветПоКонтрагенту.State;
				ДанныеКонтрагента.Состояние	= СостояниеНаОсновеОтветаСервиса(ДанныеКонтрагента, СостояниеВОтвете);
				
			Исключение
		
				ОтменитьТранзакцию();
				
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				
				ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Проверка контрагентов.Обработка ответа от веб-сервиса'"), 
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			КонецПопытки;
			
			ИндексТекущегоОтвета = ИндексТекущегоОтвета + 1;
		КонецЕсли;
		
	КонецЦикла;
				
КонецПроцедуры

#Область НастройкиВебСервиса

Функция ПолучитьWSПрокси(АдресСервиса) 
	
	WSПрокси = ВнутренняяWSПрокси(
			АдресWSDL(АдресСервиса),
			"http://ws.unisoft",
			"FNSNDSCAWS",
			"FNSNDSCAWS_Port",
			Неопределено,
			Неопределено,
			30);
		
	Возврат WSПрокси;
	
КонецФункции

Функция АдресWSDL(URI)
	
	Адрес = СокрЛП(URI);
	Если Найти(НРег(Адрес), "?wsdl") = СтрДлина(Адрес) - 4 Тогда
		Возврат Адрес;
	Иначе
		Возврат Адрес + "?wsdl";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

// Проверка ошибок, удаление дублей
Процедура ПодготовитьДанныеКПроверке(ДанныеКонтрагентовДляПроверки)
	
	// Создаем таблицу
	ДанныеКонтрагентов = ПустаяТипизированнаяТаблицаШаблон();
	
	// Копируем таблицу, сохраняя типы колонок
	Для каждого ДанныеКонтрагентаДляПроверки Из ДанныеКонтрагентовДляПроверки Цикл
		// Копируем данные из таблицы с "сырыми данными" в таблицу с "типизированными" колонками
		ДанныеКонтрагента = ДанныеКонтрагентов.Добавить();
		ЗаполнитьЗначенияСвойств(ДанныеКонтрагента, ДанныеКонтрагентаДляПроверки, "Контрагент, ИНН, КПП, Состояние, Дата");
		
		Если ДанныеКонтрагента.Состояние <> Перечисления.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных Тогда
			// Проверяем ошибки, приводим данные к нужному формату
			ПодготовитьДанныеКПроверкеПоКаждомуКонтрагенту(ДанныеКонтрагента);
		КонецЕсли;
	КонецЦикла;
	
	// Удаляем из таблицы дубли
	ДанныеКонтрагентов.Свернуть("Контрагент, ИНН, КПП, Дата, Состояние");
	
	ДанныеКонтрагентовДляПроверки = ДанныеКонтрагентов;
	
КонецПроцедуры

// Проверка ошибок по одному контрагенту
Процедура ПодготовитьДанныеКПроверкеПоКаждомуКонтрагенту(ДанныеКонтрагента)
	
	Ошибка = "";
	
	// Страна
	// Проверяем только российских контрагентов
	Если Метаданные.Справочники.Контрагенты.Реквизиты.Найти("СтранаРегистрации") <> Неопределено Тогда
		СтранаРегистрации = ДанныеКонтрагента.Контрагент.СтранаРегистрации;
		Если СтранаРегистрации <> Справочники.СтраныМира.Россия 
			И СтранаРегистрации <> Справочники.СтраныМира.ПустаяСсылка() Тогда
			ДанныеКонтрагента.Состояние = Перечисления.СостоянияСуществованияКонтрагента.НеПодлежитПроверке;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// ЭтоЮрЛицо
	Если СтрДлина(СокрЛП(ДанныеКонтрагента.ИНН)) = 10 И СтрДлина(СокрЛП(ДанныеКонтрагента.КПП)) = 9 Тогда
		ЭтоЮрЛицо = Истина;
	ИначеЕсли СтрДлина(СокрЛП(ДанныеКонтрагента.ИНН)) = 12 И СтрДлина(СокрЛП(ДанныеКонтрагента.КПП)) = 0 Тогда
		ЭтоЮрЛицо = Ложь;
	Иначе
		ДанныеКонтрагента.Состояние = Перечисления.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных;
		Возврат;
	КонецЕсли;
	
	// Дата
	Если Не ЗначениеЗаполнено(ДанныеКонтрагента.Дата) Тогда
		ДанныеКонтрагента.Дата = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	// ИНН
	ДанныеКонтрагента.ИНН = СокрЛП(ДанныеКонтрагента.ИНН);
	ИНН = ДанныеКонтрагента.ИНН;
	ИННСоответствуетТребованиям = ПроверкаКонтрагентовКлиентСервер.ИННСоответствуетТребованиям(ИНН, ЭтоЮрЛицо, Ошибка);
	Если Лев(ИНН, 2) = "00" ИЛИ НЕ ИННСоответствуетТребованиям Тогда
		ДанныеКонтрагента.Состояние = Перечисления.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных;
		Возврат;
	КонецЕсли;
	
	// КПП
	Если ЭтоЮрЛицо Тогда
		ДанныеКонтрагента.КПП = СокрЛП(ДанныеКонтрагента.КПП);
		КПП = ДанныеКонтрагента.КПП;
		КППСоответствуетТребованиям = ПроверкаКонтрагентовКлиентСервер.КППСоответствуетТребованиям(КПП, Ошибка);
		Если НЕ КППСоответствуетТребованиям Тогда
			ДанныеКонтрагента.Состояние = Перечисления.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСостоянияКонтрагентовИзКэша(ДанныеКонтрагентов)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	ДанныеКонтрагентов.Контрагент,
	              |	ДанныеКонтрагентов.ИНН,
	              |	ДанныеКонтрагентов.КПП,
	              |	ДанныеКонтрагентов.Дата
				  |ПОМЕСТИТЬ ДанныеКонтрагентов
	              |ИЗ
	              |	&ДанныеКонтрагентов КАК ДанныеКонтрагентов
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	ДанныеКонтрагентов.Контрагент,
	              |	ДанныеКонтрагентов.ИНН,
	              |	ДанныеКонтрагентов.КПП,
	              |	ДанныеКонтрагентов.Дата,
	              |	ВЫБОР
	              |		КОГДА СостоянияКонтрагентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных)
	              |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСуществованияКонтрагента.СодержитОшибкиВДанных)
	              |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияСуществованияКонтрагента.ПустаяСсылка)
	              |	КОНЕЦ КАК Состояние
				  |ИЗ
	              |	ДанныеКонтрагентов КАК ДанныеКонтрагентов
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияКонтрагентов КАК СостоянияКонтрагентов
	              |		ПО ДанныеКонтрагентов.Контрагент = СостоянияКонтрагентов.Контрагент
	              |			И ДанныеКонтрагентов.ИНН = СостоянияКонтрагентов.ИНН
	              |			И ДанныеКонтрагентов.КПП = СостоянияКонтрагентов.КПП";
	
	Запрос.УстановитьПараметр("ДанныеКонтрагентов", ДанныеКонтрагентов);
	ДанныеКонтрагентов = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Функция ДатаСтрокой(Дата)
	
	Результат = Неопределено;
	Если ТипЗнч(Дата) = Тип("Строка") Тогда 
		// Дата уже в нужном формате в виде строки
		Результат = Дата;
	ИначеЕсли ТипЗнч(Дата) = Тип("Дата") Тогда 
		Результат = Формат(Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СостояниеНаОсновеОтветаСервиса(ДанныеКонтрагента, Ответ)
	
	Если Ответ = "0" Тогда
		Состояние = Перечисления.СостоянияСуществованияКонтрагента.Действует;
	ИначеЕсли Ответ = "1" Тогда
		Состояние = Перечисления.СостоянияСуществованияКонтрагента.ПрекратилДеятельность;
	ИначеЕсли Ответ = "3" Тогда
		Состояние = Перечисления.СостоянияСуществованияКонтрагента.КППНеСоответствуетИНН;
	ИначеЕсли Ответ = "4" Тогда
		Состояние = Перечисления.СостоянияСуществованияКонтрагента.ОтсутствуетВРеестре;
	КонецЕсли;
		
	Возврат Состояние;
	
КонецФункции

Процедура ПроверитьНепроверенныхКонтрагентов(ЭтоОбновлениеИБВМоделиСервиса, Параметры = Неопределено)
	
	// Выбираем контрагентов, которых нет в регистре сведений и у которых заполнен ИНН
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	Контрагенты.ИНН,
		|	Контрагенты.КПП,
		|	&Дата КАК Дата
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияКонтрагентов КАК СостоянияКонтрагентов
		|		ПО Контрагенты.Ссылка = СостоянияКонтрагентов.Контрагент
		|ГДЕ
		|	(СостоянияКонтрагентов.Состояние ЕСТЬ NULL 
		|	ИЛИ СостоянияКонтрагентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСуществованияКонтрагента.ПустаяСсылка))
		|	И Контрагенты.ИНН <> """"
		|	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
		
	// Если ЭтоОбновлениеИБВМоделиСервиса Тогда
	// 	РазмерПорции = 1000;
	// 	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РАЗЛИЧНЫЕ", "РАЗЛИЧНЫЕ ПЕРВЫЕ "+ Формат(РазмерПорции, "ЧГ=0"));
	// КонецЕсли;

	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
	ДанныеКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	// Прерываем обновление, если не осталось необработанных данных
	// Если ЭтоОбновлениеИБВМоделиСервиса Тогда
	// 	Параметры.ОбработкаЗавершена = ДанныеКонтрагентов.Количество() = 0;
	// 	Если Параметры.ОбработкаЗавершена Тогда
	// 		Возврат;
	// 	КонецЕсли;
	// КонецЕсли;
	
	ПроверитьКонтрагентов(ДанныеКонтрагентов);
	
КонецПроцедуры

Процедура ЗаполнитьСостояния(ПроверяемыеКонтрагенты, ДанныеКонтрагентов, Состояния = Неопределено)
	
	// Соединяем результаты проверки с исходной таблицей
	Запрос = Новый Запрос;
	Если ПроверяемыеКонтрагенты.Колонки.Найти("Состояние") <> Неопределено Тогда
		ПроверяемыеКонтрагенты.Колонки.Удалить("Состояние");
	КонецЕсли;
	ПоместитьТаблицуЗначенийВоВременнуюТаблицу(ПроверяемыеКонтрагенты, Запрос, "ПроверяемыеКонтрагенты");
		
	ПоместитьТаблицуЗначенийВоВременнуюТаблицу(ДанныеКонтрагентов, 	Запрос, "ДанныеКонтрагентов");
	
	// По всем контрагентам определяем состояние
	// В таблице оставляем только контрагентов с ошибками
	Запрос.Текст = Запрос.Текст + "
		|ВЫБРАТЬ 
		| 	" + ПредставлениеКолонок(ПроверяемыеКонтрагенты, "ПроверяемыеКонтрагенты.") + ", 
		| 	ДанныеКонтрагентов.Состояние КАК Состояние
		|ИЗ 
		|	ПроверяемыеКонтрагенты КАК ПроверяемыеКонтрагенты
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонтрагентов КАК ДанныеКонтрагентов
		|	ПО ПроверяемыеКонтрагенты.Контрагент = ДанныеКонтрагентов.Контрагент
		|		И ПроверяемыеКонтрагенты.ИНН = ДанныеКонтрагентов.ИНН
		|		И ПроверяемыеКонтрагенты.КПП = ДанныеКонтрагентов.КПП
		|		И (НАЧАЛОПЕРИОДА(ПроверяемыеКонтрагенты.Дата, День) = НАЧАЛОПЕРИОДА(ДанныеКонтрагентов.Дата, День)
		|		ИЛИ НАЧАЛОПЕРИОДА(ПроверяемыеКонтрагенты.Дата, День) = ДатаВремя(1,1,1))";
		
	Если Состояния <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
			|
			|ГДЕ
			|	ДанныеКонтрагентов.Состояние В (&Состояния)";
		
		Запрос.УстановитьПараметр("Состояния", Состояния);
	Конецесли;
		
	ПроверяемыеКонтрагенты = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ПоместитьТаблицуЗначенийВоВременнуюТаблицу(Таблица, Запрос, ИмяВременнойТаблицы)
	
	ПредставлениеКолонок = ПредставлениеКолонок(Таблица);
	
	Запрос.Текст = Запрос.Текст + "
		|ВЫБРАТЬ 
		| " + ПредставлениеКолонок + "
		| ПОМЕСТИТЬ " + ИмяВременнойТаблицы + "
		| ИЗ &" + ИмяВременнойТаблицы + " КАК " + ИмяВременнойТаблицы + ";
		|////////////////////////////////////////////////////////////////////////////////////////////////// ";
	
	Запрос.УстановитьПараметр(ИмяВременнойТаблицы, Таблица);
	
КонецПроцедуры

Функция ПредставлениеКолонок(Таблица, СинонимТаблицы = "")
	
	КолонкиИсходнойТаблицы = Новый Массив;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		КолонкиИсходнойТаблицы.Добавить(СинонимТаблицы + Колонка.Имя);
	КонецЦикла;
	
	ПредставлениеКолонок = СтрокаИзМассиваПодстрок(КолонкиИсходнойТаблицы, "," + Символы.ПС);
	Возврат ПредставлениеКолонок;
	
КонецФункции

// / Объединяет строки из массива в строку с разделителями.
// 
// Параметры:
//  Массив      - Массив - массив строк которые необходимо объединить в одну строку;
//  Разделитель - Строка - любой набор символов, который будет использован в качестве разделителя.
// 
// Возвращаемое значение:
//  Строка - строка с разделителями.
// 
Функция СтрокаИзМассиваПодстрок(Массив, Разделитель = ",", СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = "";
	
	Для Индекс = 0 По Массив.ВГраница() Цикл
		Подстрока = Массив[Индекс];
		
		Если СокращатьНепечатаемыеСимволы Тогда
			Подстрока = СокрЛП(Подстрока);
		КонецЕсли;
		
		Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
			Подстрока = Строка(Подстрока);
		КонецЕсли;
		
		Если Индекс > 0 Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		
		Результат = Результат + Подстрока;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает объект WSПрокси созданный с переданными параметрами.
// 
// Параметры:
//  АдресWSDL           - Строка - месторасположение wsdl
//  URIПространстваИмен - Строка - URI пространства имен web-сервиса
//  ИмяСервиса          - Строка - имя сервиса
//  ИмяТочкиПодключения - Строка - если не задано, образуется как <ИмяСервиса>Soap
//  ИмяПользователя     - Строка - имя пользователя для входа на сервер
//  Пароль              - Строка - пароль пользователя
//  Таймаут             - Число  - таймаут на операции выполняемые через полученное прокси 
// 
// Возвращаемое значение:
//  WSПрокси
// 
Функция ВнутренняяWSПрокси(Знач АдресWSDL, Знач URIПространстваИмен, Знач ИмяСервиса,
	Знач ИмяТочкиПодключения = "", Знач ИмяПользователя, Знач Пароль,
	Знач Таймаут = 0) Экспорт
	
	WSОпределения = Новый WSОпределения(АдресWSDL, ИмяПользователя, Пароль);
	
	Если ПустаяСтрока(ИмяТочкиПодключения) Тогда
		ИмяТочкиПодключения = ИмяСервиса + "Soap";
	КонецЕсли;
	
	ИнтернетПрокси = Неопределено;
	ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси(АдресWSDL);
		
	Прокси = Новый WSПрокси(WSОпределения, URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения, ИнтернетПрокси, Таймаут);
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль       = Пароль;
	
	Возврат Прокси;
КонецФункции

#КонецОбласти

#КонецОбласти