#Область СлужебныйПрограммныйИнтерфейс

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

Процедура ДействиеКИНажатие(Форма, Элемент) Экспорт
	
	ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("ДействиеКИ_")+1));
	ДанныеКИ = Форма.КонтактнаяИнформация[ИндексКИ];
	
	Если ЗначениеЗаполнено(ДанныеКИ.Представление) Тогда
		
		Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			
			IPТелефонияКлиент.ИсходящийЗвонокОсуществитьПоКонтрагенту(Форма.Объект.Ссылка, ДанныеКИ.Представление);
			
		ИначеЕсли  ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
			
			ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", Новый Структура("Предмет, Адрес", Форма.Объект.Ссылка, ДанныеКИ.Представление));
			ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыОткрытия);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("ДействиеКИ_")+1));
	//ДанныеКИ = Форма.КонтактнаяИнформация[ИндексКИ];
	//
	//ОснованиеЗаполнения = Новый Структура("Контакт", Форма.Объект.Ссылка);
	//
	//ЗначенияЗаполнения = Новый Структура("ТипСобытия,ОснованиеЗаполнения", 
	//	ТипСобытияПоТипуКонтактнойИнформации(ДанныеКИ.Тип),
	//	ОснованиеЗаполнения);
	//	
	//ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	//ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура ПредставлениеКИПриИзменении(Форма, Элемент, Знач ПроверкаДублирования = Ложь) Экспорт
	
	ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("ПредставлениеКИ_")+1));
	ДанныеКИ = Форма.КонтактнаяИнформация[ИндексКИ];
	
	Если ПустаяСтрока(ДанныеКИ.Представление) Тогда
		ДанныеКИ.ЗначенияПолей = "";
	Иначе
		ДанныеКИ.ЗначенияПолей = КонтактнаяИнформацияВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(ДанныеКИ.Представление, ДанныеКИ.Вид);
	КонецЕсли;
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		КонтактнаяИнформацияКлиентСервер.ЗаполнитьСписокВыбораАдресов(Форма);
	КонецЕсли;
	
	Если ПроверкаДублирования Тогда 
		Форма.ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ДанныеКИ.Представление);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредставлениеКИНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ОповещениеОЗакрытииДиалога = Неопределено, Знач ПроверкаДублирования = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("ПредставлениеКИ_")+1));
	ДанныеКИ = Форма.КонтактнаяИнформация[ИндексКИ];
	
	// Если представление было изменено в поле и не соответствует реквизиту, то приводим в соответствие.
	Если ДанныеКИ.Представление <> Элемент.ТекстРедактирования Тогда
		ДанныеКИ.Представление = Элемент.ТекстРедактирования;
		ПредставлениеКИПриИзменении(Форма, Элемент);
		Модифицированность = Истина;
	КонецЕсли;
	
	ПараметрыФормы = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
						ДанныеКИ.Вид,
						ДанныеКИ.ЗначенияПолей,
						ДанныеКИ.Представление,
						ДанныеКИ.Комментарий);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИндексКИ", ИндексКИ);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("ПроверкаДублирования", ПроверкаДублирования);
	
	Если ОповещениеОЗакрытииДиалога <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("ОповещениеОЗакрытииДиалога", ОповещениеОЗакрытииДиалога);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗначениеКИРедактированиеВДиалогеЗавершено", ЭтотОбъект, ДополнительныеПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

Процедура ПредставлениеКИОчистка(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("ПредставлениеКИ_")+1));
	ДанныеКИ = Форма.КонтактнаяИнформация[ИндексКИ];
	ДанныеКИ.ЗначенияПолей = "";
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		КонтактнаяИнформацияКлиентСервер.ЗаполнитьСписокВыбораАдресов(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура КомментарийКИПриИзменении(Форма, Элемент) Экспорт
	
	ИндексКИ = Число(Сред(Элемент.Имя, СтрДлина("КомментарийКИ_")+1));
	ДанныеКИ = Форма.КонтактнаяИнформация[ИндексКИ];
	
	ОжидаемыйВид = ?(ПустаяСтрока(ДанныеКИ.ЗначенияПолей), ДанныеКИ.Вид, Неопределено);
	КонтактнаяИнформацияВызовСервера.УстановитьКомментарийКонтактнойИнформации(ДанныеКИ.ЗначенияПолей, ДанныеКИ.Комментарий, ОжидаемыйВид);
	
КонецПроцедуры

Процедура ДобавитьКонтактнуюИнформациюНажатие(Форма, Элемент, МножественнаяФормаВладельца = "объектов") Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("МножественнаяФормаВладельца", МножественнаяФормаВладельца);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКонтактнуюИнформациюВидВыбран", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокДоступныхВидов = КонтактнаяИнформацияКлиентСервер.СписокВидовДляДобавленияКонтактнойИнформации(Форма.СвойстваВидовКонтактнойИнформации, Форма.КонтактнаяИнформация);
	
	Форма.ПоказатьВыборИзСписка(ОписаниеОповещения, СписокДоступныхВидов, Элемент);
	
КонецПроцедуры

Процедура ВыполнитьКоманду(Форма, Команда, ИмяТабличнойЧасти = Неопределено) Экспорт
	
	ИмяТабличнойЧасти = ?(ИмяТабличнойЧасти = Неопределено, "КонтактнаяИнформация", ИмяТабличнойЧасти);
	            
	Если СтрНачинаетсяС(Команда.Имя, "КонтекстноеМенюКартаЯндекс_") Тогда
		
		ИндексКИ = Число(Сред(Команда.Имя, СтрДлина("КонтекстноеМенюКартаЯндекс_")+1));
		ДанныеКИ = Форма[ИмяТабличнойЧасти][ИндексКИ];
		УправлениеКонтактнойИнформациейКлиент.ПоказатьАдресНаКарте(ДанныеКИ.Представление, "Яндекс.Карты");
		
	ИначеЕсли СтрНачинаетсяС(Команда.Имя, "КонтекстноеМенюКартаGoogle_") Тогда
		
		ИндексКИ = Число(Сред(Команда.Имя, СтрДлина("КонтекстноеМенюКартаGoogle_")+1));
		ДанныеКИ = Форма[ИмяТабличнойЧасти][ИндексКИ];
		УправлениеКонтактнойИнформациейКлиент.ПоказатьАдресНаКарте(ДанныеКИ.Представление, "GoogleMaps");
		
	ИначеЕсли СтрНачинаетсяС(Команда.Имя, "ПозвонитьПоIPТелефонии_") Тогда
		
		ИндексКИ = Число(Сред(Команда.Имя, СтрДлина("ПозвонитьПоIPТелефонии_")+1));
		ДанныеКИ = Форма[ИмяТабличнойЧасти][ИндексКИ];
		
		IPТелефонияКлиент.ИсходящийЗвонокОсуществитьПоКонтрагенту(Форма.Объект.Ссылка, ДанныеКИ.Представление);
		
	ИначеЕсли СтрНачинаетсяС(Команда.Имя, "SkypeПозвонить_") Тогда
		
		ИндексКИ = Число(Сред(Команда.Имя, СтрДлина("SkypeПозвонить_")+1));
		ДанныеКИ = Форма[ИмяТабличнойЧасти][ИндексКИ];
		ДополнительныеПараметры = Новый Структура("ЛогинSkype");
		ДополнительныеПараметры.ЛогинSkype = ДанныеКИ.Представление;
		Список = Новый СписокЗначений;
		Список.Добавить("Позвонить", НСтр("ru='Позвонить';en='Call'"));	
		УправлениеКонтактнойИнформациейКлиент.ПослеВыбораИзМенюSkype(Список[0], ДополнительныеПараметры);
		
	ИначеЕсли СтрНачинаетсяС(Команда.Имя, "SkypeНачатьЧат_") Тогда
		
		ИндексКИ = Число(Сред(Команда.Имя, СтрДлина("SkypeНачатьЧат_")+1));
		ДанныеКИ = Форма[ИмяТабличнойЧасти][ИндексКИ];
		ДополнительныеПараметры = Новый Структура("ЛогинSkype");
		ДополнительныеПараметры.ЛогинSkype = ДанныеКИ.Представление;
		Список = Новый СписокЗначений;
		Список.Добавить("Начать чат", НСтр("ru='Начать чат';en='ToBegin chat'"));	
		УправлениеКонтактнойИнформациейКлиент.ПослеВыбораИзМенюSkype(Список[0], ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПРОГРАММНЫЙ_ИНТЕРФЕЙС

// Процедура - Звонок по Skype.
//
// Параметры:
//  ЛогинSkype		 - Строка	 - имя аккаунта в Skype, с которым необходимо связаться
//  ДействиеВSkype	 - Строка	 - может принимать одно из значений: "Позвонить", "НачатьЧат", "ИнформацияОбАккаунте"
//
Процедура ЗвонокПоSkype(ЛогинSkype, ДействиеВSkype = "Позвонить") Экспорт
	
	#Если НЕ ВебКлиент Тогда
		Если ПустаяСтрока(ПрограммаТелефонииУстановлена("skype")) Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru='Для совершения звонка по Skype требуется установить программу.';en='For making a call via Skype required install the program.'"));
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	СтрокаЗапуска = "skype:" + ЛогинSkype;
	Если ДействиеВSkype = "Позвонить" Тогда
		СтрокаЗапуска = СтрокаЗапуска + "?call";
	ИначеЕсли ДействиеВSkype = "НачатьЧат" Тогда
		СтрокаЗапуска = СтрокаЗапуска + "?chat";
	Иначе
		СтрокаЗапуска = СтрокаЗапуска + "?userinfo";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗапускSkype", ЭтотОбъект, СтрокаЗапуска);
	ТекстСообщения = НСтр("ru='Для запуска Skype необходимо установить расширение работы с файлами.';en='For launch Skype is necessary install expansion work с файлами.'");
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Оповещение, ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗначениеКИРедактированиеВДиалогеЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКИ = ДополнительныеПараметры.Форма.КонтактнаяИнформация[ДополнительныеПараметры.ИндексКИ];
	
	ДанныеКИ.Представление	 = РезультатЗакрытия.Представление;
	ДанныеКИ.ЗначенияПолей	 = РезультатЗакрытия.КонтактнаяИнформация;
	ДанныеКИ.Комментарий	 = РезультатЗакрытия.Комментарий;
	
	Модифицированность = Истина;
	
	Если ДанныеКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		КонтактнаяИнформацияКлиентСервер.ЗаполнитьСписокВыбораАдресов(ДополнительныеПараметры.Форма);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеОЗакрытииДиалога") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗакрытииДиалога, РезультатЗакрытия.Представление);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ПроверкаДублирования Тогда 
		ДополнительныеПараметры.Форма.ПроверкаДублированияКлиентаКонтактнаяИнформация(ДанныеКИ, ДанныеКИ.Представление);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКонтактнуюИнформациюВидВыбран(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Отбор = Новый Структура("Вид", ВыбранныйЭлемент.Значение);
	
	НайденныеСтроки = Форма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СвойстваВида = НайденныеСтроки[0];
	
	//Если СвойстваВида.ВыводитьВФормеВсегда = Ложь Тогда
	//	
	//	ДополнительныеПараметры.Вставить("ДобавляемыйВид", ВыбранныйЭлемент.Значение);
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКонтактнуюИнформациюВопросЗадан", ЭтотОбъект, ДополнительныеПараметры);
	//	
	//	ТекстВопроса = СтрШаблон(НСтр("ru='Возможность ввода ""%1"" будет добавлена для всех %2.
	//		|Продолжить?'"), ВыбранныйЭлемент.Значение, ДополнительныеПараметры.МножественнаяФормаВладельца);
	//	ЗаголовокВопроса = НСтр("ru='Подтверждение добавления';en='Confirmation add'");
	//	
	//	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.ОК, ЗаголовокВопроса);
	//	
	//Иначе
		
		Форма.ДобавитьКонтактнуюИнформациюСервер(ВыбранныйЭлемент.Значение);
		
	//КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКонтактнуюИнформациюВопросЗадан(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.ДобавитьКонтактнуюИнформациюСервер(ДополнительныеПараметры.ДобавляемыйВид, Истина);
	
КонецПроцедуры

Процедура ПослеВыбораИзМенюSkype(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗвонокПоSkype(Параметры.ЛогинSkype, ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

Процедура ЗапускSkype(РасширениеПодключено, СтрокаЗапуска) Экспорт
	
	Если РасширениеПодключено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтотОбъект);
		НачатьЗапускПриложения(Оповещение, СтрокаЗапуска);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗапускаПриложения(ВыбранныйЭлемент, Параметры) Экспорт
	// Процедура заглушка, т.к. НачатьЗапускПриложения требуется наличие обработчика оповещения. 
	Возврат;
КонецПроцедуры

// Проверяет, установлена ли программа телефонии на компьютер.
//  Проверка возможна только в тонком клиенте для Windows.
//
// Параметры:
//  ИмяПротокола - Строка - Имя проверяемого URI протокола, возможные варианты "skype", "tel", "sip".
//                          Если параметр не указан, то проверяются все протоколы. 
// 
// Возвращаемое значение:
//  Строка - имя доступного URI протокола зарегистрирована в реестре. Пустая строка - если протокол не доступен.
//  Неопределенно если проверка не возможна.
//
Функция ПрограммаТелефонииУстановлена(ИмяПротокола = Неопределено)
	
		Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоLinuxКлиент() Тогда
			Если ЗначениеЗаполнено(ИмяПротокола) Тогда
				Возврат ?(ИмяПротоколаЗарегистрированоВРеестре(ИмяПротокола), ИмяПротокола, "");
			Иначе
				СписокПротоколов = Новый Массив;
				СписокПротоколов.Добавить("tel");
				СписокПротоколов.Добавить("sip");
				СписокПротоколов.Добавить("skype");
				Для каждого ИмяПротокола Из СписокПротоколов Цикл
					Если ИмяПротоколаЗарегистрированоВРеестре(ИмяПротокола) Тогда
						Возврат ИмяПротокола;
					КонецЕсли;
				КонецЦикла;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ИмяПротоколаЗарегистрированоВРеестре(ИмяПротокола)
	
	Попытка
		
		#Если не ВебКлиент Тогда
			Системнаяинформация = Новый Системнаяинформация;
			Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 	
				Оболочка = Новый COMОбъект("Wscript.Shell");
				Результат = Оболочка.RegRead("HKEY_CLASSES_ROOT\" + ИмяПротокола + "\");
			КонецЕсли;
		#Конецесли
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

#КонецОбласти
