///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https:// creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем ПредыдущийЯзык;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Источник = Параметры.Источник;
	Если Источник = "ПанельАдминистрированияБСП" Тогда
		Элементы.ОК.Заголовок = НСтр("ru = 'Сохранить'")
	КонецЕсли;
	Элементы.ЧасовойПоясПрограммы.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеЧасовыеПояса());
	
	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
	
		ИнформационнаяБазаФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
		
		ЧасовойПоясПрограммы = ПолучитьЧасовойПоясИнформационнойБазы();
		Если ПустаяСтрока(ЧасовойПоясПрограммы) Тогда
			ЧасовойПоясПрограммы = ЧасовойПояс();
		КонецЕсли;
		
		Если ОбщегоНазначения.РазделениеВключено() Тогда
			Элементы.ГруппаОсновнойЯзык.Видимость = Ложь;
			Элементы.ГруппаДополнительныеЯзыки.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ЧасовойПоясПрограммы = ЧасовойПоясСеанса();
		
	КонецЕсли;
	
	УстановитьОсновнойЯзык();
	
	Настройки = Новый Структура;
	Настройки.Вставить("КодДополнительногоЯзыка1", "");
	Настройки.Вставить("КодДополнительногоЯзыка2", "");
	Настройки.Вставить("МультиязычныеДанные",      Истина);
	
	МультиязычностьПереопределяемый.ПриОпределенииНастроек(Настройки);
	
	КоличествоЯзыков = Метаданные.Языки.Количество();
	Если Не Настройки.МультиязычныеДанные ИЛИ КоличествоЯзыков = 1 Тогда
		Элементы.ГруппаДополнительныеЯзыки.Видимость = Ложь;
		Элементы.ГруппаОсновнойЯзык.Видимость        = Ложь;
	Иначе
		Если КоличествоЯзыков = 2 Тогда
			Элементы.ГруппаДополнительныйЯзык2.Видимость = Ложь;
		КонецЕсли;
		ОтобразитьНастройкиДополнительныхЯзыков(Настройки, КоличествоЯзыков);
	КонецЕсли;
	ФорматТелефонногоНомера = Константы.ФорматТелефонныхНомеров.Получить();
	ЗаполнитьСписокВыбораФорматовТелефонныхНомеров();	

	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИнформационнаяБазаФайловая
		И СтрНайти(ПараметрЗапуска, "ВыполнитьОбновлениеИЗавершитьРаботу") > 0 Тогда
			ПодключитьОбработчикОжидания("УстановитьЗначенияПоУмолчанию", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнойЯзык()
	
	ОсновнойЯзык = Константы.ОсновнойЯзык.Получить();
	Для каждого Язык Из Метаданные.Языки Цикл
		Элементы.ОсновнойЯзык.СписокВыбора.Добавить(Язык.КодЯзыка, Язык.Представление());
	КонецЦикла;
	
	Если ПустаяСтрока(ОсновнойЯзык) Тогда
		ОсновнойЯзык = ТекущийЯзык().КодЯзыка;
	КонецЕсли;
	
	Если ПустаяСтрока(ОсновнойЯзык) Или Элементы.ОсновнойЯзык.СписокВыбора.НайтиПоЗначению(ОсновнойЯзык) = Неопределено Тогда
		ОсновнойЯзык = ОбщегоНазначения.КодОсновногоЯзыка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьНастройкиДополнительныхЯзыков(Настройки, КоличествоЯзыков)
	
	ДоступныеЯзыки = Новый Соответствие;
	Для каждого ЯзыкКонфигурации Из Метаданные.Языки Цикл
		Если СтрСравнить(ОсновнойЯзык, ЯзыкКонфигурации.КодЯзыка) = 0  Тогда
			Продолжить;
		КонецЕсли;
		ДоступныеЯзыки.Вставить(ЯзыкКонфигурации.КодЯзыка, Истина);
	КонецЦикла;
	
	Язык1ПоУмолчанию = "";
	Если ЗначениеЗаполнено(Настройки.КодДополнительногоЯзыка1) Тогда
		Если ДоступныеЯзыки.Получить(Настройки.КодДополнительногоЯзыка1) = Истина Тогда
			Язык1ПоУмолчанию = Настройки.КодДополнительногоЯзыка1;
		КонецЕсли;
	КонецЕсли;
	
	Язык2ПоУмолчанию = "";
	Если КоличествоЯзыков > 2 И ЗначениеЗаполнено(Настройки.КодДополнительногоЯзыка2) Тогда
		Если ДоступныеЯзыки.Получить(Настройки.КодДополнительногоЯзыка2) = Истина Тогда
			Язык2ПоУмолчанию = Настройки.КодДополнительногоЯзыка2;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Язык Из Метаданные.Языки Цикл
		Если СтрСравнить(Язык.КодЯзыка, ОсновнойЯзык) <> 0 Тогда
			Если ПустаяСтрока(Язык1ПоУмолчанию) Тогда
				Язык1ПоУмолчанию = Язык.КодЯзыка;
			ИначеЕсли ПустаяСтрока(Язык2ПоУмолчанию) И Язык.КодЯзыка <> Язык1ПоУмолчанию Тогда
				Язык2ПоУмолчанию = Язык.КодЯзыка;
			КонецЕсли;
		КонецЕсли;
		Элементы.ДополнительныйЯзык1.СписокВыбора.Добавить(Язык.КодЯзыка, Язык.Представление());
		Элементы.ДополнительныйЯзык2.СписокВыбора.Добавить(Язык.КодЯзыка, Язык.Представление());
	КонецЦикла;
	
	ИспользоватьДополнительныйЯзык1 = МультиязычностьСервер.ИспользуетсяПервыйДополнительныйЯзык();
	ИспользоватьДополнительныйЯзык2 = МультиязычностьСервер.ИспользуетсяВторойДополнительныйЯзык();
	
	ДополнительныйЯзык1 = МультиязычностьСервер.КодПервогоДополнительногоЯзыкаИнформационнойБазы();
	ДополнительныйЯзык2 = МультиязычностьСервер.КодВторогоДополнительногоЯзыкаИнформационнойБазы();
	
	Элементы.ДополнительныйЯзык1.Доступность = ИспользоватьДополнительныйЯзык1;
	Элементы.ДополнительныйЯзык2.Доступность = ИспользоватьДополнительныйЯзык2;
	
	Если ПустаяСтрока(ДополнительныйЯзык1) Тогда
		ДополнительныйЯзык1 = Язык1ПоУмолчанию;
	КонецЕсли;
	
	Если КоличествоЯзыков > 2 И ПустаяСтрока(ДополнительныйЯзык2) Тогда
		ДополнительныйЯзык2 = Язык2ПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьДополнительныйЯзык1ПриИзменении(Элемент)
	Элементы.ДополнительныйЯзык1.Доступность = ИспользоватьДополнительныйЯзык1;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДополнительныйЯзык2ПриИзменении(Элемент)
	Элементы.ДополнительныйЯзык2.Доступность = ИспользоватьДополнительныйЯзык2;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойЯзыкПриИзменении(Элемент)
	
	Если СтрСравнить(ПредыдущийЯзык, ОсновнойЯзык) <> 0 Тогда
		Если СтрСравнить(ДополнительныйЯзык1, ОсновнойЯзык) = 0 Тогда
			ДополнительныйЯзык1 = ПредыдущийЯзык;
		ИначеЕсли СтрСравнить(ДополнительныйЯзык2, ОсновнойЯзык) = 0 Тогда
			ДополнительныйЯзык2 = ПредыдущийЯзык;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойЯзыкНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПредыдущийЯзык = ОсновнойЯзык;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйЯзык1ПриИзменении(Элемент)
	
	Если СтрСравнить(ПредыдущийЯзык, ДополнительныйЯзык1) <> 0 Тогда
		Если СтрСравнить(ДополнительныйЯзык1, ОсновнойЯзык) = 0 Тогда
			ОсновнойЯзык = ПредыдущийЯзык;
		ИначеЕсли СтрСравнить(ДополнительныйЯзык1, ДополнительныйЯзык2) = 0 Тогда
			ДополнительныйЯзык2 = ПредыдущийЯзык;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйЯзык2ПриИзменении(Элемент)
	
	Если СтрСравнить(ПредыдущийЯзык, ДополнительныйЯзык2) <> 0 Тогда
		Если СтрСравнить(ДополнительныйЯзык2, ДополнительныйЯзык1) = 0 Тогда
			ДополнительныйЯзык1 = ПредыдущийЯзык;
		ИначеЕсли СтрСравнить(ДополнительныйЯзык2, ОсновнойЯзык) = 0 Тогда
			ОсновнойЯзык = ПредыдущийЯзык;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйЯзык2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПредыдущийЯзык = ДополнительныйЯзык2;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйЯзык1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПредыдущийЯзык = ДополнительныйЯзык1;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если ДанныеКорректны() Тогда
		
		Если Источник = "ПанельАдминистрированияБСП" И ЗначенияКонстантИзменены() Тогда
			ПерезаполнитьДанные();
		Иначе
			ЗаписатьЗначенияКонстант();
			Закрыть(Новый Структура("Отказ", Ложь));
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Указаны некорректные значения региональных настроек'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьЗначенияПоУмолчанию()
	
	ЗаписатьЗначенияКонстант();
	Закрыть(Новый Структура("Отказ", Ложь));
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДанные()
	
	ОчиститьСообщения();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Ожидание;
	Элементы.ОК.Доступность = Ложь;
	
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполнения", ЭтотОбъект);
	
	Задание = ЗапуститьФоновоеПерезаполнениеНаСервере(УникальныйИдентификатор);
	ИдентификаторЗадания = Задание.ИдентификаторЗадания;
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	НастройкиОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
	
	Обработчик = Новый ОписаниеОповещения("ПослеФоновогоПерезаполнения", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеПерезаполнениеНаСервере(Знач УникальныйИдентификатор)
	
	ЗаписатьЗначенияКонстант();
	ПараметрыМетода = Новый Структура;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Перезаполнение строк предопределенных элементов и классификаторов.'");
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне("МультиязычностьСервер.ПерезаполнитьМультиязычныеСтрокиВОбъектах",
		ПараметрыМетода, ПараметрыВыполнения);
		
	Возврат ФоновоеЗадание;
КонецФункции

&НаКлиенте
Процедура ПослеФоновогоПерезаполнения(Задание, ДополнительныеПараметры) Экспорт
	
	Если Задание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Задание.Статус = "Выполнено" Тогда
	Элементы.Страницы.ТекущаяСтраница = Элементы.УспешноеЗавершение;
		ОбновитьПовторноИспользуемыеЗначения();
		
		Элементы.ОК.Видимость              = Ложь;
		Элементы.Закрыть.Видимость         = Истина;
		Элементы.Закрыть.КнопкаПоУмолчанию = Истина;
		ТекущийЭлемент = Элементы.Закрыть;
	ИначеЕсли Задание.Статус = "Ошибка" Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.РегиональныеНастройки;
		ТекстОшибки = НСтр("ru = 'Не удается перезаполнить строки предопределенных элементов и классификаторов.'");
		ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Техническая информация:'") + Задание.ПодробноеПредставлениеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьПрогресс(ИдентификаторЗадания)
	Возврат ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ПрогрессВыполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполняется" Тогда
		Прогресс = ПрочитатьПрогресс(Результат.ИдентификаторЗадания);
		Если Прогресс <> Неопределено Тогда
			ТекстСостоянияОчистки = Прогресс.Текст;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеКорректны()
	
	Если ПустаяСтрока(ОсновнойЯзык) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(ЧасовойПоясПрограммы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановленныеЯзыки = Новый Соответствие;
	УстановленныеЯзыки.Вставить(ОсновнойЯзык, Истина);
	
	Если ИспользоватьДополнительныйЯзык1 Тогда
		Если ОсновнойЯзык = ДополнительныйЯзык1 Или ДополнительныйЯзык1 = ДополнительныйЯзык2 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьДополнительныйЯзык2 Тогда
		Если ОсновнойЯзык = ДополнительныйЯзык2 Или ДополнительныйЯзык1 = ДополнительныйЯзык2 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаписатьЗначенияКонстант()
	
	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		Если СтрСравнить(Константы.ФорматТелефонныхНомеров.Получить(), ФорматТелефонногоНомера) <> 0 Тогда
			СохранитьФорматТелефонногоНомера();
		КонецЕсли;
		
		Если ЧасовойПоясПрограммы <> ПолучитьЧасовойПоясИнформационнойБазы() Тогда
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				УстановитьМонопольныйРежим(Истина);
				УстановитьЧасовойПоясИнформационнойБазы(ЧасовойПоясПрограммы);
				УстановитьМонопольныйРежим(Ложь);
			Исключение
				УстановитьМонопольныйРежим(Ложь);
				ВызватьИсключение;
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
			УстановитьЧасовойПоясСеанса(ЧасовойПоясПрограммы);
		КонецЕсли;
		
	Иначе
		
		УстановитьЧасовойПоясСеанса(ЧасовойПоясПрограммы);
		
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Или Не ОбщегоНазначения.РазделениеВключено() Тогда
		
		Константы.ОсновнойЯзык.Установить(ОсновнойЯзык);
		ПараметрыСеанса.ОсновнойЯзык = ОсновнойЯзык;
		
		КодЯзыка1 = ?(ИспользоватьДополнительныйЯзык1, ДополнительныйЯзык1, "");
		Константы.ДополнительныйЯзык1.Установить(КодЯзыка1);
		Константы.ИспользоватьДополнительныйЯзык1.Установить(ИспользоватьДополнительныйЯзык1);
		
		КодЯзыка2 = ?(ИспользоватьДополнительныйЯзык2, ДополнительныйЯзык2, "");
		Константы.ДополнительныйЯзык2.Установить(КодЯзыка2);
		
		Константы.ИспользоватьДополнительныйЯзык2.Установить(ИспользоватьДополнительныйЯзык2);
	
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Функция ЗначенияКонстантИзменены()	
	
	Если Метаданные.Языки.Количество() = 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрСравнить(Константы.ОсновнойЯзык.Получить(), ОсновнойЯзык) <> 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если (Константы.ИспользоватьДополнительныйЯзык1.Получить() = Ложь И ИспользоватьДополнительныйЯзык1 = Истина)
		Или (Константы.ИспользоватьДополнительныйЯзык2.Получить() = Ложь И ИспользоватьДополнительныйЯзык2 = Истина) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИспользоватьДополнительныйЯзык1
		И СтрСравнить(Константы.ДополнительныйЯзык1.Получить(), ДополнительныйЯзык1) <> 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИспользоватьДополнительныйЯзык2
		И СтрСравнить(Константы.ДополнительныйЯзык2.Получить(), ДополнительныйЯзык2) <> 0 Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
// Процедура Страна учета при изменении.
//
Процедура СтранаУчетаПриИзменении(Элемент)
	ЗаполнитьТелефонныйКод();
КонецПроцедуры

&НаСервере
// Процедура Заполнить телефонный код.
//
Процедура ЗаполнитьТелефонныйКод()
	
	Константы.СтранаУчета.Установить(НаборКонстант.СтранаУчета);
	СтранаУчета = Константы.СтранаУчета.Получить();
	
	Если ЗначениеЗаполнено(СтранаУчета) Тогда
		
		НаборКонстант.ВалютаУчета = СтранаУчета.ВалютаУчета;
		Константы.ВалютаУчета.Установить(НаборКонстант.ВалютаУчета);
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
// Процедура Сохранить формат телефонного номера.
//
Процедура СохранитьФорматТелефонногоНомера()
	
	// ФорматТН = = Константы.ФорматТелефонныхНомеров.Получить();
	// ФорматТелефонногоНомера = Константы.ФорматТелефонныхНомеров.Получить();
	// НаборКонстант.ФорматТелефонныхНомеров = ФорматТелефонногоНомера;
	Константы.ФорматТелефонныхНомеров.Установить(ФорматТелефонногоНомера);	
	
	// Если ФорматТелефонногоНомера = 0 Тогда
	//	КодСтраны = "+7";
	//	ИначеЕсли ФорматТелефонногоНомера = 1 Тогда
	//	КодСтраны = "8";
	// ИначеЕсли ФорматТелефонногоНомера = 4 Тогда 
	//	КодСтраны = "+7";
	// Иначе
	//	КодСтраны = Неопределено;
	// КонецЕсли;	 
	// КодГорода = "705";
	// Коды = Новый Структура("КодСтраны", КодСтраны);
	// ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", "КодыСтраныИГорода", Коды, НСтр("ru = 'Коды страны и города'"));
	
КонецПроцедуры

&НаСервере
// Процедура Получить ссылку на страну.
//
Функция ПолучитьСсылкуНаСтрану(СтранаУчета)
	Возврат Справочники.СтраныМира.НайтиПоНаименованию(СтранаУчета);	
КонецФункции

&НаСервере
// Процедура - Заполнить список выбора форматов телефонных номеров
//
Процедура ЗаполнитьСписокВыбораФорматовТелефонныхНомеров()
	
	СтранаУчета = Константы.СтранаУчета.Получить();
	ФорматТН = Константы.ФорматТелефонныхНомеров.Получить();
	Элементы.ФорматТелефонныхНомеров.СписокВыбора.Очистить();	
	// Элементы.ГруппаФорматТелефонногоНомера.Видимость = Ложь;	

	Если ЗначениеЗаполнено(СтранаУчета) Тогда
		
		КодСтраны = СтранаУчета.Код;
		
		// Для РОССИЙСКОЙ ФЕДЕРАЦИИ
		Если КодСтраны = "643" Тогда 
			// Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;			
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+7 (ххх) ххххххх");
			// Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(1, "8 (ххх) ххххххх");
			// Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(4, "+7 (ххх) ххх-хх-хх");			
			// Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(НаборКонстант.ФорматТелефонныхНомеров) = Неопределено Тогда 
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
				// НаборКонстант.ФорматТелефонныхНомеров = 0;
				ФорматТелефонногоНомера = 0;		
			КонецЕсли;

		// Для Украины
		ИначеЕсли КодСтраны = "804" Тогда 
			Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+38 (ххх) ххххххх");
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
				// НаборКонстант.ФорматТелефонныхНомеров = 0;  
				ФорматТелефонногоНомера = 0;
			КонецЕсли;

		// Для Белоруссии
		ИначеЕсли КодСтраны = "112" Тогда 
			Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+375 (хх) ххххххх");
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
			//	НаборКонстант.ФорматТелефонныхНомеров = 0;  
			ФорматТелефонногоНомера = 0;
			КонецЕсли;

		// Для Армении
		ИначеЕсли КодСтраны = "051" Тогда 
			Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+374 (хх) хххххх");
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
				// НаборКонстант.ФорматТелефонныхНомеров = 0;
				ФорматТелефонногоНомера = 0;
			КонецЕсли;

		// Для Азербайджана
		ИначеЕсли КодСтраны = "031" Тогда 
			Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+994 (хх) хххххх");
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
			//	НаборКонстант.ФорматТелефонныхНомеров = 0; 
			ФорматТелефонногоНомера = 0;
			КонецЕсли;
		
		// Для Казахстана
		ИначеЕсли КодСтраны = "398" Тогда 
			Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+7 (ххх) ххххххх");
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
				// НаборКонстант.ФорматТелефонныхНомеров = 0; 
				ФорматТелефонногоНомера = 0;
			КонецЕсли;

		// Для ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ
		ИначеЕсли КодСтраны = "784" Тогда 
			Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+971 (0х) ххх хххх");
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(1, "+971 (х) ххх хххх");			
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
				// НаборКонстант.ФорматТелефонныхНомеров = 0;  
				ФорматТелефонногоНомера = 0;
			КонецЕсли;
			
		// Для Молдовы
		ИначеЕсли КодСтраны = "498" Тогда 
			Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+373 (ххх) ххххх");
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
			//	НаборКонстант.ФорматТелефонныхНомеров = 0;    
			ФорматТелефонногоНомера = 0;
			КонецЕсли;
			
		// Для Польши
		ИначеЕсли КодСтраны = "616" Тогда
			
			Элементы.ГруппаФорматТелефонногоНомера.Видимость = Истина;
			Элементы.ПрименитьФорматТелефонныхНомеров.Видимость = Истина;
			Элементы.ФорматТелефонныхНомеров.СписокВыбора.Добавить(0, "+48 (хххx) ххххх");
			Если Элементы.ФорматТелефонныхНомеров.СписокВыбора.НайтиПоЗначению(ФорматТН) = Неопределено Тогда 
				// НаборКонстант.ФорматТелефонныхНомеров = 0; 
				ФорматТелефонногоНомера = 0;
			КонецЕсли;
			
		КонецЕсли;
		
		// Для ....
		
	Иначе 
		Элементы.ГруппаФорматТелефонногоНомера.Видимость = Ложь;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФорматТелефонныхНомеров(Команда)
	
	Если МодифицированыРегиональныеПараметры(НаборКонстант.СтранаУчета, ФорматТелефонногоНомера) Тогда
		Оповещение = Новый ОписаниеОповещения("ПреобразованиеФорматаПослеВопросаОЗаписиСтруктурнойЕдиницы", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Для преобразования телефонных номеров необходимо сохранить настройки. Сохранить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ТекстВопроса = НСтр("ru = 'Внимание! Формат телефонных номеров будет изменен. Применить новый формат телефонных номеров? '");	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПодтвержденияПреобразованияТелефонныхНомеров", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, , , НСтр("ru = 'Вопрос пользователю'; en = 'Question to user'"));     
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, оброботчик оповещения.
//
Процедура ПреобразованиеФорматаПослеВопросаОЗаписиСтруктурнойЕдиницы(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да 
		И ЭтаФорма.Записать() Тогда	
		
		СохранитьФорматТелефонногоНомера();

			ТекстВопроса = НСтр("ru = 'Внимание! Формат телефонных номеров будет изменен. Применить новый формат телефонных номеров? '");			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПодтвержденияПреобразованияТелефонныхНомеров", ЭтаФорма);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, , , НСтр("ru = 'Вопрос пользователю'; en = 'Question to user'"));
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка подтверждения преобразования телефонных номеров
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбработкаПодтвержденияПреобразованияТелефонныхНомеров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда 
		Элементы.ПрименитьФорматТелефонныхНомеров.Доступность = Ложь;
		Состояние(НСтр("ru='Получение данных...';en='Getting ...'"), 0, , БиблиотекаКартинок.Информация32);
		СтранаУчета = ПолучитьСсылкуНаСтрану(СтранаУчета);
		ПараметрыДлительнойОперации = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.НачатьПреобразованиеФорматаТелефонныхНомеров(Строка(УникальныйИдентификатор), Новый Структура("СтранаУчета, ФорматТелефонныхНомеров", СтранаУчета, ФорматТелефонногоНомера));
		Если НЕ ПараметрыДлительнойОперации = Неопределено Тогда
			Если НЕ ПараметрыДлительнойОперации.ИдентификаторЗадания = Неопределено Тогда 
				ПодключитьОбработчикОжидания("Подключаемый_ОжиданиеДлительнойОперации", 0.1, Истина);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	   
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый ожидание длительной операции
//
Процедура Подключаемый_ОжиданиеДлительнойОперации()
	
	// Обновим статус
	Состояние = СостояниеФоновогоЗадания(ПараметрыДлительнойОперации.ИдентификаторЗадания);
	Если Не ПустаяСтрока(Состояние.Ошибка) Тогда
		// Завершено с ошибкой, сообщим и вернемся на первую страницу.
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Состояние.Ошибка);
		Возврат;
	ИначеЕсли Состояние.Завершено Тогда
		ТекстОписанияОчистки = НСтр("ru='Формат телефонных номеров успешно обновлен.';en='Format telephone numbers successfully updated.'");
		Состояние(НСтр("ru='Завершение...';en='Completion'"), 100, , БиблиотекаКартинок.Информация32);
		ПоказатьПредупреждение( , ТекстОписанияОчистки, , НСтр("ru = 'Сообщение пользователю'; en = 'Message to user'"));
		Элементы.ПрименитьФорматТелефонныхНомеров.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	// Процесс продолжается
	Если ТипЗнч(Состояние.Прогресс) = Тип("Структура") Тогда
		Состояние(Состояние.Прогресс.Текст, Состояние.Прогресс.Процент, Состояние.Прогресс.ДополнительныеПараметры.ТипОбъекта + ": " + Состояние.Прогресс.ДополнительныеПараметры.НаименованиеОбъекта, БиблиотекаКартинок.Информация32);	
	КонецЕсли;
	ПодключитьОбработчикОжидания("Подключаемый_ОжиданиеДлительнойОперации", 0.1, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Состояние фонового задания
// 
// Возвращаемое значение:
//   - 
//
Функция СостояниеФоновогоЗадания(ИдентификаторЗадания)
	
	Результат = Новый Структура("Прогресс, Завершено, Ошибка");
	
	Результат.Ошибка = "";
	Если ИдентификаторЗадания = Неопределено Тогда
		Результат.Завершено = Истина;
		Результат.Прогресс  = Неопределено;
		Результат.Ошибка    = НСтр("ru = 'Произошла ошибка'; en = 'An error has occurred'");
	Иначе
		Попытка
			Результат.Завершено = ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
			Результат.Прогресс  = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
		Исключение
			Результат.Ошибка = ПодробноеПредставлениеОшибки( ИнформацияОбОшибке() );
		КонецПопытки
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Модифицированы региональные параметры
//
// Параметры:
//  СтруктурнаяЕдиница		 - 	 - 
//  Страна					 - 	 - 
//  ФорматТелефонныхНомеров	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция МодифицированыРегиональныеПараметры(Страна, ФорматТелефонныхНомеров)
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если Страна <> Константы.СтранаУчета.Получить() ИЛИ ФорматТелефонныхНомеров <> Константы.ФорматТелефонныхНомеров.Получить() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


#КонецОбласти 
