#Область ОбработчикиСобытийФормы
// Процедура, обработчик события "ПриСозданииНаСервере" управляемая форма документа.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивТипов = Объект.Ссылка.Метаданные().ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора[0].Значение;
	
	ОбработкаТабличныхЧастейКлиент.СоздатьДинамическийСписокПодбораНоменклатур(ЭтаФорма, Объект, "ГруппаПодборНоменклатура", МассивТипов, Истина);
	
	РаботаСДиалогами.УстановитьДоступностьЭлементовФормДокументаПоПравамПользователя(ЭтаФорма, Объект);
			
	// Установим реквизиты
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Документы.ИнвентаризацияЗапасов.ПолучитьМакет("ОтборИнвентаризации");

	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());

	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);

	ОтборИнвентаризации.Инициализировать(ИсточникНастроек);

	ТекОбъект    = РеквизитФормыВЗначение("Объект");
	ТекНастройки = ТекОбъект.ОтборИнвентаризации.Получить();
	Если ТекНастройки = Неопределено Тогда
		ОтборИнвентаризации.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборИнвентаризации.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		Объект.ВидЦен = Справочники.ВидыЦен.Закупочная;
	КонецЕсли;

	// Сформируем надпись	
	СтруктураНадписи = Новый Структура("ВидЦен", Объект.ВидЦен);
	ВидЦенНадпись = СтроковыеФункцииКлиентСерверСтоматология.СформироватьНадписьЦеныИВалюта(СтруктураНадписи, Ложь);	

	ВидОперации = Объект.ВидОперации;
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	
	СоздатьМенюУправленияТабличнымиЧастями();
	ОбновитьЗаголовкиТабЧастейНаСервере();
	УстановитьИспользованиеПартийТЧЗапасы();
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.ИнвентаризацияЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = истина;	
		РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);		
	КонецЕсли;
	
	Элементы.Запасы.МаксимальнаяШирина = ?(Элементы.ГруппаПодборНоменклатура.Видимость, 99,140);
	
КонецПроцедуры

// Процедура, обработчик события "ПослеЗаписи" управляемая форма документа.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСтоматология.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции    

&НаСервере
// Процедура - Установить использование партий ТЧЗапасы
//
Процедура УстановитьИспользованиеПартийТЧЗапасы()

	Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
		
		СтрокаТЧ.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.Номенклатура, "ИспользоватьПартии");
	    СтрокаТЧ.ЭтоСертификат              = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.Номенклатура, "ТипНоменклатуры") = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
// Обработчик события "ВидЦенНадписьНажатие"
//
Процедура ВидЦенНадписьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидЦен", 	  			Объект.ВидЦен);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	Ложь);
	
	// 2. Открвыаем форму "Цены и Валюта".
	ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,,Новый ОписаниеОповещения("РедактироватьЦеныЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события нажатие на кнопку "ЗаполнитьПоОстаткамНаСкладе".
//
Процедура КомандаЗаполнитьПоОстаткамНаСкладе(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьПоОстаткамПослеВопросаОчиститьТЧ", ЭтотОбъект), НСтр("ru = 'Табличная часть будет очищена! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
        Возврат; 
	КонецЕсли;   	
	
	КомандаЗаполнитьПоОстаткамНаСкладеЗавершение();
КонецПроцедуры

&НаКлиенте
// Процедура - Команда заполнить по остаткам после вопроса очистить ТЧ
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура КомандаЗаполнитьПоОстаткамПослеВопросаОчиститьТЧ(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	КомандаЗаполнитьПоОстаткамНаСкладеЗавершение();

КонецПроцедуры

&НаКлиенте
// Процедура - Команда заполнить по остаткам на складе фрагмент
//
Процедура КомандаЗаполнитьПоОстаткамНаСкладеЗавершение()
		
	ПерезаполнитьЦены = Ложь; 
	ЗаполнитьПоОстаткамНаСкладе(ПерезаполнитьЦены, Ложь);
	Если ПерезаполнитьЦены Тогда 
		ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы");
	КонецЕсли;
	
	ОбработатьТЧЗапасыПослеЗаполненияУчетныхДанных();
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет табличную часть "Запасы" по остаткам склада.
//  Параметры:
//   Нет;
//
Процедура ЗаполнитьПоОстаткамНаСкладе(ПерезаполнитьЦены, ПоУпаковкам)
	
	Объект.Запасы.Очистить();
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	УстановитьЗначениеПараметраНастроек(ОтборИнвентаризации.Настройки, "Склад" , ТекОбъект.Склад);
	УстановитьЗначениеПараметраНастроек(ОтборИнвентаризации.Настройки, "Период", ПолучитьДатуОстатков(ТекОбъект));
	УстановитьЗначениеПараметраНастроек(ОтборИнвентаризации.Настройки, "СтруктурнаяЕдиница", ТекОбъект.СтруктурнаяЕдиница);
	
	СхемаКомпоновки = Документы.ИнвентаризацияЗапасов.ПолучитьМакет("ОтборИнвентаризации");
	
	МакетКомпоновки = ОбщегоНазначенияСтоматология.ПолучитьМакетКомпоновки(СхемаКомпоновки, ОтборИнвентаризации.Настройки);
	
	Запрос = ОбщегоНазначенияСтоматология.ПолучитьЗапросИзМакетаКомпоновки(МакетКомпоновки, "ЗаполнениеПоОтборам");
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТекОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.КоличествоУпаковок = 0;
			НоваяСтрока.КоличествоВБазовыхЕИ = Выборка.КоличествоУпаковокПоДаннымУчета;	
			ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(НоваяСтрока); 
			Если ПоУпаковкам и ЗначениеЗаполнено(НоваяСтрока.Номенклатура.УпаковкаПоУмолчанию) и Не НоваяСтрока.Номенклатура.УпаковкаПоУмолчанию.Коэффициент = 0 Тогда				
				НоваяСтрока.КоличествоУпаковокПоДаннымУчета = НоваяСтрока.КоличествоУпаковокПоДаннымУчета/НоваяСтрока.Номенклатура.УпаковкаПоУмолчанию.Коэффициент;
				НоваяСтрока.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковок/НоваяСтрока.Номенклатура.УпаковкаПоУмолчанию.Коэффициент;
				НоваяСтрока.Упаковка = НоваяСтрока.Номенклатура.УпаковкаПоУмолчанию;
			КонецЕсли;
			
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
			СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
			СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);	
			СтруктураДанные.Вставить("Номенклатура", 		НоваяСтрока.Номенклатура);
			СтруктураДанные.Вставить("Упаковка", 			НоваяСтрока.Упаковка);
			СтруктураДанные.Вставить("Сотрудник", 			Справочники.Сотрудники.ПустаяСсылка());	
			СтруктураДанные.Вставить("КоличествоУпаковок",  НоваяСтрока.КоличествоУпаковок);
			СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);			
			НоваяСтрока.Цена = СтруктураДанные.Цена;    
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
		ПерезаполнитьЦены = Истина;
	КонецЕсли; 
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	
КонецПроцедуры
   
&НаСервере
// Устанавливает указанное значение параметра настроек компоновки данных
//
// Параметры:
//  Настройки - настройки компоновки данных
//  ИмяПараметра - имя параметра, значение которого нужно установить
//  Значение - устанавливаемое значение параметра
//
Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)

	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;

КонецПроцедуры

// Функция, возвращает дату для получения остатков по номенклатуре, по регистру "ЗапасыНаСкладах"
//   Параметры:
//    ТекОбъект - документ.
//   Возвращаемое значение:
//    Результат - дата - на момент, которой получаем остаток
&НаСервере
Функция ПолучитьДатуОстатков(ТекОбъект)

	Если ТекОбъект.ЭтоНовый() Тогда
		Если НачалоДня(ТекОбъект.Дата) = НачалоДня(ТекущаяДата()) Тогда
			Результат = '00010101';
		Иначе
			Результат = ТекОбъект.Дата;
		КонецЕсли;   	
	Иначе
		Результат = ТекОбъект.МоментВремени();
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаКлиенте
// Процедура, обработчик события нажатия на кнопку "ЗаполнитьТолькоУчетныеДанные".
//
Процедура КомандаЗаполнитьТолькоУчетныеДанные(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьТолькоУчетныеДанныеПослеВопросаОчиститьТЧ", ЭтотОбъект), НСтр("ru = 'Учетные данные будут очищены! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
        Возврат; 
	Иначе
		Возврат;
	КонецЕсли;

	КомандаЗаполнитьТолькоУчетныеДанныеЗавершение(); 
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Команда заполнить только учетные данные после вопроса очистить ТЧ
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура КомандаЗаполнитьТолькоУчетныеДанныеПослеВопросаОчиститьТЧ(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	КомандаЗаполнитьТолькоУчетныеДанныеЗавершение();

КонецПроцедуры

&НаКлиенте
// Процедура - Команда заполнить только учетные данные завершение
//
Процедура КомандаЗаполнитьТолькоУчетныеДанныеЗавершение()
	
	ЗаполнитьТолькоУчетныеДанные(Ложь);         	
	
	ОбработатьТЧЗапасыПослеЗаполненияУчетныхДанных();

КонецПроцедуры

&НаСервере
// Процедура заполняет табличную часть "Запасы" учетными данными.
// 
Процедура ЗаполнитьТолькоУчетныеДанные(ПоУпаковкам)

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗатраты.Номенклатура КАК Номенклатура,
	|	ТаблицаЗатраты.Партия КАК Партия,
	|	ТаблицаЗатраты.Упаковка КАК Упаковка,
	|	ТаблицаЗатраты.Коэффициент КАК Коэффициент,
	|	ТаблицаЗатраты.Количество КАК Количество,
	|	ТаблицаЗатраты.Цена КАК Цена,                                             
	|	ТаблицаЗатраты.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИнвентаризацияЗапасов
	|ИЗ
	|	&ТаблицаЗатраты КАК ТаблицаЗатраты";
	
	
	ТЗ =  Объект.Запасы.Выгрузить();
	ТЗ.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(10,3)));
	
	Для каждого СтрокаДанных из ТЗ Цикл
		СтрокаДанных.Коэффициент = СтрокаДанных.Упаковка.Коэффициент;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаЗатраты", ТЗ);
	
	Запрос.Выполнить(); 	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияЗапасовЗапасы.Номенклатура,
	|	ИнвентаризацияЗапасовЗапасы.Партия,
	|	ИнвентаризацияЗапасовЗапасы.Упаковка,
	|	ИнвентаризацияЗапасовЗапасы.Коэффициент,
	|	ИнвентаризацияЗапасовЗапасы.Количество,
	|	ИнвентаризацияЗапасовЗапасы.Цена,
	|	ИнвентаризацияЗапасовЗапасы.КоличествоУпаковок,
	|	ВложенныйЗапрос.КоличествоПоДаннымУчета,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияЗапасовЗапасы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВложенныйЗапрос.КоличествоПоДаннымУчета
	|		ИНАЧЕ ВложенныйЗапрос.КоличествоПоДаннымУчета / ЕСТЬNULL(ИнвентаризацияЗапасовЗапасы.Коэффициент, 1)
	|	КОНЕЦ КАК КоличествоУпаковокПоДаннымУчета,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияЗапасовЗапасы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВложенныйЗапрос.КоличествоПоДаннымУчета
	|		ИНАЧЕ ВложенныйЗапрос.КоличествоПоДаннымУчета / ЕСТЬNULL(ИнвентаризацияЗапасовЗапасы.Коэффициент, 1)
	|	КОНЕЦ КАК КоличествоВБазовыхЕИ
	|ИЗ
	|	ИнвентаризацияЗапасов КАК ИнвентаризацияЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|			ЗапасыОстатки.Партия КАК Партия,
	|			СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоПоДаннымУчета
	|		ИЗ
	|			РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|					&ДатаСреза,
	|					СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						И Склад = &Склад) КАК ЗапасыОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗапасыОстатки.Партия,
	|			ЗапасыОстатки.Номенклатура) КАК ВложенныйЗапрос
	|		ПО ИнвентаризацияЗапасовЗапасы.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И ИнвентаризацияЗапасовЗапасы.Партия = ВложенныйЗапрос.Партия";
	
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Запрос.УстановитьПараметр("Склад"    , Объект.Склад);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"    , Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаСреза", ПолучитьДатуОстатков(ТекОбъект)); 
	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ПоУпаковкам Тогда
		
		Для Каждого СтрокаТЧ из Объект.Запасы Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура.УпаковкаПоУмолчанию) и не ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
				СтрокаТЧ.КоличествоУпаковокПоДаннымУчета = СтрокаТЧ.КоличествоУпаковокПоДаннымУчета/СтрокаТЧ.Номенклатура.УпаковкаПоУмолчанию.Коэффициент;
				СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок/СтрокаТЧ.Номенклатура.УпаковкаПоУмолчанию.Коэффициент;
				СтрокаТЧ.Упаковка = СтрокаТЧ.Номенклатура.УпаковкаПоУмолчанию;
			КонецЕсли;			
		КонецЦикла;
		
	КонецЕсли;

	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);

КонецПроцедуры // ЗаполнитьТолькоУчетныеДанные()

// Процедура, обработчик события "ПриИзменении" поле ввода "КоличествоУпаковок"
//
&НаКлиенте
Процедура ЗапасыКоличествоУпаковокПриИзменении(Элемент)
	
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТабличнойЧасти);
	 	
	РассчитатьОтклонениеПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
	
	РассчитатьСуммуУчетаТабЧасти(СтрокаТабличнойЧасти);
		
КонецПроцедуры

// Процедура, рассчитывает сумму учета в табличной части "Запасы"
//  Параметры:
//   СтрокаТабличнойЧасти - текущая строка табличной части "Запасы"
//
&НаКлиенте
Процедура РассчитатьСуммуУчетаТабЧасти(СтрокаТабличнойЧасти)
		
	СтрокаТабличнойЧасти.СуммаУчет = СтрокаТабличнойЧасти.КоличествоУпаковокПоДаннымУчета * СтрокаТабличнойЧасти.Цена;
	
КонецПроцедуры

// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОтборИнвентаризации = Новый ХранилищеЗначения(ОтборИнвентаризации.Настройки, Новый СжатиеДанных(9));
	
КонецПроцедуры

// Процедура, рассчитывает отклонение в табличной части "Запасы" при проведении инвентаризации.
//   Параметры:
//    СтрокаТабличнойЧасти - текущая строка табличной части "Запасы", для которой рассчитывается отклонение.
//
&НаКлиенте
Процедура РассчитатьОтклонениеПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.Отклонение =  СтрокаТабличнойЧасти.КоличествоУпаковок - СтрокаТабличнойЧасти.КоличествоУпаковокПоДаннымУчета;
	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "Цена"
//
&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
	РассчитатьСуммуУчетаТабЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "Сумма"
//
&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииСуммыВТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаПриИзменении(Элемент)
	
	СтруктураПараметров = Новый Структура("РасчетДопКолонки", Истина);
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);	
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииУпаковкиТабЧасти(ТекущаяСтрока, СтруктураДанные);
	Если ОбщегоНазначенияСтоматология.ВернутьКоэффициентУпаковки(ТекущаяСтрока.Упаковка) > 1 Тогда
		ТекущаяСтрока.КоличествоУпаковокПоДаннымУчета = ТекущаяСтрока.КоличествоВБазовыхЕИ;		
		ТекущаяСтрока.КоличествоУпаковокПоДаннымУчета = ТекущаяСтрока.КоличествоУпаковокПоДаннымУчета / ОбщегоНазначенияСтоматология.ВернутьКоэффициентУпаковки(ТекущаяСтрока.Упаковка);
	Иначе 
		ТекущаяСтрока.КоличествоУпаковокПоДаннымУчета = ТекущаяСтрока.КоличествоВБазовыхЕИ; 		
	КонецЕсли;	
	РассчитатьОтклонениеПоСтрокеТабличнойЧасти(ТекущаяСтрока);	
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(ТекущаяСтрока);
	РассчитатьСуммуУчетаТабЧасти(ТекущаяСтрока);         
	
КонецПроцедуры

// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.Запасы.ТекущиеДанные);
	
КонецПроцедуры

// Процедура оработчик команды "Подбор"
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти  = "Запасы";
	ЕстьПартии		   = Истина;
		
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",				   Объект.Дата);
	ПараметрыПодбора.Вставить("Склад",	   			   Объект.Склад);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница",	   Объект.СтруктурнаяЕдиница);
	ПараметрыПодбора.Вставить("ВидЦен",	   			   Объект.ВидЦен);
	ПараметрыПодбора.Вставить("ИспользуетсяСодержание",Истина);

	Если Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда
		АдресЗапасовВХранилище = ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии);
		ПараметрыПодбора.Вставить("АдресЗапасовДокумента", АдресЗапасовВХранилище);
	КонецЕсли; 
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры",	   ТипНоменклатуры);
		
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда			
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("СтатусПартии",	   		СтатусПартии);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ЕстьПартии", ЕстьПартии);

	ОткрытьФорму("ОбщаяФорма.ФормаПодбора",
	ПараметрыПодбора,,,,,
	Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора подбора
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПодборЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ПолучитьЗапасыИзХранилища(РезультатВыбора, ДополнительныеПараметры.ИмяТабличнойЧасти, ДополнительныеПараметры.ЕстьПартии);
		ОбновитьЗаголовкиТабЧастейНаСервере();
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
// Функция получает список товаров из временного хранилища
//
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
		СтруктураОтбора.Вставить("Упаковка", СтрокаЗагрузки.Упаковка);
		Если ЕстьПартии Тогда
			СтруктураОтбора.Вставить("Партия", СтрокаЗагрузки.Партия);
		КонецЕсли;
		
		Строки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			
			СтрокаТабличнойЧасти = Строки[0]; 
		Иначе
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти].Добавить();
		КонецЕсли;
				
	    СтрокаТабличнойЧасти.Номенклатура =  СтрокаЗагрузки.Номенклатура;
		СтрокаТабличнойЧасти.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "ИспользоватьПартии");
		СтрокаТабличнойЧасти.ЭтоСертификат = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "ТипНоменклатуры") = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));
		СтрокаТабличнойЧасти.Партия = СтрокаЗагрузки.Партия;
		// СтрокаТабличнойЧасти.КоличествоУпаковок =  СтрокаЗагрузки.Количество;
		// СтрокаТабличнойЧасти.Количество = СтрокаЗагрузки.Количество * ?(СтрокаТабличнойЧасти.Упаковка.Пустая() = Ложь, СтрокаТабличнойЧасти.Упаковка.Коэффициент, 1);
		СтрокаТабличнойЧасти.КоличествоУпаковок =  СтрокаЗагрузки.КоличествоУпаковок;
		СтрокаТабличнойЧасти.Количество = СтрокаЗагрузки.Количество;
		СтрокаТабличнойЧасти.Цена = СтрокаЗагрузки.Цена;
		СтрокаТабличнойЧасти.Упаковка = СтрокаЗагрузки.Упаковка;		
		СтрокаТабличнойЧасти.Сумма 		= СтрокаЗагрузки.Сумма;
		СтрокаТабличнойЧасти.Отклонение =  СтрокаТабличнойЧасти.КоличествоУпаковок - СтрокаТабличнойЧасти.КоличествоУпаковокПоДаннымУчета;
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаКлиенте
// Процедура, обработчик команды "СкрытьПодбор"
// 
Процедура СкрытьПодбор(Команда)
	
	СкрытьПодборНаСервере();
	Если Элементы.ГруппаПодборНоменклатура.Видимость Тогда
		Элементы._ПодборНоменклатур.Обновить();         
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция помещает список запасов во временное хранилище и возвращает адрес 
//
Функция ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии) 
	
	СписокКолонок = "Номенклатура, Количество, КоличествоУпаковок, Цена, Сумма, Упаковка";
	Если ЕстьПартии Тогда
		СписокКолонок = СписокКолонок + ", Партия";
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Объект[ИмяТабличнойЧасти].Выгрузить(, СписокКолонок), УникальныйИдентификатор);
	
КонецФункции // ПоместитьЗапасыВХранилище()

&НаКлиенте
// Процедура обработчик команды вызывает форму настройки и редактирования цен.
//
Процедура РедактироватьЦены(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидЦен", 	  			Объект.ВидЦен);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	Ложь);
	
	// 2. Открвыаем форму "Цены и Валюта".
	ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,,Новый ОписаниеОповещения("РедактироватьЦеныЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "РедактироватьЦеныЗавершение"
//
Процедура РедактироватьЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// 3. Перезаполняем табличную часть "Запасы" если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		
		Объект.ВидЦен = Результат.ВидЦен;
		
		// Пересчитываем цены по виду цен.					
		Если Результат.ПерезаполнитьЦены Тогда
			ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы");
			
			Для Каждого СтрокаЗапасы Из Объект.Запасы Цикл
				
				РассчитатьСуммуУчетаТабЧасти(СтрокаЗапасы);	
				
			КонецЦикла;	
			
		КонецЕсли;

	КонецЕсли;
	
	// Сформируем надпись
	СтруктураНадписи = Новый Структура("ВидЦен", Объект.ВидЦен);
	ВидЦенНадпись = СтроковыеФункцииКлиентСерверСтоматология.СформироватьНадписьЦеныИВалюта(СтруктураНадписи, Ложь);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчит события ПриОткрытии
//
Процедура ПриОткрытии(Отказ)
	
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования
	
	УстановитьДоступностьЭлементов();
	Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			ПолученыШтрихкоды(Данные);
		ИначеЕсли ИмяСобытия = "DataCollectionTerminal" Тогда
			ПолученыШтрихкоды(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ВнешнееОборудование 
	
	Если Источник = "ВнешнееОборудование" И ИмяСобытия = "НеизвестныеШтрихкоды" 
			И УникальныйИдентификатор = Параметр.ФормаВладелецУникальныйИдентификатор Тогда
		ПолученыШтрихкоды(Параметр.ЗарегистрированныеШтрихкоды);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	// МассивДокументов = Объект.Ссылка;
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ИнвентаризацияЗапасов");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.ИнвентаризацияЗапасов.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)

	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции 

// ==================================================МеханизмВнешнегоОборудования======================================================

&НаКлиенте
// ПодключаемоеОборудование
//
//
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	
	Для Каждого ЭлементШтрихкода Из ДанныеШтрикодов Цикл
		Если ОбработкаТабличныхЧастейКлиент.СШКОбработкаТабличнойЧасти(Элементы.Запасы, ЭлементШтрихкода, , , Объект.Ссылка, Объект.Запасы, НеизвестныеШтрихкоды) Тогда
			ЗапасыНоменклатураПриИзменении(Элементы.Запасы.ТекущиеДанные);
			ЗапасыУпаковкаПриИзменении(Элементы.Запасы.ТекущиеДанные);		
		КонецЕсли;
		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда 
			СтруктураПараметров = Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
			ОткрытьФорму("РегистрСведений.Штрихкоды.Форма.РегистрацияШтрихкодовНоменклатуры", СтруктураПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЦикла;						
	
КонецФункции // ПолученыШтрихкоды()

&НаКлиенте
// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
Процедура ПоискПоШтрихкоду(Команда)
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект), "", НСтр("ru = 'Введите штрихкод'"));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Поиск по штрихкоду завершение
//
// Параметры:
//  Значение				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПоискПоШтрихкодуЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Значение = Неопределено, "", Значение);
	  	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		МассивШтрихкод = Новый Массив;
		МассивШтрихкод.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
		ПолученыШтрихкоды(МассивШтрихкод);
	КонецЕсли;

КонецПроцедуры

// ================================================Конец МеханизмВнешнегоОборудования==================================================

&НаКлиенте
// Процедура, обарботчик события "ПриИзменении"
//
Процедура СкладПриИзменении(Элемент)
	
	СкладПриИзмененииПодбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПередИзменением = ВидОперации;
	ВидОперации = Объект.ВидОперации;
	Если Объект.ВидОперации <> ВидОперацииПередИзменением Тогда
		Объект.Склад = Неопределено;
		УстановитьДоступностьЭлементов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов(ТипСтр = "СправочникСсылка.")
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоСкладу") Тогда
		ТипСтр = ТипСтр + "Склады";
		Элементы.Склад.Заголовок = "Склад";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоСотруднику") Тогда
		ТипСтр = ТипСтр + "Сотрудники";
		Элементы.Склад.Заголовок = "Персонал";
	Иначе
		Возврат;		
	КонецЕсли;
	
	Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗаполнитьПоСправочнику"
//
Процедура ЗаполнитьПоСправочнику(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоСправочникуПослеВопросаОчиститьТЧ", ЭтотОбъект), НСтр("ru = 'Табличная часть будет очищена! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
        Возврат; 
	КонецЕсли;   	
	
	ЗаполнитьПоСправочникуЗавершение(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить по справочнику после вопроса очистить ТЧ
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЗаполнитьПоСправочникуПослеВопросаОчиститьТЧ(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПоСправочникуЗавершение();

КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить по справочнику завершение
//
Процедура ЗаполнитьПоСправочникуЗавершение()
	
	ПерезаполнитьЦены = Ложь; 
	ЗаполнитьПоСправочникуОстатки(ПерезаполнитьЦены);
	Если ПерезаполнитьЦены Тогда 
		ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы");
	КонецЕсли;
	
	ОбработатьТЧЗапасыПослеЗаполненияУчетныхДанных();
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет табличную часть "Запасы" по остаткам склада.
//  Параметры:
//   Нет;
//
Процедура ЗаполнитьПоСправочникуОстатки(ПерезаполнитьЦены)
	
	Объект.Запасы.Очистить();
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	УстановитьЗначениеПараметраНастроек(ОтборИнвентаризации.Настройки, "Склад" , ТекОбъект.Склад);
	УстановитьЗначениеПараметраНастроек(ОтборИнвентаризации.Настройки, "Период", ПолучитьДатуОстатков(ТекОбъект));
	УстановитьЗначениеПараметраНастроек(ОтборИнвентаризации.Настройки, "СтруктурнаяЕдиница", ТекОбъект.СтруктурнаяЕдиница);
	
	СхемаКомпоновки = Документы.ИнвентаризацияЗапасов.ПолучитьМакет("ОтборПоСправочнику");
	
	МакетКомпоновки = ОбщегоНазначенияСтоматология.ПолучитьМакетКомпоновки(СхемаКомпоновки, ОтборИнвентаризации.Настройки);
	
	Запрос = ОбщегоНазначенияСтоматология.ПолучитьЗапросИзМакетаКомпоновки(МакетКомпоновки, "ЗаполнениеПоОтборам");
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТекОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.КоличествоВБазовыхЕИ = Выборка.КоличествоУпаковокПоДаннымУчета;			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
		ПерезаполнитьЦены = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ЗапасыНоменклатураПриИзменении(Элемент, СтрокаДанных = Неопределено)
	
	Если СтрокаДанных = Неопределено Тогда
		СтрокаДанных = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	СтрокаДанных.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ИспользоватьПартии");
	СтрокаДанных.ЭтоСертификат = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ТипНоменклатуры") = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);	
	СтруктураДанные.Вставить("Номенклатура", 		СтрокаДанных.Номенклатура);
	СтруктураДанные.Вставить("Упаковка", 			СтрокаДанных.Упаковка);
	СтруктураДанные.Вставить("КоличествоУпаковок",  СтрокаДанных.КоличествоУпаковок);
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);			
	СтрокаДанных.Цена = СтруктураДанные.Цена;    
	СтрокаДанных.Упаковка = СтруктураДанные.Упаковка;

	// получаем остаток по текущей строке
	ЗаполнитьУчетныеДанныеСтроки(Объект.Запасы.Индекс(СтрокаДанных));
	
	СтрокаДанных.КоличествоВБазовыхЕИ = СтрокаДанных.КоличествоУпаковокПоДаннымУчета;	
		
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.КоличествоУпаковок) Тогда
		СтрокаДанных.КоличествоУпаковок = 1;
		ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаДанных);
	КонецЕсли;

	РассчитатьОтклонениеПоСтрокеТабличнойЧасти(СтрокаДанных);
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаДанных);
	РассчитатьСуммуУчетаТабЧасти(СтрокаДанных);

	ОбновитьЗаголовкиТабЧастейНаСервере();

КонецПроцедуры

&НаСервере
// Процедура заполняет конкретную строку учетными данными
// 
Процедура ЗаполнитьУчетныеДанныеСтроки(ИндексСтроки)
	
	Если ИндексСтроки = -1 Тогда
		Возврат;
	Иначе	
		Попытка
			СтрокаТЧ = Объект.Запасы[ИндексСтроки];
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗатраты.Номенклатура КАК Номенклатура,
	|	ТаблицаЗатраты.Партия КАК Партия,
	|	ТаблицаЗатраты.Упаковка КАК Упаковка,
	|	ТаблицаЗатраты.Коэффициент КАК Коэффициент,
	|	ТаблицаЗатраты.Количество КАК Количество,
	|	ТаблицаЗатраты.Цена КАК Цена,                                             
	|	ТаблицаЗатраты.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИнвентаризацияЗапасов
	|ИЗ
	|	&ТаблицаЗатраты КАК ТаблицаЗатраты";   	
	
	ТЗ = Объект.Запасы.Выгрузить(Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура));
	
	ТЗ.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(10,3)));
	
	Для Каждого СтрокаДанных Из ТЗ Цикл
		СтрокаДанных.Коэффициент = ?(СтрокаДанных.Упаковка.Коэффициент <> 0, СтрокаДанных.Упаковка.Коэффициент, 1);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаЗатраты", ТЗ);
	
	Запрос.Выполнить(); 	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияЗапасовЗапасы.Номенклатура,
	|	ИнвентаризацияЗапасовЗапасы.Партия,
	|	ИнвентаризацияЗапасовЗапасы.Упаковка,
	|	ИнвентаризацияЗапасовЗапасы.Коэффициент,
	|	ИнвентаризацияЗапасовЗапасы.Количество,
	|	ИнвентаризацияЗапасовЗапасы.Цена,
	|	ИнвентаризацияЗапасовЗапасы.КоличествоУпаковок,
	|	ВложенныйЗапрос.КоличествоПоДаннымУчета,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияЗапасовЗапасы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВложенныйЗапрос.КоличествоПоДаннымУчета
	|		ИНАЧЕ ВложенныйЗапрос.КоличествоПоДаннымУчета / ЕСТЬNULL(ИнвентаризацияЗапасовЗапасы.Коэффициент, 1)
	|	КОНЕЦ КАК КоличествоУпаковокПоДаннымУчета,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияЗапасовЗапасы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВложенныйЗапрос.КоличествоПоДаннымУчета
	|		ИНАЧЕ ВложенныйЗапрос.КоличествоПоДаннымУчета / ЕСТЬNULL(ИнвентаризацияЗапасовЗапасы.Коэффициент, 1)
	|	КОНЕЦ КАК КоличествоВБазовыхЕИ
	|ИЗ
	|	ИнвентаризацияЗапасов КАК ИнвентаризацияЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|			ЗапасыОстатки.Партия КАК Партия,
	|			СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоПоДаннымУчета
	|		ИЗ
	|			РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|					&ДатаСреза,
	|					СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						И Склад = &Склад) КАК ЗапасыОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗапасыОстатки.Партия,
	|			ЗапасыОстатки.Номенклатура) КАК ВложенныйЗапрос
	|		ПО ИнвентаризацияЗапасовЗапасы.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И ИнвентаризацияЗапасовЗапасы.Партия = ВложенныйЗапрос.Партия";
	     	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Запрос.УстановитьПараметр("Склад"				, Объект.Склад);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаСреза"			, ПолучитьДатуОстатков(ТекОбъект)); 
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Результат[0]);
	Иначе
		СтрокаТЧ.КоличествоПоДаннымУчета			= 0;
		СтрокаТЧ.КоличествоУпаковокПоДаннымУчета	= 0;   
	КонецЕсли;         	
	
	УпаковкаПоУмолчанию = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТЧ.Номенклатура, "УпаковкаПоУмолчанию");
	Если ЗначениеЗаполнено(УпаковкаПоУмолчанию)
		И Не ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
		
		СтрокаТЧ.КоличествоУпаковокПоДаннымУчета = СтрокаТЧ.КоличествоУпаковокПоДаннымУчета / УпаковкаПоУмолчанию.Коэффициент;
		СтрокаТЧ.Упаковка						 = УпаковкаПоУмолчанию;
	// ИначеЕсли Не ЗначениеЗаполнено(УпаковкаПоУмолчанию) Тогда
	//	СтрокаТЧ.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
	КонецЕсли;			
	
	ОбщегоНазначения.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	
КонецПроцедуры 

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере"
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ЗапасыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"                       , СтрокаТабличнойЧасти.Номенклатура);
		мПараметрыВыбора.Вставить("Склад"                          , Объект.Склад);
		мПараметрыВыбора.Вставить("СтруктурнаяЕдиница"             , Объект.СтруктурнаяЕдиница);
		мПараметрыВыбора.Вставить("Дата"                           , Объект.Дата);
		мПараметрыВыбора.Вставить("МножественныйВыбор"             , Истина);

		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,,Новый ОписаниеОповещения("ЗапасыПартияНачалоВыбораЗавершение", ЭтотОбъект, СтрокаТабличнойЧасти), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
		
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗапасыПартияНачалоВыбораЗавершение"
//
Процедура ЗапасыПартияНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Параметры.Партия = Результат[0];
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события "ОбработкаВыбора"
//
Процедура ЗапасыУпаковкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Элементы.Запасы.ТекущиеДанные.Упаковка = ВыбранноеЗначение Тогда 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды
//
Процедура ЗаполнитьПоОстаткамНаСкладеУпаковки(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаСкладеУпаковкиПослеВопросаОчиститьТЧ", ЭтотОбъект), НСтр("ru = 'Табличная часть будет очищена! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
		Возврат; 
	КонецЕсли;   	
	
	ЗаполнитьПоОстаткамНаСкладеУпаковкиЗавершение();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить по остаткам на складе упаковки после вопроса очистить ТЧ
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЗаполнитьПоОстаткамНаСкладеУпаковкиПослеВопросаОчиститьТЧ(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПоОстаткамНаСкладеУпаковкиЗавершение();

КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить по остаткам на складе упаковки завершение
//
Процедура ЗаполнитьПоОстаткамНаСкладеУпаковкиЗавершение()
	
	ПерезаполнитьЦены = Ложь;
	
	ЗаполнитьПоОстаткамНаСкладе(ПерезаполнитьЦены, Истина);
	
	Если ПерезаполнитьЦены Тогда 
		ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы");
	КонецЕсли;
	
	ОбработатьТЧЗапасыПослеЗаполненияУчетныхДанных();
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды
//
Процедура ЗаполнитьТолькоУчетныеДанныеПоУпаковкам(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТолькоУчетныеДанныеПоУпаковкамПослеВопросаОчиститьТЧ", ЭтотОбъект), НСтр("ru = 'Учетные данные будут очищены! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
        Возврат; 
	Иначе
		Возврат;
	КонецЕсли;

	ЗаполнитьТолькоУчетныеДанныеПоУпаковкамЗавершение(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить только учетные данные по упаковкам после вопроса очистить ТЧ
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЗаполнитьТолькоУчетныеДанныеПоУпаковкамПослеВопросаОчиститьТЧ(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьТолькоУчетныеДанныеПоУпаковкамЗавершение();

КонецПроцедуры

&НаКлиенте 
// Процедура - Заполнить только учетные данные по упаковкам фрагмент
//
Процедура ЗаполнитьТолькоУчетныеДанныеПоУпаковкамЗавершение()
	
	ЗаполнитьТолькоУчетныеДанные(Истина);         	
	
	ОбработатьТЧЗапасыПослеЗаполненияУчетныхДанных(Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗагрузитьДанныеИзТСД", загружает данные из ТСД
//
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	МенеджерОборудованияКлиент.ЗагрузитьДанныеИзТСД(УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаНадписьНажатие(Элемент)
	        
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
	СтруктураПараметров.Вставить("Ссылка", ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы());
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
    ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров,,,,,Новый ОписаниеОповещения("СтруктурнаяЕдиницаНадписьНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
   
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "СтруктурнаяЕдиницаНадписьНажатиеЗавершение"
//
Процедура СтруктурнаяЕдиницаНадписьНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если Объект.СтруктурнаяЕдиница <> Результат Тогда
			Объект.СтруктурнаяЕдиница = Результат;
			Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
			Объект.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды.
//
Процедура УстановитьОтборПоГруппамНоменклатуры(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОтбора", "ОтборПоГруппамНоменклатуры");
	ПараметрыФормы.Вставить("СписокЗначенийОтбора", СписокГруппНоменклатуры);
	
	Оповещение = Новый ОписаниеОповещения("УстановитьОтборЗавершение",ЭтаФорма);
	ОткрытьФорму("Документ.ИнвентаризацияЗапасов.Форма.ФормаВыбораЗначенийОтбора", ПараметрыФормы, ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды.
//
Процедура УстановитьОтборПоНоменклатуре(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОтбора", "ОтборПоНоменклатуре");
	ПараметрыФормы.Вставить("СписокЗначенийОтбора", СписокНоменклатуры);
	
	Оповещение = Новый ОписаниеОповещения("УстановитьОтборЗавершение",ЭтаФорма);
	ОткрытьФорму("Документ.ИнвентаризацияЗапасов.Форма.ФормаВыбораЗначенийОтбора", ПараметрыФормы, ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, получает данные из формы отбора.
//
Процедура УстановитьОтборЗавершение(Результат,Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		СписокЗначенийОтбора = ПолучитьИзВременногоХранилища(Результат.АдресСпискаЗначенийОтбора);
		ЗаголовокСписка = СформироватьЗаголовокОтбораИзСписка(СписокЗначенийОтбора);
		
		ВидОтбора = Результат.ВидОтбора;
		Если ВидОтбора = "ОтборПоНоменклатуре" Тогда
			СписокНоменклатуры = СписокЗначенийОтбора;
			Элементы.УстановитьОтборПоНоменклатуре.Заголовок = ЗаголовокСписка;						
		Иначе
			СписокГруппНоменклатуры = СписокЗначенийОтбора;
			Элементы.УстановитьОтборПоГруппамНоменклатуры.Заголовок = ЗаголовокСписка;
		КонецЕсли;	
		УстановитьОтбор();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет установку отбора.
//
Процедура УстановитьОтбор()
	
	ОтборИнвентаризации.Настройки.Отбор.Элементы.Очистить();
	Если СписокНоменклатуры.Количество() > 0 Тогда
		ЭлементОтбора = ОтборИнвентаризации.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокНоменклатуры;
		ЭлементОтбора.Использование  = Истина;	
	КонецЕсли;
	Если СписокГруппНоменклатуры.Количество() > 0 Тогда
		ЭлементОтбора = ОтборИнвентаризации.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура.Родитель");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		ЭлементОтбора.ПравоеЗначение = СписокГруппНоменклатуры;
		ЭлементОтбора.Использование  = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет формирование заголовков.
//
Функция СформироватьЗаголовокОтбораИзСписка(СписокЭлементов)
	
	ЗаголовокОтбораСтрока = "";
	Для каждого ЭлементСписка Из СписокЭлементов Цикл
		ЗаголовокОтбораСтрока = ЗаголовокОтбораСтрока + ?(ЗаголовокОтбораСтрока = "","","; ") + ЭлементСписка.Представление;		
	КонецЦикла;
	
	Если ЗаголовокОтбораСтрока = "" Тогда
		ЗаголовокОтбораСтрока = НСтр("ru='Отбор не установлен';en='Selection not installed'");
	КонецЕсли;
	
	Возврат ЗаголовокОтбораСтрока;
	
КонецФункции 

&НаКлиенте
// Процедура обработчик команды "Импорт".
//
Процедура Импорт(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "ИнвентаризацияЗапасов.Запасы");
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяОбъектаЗаполнения", "Документ.ИнвентаризацияЗапасов.ТабличнаяЧасть.Запасы");	
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ru = 'Загрузка запасов из файла'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	//	НастройкиЗагрузкиДанных.Вставить("ПоложениеДатыВЗаказе", Объект.ПоложениеДатыОтгрузки);
	//  НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайлаЗапасы");
	//	НастройкиЗагрузкиДанных.Вставить("ПоложениеСклада", Объект.ПоложениеСклада);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
// Процедура, создает меню управления табличными частями.
//
Процедура СоздатьМенюУправленияТабличнымиЧастями()
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Запасы"        , "ГруппаЗапасы");
	СтруктураМеню.Вставить("Дополнительно" , "ГруппаДополнительно");
		
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет подсчет количества строк в таб.частях и выводит его в заголовок панели.
//
Процедура ОбновитьЗаголовкиТабЧастейНаСервере()
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработатьНажатиеМеню(Элемент.Имя);
	
	Если Элемент.Имя = "_ГруппаЗапасы"
		И Элементы.Найти("_ПодборНоменклатур") <> Неопределено Тогда
		Если Элементы.ГруппаПодборНоменклатура.Видимость = Истина Тогда
			Элементы._ПодборНоменклатур.Обновить();  
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обрабатывает нажатие динамических кнопок.
//
Процедура ОбработатьНажатиеМеню(ИмяЭлемента)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
			
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления".
//
Процедура ЗапасыПослеУдаления(Элемент)
	
	ОбновитьЗаголовкиТабЧастейНаСервере();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЗапасыПриИзменении(Элемент)
	ОбновитьЗаголовкиТабЧастейНаСервере();
КонецПроцедуры

&НаКлиенте
// Процедура - Обработать ТЧЗапасы после заполнения учетных данных
//
Процедура ОбработатьТЧЗапасыПослеЗаполненияУчетныхДанных(ПересчитыватьКоличество = Истина) 
	
	Для каждого СтрокаЗапасы из Объект.Запасы Цикл
		
		Если ПересчитыватьКоличество Тогда
			ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаЗапасы);
		КонецЕсли;
		
		ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаЗапасы);
		РассчитатьОтклонениеПоСтрокеТабличнойЧасти(СтрокаЗапасы);
		РассчитатьСуммуУчетаТабЧасти(СтрокаЗапасы);     
	КонецЦикла;
	
КонецПроцедуры

#Область ФункцииИПроцедурыПодбора

&НаКлиенте
// Процедура, обработчик события "Выбор"
// 
Процедура Подключаемый_ПодборТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаПодбора = Элементы._ПодборНоменклатур.ТекущиеДанные;
	Если Не СтрокаПодбора = Неопределено и Не СтрокаПодбора.ЭтоГруппа Тогда					
		
		СтандартнаяОбработка = Ложь;
		Номенклатура = СтрокаПодбора.Номенклатура; 		
		МассивПартий = Новый Массив;		
		МассивПартий.Добавить(ПредопределенноеЗначение("Справочник.ПартииНоменклатуры.ПустаяСсылка"));		
		
		Если СтрокаПодбора.ИспользоватьПартии Тогда			
			
			СтруктураВыбора = Новый Структура;		
			СтруктураВыбора.Вставить("Номенклатура"        , Номенклатура);
			СтруктураВыбора.Вставить("СтруктурнаяЕдиница"  , Объект.СтруктурнаяЕдиница);
            СтруктураВыбора.Вставить("Склад"               , Объект.Склад);
            СтруктураВыбора.Вставить("Дата"                , Объект.Дата);
			СтруктураВыбора.Вставить("МножественныйВыбор"  , Истина);
            СтруктураВыбора.Вставить("ОтборРежимОтбора"    , 0);
			
			ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", СтруктураВыбора,,,,, Новый ОписаниеОповещения("Подключаемый_ПодборНоменклатураВыборЗавершение", ЭтотОбъект, Новый Структура("МассивПартий, Номенклатура", МассивПартий, Номенклатура)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Возврат;	
			
		КонецЕсли;
		Подключаемый_ПодборНоменклатураВыборОбработка(МассивПартий, Номенклатура);
		
	КонецЕсли;	 
	
КонецПроцедуры 

&НаСервере
// Процедура, обновляет дерево номенклатуры при изменении склада
// 
Процедура СкладПриИзмененииПодбор()
	
   Элементы._ПодборНоменклатур.ТекущаяСтрока   = Неопределено;
   Элементы._ПодборНоменклатур.ТекущийРодитель = Неопределено;
   ОбработкаТабличныхЧастейКлиент.СкладПриИзмененииДинамическогоСпискаПодбор(ЭтаФорма, Объект,
   Объект.Ссылка.Метаданные().ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора[0].Значение, Истина, "ГруппаПодборНоменклатура");	
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет установку видимости подбора.
// 
Процедура СкрытьПодборНаСервере()
	
	Элементы.ГруппаПодборНоменклатура.Видимость = Не Элементы.ГруппаПодборНоменклатура.Видимость;
	Элементы.ЗапасыСкрытьПодбор.Пометка = Элементы.ГруппаПодборНоменклатура.Видимость; 	
	Элементы.Запасы.МаксимальнаяШирина = ?(Элементы.ГруппаПодборНоменклатура.Видимость, 99,140);	
	
КонецПроцедуры

// Процедура - Подключаемый подбор номенклатура выбор завершение
// Завершение немодального открытия окна формы - Справочник Партии номенклатуры ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения
// 
&НаКлиенте
Процедура Подключаемый_ПодборНоменклатураВыборЗавершение(Результат, Параметры)  Экспорт
	
	МассивПартий = Параметры.МассивПартий;
	Номенклатура = Параметры.Номенклатура;
	Если Не Результат = Неопределено Тогда
		МассивПартий = Результат;			
	КонецЕсли;
	Подключаемый_ПодборНоменклатураВыборОбработка(МассивПартий, Номенклатура);
	
КонецПроцедуры

// Процедура - Подключаемый подбор номенклатура выбор обработка
// Завершение процедуры - Подключаемый подбор номенклатура выбор завершение
// Параметры:
//  МассивПартий - 	 Массив партий 
//  Номенклатура - 	 Номенклатура
// 
&НаКлиенте
Процедура Подключаемый_ПодборНоменклатураВыборОбработка(МассивПартий, Номенклатура)
	
	Для Каждого СтрокаМассива из МассивПартий Цикл
		НайденныеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("Номенклатура, Партия", Номенклатура, СтрокаМассива));
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТЧ = НайденныеСтроки[0];				
			СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок + 1;
			ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТЧ); 
			
			РассчитатьОтклонениеПоСтрокеТабличнойЧасти(СтрокаТЧ);
			ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаТЧ);
			РассчитатьСуммуУчетаТабЧасти(СтрокаТЧ);
			
		Иначе
			НоваяСтрока = Объект.Запасы.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.Партия       = СтрокаМассива;								
			ЗапасыНоменклатураПриИзменении(Элементы.ЗапасыНоменклатура, НоваяСтрока);
		КонецЕсли; 
		
		ОбновитьЗаголовкиТабЧастейНаСервере();
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти 

#Область ЗагрузкаДанныхИзВнешнегоИсточника

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТовары = Объект.Запасы.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;		
		НоваяСтрокаТовары.Цена = СтрокаТаблицы.Цена;
		НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
				
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
			НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		Иначе
			НоваяСтрокаТовары.СтавкаНДС = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация.СтавкаНДС;
		КонецЕсли;
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных)
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	Для каждого СтрокаТаблицы Из Объект.Запасы Цикл 
		ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ИменаСвойств = "Номенклатура, Количество, Партия";
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, ИменаСвойств);

				Если СтрокаТаблицы.Цена > 0 Тогда				
					НоваяСтрока.Цена = СтрокаТаблицы.Цена;					
				Иначе
					
					СтруктураДанные = Новый Структура();
					СтруктураДанные.Вставить("СтруктурнаяЕдиница",  Объект.СтруктурнаяЕдиница);
					СтруктураДанные.Вставить("ДатаОбработки",	 	Объект.Дата);
					СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
					СтруктураДанные.Вставить("Номенклатура", 		НоваяСтрока.Номенклатура);
					СтруктураДанные.Вставить("Упаковка", 			НоваяСтрока.Упаковка);
					
					СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
					
					НоваяСтрока.Упаковка = СтруктураДанные.Упаковка;
					НоваяСтрока.Цена 	  = СтруктураДанные.Цена; 
					
				КонецЕсли; 
				
				НоваяСтрока.КоличествоУпаковок = СтрокаТаблицы.Количество;
				// НоваяСтрока.КоличествоУпаковокПоДаннымУчета = СтрокаТаблицы.Количество;
				// НоваяСтрока.СуммаУчет = НоваяСтрока.КоличествоУпаковокПоДаннымУчета * НоваяСтрока.Цена;	
				НоваяСтрока.Упаковка = ?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаПоУмолчанию), СтрокаТаблицы.УпаковкаПоУмолчанию, СтрокаТаблицы.Номенклатура.УпаковкаПоумолчанию);	
				НоваяСтрока.ХарактеристикиИспользуются = СтрокаТаблицы.Номенклатура.ИспользоватьПартии;
				
				ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(НоваяСтрока);			
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(НоваяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		ОбновитьЗаголовкиТабЧастейНаСервере();

	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ИнвентаризацияЗапасов, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
// Процедура При чтении на сервере.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
	Иначе
		Элементы.ГруппаСостояниеОбъекта.Видимость = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

#КонецОбласти    

#КонецОбласти
