
#Область СлужебныйПрограммныйИнтерфейс

// Получить параметры действия скидок/наценок 
Функция ПолучитьПарамтерыДействияСкидки(СкидкаНаценка, СтруктурнаяЕдиница = Неопределено) Экспорт	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДействиеСкидокНаценокСрезПоследних.СтруктурнаяЕдиница,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаНачала,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаОкончания,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя КАК ТипПолучателя,
	|	ДействиеСкидокНаценокСрезПоследних.КоличествоПрименений,
	|	ДействиеСкидокНаценокСрезПоследних.КоличествоПримененийПоКлиенту
	|ИЗ
	|	РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(
	|			,
	|			СкидкаНаценка = &СкидкаНаценка
	|				И ВЫБОР
	|					КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ДействиеСкидокНаценокСрезПоследних");
	
	Запрос.УстановитьПараметр("СкидкаНаценка"      , СкидкаНаценка);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , СтруктурнаяЕдиница);

	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

#КонецОбласти
