
#Область СлужебныйПрограммныйИнтерфейс

// Функция - определяет родство.
//
Функция ОпределитьРодство(Контрагент, Родственник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РодственныеСвязи.СтепеньРодства
	               |ИЗ
	               |	РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
	               |ГДЕ
	               |	РодственныеСвязи.Контрагент = &Контрагент
	               |	И РодственныеСвязи.Родственник = &Родственник";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Родственник", Родственник);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.СтепеньРодства;
	Иначе
		Возврат Справочники.СтепеньРодства.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Функция - Родственники клиента.
//
// Параметры:
//  СтепеньРодства	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РодственникиКлиента(
	Контрагент, 
	СтепеньРодства = Неопределено, 
	ОбщийЛицевойСчет = Неопределено, 
	ЗаконныйПредставитель = Неопределено, 
	ОбщийБонусныйСчет = Неопределено) Экспорт
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РодственныеСвязи.Родственник КАК Родственник,
	|	РодственныеСвязи.СтепеньРодства КАК СтепеньРодства,
	|	РодственныеСвязи.СтепеньРодства.Наименование КАК СтепеньРодстваНаименование,
	|	РодственныеСвязи.СтепеньРодства.ИмяПредопределенныхДанных КАК СтепеньРодстваИмяПредопределенныхДанных,
	|	РодственныеСвязи.ЗаконныйПредставитель КАК ЗаконныйПредставитель,
	|	РодственныеСвязи.РеквизитыДокументаЗаконногоПредставителя КАК РеквизитыДокументаЗаконногоПредставителя,
	|	РодственныеСвязи.ОбщийБонусныйСчет КАК ОбщийБонусныйСчет
	|ИЗ
	|	РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Контрагент <> НЕОПРЕДЕЛЕНО
	|				ТОГДА РодственныеСвязи.Контрагент = &Контрагент
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И РодственныеСвязи.Родственник.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &СтепеньРодства <> НЕОПРЕДЕЛЕНО
	|				ТОГДА РодственныеСвязи.СтепеньРодства = &СтепеньРодства
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЗаконныйПредставитель <> НЕОПРЕДЕЛЕНО
	|				ТОГДА РодственныеСвязи.ЗаконныйПредставитель = &ЗаконныйПредставитель
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОбщийЛицевойСчет <> НЕОПРЕДЕЛЕНО
	|				ТОГДА РодственныеСвязи.ОбщийЛицевойСчет = &ОбщийЛицевойСчет
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОбщийБонусныйСчет <> НЕОПРЕДЕЛЕНО
	|				ТОГДА РодственныеСвязи.ОбщийБонусныйСчет = &ОбщийБонусныйСчет
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("Контрагент"      	 					, ?(ЗначениеЗаполнено(Контрагент)  	   , Контрагент  	 , Неопределено));
	Запрос.УстановитьПараметр("СтепеньРодства"  	 					, ?(ЗначениеЗаполнено(СтепеньРодства)  , СтепеньРодства  , Неопределено));
	Запрос.УстановитьПараметр("ОбщийЛицевойСчет"	 					, ?(ЗначениеЗаполнено(ОбщийЛицевойСчет), ОбщийЛицевойСчет, Неопределено));
	Запрос.УстановитьПараметр("ЗаконныйПредставитель"					, ?(ЗначениеЗаполнено(ЗаконныйПредставитель), ЗаконныйПредставитель, Неопределено));
	Запрос.УстановитьПараметр("ОбщийБонусныйСчет"                       , ?(ЗначениеЗаполнено(ОбщийБонусныйСчет), ОбщийБонусныйСчет, Неопределено));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура - Удалить все родственные связи контрагента
//
// Параметры:
//  СсылкаНаКонтрагента	 - 	 - 
//
Процедура УдалитьВсеРодственныеСвязиКонтрагента(СсылкаНаКонтрагента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Удалить прямую запись.
	НаборЗаписейРодственныеСвязи = СоздатьНаборЗаписей();
	НаборЗаписейРодственныеСвязи.Отбор.Контрагент.Установить(СсылкаНаКонтрагента);
	НаборЗаписейРодственныеСвязи.Записать();
	
	// Удалить обратную запись.
	НаборЗаписейРодственныеСвязи = СоздатьНаборЗаписей();
	НаборЗаписейРодственныеСвязи.Отбор.Родственник.Установить(СсылкаНаКонтрагента);
	НаборЗаписейРодственныеСвязи.Записать();
	
КонецПроцедуры

#КонецОбласти