
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеТребуетсяОбратнаяЗапись") И ДополнительныеСвойства.НеТребуетсяОбратнаяЗапись = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбратнаяЗаписьНабор = РегистрыСведений.РодственныеСвязи.СоздатьНаборЗаписей();
	ОбратнаяЗаписьНабор.ДополнительныеСвойства.Вставить("НеТребуетсяОбратнаяЗапись", Истина);
	ОбратнаяЗаписьНабор.Отбор.Контрагент.Установить(ЭтотОбъект.Отбор.Родственник.Значение);
	ОбратнаяЗаписьНабор.Отбор.Родственник.Установить(ЭтотОбъект.Отбор.Контрагент.Значение);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ОбратнаяЗапись					 = ОбратнаяЗаписьНабор.Добавить();
		ОбратнаяЗапись.Контрагент		 = Запись.Родственник;
		ОбратнаяЗапись.Родственник		 = Запись.Контрагент;
		ОбратнаяЗапись.СтепеньРодства	 = Запись.СтепеньРодства;
		ОбратнаяЗапись.СтепеньРодства	 = Справочники.СтепеньРодства.ПолучитьОбратнуюСтепеньРодства(Запись.СтепеньРодства, Запись.Контрагент.ПолКлиента);
		ЗаполнитьЗначенияСвойств(ОбратнаяЗапись, Запись,, "Контрагент, Родственник, СтепеньРодства, ЗаконныйПредставитель");
		
	КонецЦикла;
	
	ОбратнаяЗаписьНабор.Записать();

КонецПроцедуры

#КонецОбласти