
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСтруктуруПараметровФормы(ПараметрСсылка)
	
	СтруктураПараметровФормы = Новый Структура;
	
	ЗначенияЗаполнения = Новый Структура;
	
	Если ТипЗнч(ПараметрСсылка) = Тип("СправочникСсылка.ШаблоныЭлектронныхПисем") И НЕ ПараметрСсылка.ЭтоГруппа Тогда
		СтруктураПараметровФормы.Вставить("ЗначенияЗаполнения", Новый Структура("ШаблонПисьма", ПараметрСсылка));
	Иначе
		СтруктураПараметровФормы.Вставить("Отказ", Истина);
	КонецЕсли;
	
	Возврат СтруктураПараметровФормы;
	
КонецФункции// ПолучитьСтруктуруПараметровФормы(ПараметрСсылка)

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПолучитьСтруктуруПараметровФормы(ПараметрКоманды);
	
	ОткрыватьФорму = Истина;
	
	Если ПараметрыФормы.Свойство("Отказ") Тогда
		
		ОткрыватьФорму = НЕ ПараметрыФормы.Отказ;
		
	КонецЕсли;
	
	Если ОткрыватьФорму Тогда
			
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти