
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбрабочтикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ДокументРеестра = Параметры.АктОказанияУслуг;
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументРеестра) Тогда
		ЭтотОбъект.Отправитель = ЭтотОбъект.ДокументРеестра.СтруктурнаяЕдиница.Организация;
		ЭтотОбъект.Получатель = ЭтотОбъект.ДокументРеестра.Контрагент;
		
		ОпределитьКоличествоПакетовОбмена();
		
		// определим параметры отображения списка пакетов за этот период
		
		ЭтотОбъект.СписокПакетовОтчетногоПериода.Параметры.УстановитьЗначениеПараметра(
			"Период", НачалоМесяца(ДокументРеестра.НачалоПериода)
		);
		ЭтотОбъект.СписокПакетовОтчетногоПериода.Параметры.УстановитьЗначениеПараметра(
			"Источник", ДокументРеестра.СтруктурнаяЕдиница.Организация
		);
		ЭтотОбъект.СписокПакетовОтчетногоПериода.Параметры.УстановитьЗначениеПараметра(
			"Получатель", ДокументРеестра.Контрагент
		);
		
		СформироватьДанныеОФайлахДокумента();
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбрабочтикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоСформированныеФайлыИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПолучитьФайл(ТекДанные.АдресХранилища, ТекДанные.ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДеревоСформированныеФайлыИмяФайлаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.Родитель) Тогда
			Расширение = ".ZIP";
			ИмяФайлаВРег = ВРег(ТекДанные.ИмяФайла);
			Если Найти(ИмяФайлаВРег, Расширение) = 0 Тогда
				ТекДанные.ИмяФайла = ТекДанные.ИмяФайла + Расширение;
			КонецЕсли;
		Иначе
			Расширение = ".XML";
			ИмяФайлаВРег = ВРег(ТекДанные.ИмяФайла);
			Если Найти(ИмяФайлаВРег, Расширение) = 0 Тогда
				ТекДанные.ИмяФайла = ТекДанные.ИмяФайла + Расширение;
			КонецЕсли;
		КонецЕсли; ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСформированныеФайлыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ЭтоАрхив = НЕ ЗначениеЗаполнено(ТекДанные.Родитель);
		Элементы.ПроверитьАрхив.Доступность = ЭтоАрхив И НЕ ТекДанные.Входящий;
		Элементы.СохранитьФайл.Доступность = ЭтоАрхив И НЕ ЗначениеЗаполнено(ТекДанные.СсылкаФайл);
		Элементы.РегистрацияПакета.Доступность = ЭтоАрхив И 
												 ТекДанные.Прикреплен И
												 НЕ ТекДанные.Зарегистрирован;
		Элементы.УдалитьФайлОбмена.Доступность = ЭтоАрхив;
	Иначе
		Элементы.ПроверитьАрхив.Доступность = Ложь;
		Элементы.СохранитьФайл.Доступность = Ложь;
		Элементы.РегистрацияПакета.Доступность = Ложь;
		Элементы.УдалитьФайлОбмена.Доступность = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСформированныеФайлыПередНачаломИзменения(Элемент, Отказ)
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	Если ТекДанные <> Неопределено И
		Элемент.ТекущийЭлемент <> Неопределено И
		Элемент.ТекущийЭлемент.Имя = "ДеревоСформированныеФайлыИмяФайла"
	Тогда
		Отказ = (ТекДанные.Прикреплен ИЛИ ТекДанные.Зарегистрирован);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСформированныеФайлыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСформированныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	Если ТекДанные <> Неопределено И
		Элемент.ТекущийЭлемент <> Неопределено И
		Элемент.ТекущийЭлемент.Имя = "ДеревоСформированныеФайлыКнопкаПросмотра"
	Тогда
		СтандартнаяОбработка = Ложь;
		ПолучитьФайл(ТекДанные.АдресХранилища, ТекДанные.ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьФайлыОбмена(Команда)
	ЭлементыДерева =ЭтотОбъект.ДеревоСформированныеФайлы.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	СформироватьФайлыОбменаСервер();
	СформироватьДанныеОФайлахДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	// сохраняем только те, что без ссылки
	Если ТекДанные <> Неопределено И
		 НЕ ЗначениеЗаполнено(ТекДанные.Родитель) И
		 НЕ ЗначениеЗаполнено(ТекДанные.СсылкаФайл)
	Тогда
		
		ФайлОтвет_ = СохранитьФайл_Сервер(ТекДанные.ИмяФайла, ТекДанные.АдресХранилища);
		Если ЗначениеЗаполнено(ФайлОтвет_) Тогда
			ТекДанные.СсылкаФайл = ФайлОтвет_;
			ТекДанные.Прикреплен = Истина;
			// дочерним узлам тоже проставим признак прикрепленности
			УзелДерева = Неопределено;
			Пока ОбщегоНазначенияКлиентСервер.ОбходДерева_Следующий(ЭтотОбъект.ДеревоСформированныеФайлы, УзелДерева) Цикл
				Если УзелДерева.Родитель = ТекДанные.УникальныйИдентификатор Тогда
					УзелДерева.СсылкаФайл = ФайлОтвет_;
					УзелДерева.Прикреплен = Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ПоказатьСообщение("РегистрацияПакетовИО_СохранениеНеУдалось");
		КонецЕсли;
		Элементы.ДеревоСформированныеФайлы.Обновить();
		ДеревоСформированныеФайлыПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияПакета(Команда)
	
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	// сохраняем только те, что без ссылки
	Если ТекДанные <> Неопределено И
		 НЕ ЗначениеЗаполнено(ТекДанные.Родитель) И
		 ТекДанные.Прикреплен = Истина И
		 ТекДанные.Зарегистрирован = Ложь
	Тогда
		Ответ = РегистрацияПакета_Сервер(ТекДанные.СсылкаФайл, ТекДанные.Входящий);
		Если Ответ Тогда
			ТекДанные.Зарегистрирован = Истина;
			// дочерним узлам тоже проставим признак прикрепленности
			УзелДерева = Неопределено;
			Пока ОбщегоНазначенияКлиентСервер.ОбходДерева_Следующий(ЭтотОбъект.ДеревоСформированныеФайлы, УзелДерева) Цикл
				Если УзелДерева.Родитель = ТекДанные.УникальныйИдентификатор Тогда
					УзелДерева.Зарегистрирован = Истина;
				КонецЕсли;
			КонецЦикла;
			Элементы.ДеревоСформированныеФайлы.Обновить();
			Элементы.СписокПакетовОтчетногоПериода.Обновить();
			ДеревоСформированныеФайлыПриАктивизацииСтроки(Неопределено);
		КонецЕсли; 
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаРегистрации(Команда)
	ТекДанные = Элементы.СписокПакетовОтчетногоПериода.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		МассивФайловДляОбновленияРегистрации = Новый Массив();
		МассивФайловДляОбновленияРегистрации.Добавить(ТекДанные.ФайлОбмена);
		Ответ = ОтменаРегистрации_Сервер(ТекДанные.Период,
								ТекДанные.НомерПакета,
								ТекДанные.Отправитель,
								ТекДанные.Получатель,
								ТекДанные.Входящий
							);
		Если Ответ Тогда
			ОбновитьЗарегистрированныеФайлы(МассивФайловДляОбновленияРегистрации);
			Элементы.СписокПакетовОтчетногоПериода.Обновить();
			Элементы.ДеревоСформированныеФайлы.Обновить();
			ДеревоСформированныеФайлыПриАктивизацииСтроки(Неопределено);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАрхив(Команда)
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Ответ = ПроверитьФайл_Сервер(ТекДанные.ИмяФайла, ТекДанные.АдресХранилища);
		Если Ответ = Ложь Тогда
			ВывестиПредупреждение("ОбменДанными_ФайлНеПрошелПроверку",
													Новый Структура("ИмяФайла", ТекДанные.ИмяФайла)
												);
		Иначе
			Состояние("Проверка файла «" + ТекДанные.ИмяФайла + "» прошла успешно.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлОбмена(Команда)
	
	Обработчик = Новый ОписаниеОповещения("ДобавитьФайлПослеУстановкиРасширения", ЭтотОбъект);
	
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Обработчик);
	
КонецПроцедуры
	
#КонецОбласти  

&НаКлиенте
// Процедура - Добавить файл после установки расширения
//
// Параметры:
//  Ответ					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДобавитьФайлПослеУстановкиРасширения(Ответ, ДополнительныеПараметры) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ДобавитьФайлПослеПодключенияРасширения", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить файл после подключения расширения
//
// Параметры:
//  Подключено				 - 	 - 
//  ДополнительныеПараметры1 - 	 - 
//
Процедура ДобавитьФайлПослеПодключенияРасширения(Подключено, ДополнительныеПараметры1) Экспорт
	
	Если НЕ Подключено Тогда
		ПоказатьПредупреждениеОНеобходимостиРасширенияРаботыСФайлами(Неопределено);
		Возврат;
	КонецЕсли;
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = Получить("РегистрацияПакетовИО_ВыборФайлаОбменаДанными_ОМС");
	ВыборФайла.Фильтр = НСтр("ru = 'Архивы ZIP (*.zip)|*.zip*'");
	ВыборФайла.ПредварительныйПросмотр = Ложь;
	ВыборФайла.Показать(Новый ОписаниеОповещения("ДобавитьФайлПослеВыбораФайла", ЭтотОбъект, Новый Структура("ВыборФайла", ВыборФайла)));

КонецПроцедуры

&НаКлиенте
// Процедура - Добавить файл после выбора файла
//
// Параметры:
//  ВыбранныеФайлы			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДобавитьФайлПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ВыборФайла = ДополнительныеПараметры.ВыборФайла;
		
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ПолныйПутьКФайлу = ВыборФайла.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;
	ЗагружаемыйФайл =  Новый ДвоичныеДанные(ПолныйПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ЗагружаемыйФайл, ЭтотОбъект.УникальныйИдентификатор);
	
	СтрокиПути = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуПоТочкамИСлэшам(ПолныйПутьКФайлу);
	Если СтрокиПути.Количество() >= 2 Тогда
		Расширение = СтрокиПути[СтрокиПути.Количество()-1];
		ИмяБезРасширения = СтрокиПути[СтрокиПути.Количество()-2];
		ПолноеИмяФайла = ИмяБезРасширения + "." + Расширение;
	Иначе
		ВызватьИсключение Получить("РегистрацияПакетовИО_ОшибкаПриПомещенииФайлаВХранилище",Новый Структура("Файл",ПолныйПутьКФайлу));
	КонецЕсли;
	
	ДобавитьФайлОбмена_Сервер(ВРег(ИмяБезРасширения), ВРег(Расширение), АдресХранилища);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлОбмена(Команда)
	
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	// сохраняем только те, что без ссылки
	Если ТекДанные <> Неопределено И НЕ ЗначениеЗаполнено(ТекДанные.Родитель) Тогда
		
		Если ТекДанные.Зарегистрирован = Истина Тогда
			ОбработкаОтвета = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбОтменеРегистрации", ЭтотОбъект);
			ПоказатьВопрос(ОбработкаОтвета,
							Получить("РегистрацияПакетовИО_ХотитеОтменитьРегистрациюФайлаИУдалитьЕго"),
							РежимДиалогаВопрос.ДаНет
						);
		Иначе
			УдалитьТекущийФайлОбменаНепосредственно();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбОтменеРегистрации(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьТекущийФайлОбменаНепосредственно();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТекущийФайлОбменаНепосредственно()
	
	ТекДанные = Элементы.ДеревоСформированныеФайлы.ТекущиеДанные;
	
	Ответ = УдалитьФайлОбмена_Сервер(ТекДанные.СсылкаФайл, ТекДанные.Прикреплен, ТекДанные.Зарегистрирован, ТекДанные.Входящий);
	
	Если Ответ Тогда
		Ид = ДеревоСформированныеФайлы.ПолучитьЭлементы().Индекс(ТекДанные);
		ДеревоСформированныеФайлы.ПолучитьЭлементы().Удалить(Ид);
	КонецЕсли;
		
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////
// Вспомогательные Методы
//

&НаСервере
Функция ПроверкаЗаполнения()
	
	Отказ = Ложь;
	
	// Если НЕ ЗначениеЗаполнено(ДокументРеестра) Тогда
	//	СообщенияПользователю.Показать("РегистрацияПакетовИО_НеЗаполненДокументРеестра");
	//	Отказ = Истина;
	// КонецЕсли;
	//
	// Код_ = ФормированиеРеестровСчетовПереопределяемый.ПолучитьЗначениеРеквизитаФормированияРеестра(
	//																	ДокументРеестра.Организация,
	//																	ДокументРеестра.ИсточникФинансирования
	//																);
	// Если НЕ ЗначениеЗаполнено(Код_) Тогда
	//	СообщенияПользователю.Показать("РегистрацияПакетовИО_НеЗаполненРеестровыйНомерОрганизации");
	//	Отказ = Истина;
	// КонецЕсли; 
	//
	// Код_ = ФормированиеРеестровСчетовПереопределяемый.ПолучитьЗначениеРеквизитаФормированияРеестра(
	//																	ДокументРеестра.Контрагент,
	//																	ДокументРеестра.ИсточникФинансирования
	//																);
	// Если НЕ ЗначениеЗаполнено(Код_) Тогда
	//	СообщенияПользователю.Показать("РегистрацияПакетовИО_НеЗаполненРеестровыйНомерКонтрагента");
	//	Отказ = Истина;
	// КонецЕсли; 
	//
	// Если НЕ ЗначениеЗаполнено(ДокументРеестра.НачалоПериода) Тогда
	//	СообщенияПользователю.Показать("РегистрацияПакетовИО_НеЗаполненаДатаОтчетногоПериода");
	//	Отказ = Истина;
	// КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДокументРеестра.ОкончаниеПериода) Тогда
		ПоказатьСообщение("РегистрацияПакетовИО_НеЗаполненаДатаОтчетногоПериода");
		Отказ = Истина;
	КонецЕсли; 
	
	Возврат Отказ;
КонецФункции

&НаСервере
Процедура ОбновитьЗарегистрированныеФайлы(МассивФайловДляПроверкиРегистрации)
	
	СоответствиеФайлЗарегистрирован = ОпределитьЗарегистрированныеФайлы(МассивФайловДляПроверкиРегистрации);
	
	Для каждого ЭлементСоответствия Из СоответствиеФайлЗарегистрирован Цикл
		УзелДерева = Неопределено;
		Пока ОбщегоНазначенияКлиентСервер.ОбходДерева_Следующий(ЭтотОбъект.ДеревоСформированныеФайлы, УзелДерева) Цикл
			Если УзелДерева.СсылкаФайл = ЭлементСоответствия.Ключ Тогда
				УзелДерева.Зарегистрирован = ЭлементСоответствия.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ОпределитьЗарегистрированныеФайлы(МассивФайлов)
	
	СоответствиеВозврат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	РегистрацияПакетовИнформационногоОбмена.ФайлОбмена
			|ИЗ
			|	РегистрСведений.РегистрацияПакетовИнформационногоОбмена КАК РегистрацияПакетовИнформационногоОбмена
			|ГДЕ
			|	РегистрацияПакетовИнформационногоОбмена.ФайлОбмена В(&Файлы)";
			
	Запрос.УстановитьПараметр("Файлы", МассивФайлов);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФайлОбмена");
	Для каждого Файл Из МассивФайлов Цикл
		Поиск = Результат.Найти(Файл);
		Если Поиск = Неопределено Тогда
			Зарегистрирован = Ложь;
		Иначе
			Зарегистрирован = Истина;
		КонецЕсли; 
		СоответствиеВозврат.Вставить(Файл, Зарегистрирован);
	КонецЦикла; 
	
	Возврат СоответствиеВозврат;
	
КонецФункции

&НаСервере
Процедура ОпределитьКоличествоПакетовОбмена()
	
	СледНомер = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.ПолучитьСледующийНомерПакетаОтчетногоПериода(
																ДокументРеестра.НачалоПериода,
																ДокументРеестра.СтруктурнаяЕдиница.Организация,
																ДокументРеестра.Контрагент
															);
															
	ЭтотОбъект.КоличествоСформированныхПакетов = СледНомер - 1;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеОФайлахДокумента()
	
	МассивФайловДокумента = РаботаСФайламиСлужебныйВызовСервераСтоматология.ПолучитьВсеПодчиненныеФайлы(ЭтотОбъект.ДокументРеестра);
	ВременныйКаталог = КаталогВременныхФайлов();
	МассивФайловДляУдаления = Новый Массив();
	МассивФайловДляПроверкиРегистрации = Новый Массив();
	
	Для Каждого ФайлСсылка Из МассивФайловДокумента Цикл
		
		Если ФайлСсылка.ПометкаУдаления = Ложь Тогда
			// Получим только не помеченные на удаление
			// получим только архивы не помеченные на удаление.
			ОбщиеДанныеОФайле = РаботаСФайламиСлужебныйВызовСервераСтоматология.ДанныеФайлаИДвоичныеДанные2(ФайлСсылка);
			ДанныеОФайле = ОбщиеДанныеОФайле.ДанныеФайла;
			Если ВРег(ДанныеОФайле.Расширение) = "ZIP" Тогда
				АдресФайла = РаботаСФайламиСлужебныйВызовСервераСтоматология.ПолучитьНавигационнуюСсылкуДляОткрытия2(ДанныеОФайле.Версия);
				
				ПутьКФайлуАрхива = ВременныйКаталог + ДанныеОФайле.ПолноеНаименованиеВерсии;
				ОбщиеДанныеОФайле.ДвоичныеДанные.Записать(ПутьКФайлуАрхива);
				МассивФайловДляУдаления.Добавить(ПутьКФайлуАрхива);
				
				ИмяПапкиДляСоздания = СтрЗаменить(ДанныеОФайле.ПолноеНаименованиеВерсии,".ZIP","");
				ИмяПапкиДляСоздания = СтрЗаменить(ИмяПапкиДляСоздания,".zip","");
				
				// проверка возможности распаковки /////////////////////////////////
				ПутьРаспаковки = ВременныйКаталог + ИмяПапкиДляСоздания;
				Архив = РаспаковатьАрхив(ПутьКФайлуАрхива, ПутьРаспаковки);
				Если Архив = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				МассивФайловДляУдаления.Добавить(ПутьРаспаковки);
				///////////////////////////////////////////////////////////////////////////////
				
				// проверим является ли файл внешним
				Входящий = ПроверитьИмяФайлаНаОтправителяИОтчетныйПериод(
																							ИмяПапкиДляСоздания,
																							Неопределено,
																							ДокументРеестра.Контрагент,
																							ДокументРеестра.СтруктурнаяЕдиница.Организация,
																							ДокументРеестра.НачалоПериода
																						);
				// заполним дерево по архиву
				АрхивУИ = Новый УникальныйИдентификатор;
				ДобавитьУзелДерева(ДанныеОФайле.ПолноеНаименованиеВерсии,
									"",
									АдресФайла,
									ДанныеОФайле.Расширение,
									АрхивУИ,
									ФайлСсылка,
									Входящий
								);
				МассивФайловДляПроверкиРегистрации.Добавить(ФайлСсылка);
				
				Для каждого ЭлементАрхива Из Архив.Элементы Цикл
					ФайлУИ = Новый УникальныйИдентификатор;
					ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьРаспаковки + "\" + ЭлементАрхива.Имя);
					Файл_Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ЭтотОбъект.УникальныйИдентификатор);
					ДобавитьУзелДерева(ЭлементАрхива.Имя,
										АрхивУИ,
										Файл_Адрес,
										ЭлементАрхива.Расширение,
										ФайлУИ,
										ФайлСсылка,
										Входящий
									);
				КонецЦикла; 
			КонецЕсли; // если архив
		КонецЕсли; // если не удален
	КонецЦикла;
	
	УдалитьФайлыПоМассивуПутей(МассивФайловДляУдаления);
	
	ОбновитьЗарегистрированныеФайлы(МассивФайловДляПроверкиРегистрации);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУзелДерева(ИмяФайла, РодительУИ, АдресВХранилище, Расширение, УИ, ФайлСсылка = Неопределено, Входящий = Ложь)
	
	КартинкаОтображения = БиблиотекаКартинок.ПиктограммаФайла_XML;
	Если ВРег(Расширение) = "ZIP" Тогда
		КартинкаОтображения = БиблиотекаКартинок.ПиктограммаФайла_WinRar;
	КонецЕсли; 
	
	Стр = Новый Структура("ИмяФайла, Родитель, АдресХранилища, Картинка, УникальныйИдентификатор, СсылкаФайл, Прикреплен, Входящий",
							ИмяФайла,
							Строка(РодительУИ),
							АдресВХранилище,
							КартинкаОтображения,
							Строка(УИ),
							ФайлСсылка,
							ЗначениеЗаполнено(ФайлСсылка),
							Входящий
						);
	НовыйУзел = ОбходИерархии_СоздатьУзелДерева(
																Стр,
																ЭтотОбъект.ДеревоСформированныеФайлы,
																"УникальныйИдентификатор"
															);
	ЗаполнитьЗначенияСвойств(НовыйУзел, Стр);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьФайлыОбменаСервер()
	Отказ = ПроверкаЗаполнения();
	Если Отказ = Ложь Тогда
		ИмяАрхива = ПолучитьИмяФайлаИнформационногоОбмена(
																"ZIP",
																Неопределено,
																ДокументРеестра.СтруктурнаяЕдиница.Организация,
																ДокументРеестра.Контрагент,
																ДокументРеестра.НачалоПериода
															) + ".ZIP";
		ВременныйКаталог = КаталогВременныхФайлов();
		ПутьКАрхиву = ВременныйКаталог + ИмяАрхива;
		
		АрхивДляОтправки = Новый ЗаписьZipФайла(ПутьКАрхиву);
		
		// файл мед помощи
		Объект_ZL_LIST = СоздатьОбъект_ZL_LIST(ДокументРеестра);
		Если Объект_ZL_LIST = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		// файл ПД
		Объект_PERS_LIST = СоздатьОбъект_PERS_LIST(ДокументРеестра);
		Если Объект_PERS_LIST = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		ИмяФайла_ZL_LIST = Объект_ZL_LIST.ZGLV.FILENAME +".XML";
		ПутьКФайлу_ZL_LIST = ВременныйКаталог + ИмяФайла_ZL_LIST;

		СведенияОМедПомощи = Новый ЗаписьXML; 
		ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("windows-1251", "1.0", Ложь); 
		СведенияОМедПомощи.ОткрытьФайл(ПутьКФайлу_ZL_LIST, ПараметрыЗаписиXML); 
		СведенияОМедПомощи.ЗаписатьОбъявлениеXML(); 
		ФабрикаXDTO.ЗаписатьXML(СведенияОМедПомощи, Объект_ZL_LIST); 
		СведенияОМедПомощи.Закрыть();
		
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу_ZL_LIST);
		Объект_ZL_LIST_Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ЭтотОбъект.УникальныйИдентификатор);
		// дополним архив
		АрхивДляОтправки.Добавить(ПутьКФайлу_ZL_LIST); 
		
		
		ИмяФайла_PERS_LIST = Объект_PERS_LIST.ZGLV.FILENAME +".XML";
		ПутьКФайлу_PERS_LIST = ВременныйКаталог + ИмяФайла_PERS_LIST;

		СведенияОМедПомощи = Новый ЗаписьXML; 
		ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("windows-1251", "1.0", Ложь); 
		СведенияОМедПомощи.ОткрытьФайл(ПутьКФайлу_PERS_LIST, ПараметрыЗаписиXML); 
		СведенияОМедПомощи.ЗаписатьОбъявлениеXML(); 
		ФабрикаXDTO.ЗаписатьXML(СведенияОМедПомощи, Объект_PERS_LIST); 
		СведенияОМедПомощи.Закрыть();
		
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу_PERS_LIST);
		Объект_PERS_LIST_Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ЭтотОбъект.УникальныйИдентификатор);
		// дополним архив
		АрхивДляОтправки.Добавить(ПутьКФайлу_PERS_LIST); 
		
		АрхивДляОтправки.Записать();
		
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКАрхиву);
		АрхивАдрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ЭтотОбъект.УникальныйИдентификатор);
		
		// заполним дерево
		АрхивУИ = Новый УникальныйИдентификатор;
		ДобавитьУзелДерева(ИмяАрхива, "", АрхивАдрес, "ZIP", АрхивУИ);
		ДобавитьУзелДерева(ИмяФайла_ZL_LIST, АрхивУИ, Объект_ZL_LIST_Адрес, "XML", Новый УникальныйИдентификатор);
		ДобавитьУзелДерева(ИмяФайла_PERS_LIST, АрхивУИ, Объект_PERS_LIST_Адрес, "XML", Новый УникальныйИдентификатор);
		
		Попытка
			УдалитьФайлы(ПутьКАрхиву);
			УдалитьФайлы(ПутьКФайлу_ZL_LIST);
			УдалитьФайлы(ПутьКФайлу_PERS_LIST);
		Исключение
			Сообщение_ = Новый СообщениеПользователю;
			Сообщение_.Текст = ОписаниеОшибки();
			Сообщение_.Сообщить();
		КонецПопытки;
		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция СохранитьФайл_Сервер(ИмяАрхива, АдресВХранилище)
	
	ФайлОбмена_ = Справочники.Файлы.ПустаяСсылка();
	
	Попытка
	
		// заново формируем архив
		ВременныйКаталог = КаталогВременныхФайлов();
		ПутьКАрхиву = ВременныйКаталог + ИмяАрхива;
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ДвоичныеДанныеФайла.Записать(ПутьКАрхиву);
		
		// если проблемы с архивом или архив пустой
		Если ПустаяСтрока(ИмяАрхива) ИЛИ ПустаяСтрока(ПутьКАрхиву) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ЭтоВебКлиент = Ложь;
			
		Файл_Архив = Новый Файл(ПутьКАрхиву);
		СведенияОФайле_ = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией", Файл_Архив);
		СведенияОФайле_.АдресВременногоХранилищаФайла = АдресВХранилище;
		ФайлОбмена_ = РаботаСФайламиСлужебныйВызовСервера.СоздатьФайлСВерсией(
																	ДокументРеестра.Ссылка,
																	СведенияОФайле_
																);
																
		
							
		УдалитьФайлы(ПутьКАрхиву);
	Исключение
		Сообщение_ = Новый СообщениеПользователю;
		Сообщение_.Текст = ОписаниеОшибки();
		Сообщение_.Сообщить();
	КонецПопытки;
	
	Возврат ФайлОбмена_;
	
КонецФункции

&НаСервере
Функция РегистрацияПакета_Сервер(СсылкаФайл, Входящий)
	
	Если ЭтотОбъект.ДокументРеестра.Проведен = Ложь Тогда
		ПоказатьСообщение("РегистрацияПакетовИО_РегистрацияПакетовСейчасНевозможна");
		Возврат Ложь;
	КонецЕсли;
	
	Если Входящий Тогда
		ИсходящийЗарегистрирован = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.ПроверитьРегистрациюДокумента(
																				ЭтотОбъект.ДокументРеестра, Ложь);
		Если ИсходящийЗарегистрирован = Ложь Тогда
			ПоказатьСообщение("РегистрацияПакетовИО_РегистрацияОтветаСейчасНевозможна");
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли; 

	// Попытка
		НачатьТранзакцию();
		
		РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.РегистрацияПакетаОбмена(
																		ЭтотОбъект.ДокументРеестра.НачалоПериода,
																		ЭтотОбъект.ДокументРеестра,
																		СсылкаФайл,
																		Входящий
																	);
													
		// пересчитываем количество пакетов
		ОпределитьКоличествоПакетовОбмена();
		
		ЗафиксироватьТранзакцию();
	// Исключение
//		ОтменитьТранзакцию();
		// Возврат Ложь;
	// КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОтменаРегистрации_Сервер(Период, НомерПакета, Источник, Получатель, Входящий)
	
	Если Входящий = Ложь Тогда
		ВходящийЗарегистрирован = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.ПроверитьРегистрациюДокумента(
																				ЭтотОбъект.ДокументРеестра, Истина);
		Если ВходящийЗарегистрирован Тогда
			ПоказатьСообщение("РегистрацияПакетовИО_ОтменаРегистрацииСейчасНевозможна");
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	Попытка
		НачатьТранзакцию();
		
		// отменяем регистрацию пакета
		РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.ОтменаРегистрацииПакетаОбмена(
																					Период,
																					НомерПакета,
																					Источник,
																					Получатель,
																					Входящий
																				);
		
		ОпределитьКоличествоПакетовОбмена();
 		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОтменаРегистрацииФайла_Сервер(Файл, Входящий)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрацияПакетовИнформационногоОбмена.НомерПакета,
		|	РегистрацияПакетовИнформационногоОбмена.Период,
		|	РегистрацияПакетовИнформационногоОбмена.Источник,
		|	РегистрацияПакетовИнформационногоОбмена.Получатель
		|ИЗ
		|	РегистрСведений.РегистрацияПакетовИнформационногоОбмена КАК РегистрацияПакетовИнформационногоОбмена
		|ГДЕ
		|	РегистрацияПакетовИнформационногоОбмена.ФайлОбмена = &ФайлОбмена";
	Запрос.УстановитьПараметр("ФайлОбмена", Файл);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Входящий = Ложь Тогда
			ВходящийЗарегистрирован = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.ПроверитьРегистрациюДокумента(
																					ЭтотОбъект.ДокументРеестра, Истина);
			Если ВходящийЗарегистрирован Тогда
				ПоказатьСообщение("РегистрацияПакетовИО_ОтменаРегистрацииСейчасНевозможна");
				Возврат Ложь;
			КонецЕсли; 
		КонецЕсли; 
		// отменяем регистрацию пакета
		РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.ОтменаРегистрацииПакетаОбмена(
																			Выборка.Период,
																			Выборка.НомерПакета,
																			Выборка.Источник,
																			Выборка.Получатель,
																			Входящий
																		);
	КонецЦикла;
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьФайл_Сервер(ИмяФайла, АдресХранилища)
	
	Возврат ПроверитьФайлИнформационногоОбмена(
												ДокументРеестра.НачалоПериода,
												Неопределено,
												ДокументРеестра.СтруктурнаяЕдиница.Организация,
												ДокументРеестра.Контрагент,
												ИмяФайла,
												"",
												АдресХранилища
											);
	
КонецФункции

&НаСервере
Процедура ДобавитьФайлОбмена_Сервер(ИмяБезРасширения, Расширение, АдресВХранилище)
	
	МассивФайловДляУдаления = Новый Массив();
	
	ИмяАрхива = ИмяБезРасширения + "." + Расширение;
	
	Попытка
		РезультатПроверки = ПроверитьИмяФайлаНаОтправителяИОтчетныйПериод(
																					ИмяБезРасширения,
																					Неопределено,
																					ДокументРеестра.Контрагент,
																					ДокументРеестра.СтруктурнаяЕдиница.Организация,
																					ДокументРеестра.НачалоПериода
																				);
		Если РезультатПроверки = Ложь Тогда
			Параметры_ = Новый Структура();
			Параметры_.Вставить("ИмяАрхива",ИмяАрхива);
			Параметры_.Вставить("Контрагент",ДокументРеестра.Контрагент);
			Параметры_.Вставить("Организация",ДокументРеестра.СтруктурнаяЕдиница.Организация);
			ПоказатьСообщение("РегистрацияПакетовИО_ФайлНеПрошелПроверку",Параметры_);
			Возврат;
		КонецЕсли; 
		// заново формируем архив
		ВременныйКаталог = КаталогВременныхФайлов();
		ПутьКАрхиву = ВременныйКаталог + ИмяАрхива;
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ДвоичныеДанныеФайла.Записать(ПутьКАрхиву);
		МассивФайловДляУдаления.Добавить(ПутьКАрхиву);
		
		// если проблемы с архивом или архив пустой
		Если ПустаяСтрока(ИмяАрхива) ИЛИ ПустаяСтрока(ПутьКАрхиву) Тогда
			ВызватьИсключение "не удалось получить архив";
		КонецЕсли;
		
		ИмяПапкиДляСоздания = СтрЗаменить(ИмяАрхива,".ZIP","");
		ИмяПапкиДляСоздания = СтрЗаменить(ИмяПапкиДляСоздания,".zip","");
		
		// проверка возможности распаковки /////////////////////////////////
		ПутьРаспаковки = ВременныйКаталог + ИмяПапкиДляСоздания;
		Архив = РаспаковатьАрхив(ПутьКАрхиву, ПутьРаспаковки);
		Если Архив = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		МассивФайловДляУдаления.Добавить(ПутьРаспаковки);
		////////////////////////////////////////////////////////////////////////
		
		// заполним дерево по архиву
		АрхивУИ = Новый УникальныйИдентификатор;
		ДобавитьУзелДерева(ИмяАрхива,
							"",
							АдресВХранилище,
							"ZIP",
							АрхивУИ,
							,
							Истина
						);
		
		Для каждого ЭлементАрхива Из Архив.Элементы Цикл
			ФайлУИ = Новый УникальныйИдентификатор;
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьРаспаковки + "\" + ЭлементАрхива.Имя);
			Файл_Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ЭтотОбъект.УникальныйИдентификатор);
			ДобавитьУзелДерева(ЭлементАрхива.Имя,
								АрхивУИ,
								Файл_Адрес,
								ЭлементАрхива.Расширение,
								ФайлУИ,
								,
								Истина
							);
		
		КонецЦикла; 
		
	Исключение
		Сообщение_ = Новый СообщениеПользователю;
		Сообщение_.Текст = ОписаниеОшибки();
		Сообщение_.Сообщить();
	КонецПопытки;
	
	УдалитьФайлыПоМассивуПутей(МассивФайловДляУдаления);
	
КонецПроцедуры

&НаСервере
Функция УдалитьФайлОбмена_Сервер(СсылкаФайл, Прикреплен, Зарегистрирован, Входящий)
	
	Попытка
		НачатьТранзакцию();
		
		Если Зарегистрирован Тогда
			Ответ = ОтменаРегистрацииФайла_Сервер(СсылкаФайл, Входящий);
			Если Ответ = Ложь Тогда
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли; 
			ОпределитьКоличествоПакетовОбмена();
		КонецЕсли;
		
		Если Прикреплен Тогда
			ФайлОбъект = СсылкаФайл.ПолучитьОбъект();
			ФайлОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщение_ = Новый СообщениеПользователю;
		Сообщение_.Текст = ОписаниеОшибки();
		Сообщение_.Сообщить();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Показывает стандартное предупреждение.
//
// Параметры:
//  ОбработчикРезультата - ОписаниеОповещения, Неопределено - Описание процедуры, принимающей результат работы метода.
//  ПредставлениеКоманды - Строка - Необязательный. Имя команды, для выполнения которой необходимо расширение.
//
Процедура ПоказатьПредупреждениеОНеобходимостиРасширенияРаботыСФайлами(ОбработчикРезультата, ПредставлениеКоманды = "")
	Если Не КлиентПоддерживаетСинхронныеВызовы() Тогда
		ТекстПредупреждения = НСтр("ru = 'Выполнение команды ""%1"" в браузерах
			|Google Chrome и Mozilla Firefox не поддерживается.'");
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Для выполнения команды ""%1"" необходимо
			|установить расширение для веб-клиента 1С:Предприятие.'");
	КонецЕсли;
	Если ЗначениеЗаполнено(ПредставлениеКоманды) Тогда
		ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%1", ПредставлениеКоманды);
	Иначе
		ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, " ""%1""", "");
	КонецЕсли;
	ВернутьРезультатПослеПоказаПредупреждения(ОбработчикРезультата, ТекстПредупреждения, Неопределено);
КонецПроцедуры

&НаКлиенте
// Показывает текст и вызывает обработчик с заданным результатом.
Процедура ВернутьРезультатПослеПоказаПредупреждения(ОбработчикРезультата, ТекстПредупреждения, Результат)
	Если ТипЗнч(ОбработчикРезультата) = Тип("ОписаниеОповещения") Тогда
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("ОбработчикРезультата", ОбработчикРезультата);
		ПараметрыОбработчика.Вставить("Результат",             Результат);
		Обработчик = Новый ОписаниеОповещения("ВернутьРезультатПослеЗакрытияПростогоДиалога", ЭтотОбъект, ПараметрыОбработчика);
		ПоказатьПредупреждение(Обработчик, ТекстПредупреждения);
	Иначе
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Обработчик результата работы процедуры ВернутьРезультатПослеПоказаПредупреждения.
Процедура ВернутьРезультатПослеЗакрытияПростогоДиалога(Структура)
	ВыполнитьОбработкуОповещения(Структура.ОбработчикРезультата, Структура.Результат);
КонецПроцедуры

Функция КлиентПоддерживаетСинхронныеВызовы()
	
#Если ВебКлиент Тогда
	// В Chrome и Firefox синхронные методы не поддерживаются.
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИнформацияПрограммыМассив = СтрРазделить(СистемнаяИнформация.ИнформацияПрограммыПросмотра, " ", Ложь);
	
	Для Каждого ИнформацияПрограммы Из ИнформацияПрограммыМассив Цикл
		Если СтрНайти(ИнформацияПрограммы, "Chrome") > 0 ИЛИ СтрНайти(ИнформацияПрограммы, "Firefox") > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
#КонецЕсли
	
	Возврат Истина;
	
КонецФункции

 // Процедура: ПоказатьСообщение
 //   выводит сообщение пользователю на указанным языке.
 //
 // Параметры:
 //   ИмяСообщения {Строка}
 //     Имя сообщения строкой.
 //   Параметры
 //     Структура, которая хранит значения по ключам. Каждое вхождение подстроки вида
 //     #Ключ#, где Ключ - это ключ структуры, будет заменено на значение по этому ключу.
 //     Параметр не обязательный.
 //   Язык {Строка}
 //     Код языка для работы с НСтр.
 //
 ///
Процедура ПоказатьСообщение(
	Знач ИмяСообщения,
	Знач Параметры = Неопределено,
	Знач Язык = ""
) 
	Перем
		Сообщение,
		СтруктураСообщения
	;
	Сообщение = Новый СообщениеПользователю;
	ТекстСообщения = Получить(ИмяСообщения, Параметры, Истина, Язык);
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

// Функция: РаспаковатьАрхив
//   распаковывает файлы
// 
// Параметры:
//   ПутьКФайлуАрхива  - Строка
//         путь к файлу архива
//   ПутьРаспаковки  - Строка
//         путь куда распаковать архив
//
// Возвращаемое значение:
//   ЧтениеZipФайла - Неопределено если возникли ошибки извлечения.
///
Функция РаспаковатьАрхив(ПутьКФайлуАрхива, ПутьРаспаковки) 
	
	Попытка
		Архив = Новый ЧтениеZipФайла();
		Архив.Открыть(ПутьКФайлуАрхива);
		Индекс = 2;
		ПутьРаспаковкиВрем = ПутьРаспаковки;
		Пока Истина Цикл
			Каталог = Новый Файл(ПутьРаспаковкиВрем);
			Если Каталог.Существует() Тогда
				ПутьРаспаковкиВрем = ПутьРаспаковки + "(" + Формат(Индекс, "ЧГ=") + ")";
				Индекс = Индекс + 1;
			Иначе
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		ПутьРаспаковки = ПутьРаспаковкиВрем;
		СоздатьКаталог(ПутьРаспаковки);
		Архив.ИзвлечьВсе(ПутьРаспаковки);
	Исключение
		ПоказатьСообщение("ФормированиеРеестровСчетов_ПриИзвлеченииАрхиваВозниклиОшибки");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Архив;
	
КонецФункции

// Функция ПроверитьИмяФайлаНаОтправителяИОтчетныйПериод()
//     проверяет соответствие проверяемого имени переданному
//     согласно требованиям обмена по ОМС.
//
// Параметры
//  ИмяФайлаБезРасширения  - Строка
//         имя файла без расширения.
//  Отправитель  - СправочникСсылка.Организации, СправочникСсылка.Контрагенты
//         отправитель файла.
//  Получатель  - СправочникСсылка.Контрагенты, СправочникСсылка.Организации
//         получатель файла.
//  ОтчетныйПериод  - Дата
//         дата среза
//
// Возвращаемое значение:
//   Булево   - Истина, если переданное имя соответствует шаблону.
///
Функция ПроверитьИмяФайлаНаОтправителяИОтчетныйПериод(ИмяФайлаБезРасширения, ИсточникФинансирования = Неопределено, Отправитель, Получатель, ОтчетныйПериод) 
	
	// собираем номер от символов T,S,M до их повторной встречи
	
	ПозицияРазделителя = Найти(ИмяФайлаБезРасширения, "_");
	ЛеваяЧасть = Лев(ИмяФайлаБезРасширения, ПозицияРазделителя - 1);
	ПраваяЧасть = Сред(ИмяФайлаБезРасширения, ПозицияРазделителя + 1);
	
	СтрокаОтКогоКому = Сред(ЛеваяЧасть, 3);
	ИмяФайла_ТипДанных = Сред(ИмяФайлаБезРасширения, 1, 1);
	ИмяФайла_ТипОтправителя = Сред(ИмяФайлаБезРасширения, 2, 1);
	
	Если Найти(СтрокаОтКогоКому, "M") <> 0 Тогда
		РазделительОтправительПолучатель = Найти(СтрокаОтКогоКому, "M");
	ИначеЕсли Найти(СтрокаОтКогоКому, "T") <> 0 Тогда
		РазделительОтправительПолучатель = Найти(СтрокаОтКогоКому, "T");
	ИначеЕсли Найти(СтрокаОтКогоКому, "S") <> 0 Тогда
		РазделительОтправительПолучатель = Найти(СтрокаОтКогоКому, "S");
	Иначе
		Возврат Ложь;
	КонецЕсли;
	ИмяФайла_ТипПолучателя = Сред(СтрокаОтКогоКому, РазделительОтправительПолучатель, 1);
	
	ИмяФайла_Отправитель = Лев(СтрокаОтКогоКому,РазделительОтправительПолучатель - 1);
	ИмяФайла_Получатель = Сред(СтрокаОтКогоКому,РазделительОтправительПолучатель + 1);
	
	ИмяФайла_Год = Лев(ПраваяЧасть, 2);
	ИмяФайла_Месяц = Сред(ПраваяЧасть, 3, 2);
	
	// исходные данные
	ТипОтправителя = ПолучитьПараметрТипыИсточника(Отправитель, ИсточникФинансирования);
	ТипПолучателя = ПолучитьПараметрТипыИсточника(Получатель, ИсточникФинансирования);
	
	РеестровыйНомерОтправителя = ПолучитьКод(Отправитель, ИсточникФинансирования);
	РеестровыйНомерПолучателя = ПолучитьКод(Получатель, ИсточникФинансирования);
	ОтчетныйПериод_Год = Формат(ОтчетныйПериод, "ДФ=""гг""");
	ОтчетныйПериод_Месяц = Формат(ОтчетныйПериод, "ДФ=""ММ""");
	
	Если ИмяФайла_ТипОтправителя <> ТипОтправителя ИЛИ
		 ИмяФайла_Отправитель <> РеестровыйНомерОтправителя ИЛИ
		 ИмяФайла_ТипПолучателя <> ТипПолучателя ИЛИ
		 ИмяФайла_Получатель <> РеестровыйНомерПолучателя
	Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИмяФайла_Год <> ОтчетныйПериод_Год ИЛИ
		 ИмяФайла_Месяц <> ОтчетныйПериод_Месяц
	Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Процедура: УдалитьФайлыПоМассивуПутей
//   удаляет временные файлы.
// 
// Параметры:
//   Массив{Массив}
//     массив путей удаления
///
Процедура УдалитьФайлыПоМассивуПутей(МассивПутей)
	
	// удаление созданного распаковкой каталога
	Попытка
		Для каждого ФайлПуть Из МассивПутей Цикл
			УдалитьФайлы(ФайлПуть);
		КонецЦикла; 
	Исключение
		ПоказатьСообщение("ФормированиеРеестровСчетов_ОшибкаУдаленияПроверяемогоАрхива");
	КонецПопытки;
	
КонецПроцедуры

 // Функция: ОбходИерархии_СоздатьУзелДерева
 //   Выполняется обход иерархии с одновременным созданием дерева.
 //   Данная функция выполняет очередной шаг обхода.
 //
 // Параметры:
 //   ИерархическаяВыборка
 //     Выборка с сортировкой по иерархии, то есть сначала идет родитель,
 //     непосредственно за ним идут иерархии детей.
 //     В выборке должно быть поле Родитель, по которому строится иерархия.
 //   Дерево.
 //     Дерево, которое заполняется. Тип ДанныеФормыДерево.
 //   ИмяПоляСсылки.
 //     Имя поля дерева, по которому осуществляется связь полем Родитель выборки.
 //
 // Возврат:
 //   Созданный узел дерева.
 //
 // Пример:
 //   // В следующем примере происходит заполнение дерева иерархическим списком
 //   // элементов справочника Номенклатура.
 //   Запрос = Новый Запрос(
 //     "ВЫБРАТЬ
 //     |	Номенклатура.Ссылка,
 //     |	Номенклатура.Наименование,
 //     |	Номенклатура.Родитель
 //     |ИЗ
 //     |	Справочник.Номенклатура КАК Номенклатура
 //     |
 //     |УПОРЯДОЧИТЬ ПО
 //     |	Ссылка ИЕРАРХИЯ"
 //   );
 //   Выборка = Запрос.Выполнить().Выбрать();
 //   Дерево = ЭтотОбъект.Дерево; // Реквизит формы типа ДанныеФормыДерево, (ДеревоЗначений)
 //   Пока Выборка.Следующий() Цикл
 //   	УзелДерева = АлгоритмыДляКоллекций.ОбходИерархии_СоздатьУзелДерева(Выборка, Дерево);
 //   	УзелДерева.Наименование = Выборка.Наименование;
 //   КонецЦикла;
 ///
Функция ОбходИерархии_СоздатьУзелДерева(ИерархическаяВыборка, Дерево, ИмяПоляСсылки = "Ссылка")
	Перем УзелДерева, ЭлементыДерева, Условие;
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Если Не ЗначениеЗаполнено(ИерархическаяВыборка.Родитель) Тогда
		Возврат ЭлементыДерева.Добавить();
	КонецЕсли;
	УзелДерева = ЭлементыДерева[ЭлементыДерева.Количество() - 1];
	Пока Не УзелДерева[ИмяПоляСсылки] = ИерархическаяВыборка.Родитель Цикл
		ЭлементыДерева = УзелДерева.ПолучитьЭлементы();
		УзелДерева = ЭлементыДерева[ЭлементыДерева.Количество() - 1];
	КонецЦикла;
	Возврат УзелДерева.ПолучитьЭлементы().Добавить();
КонецФункции

// Функция ПолучитьИмяФайлаИнформационногоОбмена()
//     формирует имя файла обмена
//
// Параметры
//  ТипФайла  - {Строка} 
//      одна из: ZL_LIST, PERS_LIST, ZIP
//  ОрганизацияИсточник - {СправочникСсылка.Организации, СправочникСсылка.Контрагенты} 
//      источник пакета.
//  ОрганизацияПолучатель - {СправочникСсылка.Организации, СправочникСсылка.Контрагенты} 
//      получатель пакета.
//  ОтчетныйПериод  - {Дата} 
//      период формирвоания пакета
//
// Возвращаемое значение:
//   Строка   - сформированное имя файла.
///
Функция ПолучитьИмяФайлаИнформационногоОбмена(ТипФайла, ИсточникФинансирования = Неопределено, ОрганизацияИсточник, ОрганизацияПолучатель, ОтчетныйПериод)
	
	НаборСимволов = Новый Массив();
	
	НаборСимволов.Вставить(0, ПолучитьИдентификаторПередаваемыхДанных(ТипФайла));// КонстантаОзначающаяПередаваемыеДанные;
	// данные источника
	НаборСимволов.Вставить(1, ПолучитьПараметрТипыИсточника(ОрганизацияИсточник, ИсточникФинансирования));
	
	РеестровыйНомерИсточник_ = ПолучитьЗначениеРеквизитаФормированияРеестра(
																				ОрганизацияИсточник,
																				ИсточникФинансирования
																			);
	НаборСимволов.Вставить(2, ФорматироватьРеестровыйНомер(РеестровыйНомерИсточник_));
	// данные получатель
	НаборСимволов.Вставить(3, ПолучитьПараметрТипыИсточника(ОрганизацияПолучатель, ИсточникФинансирования));
	
	РеестровыйНомерПолучатель_ = ПолучитьЗначениеРеквизитаФормированияРеестра(
																				ОрганизацияПолучатель,
																				ИсточникФинансирования
																			);
	НаборСимволов.Вставить(4, ФорматироватьРеестровыйНомер(РеестровыйНомерПолучатель_));
	// данные отчетного периода
	НаборСимволов.Вставить(5, "_");
	НаборСимволов.Вставить(6, Формат(ОтчетныйПериод, "ДФ=""гг"""));
	НаборСимволов.Вставить(7, Формат(ОтчетныйПериод, "ДФ=""ММ"""));
	НаборСимволов.Вставить(8, ПолучитьПорядковыйНомерПакетаОтчетногоПериода(ОтчетныйПериод, ОрганизацияИсточник, ОрганизацияПолучатель));
	
	ОбщаяСтрока = "";
	
	Для каждого Символ Из НаборСимволов Цикл
		Если ПустаяСтрока(Символ) Тогда
			Возврат "";
		КонецЕсли;
		ОбщаяСтрока = ОбщаяСтрока + Символ;
	КонецЦикла; 
	
	
	Возврат ОбщаяСтрока;
	
КонецФункции

// Функция ПолучитьПорядковыйНомерПакетаОтчетногоПериода()
//     определяет новый порядковый номер для пакета обмена в омс
//
// Параметры
//  ОтчетныйПериод  - Дата
//         дата среза
//  Источник  - {СправочникСсылка.Организации, СправочникСсылка.Контрагенты}
//         отправитель файла.
//  Получатель  - {СправочникСсылка.Контрагенты, СправочникСсылка.Организации}
//         получатель файла.
//
// Возвращаемое значение:
//   Строка   - новый порядковый номер пакета.
///
Функция ПолучитьПорядковыйНомерПакетаОтчетногоПериода(ОтчетныйПериод, Источник, Получатель)
	
	НомерПакета = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.ПолучитьСледующийНомерПакетаОтчетногоПериода(
																					ОтчетныйПериод,
																					Источник,
																					Получатель
																					);
	
	Возврат Формат(НомерПакета, "ЧГ=0");
	
КонецФункции

// Функция ФорматироватьРеестровыйНомер()
//     получает реестровый номер участника обмена
//
// Параметры
//  Ссылка  - {СправочникСсылка.Организации, СправочникСсылка.Контрагенты}
//      участник обмена.
//
// Возвращаемое значение:
//   <Строка>   - реестровый номер участника.
///
Функция ФорматироватьРеестровыйНомер(Номер)
	
	Номер = СокрЛП(Номер);
	Номер = СтрЗаменить(Номер," ","");
	
	Возврат Номер;
	
КонецФункции

// Функция ПолучитьИдентификаторПередаваемыхДанных()
//     
//
// Параметры
//  Тип  - Строка
//      тип передаваемых данных
//
// Возвращаемое значение:
//   Строка   - идентификатор типа передаваемых данных.
///
Функция ПолучитьИдентификаторПередаваемыхДанных(Тип)
	
	Если Тип = "ZL_LIST" Тогда
		Возврат "H";
	ИначеЕсли Тип = "PERS_LIST" Тогда
		Возврат "L";
	ИначеЕсли Тип = "ZIP" Тогда
		Возврат "Z";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Процедура: СоздатьОбъект_ZL_LIST
//   Создает XDTO объект ZL_LIST, для отправки ответа
//   на запрос;
// 
// Параметры:
//   Документ{ДокументСсылка.РеестрОказаннойПомощи}
//     ссылка на документ по данных которого надо формировать файл.
//
// Возвращаемое значение:
//   XDTO объект   - созданный по документу.
///
Функция СоздатьОбъект_ZL_LIST(Документ)
	
	ИстФин_ = Неопределено;
	
	ТипЗначения_ZL_LIST = ТипFFOMS("ZL_LIST");
	
	СообщениеОбъект_ = СоздатьОбъектXDTO(ТипЗначения_ZL_LIST);
	
	ДанныеЗаполнения_ = Новый Массив;
	ДобавитьВМассив(ДанныеЗаполнения_,"ZGLV.@VERSION","1.0");
	ДобавитьВМассив(ДанныеЗаполнения_,"ZGLV.@DATA", ФорматДаты(ТекущаяДатаСеанса()));
	ДобавитьВМассив(ДанныеЗаполнения_,"ZGLV.@FILENAME", ПолучитьИмяФайлаИнформационногоОбмена(
	"ZL_LIST",
	Неопределено,
	Документ.СтруктурнаяЕдиница.Организация,
	Документ.Контрагент,
	Документ.НачалоПериода
	)
	);
	////////////////////////////////////////////////////////////////////
	СчетНаОплату = Документы.АктОказанияУслуг.ПолучитьСчетРеестра(Документ.Ссылка);
	
	ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@CODE",    ПолучитьКодЗаписиСчета(Документ.Номер));
	ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@CODE_MO", ПолучитьКод(Документ.СтруктурнаяЕдиница.Организация, Неопределено));
	ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@YEAR",    Год(Документ.НачалоПериода));
	ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@MONTH",   Месяц(Документ.НачалоПериода));
	Если НЕ СчетНаОплату = Неопределено Тогда
		ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@NSCHET",  СчетНаОплату.Номер);
		ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@DSCHET",  ФорматДаты(СчетНаОплату.Дата));
	КонецЕсли;
	
	КодКонтрагента_ = ПолучитьКод(Документ.Контрагент, ИстФин_);
	Если ЗначениеЗаполнено(КодКонтрагента_) Тогда
		ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@PLAT", КодКонтрагента_);
	КонецЕсли;
	ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@SUMMAV", Документ.СуммаДокумента);
	Если ЗначениеЗаполнено(Документ.Комментарий) Тогда
		ДобавитьВМассив(ДанныеЗаполнения_,"SCHET.@COMENTS", Документ.Комментарий);
	КонецЕсли; 
	////////////////////////////////////////////////////////////////////
	
	ИтераторЗаписи = 0;
	Для Каждого СтрокаТЧПрием Из Документ.ОказанныеУслуги Цикл
		
		Прием = СтрокаТЧПрием.ДокументОснования;
		ЭлементЗаписи =  "ZAP[" + Формат(ИтераторЗаписи, "ЧН=0; ЧГ=0") + "]";
		
		// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".@N_ZAP", СтрокаТЧПрием.НомерЗаписи);
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".@N_ZAP", СтрокаТЧПрием.НомерСтроки);
		// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".@PR_NOV", Число(СтрокаТЧПрием.ПередачаОсуществлялась)); // TODO: после передачи менять реквизит
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".@PR_NOV", 0);
		// данные пациента
		// Для каждого Пациент Из Документ.ЗаписиПациента Цикл
		// Если Пациент.ИдентификаторПациента = СтрокаТЧПрием.ИдентификаторПациента Тогда
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@ID_PAC",Строка(Прием.Контрагент.УникальныйИдентификатор()));
		КодПолисВид_ = ПолучитьКод(Прием.ПолисМедСтрахования.ТипПолиса, ИстФин_);
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@VPOLIS", КодПолисВид_);
		Если ЗначениеЗаполнено(Прием.ПолисМедСтрахования.СерияПолиса) Тогда
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@SPOLIS", Прием.ПолисМедСтрахования.СерияПолиса);
		КонецЕсли;
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@NPOLIS", Прием.ПолисМедСтрахования.НомерПолиса);
		
		// КодСМО_ = ПолучитьКод(Прием.СМО, ИстФин_);
		КодСМО_ = ПолучитьКод(Прием.Контрагент, ИстФин_);
		Если ЗначениеЗаполнено(КодСМО_) Тогда
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@SMO", КодСМО_);
			// ИначеЕсли ЗначениеЗаполнено(СтрокаТЧПрием.СМО.ОГРН) ИЛИ ЗначениеЗаполнено(СтрокаТЧПрием.СМО.КодОКАТО) Тогда  
			// Если ЗначениеЗаполнено(СтрокаТЧПрием.СМО.ОГРН) Тогда
			//		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@SMO_OGRN", СтрокаТЧПрием.СМО.ОГРН);
		Иначе
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@SMO_NAM", Прием.Контрагент.НаименованиеПолное);	
		КонецЕсли; 
		//	Если ЗначениеЗаполнено(СтрокаТЧПрием.СМО.КодОКАТО) Тогда
		//		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@SMO_OK", СтрокаТЧПрием.СМО.КодОКАТО);
		//	КонецЕсли; 
		// Иначе
		//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@SMO_NAM", СтрокаТЧПрием.СМО.НаименованиеПолное);
		// КонецЕсли; 
		
		// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@NOVOR", Пациент.ПризнакНоворожденного);
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ".PACIENT.@NOVOR", Ложь);
		// КонецЕсли; 
		// КонецЦикла; 
		
		ИтераторСлучая = 0;
		//// случай ////////////////////////////////////////////////////
		Для каждого СтрокаТЧЛечение Из Прием.Лечение Цикл
			//	Если Лечение.НомерЗаписи = СтрокаТЧПрием.НомерЗаписи Тогда
			//
			ЭлементСлучая = ".SLUCH[" + Формат(ИтераторСлучая, "ЧН=0; ЧГ=0") + "]";
			
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@IDCASE", Лечение.РеестровыйНомерСлучая);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@IDCASE", СтрокаТЧЛечение.НомерСтроки);
			
			// КодУсловияМедицинскойПомощи_ = ПолучитьКод(Лечение.УсловиеОказанияПомощи, ИстФин_);
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@USL_OK", КодУсловияМедицинскойПомощи_);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@USL_OK", 3);
			
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@VIDPOM", ПолучитьКод_ВидПомощи(Лечение.ВидПомощи));
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@VIDPOM", 1);
			
			// Если ЗначениеЗаполнено(Лечение.НаправившаяОрганизация) Тогда
			//	КодНаправившаяОрганизация_ = ПолучитьКод(Лечение.НаправившаяОрганизация, ИстФин_);
			//	Если ЗначениеЗаполнено(КодНаправившаяОрганизация_) Тогда
			//		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@NPR_MO", КодНаправившаяОрганизация_);
			//	КонецЕсли;
			// КонецЕсли;
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@NPR_MO", 2);
			// Если Лечение.Направление = 1 ИЛИ Лечение.Направление = 2 Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@EXTR", Лечение.Направление);
			// КонецЕсли;
			//// Мо лечения
			КодМОЛечения_ = ПолучитьКод(Прием.СтруктурнаяЕдиница.Организация, ИстФин_);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@LPU", КодМОЛечения_);
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@LPU", 1234);
			// Если ЗначениеЗаполнено(Лечение.ПодразделениеМОЛечения) Тогда
			//	КодПодразделениеМОЛечения_ = ПолучитьКод(Лечение.ПодразделениеМОЛечения, ИстФин_);
			//	Если ЗначениеЗаполнено(КодПодразделениеМОЛечения_) Тогда
			//		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@LPU_1", Число(КодПодразделениеМОЛечения_));
			//	КонецЕсли;
			// КонецЕсли;
			// Если ЗначениеЗаполнено(Лечение.ОтделениеМОЛечения) Тогда
			//	КодОтделениеМОЛечения_ = ПолучитьКод(Лечение.ОтделениеМОЛечения, ИстФин_);
			//	Если ЗначениеЗаполнено(КодОтделениеМОЛечения_) Тогда
			//		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@PODR", Число(КодОтделениеМОЛечения_));
			//	КонецЕсли;
			// КонецЕсли; 
			//// профиль
			// КодПрофиль_ = ПолучитьКод(Лечение.Профиль, ИстФин_);
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@PROFIL", ?(ЗначениеЗаполнено(КодПрофиль_), Число(КодПрофиль_), 0));
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@PROFIL", 471);
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DET", Число(Лечение.ПризнакДетскогоПрофиля));
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DET", 0);
			//// лечение
			МедКарта = Справочники.МедицинскиеКарты.НайтиПоРеквизиту("ВладелецКарты", Прием.Контрагент);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@NHISTORY", МедКарта.Наименование);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DATE_1", ФорматДаты(Прием.Дата));
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DATE_2", ФорматДаты(Лечение.ДатаОкончанияЛечения));
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DATE_2", ФорматДаты(Прием.ВремяОкончанияПриема));
			// Если ЗначениеЗаполнено(Лечение.ДиагнозПервичный) Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DS0", ПолучитьКодМКБПодрубрики(Лечение.ДиагнозПервичный));
			// КонецЕсли; 
			// Если ЗначениеЗаполнено(Лечение.ДиагнозОсновной) Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DS1", ПолучитьКодМКБПодрубрики(Лечение.ДиагнозОсновной));
			// КонецЕсли;
			// Если ЗначениеЗаполнено(Лечение.Диагноз_Удалить) Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DS1", ПолучитьКодМКБПодрубрики(Лечение.Диагноз_Удалить));
			// КонецЕсли;
			Диагноз = ПолучитьДиагнозИзПриема(Прием.Ссылка);			
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DS1", ?(ЗначениеЗаполнено(Диагноз), ПолучитьКодМКБПодрубрики(Диагноз), ""));  // диангоз нужно заполнять обязательно.
			// Если ЗначениеЗаполнено(Лечение.ДиагнозСопутствующий) Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@DS2", ПолучитьКодМКБПодрубрики(Лечение.ДиагнозСопутствующий));
			// КонецЕсли;
			//// МЭС
			// Если ЗначениеЗаполнено(Лечение.МЭС) Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@CODE_MES1", ПолучитьКодМЭС(Лечение.МЭС));
			// КонецЕсли; 
			// Если ЗначениеЗаполнено(Лечение.МЭССопутствующего) Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@CODE_MES2", ПолучитьКодМЭС(Лечение.МЭССопутствующего));
			// КонецЕсли; 
			//
			// Если ЗначениеЗаполнено(Лечение.РезультатОбращения) Тогда
			//	КодРезультатОбращения_ = ПолучитьКод(Лечение.РезультатОбращения, ИстФин_);
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@RSLT", КодРезультатОбращения_);
			// КонецЕсли;
			// Если ЗначениеЗаполнено(Лечение.ИсходЗаболевания) Тогда
			//	КодИсходЗаболевания_ = ПолучитьКод(Лечение.ИсходЗаболевания, ИстФин_);
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@ISHOD", КодИсходЗаболевания_);
			// КонецЕсли;
			СпециализацииСотрудника = СтрокаТЧЛечение.Сотрудник.СпецилазацииСотрудника;
			Если ЗначениеЗаполнено(СпециализацииСотрудника) Тогда
				КодСпециальностьСотрудника_ = ПолучитьКод(СпециализацииСотрудника[0].Специализация, ИстФин_);
			КонецЕсли;
			КодСотрудник_ = ПолучитьКод(СтрокаТЧЛечение.Сотрудник, ИстФин_);
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@PRVS", КодСпециальностьСотрудника_);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@PRVS", КодСпециальностьСотрудника_);
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@IDDOKT", КодСотрудник_);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@IDDOKT", КодСотрудник_);
			//
			// ОсобыеСлучаи_ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Лечение.ОсобыйЛечение);
			// Для каждого ОсСл Из ОсобыеСлучаи_ Цикл
			//	Индекс = ОсобыеСлучаи_.Найти(ОсСл);
			//	Если ОсСл = 1 ИЛИ ОсСл = 2 Тогда
			//		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".OS_SLUCH[" + Строка(Индекс) + "]", ОсСл);
			//	КонецЕсли;
			// КонецЦикла;
			//
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@IDSP", ПолучитьКод_СпособОплатыМедПомощи(Лечение.СпособОплатыМедицинскойПомощи));
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@IDSP", 1);
			Если ЗначениеЗаполнено(СтрокаТЧЛечение.Количество) Тогда
				ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@ED_COL", СтрокаТЧЛечение.Количество);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТЧЛечение.Цена) Тогда
				ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@TARIF", СтрокаТЧЛечение.Цена);
			КонецЕсли;
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@SUMV", СтрокаТЧЛечение.Сумма);
			// Если ЗначениеЗаполнено(Прием.Комментарий) Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ".@COMENTSL", Прием.Комментарий);
			// КонецЕсли;
			//
			//// для не посещений заполняем услуги
			// ПосещениеКодПоОМС_ = 
			// ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Лечение.СпособОплатыМедицинскойПомощи, "КодПоОМС");
			// Если ПосещениеКодПоОМС_ <> "22" Тогда
			//	
			//	Если Значениезаполнено(Документ.ВладелецНоменклатуры) Тогда
			//		ТаблицаУслуг_ =  Документ.НоменклатураВладельцев;
			//		ПоВладельцу = Истина;
			//	Иначе
			//		ТаблицаУслуг_ =  Документ.ВыполненныеУслуги;
			//		ПоВладельцу = Ложь;
			//	КонецЕсли;
			//	ИтераторУслуги = 0;
			//	// сведения об услуге
			//	Для каждого УслугаТаблицы Из ТаблицаУслуг_ Цикл
			//		Если Лечение.РеестровыйНомерСлучая = УслугаТаблицы.РеестровыйНомерСлучая Тогда
			//			
			//			Если ПоВладельцу = Истина Тогда
			//				ОтборУслуга_ = Документ.ВыполненныеУслуги.НайтиСтроки(
			//				Новый Структура("УникальныйИдентификаторУслуги", УслугаТаблицы.УникальныйИдентификаторУслуги)
			//				);
			//				УслугаСлучая = ОтборУслуга_.Получить(0);
			//			Иначе
			//				УслугаСлучая = УслугаТаблицы;
			//			КонецЕсли;
			//			
			ЭлементУслуга =  ".USL[0]";
			
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@IDSERV", СтрокаТЧЛечение.НомерСтроки);
			КодМОЛечения_ = ПолучитьКод(Прием.СтруктурнаяЕдиница.Организация, ИстФин_);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@LPU", КодМОЛечения_);
			// Если ЗначениеЗаполнено(УслугаСлучая.ПодразделениеМОЛечения) Тогда
			//	КодПодразделениеМОЛечения_ = ПолучитьКод(УслугаСлучая.ПодразделениеМОЛечения, ИстФин_);
			//	Если ЗначениеЗаполнено(КодПодразделениеМОЛечения_) Тогда
			//		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@LPU_1", КодПодразделениеМОЛечения_);
			//	КонецЕсли;
			// КонецЕсли;
			// Если ЗначениеЗаполнено(УслугаСлучая.ОтделениеМОЛечения) Тогда
			//	КодОтделениеМОЛечения_ = ПолучитьКод(УслугаСлучая.ОтделениеМОЛечения, ИстФин_);
			//	Если ЗначениеЗаполнено(КодОтделениеМОЛечения_) Тогда
			//		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@PODR", Число(КодОтделениеМОЛечения_));
			//	КонецЕсли;
			// КонецЕсли;
			// профиль
			// КодПрофиль_ = ПолучитьКод(УслугаСлучая.Профиль, ИстФин_);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@PROFIL", 471);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@DET", 0);
			
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@DATE_IN", ФорматДаты(Прием.Дата));
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@DATE_OUT",ФорматДаты(Прием.ВремяОкончанияПриема));
						
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@DS", ?(ЗначениеЗаполнено(Диагноз), ПолучитьКодМКБПодрубрики(Диагноз), ""));  // диангоз нужно заполнять обязательно.
			
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@DS", 12);  // диангоз нужно заполнять обязательно.
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@CODE_USL", СтрокаТЧЛечение.КодУслуги);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@KOL_USL", СтрокаТЧЛечение.Количество);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@TARIF", СтрокаТЧЛечение.Цена);
			// принятая сумма обязательна, но передаваться будет пустой
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@SUMV_USL", СтрокаТЧЛечение.Сумма);
			
			// КодСпециальностьСотрудника_ = ПолучитьКод(УслугаСлучая.СпециальностьСотрудника, ИстФин_);
			// КодСотрудник_ = ПолучитьКод(УслугаСлучая.Сотрудник, ИстФин_);
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@PRVS", КодСпециальностьСотрудника_);
			// ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@CODE_MD", КодСотрудник_);
			СпециализацииСотрудника = СтрокаТЧЛечение.Сотрудник.СпецилазацииСотрудника;
			Если ЗначениеЗаполнено(СпециализацииСотрудника) Тогда
				КодСпециальностьСотрудника_ = ПолучитьКод(СпециализацииСотрудника[0].Специализация, ИстФин_);
			КонецЕсли;
			КодСотрудник_ = ПолучитьКод(СтрокаТЧЛечение.Сотрудник, ИстФин_);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@PRVS", КодСпециальностьСотрудника_);
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@CODE_MD", КодСотрудник_);

			// Если ЗначениеЗаполнено(УслугаСлучая.КомментарийКУслуге) Тогда
			//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементЗаписи + ЭлементСлучая + ЭлементУслуга + ".@COMENTU", УслугаСлучая.КомментарийКУслуге);
			// КонецЕсли; 
			//			
			//			ИтераторУслуги = ИтераторУслуги + 1;
			//		КонецЕсли;
			//	КонецЦикла;
			// КонецЕсли; // заполнение услуг
			ИтераторСлучая = ИтераторСлучая + 1;
		КонецЦикла;
		ИтераторЗаписи = ИтераторЗаписи + 1;
	КонецЦикла;
	
	Попытка
		ЗаполнитьОбъектXDTO(СообщениеОбъект_, ДанныеЗаполнения_);
		СообщениеОбъект_.Проверить();
	Исключение
		Рез = ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке());
		Сообщение_ = Новый СообщениеПользователю;
		Сообщение_.Текст = Рез;
		Сообщение_.Сообщить();
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат СообщениеОбъект_;
	
КонецФункции

// Функция ПолучитьКодМКБПодрубрики()
//     получает Код у элемента справочника МКБ
//
// Параметры
//  МКБ - {СпраовчникСсылка.МКБ10}
//       ссылка на МКБ10
//
// Возвращаемое значение:
//   Строка   - код родительского элемента справочника МКБ10.
///
Функция ПолучитьКодМКБПодрубрики(МКБ)
	
	Если ЗначениеЗаполнено(МКБ.Родитель) Тогда
		Возврат МКБ.Родитель.Код
	КонецЕсли; 
	
	Возврат МКБ.Код;
	
КонецФункции

// Функция, возвращает диагноз пациента из приема.
//
Функция ПолучитьДиагнозИзПриема(ПриемСсылка)
	
	НаборЗаписей = РегистрыСведений.ЗначенияПараметровОбследований.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Документ.Установить(ПриемСсылка);
	НаборЗаписей.Отбор.Параметр.Установить(ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз);	
	НаборЗаписей.Прочитать();
	
	Возврат ?(ЗначениеЗаполнено(НаборЗаписей), НаборЗаписей[0].Значение, Неопределено);	
	
КонецФункции

// Функция ОбработатьИнформациюОбОшибке()
//     из информации об ошибке формирует сообщение пользователю
//     пока что только для нарушений типа, возможно расширение.
//
// Параметры
//  ИнформацияОбОшибке  - ИнформацияОбОшибке
//         сведения об ошибке.
//
// Возвращаемое значение:
//   Строка   - текст ошибки
///
Функция ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке, СтруктураОшибки = Неопределено)
	
	Если СтруктураОшибки = Неопределено Тогда
		СтруктураОшибки = Новый Структура("Атрибут,Значение,ОписаниеОшибки",
										Неопределено,Неопределено, "");
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ИнформацияОбОшибке.Описание) Тогда
		Если Найти(ИнформацияОбОшибке.Описание,"Ошибка при установке значения атрибута контекста") <> 0 Тогда
			ВырезкаАтрибута = СтрЗаменить(ИнформацияОбОшибке.Описание,"Ошибка при установке значения атрибута контекста","");
			ВырезкаАтрибута = СтрЗаменить(ВырезкаАтрибута,"(","");
			ВырезкаАтрибута = СтрЗаменить(ВырезкаАтрибута,")","");
			ДанныеАтрибута = ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена(СокрЛП(ВырезкаАтрибута));
			СтруктураОшибки.Атрибут = ДанныеАтрибута.Представление;
			СтруктураОшибки.ОписаниеОшибки = ДанныеАтрибута.ОписаниеОшибки;
		КонецЕсли;
		Если Найти(ИнформацияОбОшибке.Описание,"Проверка свойства") <> 0 Тогда
			НачалоВырезка_ = Найти(ИнформацияОбОшибке.Описание, "Проверка свойства");
			ВырезкаБезЛево_ = Сред(ИнформацияОбОшибке.Описание, НачалоВырезка_);
			КонецСвойства_ = Найти(ВырезкаБезЛево_, ":");
			ВырезкаАтрибута = Сред(ИнформацияОбОшибке.Описание, НачалоВырезка_ + 19, КонецСвойства_ - 21);
			ДанныеАтрибута = ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена(СокрЛП(ВырезкаАтрибута));
			СтруктураОшибки.Атрибут = ДанныеАтрибута.Представление;
			СтруктураОшибки.ОписаниеОшибки = ДанныеАтрибута.ОписаниеОшибки;
		КонецЕсли;
		Если Найти(ИнформацияОбОшибке.Описание,"Значение:") <> 0 Тогда
			ВырезкаMinLength = Сред(
									ИнформацияОбОшибке.Описание,
									Найти(ИнформацияОбОшибке.Описание,"Значение:")
									);
			ВырезкаMinLength = Сред(ВырезкаMinLength, Найти(ВырезкаMinLength,"'"));
			ВырезкаMinLength = Сред(ВырезкаMinLength,0,Найти(ВырезкаMinLength,"'"));
			СтруктураОшибки.Значение = СокрЛП(ВырезкаMinLength);
		КонецЕсли;
		Если Найти(ИнформацияОбОшибке.Описание,"Ошибка проверки данных XDTO") <> 0 Тогда
			НеЗаполненоСвойство_ = Найти(ИнформацияОбОшибке.Описание,"Не установлено значение одного из следующих свойств");
			Если НеЗаполненоСвойство_ <> 0 Тогда
				ВырезкаИмениСвойства = Сред(
										ИнформацияОбОшибке.Описание,
										НеЗаполненоСвойство_ + 53
										);
				ДанныеАтрибута = ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена(СокрЛП(ВырезкаИмениСвойства));
				СтруктураОшибки.Атрибут = ДанныеАтрибута.Представление;
				СтруктураОшибки.ОписаниеОшибки = ДанныеАтрибута.ОписаниеОшибки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ИнформацияОбОшибке.Причина) = Тип("ИнформацияОбОшибке") Тогда
		ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке.Причина, СтруктураОшибки);
	КонецЕсли;
	Если СтруктураОшибки.Атрибут <> Неопределено Тогда
		Текст = "Значение '" + 
				?(ЗначениеЗаполнено(СтруктураОшибки.Значение),СтруктураОшибки.Значение,"Пусто") + 
				"' реквизита '" +
				СтруктураОшибки.Атрибут + 
				"' не соответствует его типу." + ?(ЗначениеЗаполнено(СтруктураОшибки.ОписаниеОшибки), Символы.ПС + СтруктураОшибки.ОписаниеОшибки, "");
				
	Иначе
		Текст = ИнформацияОбОшибке.Описание;
	КонецЕсли; 
	
	Возврат Текст;
	
КонецФункции

// Функция ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена()
//     
//
// Параметры
//  ИмяАтрибута  - Строка
//         сведения об ошибке
//
// Возвращаемое значение:
//   Строка   - Представление атрибута, найденное в макете.
///
Функция ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена(ИмяАтрибута)
	
	Описание = Новый Структура("Представление,ОписаниеОшибки", "Имя атрибута не определено", "");
	РегОбмена = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена;
	ТекстXML = РегОбмена.ПолучитьМакет("ОписаниеПолейВыгрузки").ПолучитьТекст();
	МакетТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ТекстXML).Данные;
	Поиск = МакетТаблица.НайтиСтроки(Новый Структура("ИмяЭлемента", ИмяАтрибута));
	Если Поиск.Количество() > 0  Тогда
		ЗаполнитьЗначенияСвойств(Описание, Поиск[0]);
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

// Функция ПолучитьКодЗаписиСчета()
//     получаем номер документа без буквенных символов
//
// Параметры
//  НомерДокумента  - Строка - номер документа
//
// Возвращаемое значение:
//   Число   - номер документа без букв.
///
Функция ПолучитьКодЗаписиСчета(НомерДокумента)
	
	Значение = 0;
	Итератор = 1;
	Попытка
		Пока Итератор <= СтрДлина(НомерДокумента) Цикл
			Значение = Число(Прав(НомерДокумента, Итератор));
			Итератор = Итератор + 1;
		КонецЦикла;
	Исключение
		
	КонецПопытки;
	
	Если Значение < 0 Тогда
		Значение = Значение * (-1);
	КонецЕсли; 
	
	Возврат Значение;
	
КонецФункции

// Функция ФорматДаты()
//     форматирует дату к формату обмена
//
// Параметры
//  Дата  - {Дата}
//    дата в любом формате
//
// Возвращаемое значение:
//   Строка   - отформатированная дата.
///
Функция ФорматДаты(Дата)
	
	Возврат Формат(Дата,"ДФ=""гггг-ММ-дд""");
	
КонецФункции

 // Процедура: ТипFFOMS
 //   Получает тип XDTO по имени типа из пространства имен ffoms:order:79:2011-04-07
 // 
 // Параметры:
 ///
Функция ТипFFOMS(ИмяТипа, Фабрика_XDTO = Неопределено)
	
	ПространствоИмен = "ffoms:order:79:2011-04-07";	
		
	Если Фабрика_XDTO = Неопределено Тогда
		Возврат ФабрикаXDTO.Пакеты.Получить(ПространствоИмен).Получить(ИмяТипа);
	Иначе
		Возврат Фабрика_XDTO.Пакеты.Получить(ПространствоИмен).Получить(ИмяТипа);
	КонецЕсли;
	
КонецФункции

// Процедура: ДобавитьВМассив
//   Добавляет значение в массив
// 
// Параметры:
//   Массив{Массив}
//     массив данных
//   Ключ{Строка}
//     имя ключа структуры
//   Значение{Произвольный}
//     значение ключа структуры
///
Процедура ДобавитьВМассив(Массив,Ключ,Значение)
	Массив.Добавить(Новый Структура("Ключ,Значение",Ключ,Значение));
КонецПроцедуры

////
// Процедура: СоздатьОбъект_PERS_LIST
//   Создает XDTO объект PERS_LIST, для отправки ответа
//   на запрос;
// 
// Параметры:
//   Документ{ДокументСсылка.РеестрОказаннойПомощи}
//     ссылка на документ по данных которого надо формировать файл.
//
// Возвращаемое значение:
//   XDTO объект   - созданный по документу.
///
Функция СоздатьОбъект_PERS_LIST(Документ)
	
	ТипЗначения_PERS_LIST = ТипFFOMS("PERS_LIST");
	
	СообщениеОбъект_ = СоздатьОбъектXDTO(ТипЗначения_PERS_LIST);
	
	ДанныеЗаполнения_ = Новый Массив;
	// ЗАГОЛОВОК
	ДобавитьВМассив(ДанныеЗаполнения_,"ZGLV.@VERSION","1.0");
	ДобавитьВМассив(ДанныеЗаполнения_,"ZGLV.@DATA",ФорматДаты(ТекущаяДатаСеанса()));
	ДобавитьВМассив(ДанныеЗаполнения_,"ZGLV.@FILENAME",ПолучитьИмяФайлаИнформационногоОбмена(
	"PERS_LIST",
	Неопределено,
	Документ.СтруктурнаяЕдиница.Организация,
	Документ.Контрагент,
	Документ.НачалоПериода
	)
	);
	ДобавитьВМассив(ДанныеЗаполнения_,"ZGLV.@FILENAME1",ПолучитьИмяФайлаИнформационногоОбмена(
	"ZL_LIST",
	Неопределено,
	Документ.СтруктурнаяЕдиница.Организация,
	Документ.Контрагент,
	Документ.НачалоПериода
	)
	);
	////////////////////////////////////////////////////////////////////
	
	// данные пациента
	ИтераторПациентов = 0;
	Для Каждого СтрокаУслуга Из Документ.ОказанныеУслуги Цикл
		
		Пациент = СтрокаУслуга.ДокументОснования.Контрагент;	
		
		ЭлементПациент = "PERS[" + Формат(ИтераторПациентов, "ЧН=0; ЧГ=0") + "]";		
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@ID_PAC", Строка(Пациент.УникальныйИдентификатор()));
		
		// перс данные
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@FAM", ФорматПустойСтрокиНЕТ(Пациент.Фамилия));
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@IM", ФорматПустойСтрокиНЕТ(Пациент.Имя));
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@OT", ФорматПустойСтрокиНЕТ(Пациент.Отчество));
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@W", ПолучитьКод(Пациент.ПолКлиента, Неопределено));
		ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@DR", ФорматДаты(Пациент.ДатаРожденияКлиента));
		
		// представитель
		Если ЗначениеЗаполнено(Пациент.ЗаконныйПредставитель.Фамилия) Тогда
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@FAM_P", Пациент.ЗаконныйПредставитель.Фамилия);
		КонецЕсли; 
		Если ЗначениеЗаполнено(Пациент.ЗаконныйПредставитель.Имя) Тогда
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@IM_P", Пациент.ЗаконныйПредставитель.Имя);
		КонецЕсли; 
		Если ЗначениеЗаполнено(Пациент.ЗаконныйПредставитель.Отчество) Тогда
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@OT_P", ФорматПустойСтрокиНЕТ(Пациент.ЗаконныйПредставитель.Отчество));
		КонецЕсли; 
		Если ЗначениеЗаполнено(Пациент.ЗаконныйПредставитель.ПолКлиента) Тогда
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@W_P", ПолучитьКод(Пациент.ЗаконныйПредставитель.ПолКлиента, Неопределено));
		КонецЕсли; 
		Если ЗначениеЗаполнено(Пациент.ЗаконныйПредставитель.ДатаРожденияКлиента) Тогда
			ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@DR_P", ФорматДаты(Пациент.ЗаконныйПредставитель.ДатаРожденияКлиента));
		КонецЕсли; 
		// Если ЗначениеЗаполнено(Пациент.МестоРожденияПредставление) Тогда
		//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@MR", Пациент.МестоРожденияПредставление);
		// КонецЕсли; 
		
		// ДУЛ
		ДУЛ = ВернутьДУЛКонтрагента(Пациент);
		Если ЗначениеЗаполнено(ДУЛ) Тогда
			КодДокументВид_ = ПолучитьКод(ДУЛ.ВидДокумента, Неопределено);
			Если ЗначениеЗаполнено(КодДокументВид_) Тогда
				ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@DOCTYPE", КодДокументВид_);
				Если ЗначениеЗаполнено(ДУЛ.Серия) Тогда
					ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@DOCSER", ДУЛ.Серия);
				КонецЕсли;
				Если ЗначениеЗаполнено(ДУЛ.Номер) Тогда
					ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@DOCNUM", ДУЛ.Номер);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Если ЗначениеЗаполнено(Пациент.СтраховойНомерПФР) Тогда
		//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@SNILS", Пациент.СтраховойНомерПФР);
		// КонецЕсли;
		// Если ЗначениеЗаполнено(Пациент.МестоЖительстваОКАТО) Тогда
		//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@OKATOG", Пациент.МестоЖительстваОКАТО);
		// КонецЕсли;
		// Если ЗначениеЗаполнено(Пациент.МестоПребыванияОКАТО) Тогда
		//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@OKATOP", Пациент.МестоПребыванияОКАТО);
		// КонецЕсли;
		// Если ЗначениеЗаполнено(Пациент.КомментарийКПациенту) Тогда
		//	ДобавитьВМассив(ДанныеЗаполнения_, ЭлементПациент +".@COMENTP", Пациент.КомментарийКПациенту);
		// КонецЕсли;
		
		ИтераторПациентов = ИтераторПациентов + 1;
	КонецЦикла;
	
	Попытка
		ЗаполнитьОбъектXDTO(СообщениеОбъект_, ДанныеЗаполнения_);
		СообщениеОбъект_.Проверить();
	Исключение
		Рез = ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке());
		Сообщение_ = Новый СообщениеПользователю;
		Сообщение_.Текст = Рез;
		Сообщение_.Сообщить();
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат СообщениеОбъект_;
	
КонецФункции

// Функция ФорматПустойСтрокиНЕТ()
//     форматирует пустую строку
//
// Параметры
//  Строка  - {Строка}
//      строка для форматирования
//
// Возвращаемое значение:
//   Строка   - если параметр пустая строка, то "НЕТ"
///
Функция ФорматПустойСтрокиНЕТ(Строка)
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат "НЕТ";
	Иначе
		Возврат Строка;
	КонецЕсли; 
	
КонецФункции

&НаСервере
// Функция возвращает дул контрагента .
//
Функция ВернутьДУЛКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	   "ВЫБРАТЬ ПЕРВЫЕ 1
	   |	ДокументыФизическихЛиц.Физлицо,
	   |	ДокументыФизическихЛиц.ВидДокумента,
	   |	ДокументыФизическихЛиц.Серия,
	   |	ДокументыФизическихЛиц.Номер,
	   |	ДокументыФизическихЛиц.ДатаВыдачи,
	   |	ДокументыФизическихЛиц.СрокДействия,
	   |	ДокументыФизическихЛиц.КемВыдан,
	   |	ДокументыФизическихЛиц.КодПодразделения,
	   |	ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность,
	   |	ДокументыФизическихЛиц.Представление
	   |ИЗ
	   |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	   |ГДЕ
	   |	ДокументыФизическихЛиц.Физлицо = &Физлицо";

	Запрос.УстановитьПараметр("Физлицо", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Неопределено, РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции // ПолучитьКлючЗаписи()

// Функция ПроверитьФайлИнформационногоОбмена()
//     определяет новый порядковый номер для пакета обмена в омс
//
// Параметры
//  НачалоПериода  - Дата
//         дата среза
//  ОрганизацияИсточник  - СправочникСсылка.Организации
//         отправитель файла.
//  ОрганизацияПолучатель  - СправочникСсылка.Контрагенты
//         получатель файла.
//  ИмяФайлаАрхива  - Строка
//         имя файла, для проверки, если извлекаем из хранилища.
//  ПутьКФайлуАрхива  - Строка
//         путь к файлу на локальном диске.
//  АдресВХранилище  - Строка
//         адрес файла во временном хранилище.
//
// Возвращаемое значение:
//   Булево   - Истина, если переданный файл соответствует требованиям.
///
Функция ПроверитьФайлИнформационногоОбмена(
							НачалоПериода,
							ИсточникФинансирования,
							Отправитель,
							Получатель,
							ИмяФайлаАрхива,
							ПутьКФайлуАрхива,
							АдресВХранилище = ""
							
			)
	
	МассивФайловДляУдаления = Новый Массив();
	ВременныйКаталог = КаталогВременныхФайлов();
	// проверка на существование файла /////////////////////////////////////////////
	Если ЗначениеЗаполнено(АдресВХранилище) И
		 ЗначениеЗаполнено(ИмяФайлаАрхива)
	Тогда
		ПутьКФайлуАрхива = ВременныйКаталог + ИмяФайлаАрхива;
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ДвоичныеДанныеФайла.Записать(ПутьКФайлуАрхива);
		МассивФайловДляУдаления.Добавить(ПутьКФайлуАрхива);
		ФайлОбмена = Новый Файл(ПутьКФайлуАрхива);
	ИначеЕсли ЗначениеЗаполнено(ПутьКФайлуАрхива) Тогда
		ФайлОбмена = Новый Файл(ПутьКФайлуАрхива);
	Иначе
		ПоказатьСообщение("ФормированиеРеестровСчетов_НеУказаноРасположениеФайла");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ФайлОбмена.Существует() Тогда
		ПоказатьСообщение("ФормированиеРеестровСчетов_ФайлАрхиваНеСуществует");
		Возврат Ложь;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////////
	
	ИмяФайлаБезРаширения = ФайлОбмена.ИмяБезРасширения;
	РасширениеФайла = ФайлОбмена.Расширение;
	
	Ответ = ПроверитьИмяФайлаНаОтправителяИОтчетныйПериод(ИмяФайлаБезРаширения, ИсточникФинансирования, Отправитель, Получатель, НачалоПериода);
	
	// проверка на имя архива
	Если Ответ = Ложь Тогда
		Параметры_ = Новый Структура();
		Параметры_.Вставить("ИмяФайла", ИмяФайлаБезРаширения);
		ПоказатьСообщение("ФормированиеРеестровСчетов_ИмяФайлаНеСоответствует",Параметры_);
		Возврат Ложь;
	КонецЕсли; 
	
	// проверка возможности распаковки /////////////////////////////////
	ПутьРаспаковки = ВременныйКаталог + ИмяФайлаБезРаширения;
	Архив = РаспаковатьАрхив(ПутьКФайлуАрхива, ПутьРаспаковки);
	Если Архив = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	МассивФайловДляУдаления.Добавить(ПутьРаспаковки);
	///////////////////////////////////////////////////////////////////
	
	Если Архив.Элементы.Количество() <> 2 Тогда
		ПоказатьСообщение("ФормированиеРеестровСчетов_СтандартФайловВАрхиве");
	КонецЕсли; 
	
	Для каждого ФайлАрхива Из Архив.Элементы Цикл
		ФорматXDTOКорректен = Истина;
		Если ВРег(ФайлАрхива.Расширение) <> "XML" Тогда
			ПоказатьСообщение("ФормированиеРеестровСчетов_СтандартФайловВАрхиве");
			Возврат Ложь;
		КонецЕсли; 
		ПутьКФайлуАрхива = ПутьРаспаковки +"\" + ФайлАрхива.Имя;
		ИмяБезРасширения = ФайлАрхива.ИмяБезРасширения;
		Префикс = Лев(ФайлАрхива.Имя, 1);
		// проверка на отправителя и период
		Ответ = ПроверитьИмяФайлаНаОтправителяИОтчетныйПериод(ИмяБезРасширения, ИсточникФинансирования, Отправитель, Получатель, НачалоПериода);
		Если Ответ = Ложь Тогда
			Параметры_ = Новый Структура();
			Параметры_.Вставить("ИмяФайла", ИмяФайлаБезРаширения);
			ПоказатьСообщение("ФормированиеРеестровСчетов_ИмяФайлаНеСоответствует",Параметры_);
			Возврат Ложь;
		КонецЕсли;
		
		// проверка на нахождение только допустимых файлов
		Попытка
			Если Префикс = "H" Тогда
				ФорматXDTOКорректен = ПроверитьОбъектXDTO(ПутьКФайлуАрхива, ТипFFOMS("ZL_LIST"));
			ИначеЕсли Префикс = "L" Тогда
				ФорматXDTOКорректен = ПроверитьОбъектXDTO(ПутьКФайлуАрхива, ТипFFOMS("PERS_LIST"));
			Иначе
				Параметры_ = Новый Структура();
				Параметры_.Вставить("ИмяФайла", ФайлАрхива.Имя);
				ПоказатьСообщение("ФормированиеРеестровСчетов_ФайлВАрхивеНеСоответствуетТребованиям",Параметры_);
				Возврат Ложь;
			КонецЕсли;
		Исключение
			Рез = ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке());
			Сообщение_ = Новый СообщениеПользователю;
			Сообщение_.Текст = Рез;
			Сообщение_.Сообщить();
			Возврат Неопределено;
		КонецПопытки;
		Если НЕ ФорматXDTOКорректен Тогда
			Параметры_ = Новый Структура();
			Параметры_.Вставить("ИмяФайла", ФайлАрхива.Имя);
			ПоказатьСообщение("ФормированиеРеестровСчетов_НеКорректнаяСтруктураФайла",Параметры_);
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла;
	
	УдалитьФайлыПоМассивуПутей(МассивФайловДляУдаления);
	
	Возврат Истина;
	
КонецФункции

// Функция ПроверитьОбъектXDTO()
//     проверяет ОбъектXDTO на валидность
//
// Параметры
//  ПутьКФайлу  - Строка
//         путь к файлу
//  Тип  - ТипXDTO
//         типXDTO
//
// Возвращаемое значение:
//   Булево   - Истина, если проверка прошла успешно.
///
Функция ПроверитьОбъектXDTO(ПутьКФайлу, Тип)
	
	ЧтениеXML_ = Новый ЧтениеXML();
	ЧтениеXML_.ОткрытьФайл(ПутьКФайлу,,,"windows-1251");
	Попытка
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(
						ЧтениеXML_,
						Тип
					);
	Исключение
		Инфо = ИнформацияОбОшибке();
		Рез = ОбработатьИнформациюОбОшибке(Инфо);
		Сообщение_ = Новый СообщениеПользователю;
		Сообщение_.Текст = Рез;
		Сообщение_.Сообщить();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция ПолучитьЗначениеРеквизитаФормированияРеестра
//
// Параметры:
//  Данные  - Произвольный - <описание параметра>
//                 <продолжение описания параметра>
//  ИсточникФинансирования  - <СправочникСсылка.ИсточникиФинансирования - источник
//                 финансирования для определения по какому реквизииту получать данные.
//
// Возвращаемое значение:
//   Строка   - имя реквизита, с которого необходимо получить данные для формирования реестра.
//
Функция ПолучитьЗначениеРеквизитаФормированияРеестра(Данные, ИсточникФинансирования = Неопределено)
		
	// ОБМЕН ПО ОМС
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.Организации"), "РеестровыйНомерОМС");
	// СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.СтруктураПредприятия"), "РеестровыйНомерОМС");
	СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.Контрагенты"), "РеестровыйНомерОМС");
	СоответствиеРеквизитов.Вставить(Тип("ПеречислениеСсылка.ТипыПолиса"), Перечисления.ТипыПолиса);
	// СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.ПрофилиМедицинскойПомощи"), "КодПоОМС");
	СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.Специализации"), "КодПоОМС");
	СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.Сотрудники"), "КодПоОМС");
	СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.ВидыДокументовФизическихЛиц"), "КодПоОМС");
	// СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.ИсходыЗаболеванийПоликлиника"), Справочники.ИсходыЗаболеванийПоликлиника);
	// СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.РезультатыОбращенийПоликлиника"), Справочники.РезультатыОбращенийПоликлиника);
	СоответствиеРеквизитов.Вставить(Тип("ПеречислениеСсылка.ПолФизическогоЛица"), Перечисления.ПолФизическогоЛица);
	// СоответствиеРеквизитов.Вставить(Тип("СправочникСсылка.СпособыОплатыМедицинскойПомощи"), Справочники.СпособыОплатыМедицинскойПомощи);
	
	ЗначениеСоответствия_ = СоответствиеРеквизитов.Получить(ТипЗнч(Данные));	
	
	Если ТипЗнч(ЗначениеСоответствия_) = Тип("Строка") Тогда
		Значение_ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные, ЗначениеСоответствия_);
	Иначе
		Значение_ = ЗначениеСоответствия_.КодПоОМС(Данные);
	КонецЕсли;
	
	Возврат Значение_;
	
КонецФункции // ПолучитьИмяРеквизитаФормированияРеестра()

 // Процедура: ПолучитьТипXDTO
 //   Создает объект XDTO по типу
 // 
 // Параметры:
 ///
Функция СоздатьОбъектXDTO(ТипОбъекта, Фабрика_XDTO = Неопределено)
	
	Если Фабрика_XDTO = Неопределено Тогда
		Возврат ФабрикаXDTO.Создать(ТипОбъекта);
	Иначе
		Возврат Фабрика_XDTO.Создать(ТипОбъекта);
	КонецЕсли;
	
КонецФункции

 // Процедура: ЗаполнитьОбъектXDTO
 //   Заполняет объект xdto по его описанию
 // 
 // Параметры:
 //   Объект
 //     ОбхектXDTO
 //   ДанныеЗаполнения
 //     Массив стркутур Структура("Ключ,Значение"),
 //     где ключ  - строковый путь "tag1.tag2.tag3[0].@attr1",
 //     Значение - произвольное значение.
 //   Фабрика_XDTO
 //   Разделитель
 //		Разделитель в строковом пути
 ///
Процедура ЗаполнитьОбъектXDTO(Объект, ДанныеЗаполнения, Фабрика_XDTO = Неопределено, Разделитель=".")
	
	Для Каждого КлючЗначение_ Из ДанныеЗаполнения Цикл
		Ключи_ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючЗначение_.Ключ, Разделитель);
		ТекОбъект_ = Объект;
		ПредыдущийОбъект_ = Неопределено;
		Для Каждого Ключ_ Из Ключи_ Цикл
			ПредыдущийОбъект_ = ТекОбъект_;
			Если Не ЭтоАтрибут(Ключ_) Тогда
				Если ОбъектСуществует(ТекОбъект_,Ключ_) Тогда
					ТекОбъект_ = ПолучитьОбъектПоля(ТекОбъект_,Ключ_);
				Иначе
					ТекОбъект_ = СоздатьОбъектПоля(ТекОбъект_, Ключ_, Фабрика_XDTO);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ТекОбъект_ <> Неопределено Тогда
			Если КлючЗначение_.Значение <> Неопределено И КлючЗначение_.Значение <> "" Тогда
				Если ЭтоАтрибут(Ключ_) Тогда
					ТекОбъект_[ИмяКлюча(Ключ_)] = КлючЗначение_.Значение;
				ИначеЕсли ТипЗнч(ТекОбъект_) = Тип("Строка") И ПредыдущийОбъект_ <> Неопределено Тогда
					ПредыдущийОбъект_[ИмяКлюча(Ключ_)] = КлючЗначение_.Значение;
				Иначе
					Последовательность_ = ТекОбъект_.Последовательность();
					Последовательность_.Очистить();
					Последовательность_.Добавить(КлючЗначение_.Значение, Неопределено);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ПредыдущийОбъект_[ИмяКлюча(Ключ_)] = КлючЗначение_.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

 // Функция ИмяКлюча
 ///
Функция ИмяКлюча(Ключ)
	Если ЭтоАтрибут(Ключ) Тогда
		Возврат ИмяКлюча(Прав(Ключ,СтрДлина(Ключ) - 1));
	ИначеЕсли ЭтоСписок(Ключ) Тогда
		Массив_ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ключ, "[");
		Возврат ИмяКлюча(Массив_[0]);
	ИначеЕсли КлючСодержитТип(Ключ) Тогда
		Массив_ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ключ, "{");
		Возврат ИмяКлюча(Массив_[0]);
	Иначе
		Возврат Ключ;
	КонецЕсли;
КонецФункции

 // Функция ЭтоСписок
 ///
Функция ЭтоСписок(Ключ)
	Если Прав(Ключ,1) = "]" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

 // Функция КлючСодержитТип
 ///
Функция КлючСодержитТип(Ключ)
	Возврат Найти(Ключ,"{") <> 0;
КонецФункции

 // Функция СоздатьОбъектПоля
 ///
Функция СоздатьОбъектПоля(Объект, Ключ, Фабрика_XDTO = Неопределено)

	Если КлючСодержитТип(Ключ) Тогда
		ИмяТипа_ = ПолучитьИмяТипа(Ключ);
		Тип_ = ПолучитьТипXDTO(ИмяТипа_.ИмяТипа, ИмяТипа_.ПространствоИмен, Фабрика_XDTO);
		Результат_ = СоздатьОбъектXDTO(
									Тип_,
									Фабрика_XDTO
								);
	Иначе
		Результат_ = СоздатьОбъектXDTO(
									Объект.Тип().Свойства.Получить(ИмяКлюча(Ключ)).Тип,
									Фабрика_XDTO
								);
	КонецЕсли;
	
	Если Результат_ <> Неопределено Тогда
		Если ТипЗнч(Объект[ИмяКлюча(Ключ)]) = Тип("СписокXDTO") Тогда
			Объект[ИмяКлюча(Ключ)].Добавить(Результат_);
		Иначе
			Объект[ИмяКлюча(Ключ)] = Результат_;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат_;
КонецФункции

 // Функция ПолучитьИмяТипа
 ///
Функция ПолучитьИмяТипа(Ключ)
	Лев_ = Найти(Ключ,"{");
	Прав_ = Найти(Ключ,"}");
	Зпт_ = Найти(Ключ,",");
	Содержимое_ = Сред(Ключ,Лев_ + 1,Прав_ - Лев_ - 1);
	ПространствоИмен_ = ВосстановитьПространствоИмен(Лев(Содержимое_,Зпт_ - Лев_ - 1));
	Тип_ = Прав(Содержимое_,Прав_ - Зпт_ - 1);
	Возврат Новый Структура("ПространствоИмен,ИмяТипа",ПространствоИмен_,Тип_);
КонецФункции

 // Процедура: ВосстановитьПространствоИмен
 //   Восстанавливает ПИ после преобразования функцией ПреобразоватьПространствоИмен
 // 
 // Параметры:
 ///
Функция ВосстановитьПространствоИмен(ПИ) 
	Возврат СтрЗаменить(ПИ,"#<dot>#",".");
КонецФункции

 // Процедура: ПолучитьТипXDTO
 //   Получает тип XDTO по имени типа и пространству имен
 // 
 // Параметры:
 ///
Функция ПолучитьТипXDTO(ИмяТипа, ПространствоИмен, Фабрика_XDTO = Неопределено)
	
	Если Фабрика_XDTO = Неопределено Тогда
		Возврат ФабрикаXDTO.Пакеты.Получить(ПространствоИмен).Получить(ИмяТипа);
	Иначе
		Возврат Фабрика_XDTO.Пакеты.Получить(ПространствоИмен).Получить(ИмяТипа);
	КонецЕсли;
	
КонецФункции

 // Функция ПолучитьОбъектПоля
 ///
Функция ПолучитьОбъектПоля(Объект, Ключ)
	Если ТипЗнч(Объект[ИмяКлюча(Ключ)]) = Тип("СписокXDTO") Тогда
		Если ЭтоСписок(Ключ) Тогда
			Индекс_ = ПолучитьИндекс(Ключ);
			Возврат Объект[ИмяКлюча(Ключ)].Получить(Индекс_);
		Иначе
			Возврат Объект[ИмяКлюча(Ключ)].Получить(0);
		КонецЕсли;
	Иначе
		Возврат Объект[ИмяКлюча(Ключ)];
	КонецЕсли;

КонецФункции

 // Функция ПолучитьИндекс
 ///
Функция ПолучитьИндекс(Ключ)
	Массив_ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ключ, "[");
	Возврат Число(Лев(Массив_[1],СтрДлина(Массив_[1])-1));
КонецФункции

 // Функция ОбъектСуществует
 ///
Функция ОбъектСуществует(Объект, Ключ)
	Если ТипЗнч(Объект[ИмяКлюча(Ключ)]) = Тип("СписокXDTO") Тогда
		Список_ = Объект[ИмяКлюча(Ключ)];
		
		Если ЭтоСписок(Ключ) Тогда
			Индекс_ = ПолучитьИндекс(Ключ);
			Возврат Список_.Количество() > Индекс_;
		Иначе
			Возврат Список_.Количество() <> 0;
		КонецЕсли;
	Иначе
		Возврат Объект[ИмяКлюча(Ключ)] <> Неопределено;
	КонецЕсли;
КонецФункции

// Функция ЭтоАтрибут
 ///
Функция ЭтоАтрибут(Ключ)
	Если Лев(Ключ,1) = "@" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

 // Функция: Получить
 //   возвращает текст и заголовок сообщения пользователю, соответствующего
 //   имени сообщения в справочнике.
 //
 // Параметры:
 //   ИмяСообщения {Строка}
 //     Имя сообщения строкой.
 //   Параметры
 //     Структура, которая хранит значения по ключам. Каждое вхождение подстроки вида
 //     #Ключ#, где Ключ - это ключ структуры, будет заменено на значение по этому ключу.
 //     Параметр не обязательный.
 //   ТолькоТекст {Булево}
 //     Определяет возвращаемое значение. Если Ложь, то вернется структура.
 //   Язык {Строка}
 //     Код языка для работы с НСтр.
 //
 // Возврат:
 //   {Строка, Структура}
 //        Текст сообщения или структура с двумя полями: Текст и Заголовок
 ///
Функция Получить(
	Знач ИмяСообщения,
	Знач Параметры = Неопределено,
	Знач ТолькоТекст = Истина,
	Знач Язык = ""
) Экспорт
	
	СообщениеСтруктура = ПолучитьПовтИсп(ИмяСообщения, Язык);
	Сообщение = Новый Структура(СообщениеСтруктура);
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		Для Каждого Параметр Из Параметры Цикл
			Шаблон = "#" + Параметр.Ключ + "#";
			Замена = Параметр.Значение;
			Сообщение.Текст = СтрЗаменить(Сообщение.Текст, Шаблон, Замена);
		КонецЦикла;
	КонецЕсли;
	
	Если ТолькоТекст = Истина Тогда
		Возврат Сообщение.Текст;
	Иначе
		Возврат Сообщение;
	КонецЕсли;
	
КонецФункции

 // Функция: Получить
 //   Получает сообщение пользователю по заданному идентификатору.
 //
 // Параметры:
 //   ИмяСообщения{Строка}
 //        Имя сообщения для получения
 //   Язык{Строка}
 //        Код языка, для получения строки НСтр
 //
 // Возврат: {Строка}
 ///
Функция ПолучитьПовтИсп(Знач ИмяСообщения, Знач КодЯзыка = "") 
	
	Сообщение = Новый Структура("Текст, Заголовок, Описание");
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	СообщенияПользователю.Наименование КАК Заголовок,
				|	СообщенияПользователю.ТекстНСтр КАК Текст,
				|	СообщенияПользователю.Описание
				|ИЗ
				|	Справочник.СообщенияПользователю КАК СообщенияПользователю
				|ГДЕ
				|	СообщенияПользователю.ПометкаУдаления = ЛОЖЬ
				|	И СообщенияПользователю.ИмяСообщения = &ИмяСообщения";
		Запрос.УстановитьПараметр("ИмяСообщения", ИмяСообщения);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Сообщение, Выборка);
			Сообщение.Текст = НСтр(Сообщение.Текст, КодЯзыка);
		Иначе
			ВызватьИсключение НСтр("ru='Неизвестное сообщение!'");
		КонецЕсли;
		
	Исключение
		
		Сообщение.Текст = НСтр("ru='Неизвестное сообщение: " + ИмяСообщения + "'");
		Сообщение.Заголовок = НСтр("ru='Неизвестное сообщение!'");
		
	КонецПопытки;
	
	Результат = Новый ФиксированнаяСтруктура(Сообщение);
	
	Возврат Результат;
	
КонецФункции

// Функция ПолучитьПараметрТипыИсточника()
//     определяет тип участника обмена данными
//
// Параметры
//  Ссылка  - {СправочникСсылка.Организации, СправочникСсылка.Контрагенты}
//      участник обмена.
//
// Возвращаемое значение:
//   <Строка>   - тип участника обмена.
///
Функция ПолучитьПараметрТипыИсточника(Ссылка, ИсточникФинансирования)
	
	Параметр_ = "";
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		Параметр_ =  "M";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		КодКонтрагента_ = ПолучитьЗначениеРеквизитаФормированияРеестра(Ссылка, ИсточникФинансирования);
		ДлинаКода = СтрДлина(КодКонтрагента_);
		Если ДлинаКода = 2 Тогда
			Параметр_ = "T";
		ИначеЕсли ДлинаКода = 5 Тогда
			Параметр_ = "S";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Параметр_;
	
КонецФункции

Функция ПолучитьКод(Ссылка, ИсточникФинансирования)
	
	Возврат ПолучитьЗначениеРеквизитаФормированияРеестра(Ссылка, ИсточникФинансирования);
	
КонецФункции

&НаКлиенте
 // Процедура: ВывестиПредупреждение
 //   выводит предупреждение.
 //
 // Параметры:
 //   ИмяСообщения - {Строка} - 
 //     Имя сообщения строкой.
 //   Параметры - {Структура} - 
 //     Структура, которая хранит значения по ключам. Каждое вхождение подстроки вида
 //     #Ключ#, где Ключ - это ключ структуры, будет заменено на значение по этому ключу.
 //     Параметр не обязательный.
 //   ИспользоватьОповещение - {Булево} - 
 //     Признак того, что оповещение необходимо
 //   Модуль {УправляемаяФорма; КомандаКомандногоИнтерфейса; ОбщийМодуль}
 //     Программный модуль, процедура которого будет вызвана.
 //   ИмяОповещенияОЗавершении - {Строка} - 
 //     Содержит описание процедуры, которая будет вызвана
 //     после закрытия окна предупреждения со следующими параметрами.
 //   ДополнительныеПараметры - {Структура} - 
 //     Дополнительные параметры, которые будут переданы с оповещением
 //   Таймаут - {Число} - 
 //     Интервал времени в секундах, в течение которого система будет ожидать ответа пользователя.
 //     По истечении интервала окно предупреждения будет закрыто.
 //     Если параметр не указан, то время ожидания не ограничено.
 //   ИспользоватьЗаголовок - {Булево} - 
 //     Признак того, что необходимо использовать заголовок при выводе
 //   ИмяСообщенияЗаголовка - {Строка} - 
 //     Имя сообщения с заголовком строкой
 //   ПараметрыСообщенияЗаголовка - {Структура} - 
 //     Структура, которая хранит значения по ключам. Каждое вхождение подстроки вида
 //     #Ключ#, где Ключ - это ключ структуры, будет заменено на значение по этому ключу.
 //     Параметр не обязательный.
 //   Язык - {Строка} - 
 //     Код языка для работы с НСтр.
 //
 ///
Процедура ВывестиПредупреждение(
		Знач ИмяСообщения,
		Знач Параметры = Неопределено,
		Знач ИспользоватьОповещение = Ложь,
		Знач Модуль = Неопределено,
		Знач ИмяОповещенияОЗавершении = Неопределено,
		Знач ДополнительныеПараметры = Неопределено,
		Знач ИспользоватьЗаголовок = Ложь,
		Знач ИмяСообщенияЗаголовок = Неопределено,
		Знач ПараметрыСообщенияЗаголовка = Неопределено,
		Знач Таймаут = 0,
		Знач Язык = ""
	)
	
	ДанныеСообщения = Получить(ИмяСообщения, Параметры, Ложь, Язык);
	
	// определяемся с заголовком
	Если ИмяСообщенияЗаголовок = Неопределено Тогда
		ЗаголовокТекст_ = ДанныеСообщения.Заголовок;
	Иначе
		ЗаголовокТекст_ = Получить(ИмяСообщенияЗаголовок, ПараметрыСообщенияЗаголовка, Истина, Язык);
	КонецЕсли;
	
	Если ИспользоватьОповещение = Истина И Модуль <> Неопределено Тогда
		// оповещаем по завершении
		
		Если ИмяОповещенияОЗавершении = Неопределено Тогда
			// некое универсальное оповещение
			ОписаниеОповещения_ = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждения", Модуль, ДополнительныеПараметры);
		Иначе
			ОписаниеОповещения_ = Новый ОписаниеОповещения(ИмяОповещенияОЗавершении, Модуль, ДополнительныеПараметры);
		КонецЕсли;
		
		
		Если ИспользоватьЗаголовок = Истина Тогда
		
			ПоказатьПредупреждение(ОписаниеОповещения_, ДанныеСообщения.Текст, Таймаут, ЗаголовокТекст_);
		
		Иначе
		
			ПоказатьПредупреждение(ОписаниеОповещения_, ДанныеСообщения.Текст, Таймаут);
			
		КонецЕсли;
		
	Иначе
		// без оповещений
		
		Если ИспользоватьЗаголовок = Истина Тогда
		
			ПоказатьПредупреждение(, ДанныеСообщения.Текст, Таймаут, ЗаголовокТекст_);
		
		Иначе
		
			ПоказатьПредупреждение(, ДанныеСообщения.Текст, Таймаут);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 
