
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='Оборудование:'") + Символы.НПП  + Строка(Идентификатор);
	
	времПорт            	= Неопределено;
	времСервер          	= Неопределено;
	времЛогин           	= Неопределено;
	времПароль	        	= Неопределено;
	времСтруктурнаяЕдиница 	= Неопределено;

	Параметры.ПараметрыОборудования.Свойство("Сервер"          		, времСервер);
	Параметры.ПараметрыОборудования.Свойство("Порт"            		, времПорт);
	Параметры.ПараметрыОборудования.Свойство("Логин"          	 	, времЛогин);
	Параметры.ПараметрыОборудования.Свойство("Пароль"          		, времПароль);
	Параметры.ПараметрыОборудования.Свойство("СтруктурнаяЕдиница"	, времСтруктурнаяЕдиница);
	
	Сервер          	= ?(времСервер	        = Неопределено,   "http://xxxxx.vats-on.ru"	, времСервер);
	Порт            	= ?(времПорт            = Неопределено,   80			, времПорт);
	Логин 	        	= ?(времЛогин           = Неопределено,   ""			, времЛогин);
	Пароль          	= ?(времПароль	        = Неопределено,   ""			, времПароль);
	СтруктурнаяЕдиница 	= ?(времСтруктурнаяЕдиница = Неопределено, Неопределено	, времСтруктурнаяЕдиница);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("Сервер"          , Сервер);
	НовыеЗначениеПараметров.Вставить("Порт"            , Порт);
	НовыеЗначениеПараметров.Вставить("Логин"           , Логин);
	НовыеЗначениеПараметров.Вставить("Пароль"          , Пароль);
	НовыеЗначениеПараметров.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	
	ОчиститьСообщения();
	СообщениеОшибки  = "";
	
	Результат = IPТелефония.OKTELL_ТестированиеСервера(Сервер, Порт, Логин, Пароль, СообщениеОшибки);
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден. Ошибка %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", СообщениеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти