
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	Элементы.ВерсияСхемОбмена.СписокВыбора.ЗагрузитьЗначения(ИнтеграцияМДЛП.ДоступныеВерсииСхемОбмена());
	
	КлючСохраненияПоложенияОкна = Объект.СобственнаяОрганизация;
	
	СобытияФормМДЛППереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
	СобытияФормМДЛППереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СобытияФормМДЛПКлиентПереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СобытияФормМДЛППереопределяемый.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ОрганизацииМДЛП", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СобственнаяОрганизацияПриИзменении(Элемент)
	
	Элементы.ВерсияСхемОбмена.Видимость = Объект.СобственнаяОрганизация;
	Элементы.ИдентификаторКлиента.Видимость = Объект.СобственнаяОрганизация;
	Элементы.СекретКлиента.Видимость = Объект.СобственнаяОрганизация;
	Элементы.ДатаНачалаИспользования.Видимость = Объект.СобственнаяОрганизация;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	Элементы.ВерсияСхемОбмена.Видимость = Объект.СобственнаяОрганизация;
	Элементы.ИдентификаторКлиента.Видимость = Объект.СобственнаяОрганизация;
	Элементы.СекретКлиента.Видимость = Объект.СобственнаяОрганизация;
	Элементы.ДатаНачалаИспользования.Видимость = Объект.СобственнаяОрганизация;
	
КонецПроцедуры

#КонецОбласти
