                                              
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Инициализировать предопределенную сделку
//
// Параметры:
//  Контрагент			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Врач				 - 	 - 
//  Специализация		 - 			 - 
//  ВидОсмотра			 - 			 - 
//  Записан				 - 			 - 
//  ГенерироватьСделку	 - 			 - 
//  ЭтапГенерации		 - 			 - 
//  ВключитьБизнесЛогику - 			 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПредопределеннуюСделку(Контрагент
											, СтруктурнаяЕдиница 	= Неопределено
											, Врач 					= Неопределено
											, Специализация 		= Неопределено
											, ВидОсмотра 			= Неопределено
											, Записан 				= Ложь
											, ГенерироватьСделку 	= Ложь
											, ЭтапГенерации 		= Неопределено
											, МассивСделокИсключения = Неопределено
											, ВключитьБизнесЛогику 	= Ложь) Экспорт
								
											
	Сделка = Неопределено;
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
		
	ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	Если НЕ ЗначениеЗаполнено(ВидСделки) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось инициализировать предопределенную сделку по причине: Не инициализирован предопределенный вид сделки ""Первичный, повторный пациент""'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Врач) Тогда
		Врач = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Попытка
		КоллекцияСделок = ПолучитьСделкиПоКлиенту(Контрагент
												, СтруктурнаяЕдиница
												, Истина
												, Врач
												, ?(ВидОсмотра = Перечисления.ВидыОсмотров.Направление, Специализация, Неопределено)
												, 
												, Истина
												, Ложь
												, Перечисления.РезультатыСделок.ПустаяСсылка()
												,
												,
												,
												, МассивСделокИсключения
												, ВидОсмотра);
												
		Если КоллекцияСделок.Количество() > 0 И ТипЗнч(КоллекцияСделок) = Тип("ТаблицаЗначений") Тогда
			Если ЗначениеЗаполнено(ВидОсмотра) Тогда 										
				СтркутураПоиска1 = Новый Структура("ВидСделки, СтруктурнаяЕдиница, Врач, Записан", ВидСделки, СтруктурнаяЕдиница, Врач, Записан);
			Иначе 
				СтркутураПоиска1 = Новый Структура("ВидСделки, СтруктурнаяЕдиница, Записан", ВидСделки, СтруктурнаяЕдиница, Записан);
			КонецЕсли;	
			КоллекцияСтрок = КоллекцияСделок.НайтиСтроки(СтркутураПоиска1);
			Если КоллекцияСтрок.Количество() > 0 Тогда 
				Сделка = ?(ТипЗнч(КоллекцияСделок) = Тип("Массив"), КоллекцияСделок[0], КоллекцияСтрок[КоллекцияСтрок.Количество()-1].Сделка);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Сделка) И НЕ Записан Тогда 
				Если ЗначениеЗаполнено(ВидОсмотра) Тогда 										
					СтркутураПоиска2 = Новый Структура("ВидСделки, СтруктурнаяЕдиница, Врач, Записан", ВидСделки, СтруктурнаяЕдиница, Врач, Истина);
					КоллекцияСтрок = КоллекцияСделок.НайтиСтроки(СтркутураПоиска2);
					Если КоллекцияСтрок.Количество() = 0 И ВидОсмотра = Перечисления.ВидыОсмотров.Направление И НЕ ЗначениеЗаполнено(Врач) И ЗначениеЗаполнено(Специализация) Тогда
						СтркутураПоиска2 = Новый Структура("ВидСделки, СтруктурнаяЕдиница, Специализация, Записан", ВидСделки, СтруктурнаяЕдиница, Специализация, Истина);
					КонецЕсли;	
				Иначе 
					СтркутураПоиска2 = Новый Структура("ВидСделки, СтруктурнаяЕдиница, Записан", ВидСделки, СтруктурнаяЕдиница, Истина);
				КонецЕсли;	
				КоллекцияСтрок = КоллекцияСделок.НайтиСтроки(СтркутураПоиска2);
				Если КоллекцияСтрок.Количество() > 0 Тогда
					Записан = Истина;
					Сделка = ?(ТипЗнч(КоллекцияСделок) = Тип("Массив"), КоллекцияСделок[0], КоллекцияСтрок[КоллекцияСтрок.Количество()-1].Сделка);
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Сделка) И ЗначениеЗаполнено(Врач) И ЗначениеЗаполнено(Специализация) И ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда 
				СтркутураПоиска = Новый Структура("ВидСделки, СтруктурнаяЕдиница, Специализация, Записан", ВидСделки, СтруктурнаяЕдиница, Специализация, Записан);
				КоллекцияСтрок = КоллекцияСделок.НайтиСтроки(СтркутураПоиска);
				Если КоллекцияСтрок.Количество() > 0 Тогда 
					Сделка = ?(ТипЗнч(КоллекцияСделок) = Тип("Массив"), КоллекцияСделок[0], КоллекцияСтрок[КоллекцияСтрок.Количество()-1].Сделка);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
												
		
		Если ЗначениеЗаполнено(Сделка) Тогда 
			Возврат Сделка;		
		ИначеЕсли НЕ ГенерироватьСделку Тогда 
			Возврат Неопределено;
		КонецЕсли;
		
		// Формируем данные заполнения генерируемой сделки
		Если ЗначениеЗаполнено(ЭтапГенерации) Тогда 
			Если ТипЗнч(ЭтапГенерации) = Тип("Число") Тогда 
				ЭтапГенерации = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделки, ЭтапГенерации);
			ИначеЕсли НЕ ТипЗнч(ЭтапГенерации) = Тип("СправочникСсылка.ЭтапыСделок") Тогда 
        		ЭтапГенерации = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделки, 3);
			КонецЕсли;
		Иначе 
        	ЭтапГенерации = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделки, 1);
		КонецЕсли;	
					
		Если НЕ ЗначениеЗаполнено(ЭтапГенерации) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ДанныеЗаполнения = Новый Структура();
		ДанныеЗаполнения.Вставить("ВидСделки"         		, ВидСделки);
		ДанныеЗаполнения.Вставить("Контрагент"        		, Контрагент);
		ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
		ДанныеЗаполнения.Вставить("ЭтапСделки"        		, ЭтапГенерации);
		ДанныеЗаполнения.Вставить("Врач"              		, Врач);
		ДанныеЗаполнения.Вставить("ИнтерактивнаяЗапись"		, Истина);
		ДанныеЗаполнения.Вставить("СформироватьНаименование", Истина);		
		
		ЗаякаПациента = Справочники.Заявки.ПолучитьЗаявкуКонтрагента(Контрагент,  , СтруктурнаяЕдиница, Истина);
		Если ЗначениеЗаполнено(ЗаякаПациента) Тогда
			ДанныеЗаполнения.Вставить("Заявка", ЗаякаПациента);	
		КонецЕсли;
		
		НоваяСделка = СоздатьНовуюСделку(ДанныеЗаполнения, ВключитьБизнесЛогику);
		Возврат НоваяСделка;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Функция - Создать новую сделку
//
// Параметры:
//  ДанныеГенерации	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьНовуюСделку(ДанныеГенерации, ВключитьБизнесЛогику = Ложь, ВернутьОбъект = Ложь) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеГенерации) = Тип("Структура") Тогда 
		
		Если ДанныеГенерации.Свойство("СсылкаНовойСделки") И ОбщегоНазначения.СсылкаСуществует(ДанныеГенерации.СсылкаНовойСделки) Тогда
			Возврат ДанныеГенерации.СсылкаНовойСделки;
		КонецЕсли;
		
		НоваяСделка = СоздатьЭлемент();
		НоваяСделка.Заполнить(ДанныеГенерации);
		Если ДанныеГенерации.Свойство("СсылкаНовойСделки") Тогда 
			НоваяСделка.УстановитьСсылкуНового(ДанныеГенерации.СсылкаНовойСделки);
		КонецЕсли;
		Если ДанныеГенерации.Свойство("ИнтерактивнаяЗапись") Тогда 
			НоваяСделка.ДополнительныеСвойства.Вставить("ИнтерактивнаяЗапись", Истина);
		КонецЕсли;
		Если ДанныеГенерации.Свойство("ЗаявкаСинхронизации") Тогда 
			НоваяСделка.ДополнительныеСвойства.Вставить("ЗаявкаСинхронизации", ДанныеГенерации.ЗаявкаСинхронизации);
		КонецЕсли;
		Если ДанныеГенерации.Свойство("НеобходимаГенерацияЗаявки") Тогда 
			НоваяСделка.ДополнительныеСвойства.Вставить("НеобходимаГенерацияЗаявки", ДанныеГенерации.НеобходимаГенерацияЗаявки);
		КонецЕсли;
		Если ДанныеГенерации.Свойство("КаналПривлечения") Тогда
			НоваяСделка.КаналПривлечения = ?(ЗначениеЗаполнено(ДанныеГенерации.КаналПривлечения), ДанныеГенерации.КаналПривлечения, НоваяСделка.КаналПривлечения);
			НоваяСделка.ДополнительныеСвойства.Вставить("КаналПривлечения", ДанныеГенерации.КаналПривлечения);
		КонецЕсли;
		Если ДанныеГенерации.Свойство("КаналПривлеченияЗначение") Тогда
			НоваяСделка.КаналПривлеченияЗначение = ?(ЗначениеЗаполнено(ДанныеГенерации.КаналПривлеченияЗначение), ДанныеГенерации.КаналПривлеченияЗначение, НоваяСделка.КаналПривлеченияЗначение);			
			НоваяСделка.ДополнительныеСвойства.Вставить("КаналПривлеченияЗначение", ДанныеГенерации.КаналПривлеченияЗначение);
		КонецЕсли;
		ЗадачаСделки = Неопределено;
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеГенерации, "СгенерироватьЗадачу", Ложь) Тогда
			ПараметрыЗадачи = Новый Структура;
			ПараметрыЗадачи.Вставить("НаправившийВрач", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеГенерации, "НаправившийВрач", Неопределено));
			ЗадачаСделки = Задачи.Взаимодействие.ИнициализироватьЗадачуСделки(НоваяСделка
																			, ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеГенерации, "ВидОсмотра", Неопределено)
																			, ПараметрыЗадачи
																			, ВключитьБизнесЛогику
																			, Истина);
		КонецЕсли;	
		Попытка
			НоваяСделка.ОбменДанными.Загрузка = НЕ ВключитьБизнесЛогику;			
			НоваяСделка.Записать();
			Если НЕ ЗадачаСделки = Неопределено Тогда 
				ЗадачаСделки.Сделка = НоваяСделка.Ссылка;
				//ЗадачаСделки.ОбменДанными.Загрузка = НЕ ВключитьБизнесЛогику;				
				ЗадачаСделки.Записать();
			КонецЕсли;	
			Если ВернутьОбъект Тогда 
				Возврат НоваяСделка;
			Иначе 	
				Возврат НоваяСделка.Ссылка;
			КонецЕсли;	
		Исключение
			МетаданныеСправочника 		= Метаданные.Справочники.Сделки;
			ПредставлениеСправочника 	= МетаданныеСправочника.Представление();
			
			ОбъектИнициации = Неопределено;
			ДанныеГенерации.Свойство("ОбъектИнициации", ОбъектИнициации);
			// Сформируем комментарий
			Если ОбъектИнициации = Неопределено Тогда 
				ШаблонКомментария = НСтр("ru = 'Не удалось создать новую сделку
				|по причине: %1'");
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонКомментария,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			Иначе
				ПредставлениеОбъекта = СокрЛП(Строка(ОбъектИнициации));
				Если ТипЗнч(ОбъектИнициации) = Тип("ДокументСсылка.Прием") Тогда 
					ШаблонКомментария = НСтр("ru = 'При записи приема: %1, не удалось создать новую сделку
					|по причине: %2'");
				Иначе 
					ШаблонКомментария = НСтр("ru = 'При записи объекта: %1, не удалось создать новую сделку
					|по причине: %2'");
				КонецЕсли;	
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонКомментария,
				ПредставлениеОбъекта,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			КонецЕсли;	
			
			// Запишем в журнал
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Создание сделки'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			МетаданныеСправочника,,
			Комментарий);
			
			ВызватьИсключение Комментарий;
		КонецПопытки;	
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

// Процедура - Проверить бизнес логику создания
//
// Параметры:
//  ГенерируемыйОбъект	 - 	 - 
//  СделкаАналог		 - 	 - 
//  Комментарий			 - 	 - 
//  СообщатьПользователю - 	 - 
//  Отказ				 - 	 - 
//
Процедура ПроверитьБизнесЛогикуСоздания(ГенерируемыйОбъект
										, СделкаАналог = Неопределено
										, Комментарий = ""
										, СообщатьПользователю = Ложь
										, Отказ = Ложь) Экспорт
										
	Если ЗначениеЗаполнено(СделкаАналог) Тогда 
		СделкаАналог = Справочники.Сделки.ПустаяСсылка();
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ГенерируемыйОбъект) = Тип("СправочникОбъект.Сделки") Тогда
		Если ГенерируемыйОбъект.ДополнительныеСвойства.Свойство("ИнтерактивнаяЗапись") И ГенерируемыйОбъект.ДополнительныеСвойства.ИнтерактивнаяЗапись = Истина Тогда
			// Проверка была произведена ранее из формы объекта. Уходим.
			Возврат;
		КонецЕсли;	
		ГенерируемаяСделка = ГенерируемыйОбъект;
	ИначеЕсли ТипЗнч(ГенерируемыйОбъект) = Тип("ФормаКлиентскогоПриложения") И ГенерируемыйОбъект.ИмяФормы = "Справочник.Сделки.Форма.ФормаЭлемента" Тогда
		ГенерируемаяСделка = ГенерируемыйОбъект.Объект;
	Иначе 
		Возврат;
	КонецЕсли;	
	
	ЭтоСозданиеСделки = НЕ ЗначениеЗаполнено(ГенерируемаяСделка.Ссылка);
	
	ИзмененыИзмеренияЛогикиУникальностиСделок = НЕ ЭтоСозданиеСделки 
												И (ГенерируемаяСделка.СтруктурнаяЕдиница <> ГенерируемаяСделка.Ссылка.СтруктурнаяЕдиница
												ИЛИ ГенерируемаяСделка.Контрагент <> ГенерируемаяСделка.Ссылка.Контрагент
												ИЛИ ГенерируемаяСделка.Врач <> ГенерируемаяСделка.Ссылка.Врач
												ИЛИ (ГенерируемаяСделка.Врач = ГенерируемаяСделка.Ссылка.Врач И ГенерируемаяСделка.Специализация <> ГенерируемаяСделка.Ссылка.Специализация));

	Если НЕ ЗначениеЗаполнено(ГенерируемаяСделка.ВидСделки) 
		ИЛИ (НЕ ЭтоСозданиеСделки И (НЕ ИзмененыИзмеренияЛогикиУникальностиСделок ИЛИ ЗначениеЗаполнено(ГенерируемаяСделка.РезультатСделки))) Тогда 
		Возврат;
	КонецЕсли;
		
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГенерируемаяСделка.СтруктурнаяЕдиница) Тогда 
		СтруктурнаяЕдиница 	= ГенерируемаяСделка.СтруктурнаяЕдиница
	Иначе 	
		СтруктурнаяЕдиница 	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ГенерируемаяСделка.Контрагент) Тогда 
		Пациент 			= ГенерируемаяСделка.Контрагент;
		//СтатусПациента 		= РегистрыСведений.СтатусыКонтрагентов.ПолучитьСтатусКлиента(Пациент, ТекущаяДатаСеанса(), , Перечисления.СтатусыКонтрагентов.Потенциальный);
	Иначе 
		Пациент 			= Справочники.Контрагенты.ПустаяСсылка();																				
		//СтатусПациента 		= Перечисления.СтатусыКонтрагентов.Потенциальный;
	КонецЕсли;	
	Врач 					= ГенерируемаяСделка.Врач;
	
	Если ЭтоСозданиеСделки Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
		//Запрос.УстановитьПараметр("СтатусПациента"		, СтатусПациента);
		Запрос.УстановитьПараметр("ВидСделки"			, ГенерируемаяСделка.ВидСделки);	
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтруктурныеЕдиницыПримененияВидыСделок.Ссылка КАК ВидСделки
		|ИЗ
		|	Справочник.ВидыСделок.СтруктурныеЕдиницыПрименения КАК СтруктурныеЕдиницыПримененияВидыСделок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыСделок КАК ЭтапыСделок
		|		ПО СтруктурныеЕдиницыПримененияВидыСделок.Ссылка = ЭтапыСделок.ВидСделки
		|			И (ЭтапыСделок.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	СтруктурныеЕдиницыПримененияВидыСделок.Ссылка = &ВидСделки
		|	И СтруктурныеЕдиницыПримененияВидыСделок.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И (СтруктурныеЕдиницыПримененияВидыСделок.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|			ИЛИ СтруктурныеЕдиницыПримененияВидыСделок.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))";
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	СтатусыПациентовПримененияВидыСделок.Ссылка КАК ВидСделки
		//|ИЗ
		//|	Справочник.ВидыСделок.СтатусыПациентовПрименения КАК СтатусыПациентовПримененияВидыСделок
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыСделок КАК ЭтапыСделок
		//|		ПО СтатусыПациентовПримененияВидыСделок.Ссылка = ЭтапыСделок.ВидСделки
		//|			И (ЭтапыСделок.ПометкаУдаления = ЛОЖЬ)
		//|ГДЕ
		//|	СтатусыПациентовПримененияВидыСделок.Ссылка = &ВидСделки
		//|	И СтатусыПациентовПримененияВидыСделок.Ссылка.ПометкаУдаления = ЛОЖЬ
		//|	И (СтатусыПациентовПримененияВидыСделок.СтатусПациента = &СтатусПациента
		//|			ИЛИ СтатусыПациентовПримененияВидыСделок.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка))";
		
		ТаблицаДоступныхВидовСделокПоСЕ = Запрос.Выполнить().Выгрузить();
		//РезультатПакетногоЗапроса 				= Запрос.ВыполнитьПакет();
		//ТаблицаДоступныхВидовСделокПоСЕ 		= РезультатПакетногоЗапроса[0].Выгрузить();
		//ТаблицаДоступныхВидовСделокПоСтатусам 	= РезультатПакетногоЗапроса[1].Выгрузить();
		
		//Если ТаблицаДоступныхВидовСделокПоСЕ.Количество() = 0 И ТаблицаДоступныхВидовСделокПоСтатусам.Количество() = 0 Тогда 
		//	ШаблонКомментария 	= НСтр("ru = 'Создание сделки с данным видом: ""%1"" запрещено! Проверьте заполнение данного вида сделки или обратитесь к администратору базы данных!'");
		//	Комментарий 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария, СокрЛП(Строка(ГенерируемаяСделка.ВидСделки)));
		Если ТаблицаДоступныхВидовСделокПоСЕ.Количество() = 0 Тогда 
			ШаблонКомментария 	= НСтр("ru = 'В текущей клинике запрещено создание сделок с видом: ""%1""! Обратитесь к администратору базы данных!'");
			Комментарий 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария, СокрЛП(Строка(ГенерируемаяСделка.ВидСделки)));		
		//ИначеЕсли ТаблицаДоступныхВидовСделокПоСтатусам.Количество() = 0 Тогда 
		//	ШаблонКомментария 	= НСтр("ru = 'Создание сделок с видом ""%1"" запрещено для пациентов со статусом ""%2""! Обратитесь к администратору базы данных!'");
		//	Комментарий 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария, СокрЛП(Строка(ГенерируемаяСделка.ВидСделки)), СокрЛП(Строка(СтатусПациента)));				
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Комментарий) Тогда 
			Отказ = Истина;
			Если СообщатьПользователю Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий, ГенерируемыйОбъект);
			КонецЕсли;	
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Пациент) 
		ИЛИ НЕ ГенерируемаяСделка.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГенерируемаяСделка.Специализация) Тогда 
		Специализация = ГенерируемаяСделка.Специализация;
	Иначе 
		Специализация = Справочники.Специализации.ПустаяСсылка();																				
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВидСделки"			, ГенерируемаяСделка.ВидСделки);		
	Запрос.УстановитьПараметр("Пациент"				, Пациент);
	Запрос.УстановитьПараметр("Врач"				, Врач);
	Запрос.УстановитьПараметр("Специализация"		, Специализация);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделки.Ссылка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаСделокПациента
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сделки.ВидСделки = &ВидСделки
	|	И Сделки.Контрагент = &Пациент
	|	И Сделки.Врач = &Врач
	|	И Сделки.Специализация = &Специализация
	|	И Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСделокПациента.Сделка КАК Сделка
	|ИЗ
	|	ТаблицаСделокПациента КАК ТаблицаСделокПациента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие КАК Событие
	|		ПО ТаблицаСделокПациента.Сделка = Событие.Сделка
	|ГДЕ
	|	Событие.Ссылка ЕСТЬ NULL";	
	
	ВыборкаАналогичнойСделки = Запрос.Выполнить().Выбрать();
	Если ВыборкаАналогичнойСделки.Следующий() Тогда
		ПредварительнаяЗапись = Документы.Событие.ПолучитьПредварительнуюЗаписьПоСделке(ГенерируемаяСделка.Ссылка);
		Если ЗначениеЗаполнено(ПредварительнаяЗапись) Тогда
			ДанныеЗаписи 		= ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ПредварительнаяЗапись, "Номер, Дата");
			ПричинаОтказа 		= НСтр("ru = 'Перезапись к другому врачу';en = 'Transferring to another doctor'");       
			ОписаниеОтказа 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Отменена в связи с переносом предварительной записи %1, от %2 на текущего врача';en = 'Canceled due to transfer of appointment %1 from %2 to current doctor'"), "№" + Строка(ДанныеЗаписи.Номер), Формат(ДанныеЗаписи.Дата, "ДФ='dd MMMM yyyy'','' HH:mm'"));       
			УстановитьЭтапСделке(ВыборкаАналогичнойСделки.Сделка, Справочники.ЭтапыСделок.Отказ, Истина, , , ПричинаОтказа, ОписаниеОтказа);	
		Иначе 	
			ШаблонКомментария 	= НСтр("ru = 'Для данного пациента и врача в клинике уже существует незавершенная сделка! %1'");				
			Комментарий 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария, ?(ЭтоСозданиеСделки, "Создание сделки отменено!", "Изменение реквизитов сделки отменено!"));
		
	    	СделкаАналог 		= ВыборкаАналогичнойСделки.Сделка;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комментарий) Тогда 
		Отказ = Истина;
		Если СообщатьПользователю Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий, ГенерируемыйОбъект);
		КонецЕсли;	
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

// Функция - Получить сделки по клиенту
//
// Параметры:
//  Контрагент						 - 	 - 
//  СтруктурнаяЕдиница				 - 	 - 
//  ПоВсемДоступнымДляПользователя	 - 	 - 
//  Врач							 - 	 - 
//  Прием							 - ДокументСсылка.Прием	 - Если передать ссылку на Прием и в приеме будет заполнена сделка - функция вернет только ее
//  ВернутьТаблицей					 - Булево	 - 
//  ПоВсемВрачам					 - Булево	 - 
//  РезультатСделки					 - ПеречислениеСсылка.РезультатыСделок	 - 
//										- Неопределено - Все
//										- ПустаяСсылка - Все незавершенные
//										- Значение - Все с переданным значением
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСделкиПоКлиенту(Контрагент
								, СтруктурнаяЕдиница 				= Неопределено
								, ПоВсемДоступнымДляПользователя 	= Истина
								, Врач 								= Неопределено
								, ЗНАЧ Специализация 				= Неопределено
								, Прием 							= Неопределено
								, ВернутьТаблицей 					= Ложь
								, ПоВсемВрачам 						= Ложь
								, РезультатСделки 					= Неопределено
								, Актуальные 						= Ложь
								, МенеджерВТ 						= Неопределено
								, ПолучатьЗапланированные 			= Истина
								, МассивСделокИсключения 			= Неопределено
								, ЗНАЧ ВидОсмотра 					= Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Сделка = Неопределено;
	Если ЗначениеЗаполнено(Прием) Тогда 
		Сделка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Прием, "Сделка");
		Если ЗначениеЗаполнено(Сделка) И ВернутьТаблицей = Ложь Тогда
			МассивСделок = Новый Массив;
			МассивСделок.Добавить(Сделка);
			Возврат МассивСделок;
		КонецЕсли;
	КонецЕсли;
	
	МассивСтруктурныхЕдиницДоступныхПользователю = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда 
		Если ПоВсемДоступнымДляПользователя Тогда 
			МассивСтруктурныхЕдиницДоступныхПользователю = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ПараметрыСеанса.ТекущийСотрудник, "Массив");
			Если ЗначениеЗаполнено(СтруктурнаяЕдиница) И МассивСтруктурныхЕдиницДоступныхПользователю.Найти(СтруктурнаяЕдиница) = Неопределено Тогда 
				МассивСтруктурныхЕдиницДоступныхПользователю.Добавить(СтруктурнаяЕдиница);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
			МассивСтруктурныхЕдиницДоступныхПользователю.Добавить(СтруктурнаяЕдиница);
		КонецЕсли;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(МассивСтруктурныхЕдиницДоступныхПользователю) ИЛИ (НЕ ЗначениеЗаполнено(Врач) И НЕ ПоВсемВрачам) Тогда  
		МассивСтруктурныхЕдиницДоступныхПользователю = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц(, Истина);
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница) И МассивСтруктурныхЕдиницДоступныхПользователю.Найти(СтруктурнаяЕдиница) = Неопределено Тогда 
			МассивСтруктурныхЕдиницДоступныхПользователю.Добавить(СтруктурнаяЕдиница);
		КонецЕсли;
		Если МассивСтруктурныхЕдиницДоступныхПользователю.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка()) = Неопределено Тогда 
			МассивСтруктурныхЕдиницДоступныхПользователю.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
		КонецЕсли;		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Врач) Тогда
		Врач = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
			
	// Инициализируем временную таблицу
	Если МенеджерВТ = Неопределено ИЛИ (НЕ ЗначениеЗаполнено(Врач) И НЕ ПоВсемВрачам) Тогда 
		ИнициализироватьВременнуюТаблицуСделокКонтрагента(МенеджерВТ, Контрагент, МассивСтруктурныхЕдиницДоступныхПользователю, Врач, ПоВсемВрачам);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Сделка КАК Сделка,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	Сделки.Врач КАК Врач,
	|	Сделки.Прием КАК Прием,
	|	Сделки.РезультатСделки КАК РезультатСделки,
	|	Сделки.СуммаСделки КАК СуммаСделки,
	|	Сделки.ЭтапОтказа КАК ЭтапОтказа,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапУспеха КАК ЭтапУспеха,
	|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сделки.Специализация КАК Специализация,
	|	Сделки.ВидСделки = &ВидСделки
	|		И Сделки.ЭтапСделки.НомерЭтапа > 2 КАК Записан
	|ИЗ
	|	ТаблицаСделокПациента КАК Сделки
	|ГДЕ
	|	НЕ Сделки.ПометкаУдаления
	|	И Сделки.Врач = &Врач
	|	И Сделки.Сделка = &Сделка
	|	И Сделки.РезультатСделки = &РезультатСделки
	|	И &СделкиИсключения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;	
	Запрос.УстановитьПараметр("ВидСделки", ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));		
	
	Если ЗначениеЗаполнено(Сделка) Тогда 
		Запрос.УстановитьПараметр("Сделка", Сделка);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.РезультатСделки = &РезультатСделки", "ИСТИНА");		
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Сделка = &Сделка", "ИСТИНА");
	КонецЕсли;
	
	Если Актуальные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.РезультатСделки = &РезультатСделки", "Сделки.РезультатСделки <> ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Отказ) И Сделки.РезультатСделки <> ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Успех)");		
	ИначеЕсли РезультатСделки = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.РезультатСделки = &РезультатСделки", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("РезультатСделки", РезультатСделки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивСделокИсключения) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &СделкиИсключения", "И НЕ Сделки.Сделка В (&МассивСделокИсключения)");
		Запрос.УстановитьПараметр("МассивСделокИсключения", МассивСделокИсключения);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &СделкиИсключения", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Врач = &Врач", "ИСТИНА");
	ИначеЕсли ПоВсемВрачам Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Врач = &Врач", "ИСТИНА");
	Иначе 	
		Запрос.УстановитьПараметр("Врач", Врач);
		Если НЕ ЗначениеЗаполнено(Врач) И ЗначениеЗаполнено(Специализация) Тогда
			Если ВидОсмотра = Перечисления.ВидыОсмотров.Направление И РезультатСделки = Перечисления.РезультатыСделок.ПустаяСсылка() Тогда
				МассивСотрудников = Справочники.Сотрудники.ПолучитьМассивСотрудниковПоСпециализации(Специализация);
				МассивСотрудников.Добавить(Справочники.Сотрудники.ПустаяСсылка());
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Врач = &Врач", "Сделки.Врач В(&МассивВрачей) И Сделки.Специализация = &Специализация");
				Запрос.УстановитьПараметр("МассивВрачей", МассивСотрудников);				
			Иначе 	
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Врач = &Врач", "Сделки.Врач = &Врач И (Сделки.Специализация = &Специализация ИЛИ Сделки.Специализация = ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка))");
			КонецЕсли;	
			Запрос.УстановитьПараметр("Специализация", Специализация);
		КонецЕсли;	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() И НЕ ЗначениеЗаполнено(Сделка) И ЗначениеЗаполнено(Врач) И НЕ ПоВсемВрачам Тогда
		Если НЕ ЗначениеЗаполнено(Специализация) Тогда 
			Специализация = Справочники.Сотрудники.ПолучитьОсновнуюСпециализациюСотрудника(Врач);
		КонецЕсли;	
		КоллекцияСделок = ПолучитьСделкиПоКлиенту(Контрагент
												, СтруктурнаяЕдиница
												, ПоВсемДоступнымДляПользователя
												, Справочники.Сотрудники.ПустаяСсылка()
												, Специализация										
												, Прием
												, ВернутьТаблицей
												, ПоВсемВрачам
												, РезультатСделки
												, Актуальные
												, МенеджерВТ
												, ПолучатьЗапланированные);
												
	Иначе
		КоллекцияСделок = Неопределено;												
		ТаблицаСделок = Запрос.Выполнить().Выгрузить();
		Если НЕ ПолучатьЗапланированные И ЗначениеЗаполнено(ТаблицаСделок) Тогда 
			// Отсекаем, сделки сгенерированные сегодня по направлениям и повторным приемам
			МассивУдаляемыхСтрок = Новый Массив;
			МассивЗапланированныхСделок = РегистрыСведений.Профосмотры.ПолучитьЗапланированыеСделки(ТекущаяДатаСеанса(), , Контрагент);
			Для Каждого СтрокаТЗСделка Из ТаблицаСделок Цикл 
				Если НЕ МассивЗапланированныхСделок.Найти(СтрокаТЗСделка.Сделка) = Неопределено Тогда
					МассивУдаляемыхСтрок.Добавить(СтрокаТЗСделка);
				КонецЕсли;	
			КонецЦикла;
			Для Каждого ЭлементСтрока Из МассивУдаляемыхСтрок Цикл 
				ТаблицаСделок.Удалить(ЭлементСтрока);
			КонецЦикла;	
		КонецЕсли;
		// Если после отсечения не осталось с нужным врачем - поищем сделку без врача
		Если НЕ ЗначениеЗаполнено(ТаблицаСделок) И НЕ ЗначениеЗаполнено(Сделка) И ЗначениеЗаполнено(Врач) И НЕ ПоВсемВрачам Тогда
			Если НЕ ЗначениеЗаполнено(Специализация) Тогда 
				Специализация = Справочники.Сотрудники.ПолучитьОсновнуюСпециализациюСотрудника(Врач);
			КонецЕсли;	
			КоллекцияСделок = ПолучитьСделкиПоКлиенту(Контрагент
													, СтруктурнаяЕдиница
													, ПоВсемДоступнымДляПользователя
													, Справочники.Сотрудники.ПустаяСсылка()
													, Специализация										
													, Прием
													, ВернутьТаблицей
													, ПоВсемВрачам
													, РезультатСделки
													, Актуальные
													, МенеджерВТ
													, ПолучатьЗапланированные);
			
		КонецЕсли;	
		
		Если КоллекцияСделок = Неопределено Тогда 
			Если ВернутьТаблицей Тогда 
				КоллекцияСделок = ТаблицаСделок;	
			Иначе 	
				КоллекцияСделок = ТаблицаСделок.ВыгрузитьКолонку("Сделка");	
			КонецЕсли;
		КонецЕсли;
		// Уничтожаем временную Таблицу
		Запрос.МенеджерВременныхТаблиц.Закрыть();		
	КонецЕсли;
	
	МенеджерВТ = Неопределено;
	
	Возврат КоллекцияСделок;
	
КонецФункции

// Функция - Получить завершенные сделки
//
// Параметры:
//  ДатаЗавершения		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Контрагент			 - 	 - 
//  Врач				 - 	 - 
//  ВидСделки			 - 			 - 
//  РезультатЗавершения	 - 			 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗавершенныеСделки(ДатаЗавершения 		= Неопределено
								, СтруктурнаяЕдиница 	= Неопределено
								, Контрагент 			= Неопределено
								, Врач 					= Неопределено
								, ВидСделки 			= Неопределено
								, РезультатЗавершения 	= Неопределено
								, ВернутьПоследнюю 		= Ложь) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделки.Ссылка КАК Сделка
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сделки.ВидСделки = &ВидСделки
	|	И Сделки.Контрагент = &Контрагент
	|	И Сделки.Врач = &Врач
	|	И Сделки.РезультатСделки = &РезультатСделки
	|	И НАЧАЛОПЕРИОДА(Сделки.ДатаЗавершенияСделки, ДЕНЬ) = &ДатаЗавершенияСделки
	|	И Сделки.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаЗавершенияСделки";
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц(, Истина);
		Если МассивСтруктурныхЕдиниц.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка()) = Неопределено Тогда 
			МассивСтруктурныхЕдиниц.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
		КонецЕсли;		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "Сделки.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)");
	КонецЕсли; 
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, МассивСтруктурныхЕдиниц));
	
	Если НЕ ЗначениеЗаполнено(ВидСделки) Тогда
		МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, МассивСтруктурныхЕдиниц));		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.ВидСделки = &ВидСделки", "Сделки.ВидСделки В(&ВидСделки)");
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидСделки", ?(ЗначениеЗаполнено(ВидСделки), ВидСделки, МассивВидовСделок));
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Сделки.Контрагент = &Контрагент", "");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Врач) Тогда 
		Запрос.УстановитьПараметр("Врач", Врач);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Сделки.Врач = &Врач", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатЗавершения) Тогда 
		Запрос.УстановитьПараметр("РезультатСделки", РезультатЗавершения);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.РезультатСделки = &РезультатСделки", "Сделки.РезультатСделки <> ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)");
	КонецЕсли; 

	Если ЗначениеЗаполнено(ДатаЗавершения) Тогда 
		Запрос.УстановитьПараметр("ДатаЗавершенияСделки", НачалоДня(ДатаЗавершения));
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НАЧАЛОПЕРИОДА(Сделки.ДатаЗавершенияСделки, ДЕНЬ) = &ДатаЗавершенияСделки", "Сделки.ДатаЗавершенияСделки <> ДАТАВРЕМЯ(1,1,1)");
	КонецЕсли;
				
	Если ВернутьПоследнюю Тогда 
		ТаблицаСделок = Запрос.Выполнить().Выгрузить();
		Если ЗначениеЗаполнено(ТаблицаСделок) Тогда 
			Возврат ТаблицаСделок[ТаблицаСделок.Количество()-1].Сделка;
		Иначе 
			Возврат Справочники.Сделки.ПустаяСсылка();
		КонецЕсли;	
	Иначе 	
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сделка");
	КонецЕсли;	
	
КонецФункции

// Процедура - Инициализировать временную таблицу сделок контрагента
//
// Параметры:
//  МенеджерВТ	 - 	 - 
//  Контрагент	 - 	 - 
//
Процедура ИнициализироватьВременнуюТаблицуСделокКонтрагента(МенеджерВТ, Контрагент, МассивСтруктурныхЕдиниц, Врач, ПоВсемВрачам) Экспорт 
	
	//---------------------------------------------
	МассивПараметровОтбора = Новый Массив;

	ПараметрыОтбораСЕ 			= Новый Структура;
	ПараметрыОтбораСЕ.Вставить("ШаблонУсловия"						, "&ОтборСтруктурнаяЕдиница");
	ПараметрыОтбораСЕ.Вставить("УсловиеОтбора"						, "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	ПараметрыОтбораСЕ.Вставить("НаименованиеПараметра"				, "СтруктурнаяЕдиница");
	
	ПараметрыОтбораВидаСделок 	= Новый Структура;
	ПараметрыОтбораВидаСделок.Вставить("ШаблонУсловия"				, "&ОтборВидаСделок");	
	ПараметрыОтбораВидаСделок.Вставить("УсловиеОтбора"				, "Сделки.ВидСделки В(&МассивВидовСделок)");
	ПараметрыОтбораВидаСделок.Вставить("НаименованиеПараметра"		, "МассивВидовСделок");
	
	Если МассивСтруктурныхЕдиниц.Количество() = 1 Тогда
		ПараметрыОтбораСЕ.Вставить("ЗначениеПараметра"				, МассивСтруктурныхЕдиниц[0]);
		Если НЕ ЗначениеЗаполнено(Врач) И НЕ ПоВсемВрачам Тогда
			МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"), МассивСтруктурныхЕдиниц[0]);                                       
		Иначе 	
			МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, МассивСтруктурныхЕдиниц[0]);
		КонецЕсли;
		ПараметрыОтбораВидаСделок.Вставить("ЗначениеПараметра"		, МассивВидовСделок);
	Иначе
		ПараметрыОтбораСЕ.Вставить("УсловиеОтбора"					, "Сделки.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)");
		ПараметрыОтбораСЕ.Вставить("НаименованиеПараметра"			, "МассивСтруктурныхЕдиниц");
		ПараметрыОтбораСЕ.Вставить("ЗначениеПараметра"				, МассивСтруктурныхЕдиниц);
		Если НЕ ЗначениеЗаполнено(Врач) И НЕ ПоВсемВрачам Тогда
			МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"), МассивСтруктурныхЕдиниц);
		Иначе 				
			МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, МассивСтруктурныхЕдиниц);
		КонецЕсли;
		ПараметрыОтбораВидаСделок.Вставить("ЗначениеПараметра"		, МассивВидовСделок);
	КонецЕсли;	
	МассивПараметровОтбора.Добавить(ПараметрыОтбораСЕ);
	МассивПараметровОтбора.Добавить(ПараметрыОтбораВидаСделок);
	
	МенеджерВТ						= Новый МенеджерВременныхТаблиц;
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МенеджерВТ;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.ПометкаУдаления КАК ПометкаУдаления,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	Сделки.ДатаСделки КАК ДатаСделки,
	|	Сделки.Контрагент КАК Контрагент,
	|	Сделки.Врач КАК Врач,
	|	Сделки.Специализация КАК Специализация,
	|	Сделки.Прием КАК Прием,
	|	Сделки.РезультатСделки КАК РезультатСделки,
	|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сделки.СуммаСделки КАК СуммаСделки,
	|	Сделки.ЭтапОтказа КАК ЭтапОтказа,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапУспеха КАК ЭтапУспеха
	|ПОМЕСТИТЬ ТаблицаСделокПациента
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	&ОтборСтруктурнаяЕдиница
	|	И &ОтборВидаСделок
	|	И Сделки.Контрагент = &Контрагент";
	
	Для Каждого ЭлементКоллекции Из МассивПараметровОтбора Цикл 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ЭлементКоллекции.ШаблонУсловия, ЭлементКоллекции.УсловиеОтбора);
		Если ЗначениеЗаполнено(ЭлементКоллекции.НаименованиеПараметра) Тогда 
			Запрос.УстановитьПараметр(ЭлементКоллекции.НаименованиеПараметра, ЭлементКоллекции.ЗначениеПараметра);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Функция - Получить сделку по записи на прием
//
// Параметры:
//  Запись	 - 	 - 
//  Прием	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСделкуПоЗаписиНаПрием(Запись = Неопределено, Прием = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Запись) Тогда 
		Возврат ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Запись, "Сделка");
	ИначеЕсли ЗначениеЗаполнено(Прием) Тогда
		Если НЕ ПривилегированныйРежим() Тогда 
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СсылкаНаПрием", Прием);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Событие.Сделка КАК Сделка
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.СсылкаНаПрием = &СсылкаНаПрием";
		
		ВыборкаСделки = Запрос.Выполнить().Выбрать();
		Возврат ?(ВыборкаСделки.Следующий(), ВыборкаСделки.Сделка, Неопределено);
	Иначе 
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

// Функция - Получить сделки по продлению членства пакета услуг
//
// Параметры:
//  ЧленствоПакетУслуг	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСделкиПоПродлениюЧленстваПакетаУслуг(ЧленствоПакетУслуг, ПоВсемДоступнымДляПользователя = Истина) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ЧленствоПакетУслуг) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ТекущаяСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	МассивСтруктурныхЕдиницДоступныхПользователю = Неопределено;
	Если ПоВсемДоступнымДляПользователя Тогда 
		МассивСтруктурныхЕдиницДоступныхПользователю = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(ПараметрыСеанса.ТекущийСотрудник, "Массив");
		Если МассивСтруктурныхЕдиницДоступныхПользователю.Найти(ТекущаяСтруктурнаяЕдиница) = Неопределено Тогда 
			МассивСтруктурныхЕдиницДоступныхПользователю.Добавить(ТекущаяСтруктурнаяЕдиница);
		КонецЕсли;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Сделки.Ссылка КАК Сделка
	               |ИЗ
	               |	Справочник.Сделки КАК Сделки
	               |ГДЕ
	               |	Сделки.ПометкаУдаления = ЛОЖЬ
	               |	И Сделки.ЧленствоПакетУслуг = &ЧленствоПакетУслуг
	               |	И &ОтборСтруктурнаяЕдиница
	               |	И Сделки.ВидСделки В(&МассивВидовСделок)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сделки.ДатаСделки";
	
	Запрос.УстановитьПараметр("ЧленствоПакетУслуг", ЧленствоПакетУслуг);
	Если ЗначениеЗаполнено(МассивСтруктурныхЕдиницДоступныхПользователю) Тогда
		Если МассивСтруктурныхЕдиницДоступныхПользователю.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборСтруктурнаяЕдиница", "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", МассивСтруктурныхЕдиницДоступныхПользователю[0]);
			МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, МассивСтруктурныхЕдиницДоступныхПользователю[0]);
			Запрос.УстановитьПараметр("МассивВидовСделок", МассивВидовСделок);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборСтруктурнаяЕдиница", "Сделки.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)");	
			Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиницДоступныхПользователю);			
			МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, МассивСтруктурныхЕдиницДоступныхПользователю);
			Запрос.УстановитьПараметр("МассивВидовСделок", МассивВидовСделок);			
		КонецЕсли;	
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтруктурнаяЕдиница) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборСтруктурнаяЕдиница", "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ТекущаяСтруктурнаяЕдиница);
		МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, ТекущаяСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("МассивВидовСделок", МассивВидовСделок);					
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборСтруктурнаяЕдиница", "ИСТИНА");
		МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок();
		Запрос.УстановитьПараметр("МассивВидовСделок", МассивВидовСделок);							
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сделка");	
	
КонецФункции

// Функция - Получить не завершенные сделки по записям без приемов
//
// Параметры:
//  НачалоПериода		 - 	 - 
//  КонецПериода		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНеЗавершенныеСделкиПоЗаписямБезПриемов(НачалоПериода
													, КонецПериода
													, СтруктурнаяЕдиница = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда 
		НачалоПериода = НачалоДня(ТекущаяДатаСеанса()) - 86400;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда 
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда 
			МассивСтруктурныхЕдиниц.Добавить(СтруктурнаяЕдиница);
		ИначеЕсли ТипЗнч(СтруктурнаяЕдиница) = Тип("Массив") Тогда 
			МассивСтруктурныхЕдиниц = СтруктурнаяЕдиница;
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериодаПроверки"	, НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериодаПроверки"	, КонецПериода);
	Запрос.УстановитьПараметр("ПредопреленныйВидСделки"	, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОкончен) КАК СтатусПредварительнойЗаписи
	|ПОМЕСТИТЬ СтатусыПредварительнойЗаписи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатусПредварительнойЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументСобытие.Ссылка КАК ПредварительнаяЗапись,
	|	ДокументСобытие.Дата КАК ДатаНачалаПриема,
	|	ДокументСобытие.Резерв КАК Резерв,
	|	ДокументСобытие.СсылкаНаПрием КАК СсылкаНаПрием,
	|	ДокументСобытие.Статус КАК Статус,
	|	ДокументСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДокументСобытие.ТипСобытия КАК ТипСобытия,
	|	ДокументСобытие.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаЗаписейПоДате
	|ИЗ
	|	Документ.Событие КАК ДокументСобытие
	|ГДЕ
	|	ДокументСобытие.Проведен
	|	И ДокументСобытие.Дата > &НачалоПериодаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаписейПоДате.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ТаблицаЗаписейПоДате.ДатаНачалаПриема КАК ДатаНачалаПриема,
	|	ТаблицаЗаписейПоДате.СсылкаНаПрием КАК СсылкаНаПрием,
	|	ТаблицаЗаписейПоДате.Статус КАК Статус,
	|	ТаблицаЗаписейПоДате.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗаписейПоДате.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаЗавершенныхПриемов
	|ИЗ
	|	ТаблицаЗаписейПоДате КАК ТаблицаЗаписейПоДате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатусыПредварительнойЗаписи КАК СтатусыПредварительнойЗаписи
	|		ПО ТаблицаЗаписейПоДате.Статус = СтатусыПредварительнойЗаписи.СтатусПредварительнойЗаписи
	|ГДЕ
	|	ТаблицаЗаписейПоДате.ДатаНачалаПриема <= &КонецПериодаПроверки
	|	И ТаблицаЗаписейПоДате.Резерв = ЛОЖЬ
	|	И ТаблицаЗаписейПоДате.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|	И ТаблицаЗаписейПоДате.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка,
	|	СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	Сделки.Контрагент КАК Контрагент,
	|	Сделки.Врач КАК Врач,
	|	Сделки.РезультатСделки КАК РезультатСделки,
	|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	ТаблицаЗавершенныхПриемов.Статус КАК Статус
	|ИЗ
	|	ТаблицаЗавершенныхПриемов КАК ТаблицаЗавершенныхПриемов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сделки КАК Сделки
	|		ПО ТаблицаЗавершенныхПриемов.Сделка = Сделки.Ссылка
	|			И ТаблицаЗавершенныхПриемов.СтруктурнаяЕдиница = Сделки.СтруктурнаяЕдиница
	|ГДЕ
	|	Сделки.ВидСделки = &ПредопреленныйВидСделки
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)";
	
	Если ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) Тогда
		Если МассивСтруктурныхЕдиниц.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ТаблицаЗаписейПоДате.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", МассивСтруктурныхЕдиниц[0]);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ТаблицаЗаписейПоДате.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)");
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", МассивСтруктурныхЕдиниц);
		КонецЕсли;	
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
													
КонецФункции

// Функция, возвращает актуальную сделку контрагента.
//
Функция ПолучитьАктуальнуюСделкуКлиента(Контрагент, СтруктурнаяЕдиница = Неопределено, БезЗаявок = Ложь) Экспорт
	
	ВидСделки = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сделки.Ссылка КАК Сделка
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сделки.ВидСделки = &ВидСделки
	|	И Сделки.Контрагент = &Контрагент
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|	И НЕ Сделки.ПометкаУдаления
	|	И &УсловиеБезЗаявок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки УБЫВ");
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц(, Истина);
		Если МассивСтруктурныхЕдиниц.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка()) = Неопределено Тогда 
			МассивСтруктурныхЕдиниц.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
		КонецЕсли;		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "Сделки.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)");
	КонецЕсли; 
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, МассивСтруктурныхЕдиниц));
	
	Если НЕ ЗначениеЗаполнено(ВидСделки) Тогда
		МассивВидовСделок = Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок(, ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, МассивСтруктурныхЕдиниц));		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.ВидСделки = &ВидСделки", "Сделки.ВидСделки В(&ВидСделки)");
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидСделки", ?(ЗначениеЗаполнено(ВидСделки), ВидСделки, МассивВидовСделок));
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	УсловиеБезЗаявок 			= ?(БезЗаявок, "И Сделки.Заявка = ЗНАЧЕНИЕ(Справочник.Заявки.ПустаяСсылка)", "");
	Запрос.Текст              	= СтрЗаменить(Запрос.Текст, "И &УсловиеБезЗаявок", УсловиеБезЗаявок);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Сделка; 
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция, проверяет наличие актуальных сделок по контрагенту.
//
// Параметры:
//  Контрагент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НаличиеАктуальныхСделокПоКлиенту(СтруктурнаяЕдиница = Неопределено
										, ВидыСделок = Неопределено
										, Контрагент
										, РезультатСделки = Неопределено) Экспорт
	
	КоллекцияСделок = ПолучитьСделкиПоКлиенту(Контрагент, СтруктурнаяЕдиница, , , , , ЗначениеЗаполнено(ВидыСделок), Истина, РезультатСделки);
	Если НЕ ЗначениеЗаполнено(КоллекцияСделок) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидыСделок) Тогда 
		Если ТипЗнч(ВидыСделок) = Тип("Массив") Тогда
			ЕстьСделки = Ложь;
			Для Каждого ЭлементВидСделки Из ВидыСделок Цикл 
				МассивСделок = КоллекцияСделок.НайтиСтроки(Новый Структура("ВидСделки", ЭлементВидСделки));
				Если НЕ МассивСделок.Количество() = 0 Тогда
					ЕстьСделки = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			Возврат ЕстьСделки;
		ИначеЕсли ТипЗнч(ВидыСделок) = Тип("СправочникСсылка.ВидыСделок") Тогда 
			Возврат НЕ КоллекцияСделок.НайтиСтроки(Новый Структура("ВидСделки", ВидыСделок)).Количество() = 0;
		КонецЕсли;
	Иначе 
		Возврат ЗначениеЗаполнено(КоллекцияСделок);
	КонецЕсли;
	
КонецФункции

// Функция - Получить актуальный этап сделки
//
// Параметры:
//  Сделка		 - 	 - 
//  ВидСделки	 - 	 - 
//  Пациент		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьАктуальныйЭтапВоронки(Сделка = Неопределено, ВидСделки, Пациент = Неопределено, СтатусПЗ = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	ТаблицаПриемов = Новый ТаблицаЗначений;
	ТаблицаАктуальныхЗаписей = Новый ТаблицаЗначений;
	Если ЗначениеЗаполнено(Сделка) Тогда	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сделка", Сделка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Событие.Ссылка КАК ПредварительнаяЗапись,
		|	Событие.Дата КАК Дата,
		|	Событие.ДатаСоздания КАК ДатаСоздания,
		|	Событие.Статус КАК Статус,
		|	Событие.Сделка КАК Сделка,
		|	Событие.Проведен КАК Проведен,
		|	Событие.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ ТаблицаПредварительныхЗаписейВоронки
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.Сделка = &Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПредварительныхЗаписейВоронки.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
		|	ТаблицаПредварительныхЗаписейВоронки.Дата КАК Дата,
		|	ТаблицаПредварительныхЗаписейВоронки.ДатаСоздания КАК ДатаСоздания,
		|	ТаблицаПредварительныхЗаписейВоронки.Статус КАК Статус,
		|	ТаблицаПредварительныхЗаписейВоронки.Сделка КАК Сделка
		|ИЗ
		|	ТаблицаПредварительныхЗаписейВоронки КАК ТаблицаПредварительныхЗаписейВоронки
		|ГДЕ
		|	НЕ ТаблицаПредварительныхЗаписейВоронки.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен))
		|	И ТаблицаПредварительныхЗаписейВоронки.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПредварительныхЗаписейВоронки.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
		|	ТаблицаПредварительныхЗаписейВоронки.Дата КАК Дата,
		|	ТаблицаПредварительныхЗаписейВоронки.ДатаСоздания КАК ДатаСоздания,
		|	ТаблицаПредварительныхЗаписейВоронки.Статус КАК Статус,
		|	ТаблицаПредварительныхЗаписейВоронки.Сделка КАК Сделка
		|ИЗ
		|	ТаблицаПредварительныхЗаписейВоронки КАК ТаблицаПредварительныхЗаписейВоронки
		|ГДЕ
		|	ТаблицаПредварительныхЗаписейВоронки.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен))
		|	И ТаблицаПредварительныхЗаписейВоронки.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПредварительныхЗаписейВоронки.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
		|	ТаблицаПредварительныхЗаписейВоронки.Дата КАК Дата,
		|	ТаблицаПредварительныхЗаписейВоронки.ДатаСоздания КАК ДатаСоздания,
		|	ТаблицаПредварительныхЗаписейВоронки.Статус КАК Статус,
		|	ТаблицаПредварительныхЗаписейВоронки.Сделка КАК Сделка
		|ИЗ
		|	ТаблицаПредварительныхЗаписейВоронки КАК ТаблицаПредварительныхЗаписейВоронки
		|ГДЕ
		|	ТаблицаПредварительныхЗаписейВоронки.ПометкаУдаления
		|	И ТаблицаПредварительныхЗаписейВоронки.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументПрием.Дата КАК Дата,
		|	ДокументПрием.Ссылка КАК Прием,
		|	ДокументПрием.Сделка КАК Сделка,
		|	ДокументПрием.РезультатПриема КАК РезультатПриема,
		|	ДокументПрием.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.Прием КАК ДокументПрием
		|ГДЕ
		|	ДокументПрием.Проведен
		|	И ДокументПрием.Сделка = &Сделка
		|	И ВЫБОР
		|			КОГДА НЕ ВЫРАЗИТЬ(ДокументПрием.ДокументОснование КАК Документ.Событие) ЕСТЬ NULL
		|				ТОГДА НЕ ВЫРАЗИТЬ(ДокументПрием.ДокументОснование КАК Документ.Событие).Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен))
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		РезультатПакетногоЗапроса 	= Запрос.ВыполнитьПакет();
		ТаблицаАктуальныхЗаписей 	= РезультатПакетногоЗапроса[1].Выгрузить();
		ТаблицаОтмененныхЗаписей 	= РезультатПакетногоЗапроса[2].Выгрузить();
		ТаблицаУдаленныхЗаписей 	= РезультатПакетногоЗапроса[3].Выгрузить();		
		ТаблицаПриемов 				= РезультатПакетногоЗапроса[4].Выгрузить(); 
	КонецЕсли;
	
	Если ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда 
		Если НЕ ТаблицаПриемов.Количество() = 0 Тогда
			Возврат Справочники.ЭтапыСделок.Успех;
		КонецЕсли;	
		Если НЕ ТаблицаАктуальныхЗаписей.Количество() = 0 Тогда
			СтатусПЗ = ТаблицаАктуальныхЗаписей[ТаблицаАктуальныхЗаписей.Количество() - 1].Статус;			
			Если ТаблицаАктуальныхЗаписей[ТаблицаАктуальныхЗаписей.Количество() - 1].Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда 
				Возврат Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделки, 4);
			ИначеЕсли ТаблицаАктуальныхЗаписей[ТаблицаАктуальныхЗаписей.Количество() - 1].Статус = Перечисления.СтатусыСобытия.ПриемОтменен
				ИЛИ ТаблицаАктуальныхЗаписей[ТаблицаАктуальныхЗаписей.Количество() - 1].Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда 
				Возврат Справочники.ЭтапыСделок.Отказ;
			ИначеЕсли ЗначениеЗаполнено(Сделка)
				И (СтатусПЗ = Перечисления.СтатусыСобытия.ПациентОжидает ИЛИ СтатусПЗ = Перечисления.СтатусыСобытия.ПриемНачат ИЛИ СтатусПЗ = Перечисления.СтатусыСобытия.ПриемОкончен)
				И ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сделка, "ЭтапСделки") = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделки, 4) Тогда 
				Возврат Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделки, 4);
			Иначе 
				Возврат Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделки, 3);
			КонецЕсли;
		КонецЕсли;	
		Если ЗначениеЗаполнено(Сделка)
			И ЗначениеЗаполнено(ТаблицаОтмененныхЗаписей)
			И (ТаблицаОтмененныхЗаписей[ТаблицаОтмененныхЗаписей.Количество() - 1].Статус = Перечисления.СтатусыСобытия.ПриемОтменен
			ИЛИ ТаблицаОтмененныхЗаписей[ТаблицаОтмененныхЗаписей.Количество() - 1].Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся) Тогда
			
			СтатусПЗ = ТаблицаОтмененныхЗаписей[ТаблицаОтмененныхЗаписей.Количество() - 1].Статус;
			Возврат Справочники.ЭтапыСделок.Отказ;
		ИначеЕсли ЗначениеЗаполнено(Сделка)
			И ЗначениеЗаполнено(ТаблицаУдаленныхЗаписей)
			И (ТаблицаУдаленныхЗаписей[ТаблицаУдаленныхЗаписей.Количество() - 1].Статус = Перечисления.СтатусыСобытия.НеПодтверждена
			ИЛИ ТаблицаУдаленныхЗаписей[ТаблицаУдаленныхЗаписей.Количество() - 1].Статус = Перечисления.СтатусыСобытия.Подтверждена) Тогда
			
			СтатусПЗ = ТаблицаУдаленныхЗаписей[ТаблицаУдаленныхЗаписей.Количество() - 1].Статус;
			Возврат Справочники.ЭтапыСделок.Отказ;
		Иначе 	
			Возврат Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделки, 3);
		КонецЕсли;	
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции	

// Функция возвращает сделку по заявке.
//
Функция ПолучитьСделкуПоЗаявке(Заявка, СделкаИсключение = Неопределено) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сделки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.Заявка = &Заявка
	|	И НЕ Сделки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки УБЫВ");
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

// Процедура - Инициализировать сделку согласно предмета
//
// Параметры:
//  ЗадачаПредмет	 - 	 - 
//  Сделка			 - 	 - 
//
Процедура ИнициализироватьСделкуСогласноПредмета(СтруктурнаяЕдиница, Контрагент, ЗадачаПредмет, Сделка) Экспорт
	
	Если ЗначениеЗаполнено(Сделка) Тогда 
		Возврат;
	КонецЕсли;
	             
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Сделки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Сделки КАК Сделки
	               |ГДЕ
	               |	Сделки.ПометкаУдаления = ЛОЖЬ
	               |	И Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница				   
	               |	И &УсловиеПоискаСделки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сделки.ДатаСделки УБЫВ";
	
	Если ЗначениеЗаполнено(ЗадачаПредмет) И ТипЗнч(ЗадачаПредмет) = Тип("ДокументСсылка.ПланЛечения") Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоискаСделки", "Сделки.ПланЛечения = &ПланЛечения");
		Запрос.УстановитьПараметр("ПланЛечения", ЗадачаПредмет);
	ИначеЕсли ЗначениеЗаполнено(ЗадачаПредмет) И ТипЗнч(ЗадачаПредмет) = Тип("СправочникСсылка.Заявки") Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоискаСделки", "Сделки.Заявка = &Заявка");
		Запрос.УстановитьПараметр("Заявка", ЗадачаПредмет);
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоискаСделки", "Сделки.Контрагент = &Контрагент");
		//Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе 
		Возврат;
	КонецЕсли;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);

	ВыборкаСделка = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаСделка.Следующий() Тогда 
		Сделка = ВыборкаСделка.Ссылка;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Установить этап сделке
//
// Параметры:
//  Сделка				 - 	 - 
//  Этап				 - 	 - 
//  ВключитьБизнесЛогику - 	 - 
//
Процедура УстановитьЭтапСделке(Сделка
							, Этап
							, ВключитьБизнесЛогику 	= Ложь
							, ЛечащийВрач 			= Неопределено
							, СтатусПЗ 				= Неопределено
							, ПричинаОтказа 		= Неопределено
							, Описание 				= ""
							, СтруктурнаяЕдиница 	= Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Сделка_Объект = Сделка.ПолучитьОбъект();
	Если Сделка_Объект.ЭтапСделки = Этап Тогда 
		Возврат;
	КонецЕсли;	
	Если Этап 							= Справочники.ЭтапыСделок.Успех Тогда 
		Сделка_Объект.РезультатСделки 	= Перечисления.РезультатыСделок.Успех;
		Сделка_Объект.ЭтапУспеха		= Сделка_Объект.ЭтапСделки;
		Сделка_Объект.ЭтапСделки		= Справочники.ЭтапыСделок.Успех;
		Сделка_Объект.ПричинаОтказа   	= Неопределено;
		Прием = Документы.Прием.ПолучитьПоследнийПриемПоСделке(Сделка);
		Если Сделка_Объект.Прием <> Прием Тогда		
			Сделка_Объект.Прием 		= Прием;
		КонецЕсли;
	ИначеЕсли Этап 						= Справочники.ЭтапыСделок.Отказ Тогда	
		Сделка_Объект.РезультатСделки 	= Перечисления.РезультатыСделок.Отказ;
		Сделка_Объект.ЭтапОтказа		= Сделка_Объект.ЭтапСделки;
		Сделка_Объект.ЭтапСделки		= Справочники.ЭтапыСделок.Отказ;
		Если ЗначениеЗаполнено(ПричинаОтказа) И ТипЗнч(ПричинаОтказа) = Тип("СправочникСсылка.ПричиныОтказов") Тогда 
			Сделка_Объект.ПричинаОтказа = ПричинаОтказа;
		Иначе 	
			Сделка_Объект.ПричинаОтказа = ПолучитьПричинуОтказаСделки(Сделка, Сделка_Объект.ВидСделки, СтатусПЗ, ПричинаОтказа);
		КонецЕсли;	
	Иначе 
		Сделка_Объект.ЭтапСделки 		= Этап;		
	КонецЕсли;
	Если ЛечащийВрач <> Неопределено Тогда
		Сделка_Объект.Врач = ЛечащийВрач;
	КонецЕсли;
	Если СтруктурнаяЕдиница <> Неопределено Тогда
		Сделка_Объект.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
	КонецЕсли;
	Если ЗначениеЗаполнено(Описание) Тогда 
		Сделка_Объект.Описание = Сделка_Объект.Описание + ?(ЗначениеЗаполнено(СокрЛП(Сделка_Объект.Описание)), Символы.ПС, "") + Описание;
	КонецЕсли;		
	Попытка
		Сделка_Объект.ОбменДанными.Загрузка = НЕ ВключитьБизнесЛогику;			
		Сделка_Объект.Записать();
	Исключение
		МетаданныеСправочника 			= Метаданные.Справочники.Сделки;
		ПредставлениеСправочника 		= МетаданныеСправочника.Представление();
		
		// Сформируем комментарий			
		ШаблонКомментария = НСтр("ru = 'Не удалось установить этап сделке
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		// Запишем в журнал
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Изменение сделки'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение Комментарий;
	КонецПопытки;	
	
КонецПроцедуры

// Процедура - Сменить врача в сделке
//
// Параметры:
//  Сделка				 - 	 - 
//  ЛечащийВрач			 - 	 - 
//  ВключитьБизнесЛогику - 	 - 
//
Процедура СменитьВрачаВСделке(Сделка, ЛечащийВрач, ВключитьБизнесЛогику = Ложь) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Сделка_Объект = Сделка.ПолучитьОбъект();
	Если Сделка_Объект.Врач = ЛечащийВрач Тогда 
		Возврат;
	КонецЕсли;	
	Сделка_Объект.Врач = ЛечащийВрач;
	Попытка
		Сделка_Объект.ОбменДанными.Загрузка = НЕ ВключитьБизнесЛогику;			
		Сделка_Объект.Записать();
	Исключение
		МетаданныеСправочника 			= Метаданные.Справочники.Сделки;
		ПредставлениеСправочника 		= МетаданныеСправочника.Представление();
		
		// Сформируем комментарий			
		ШаблонКомментария = НСтр("ru = 'Не удалось сменить врача в сделке
		|по причине: %1'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонКомментария,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		// Запишем в журнал
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Изменение сделки'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		ВызватьИсключение Комментарий;
	КонецПопытки;	
	
КонецПроцедуры

// Функция - Получить причину отказа сделки
//
// Параметры:
//  Сделка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПричинуОтказаСделки(Сделка, ВидСделки = Неопределено, СтатусПЗ = Неопределено, ПричинаОтказа = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ПричинаОтказа) Тогда 
		Возврат Справочники.ПричиныОтказов.ИнициализироватьПричинуОтказа(ПричинаОтказа, Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидСделки) Тогда 
		ВидСделки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сделка, "ВидСделки");
	КонецЕсли;
	
	Если ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда 
		Если НЕ ЗначениеЗаполнено(СтатусПЗ) Тогда 
			ПредварительнаяЗапись = Документы.Событие.ПолучитьПредварительнуюЗаписьПоСделке(Сделка, СтатусПЗ);
		КонецЕсли;
		Если СтатусПЗ = Перечисления.СтатусыСобытия.ПриемОтменен Тогда 
			Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентОтказался");
		ИначеЕсли СтатусПЗ = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда 
			Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентНеПришел"); 
		Иначе 
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Событие.ПричинаОтмены КАК ПричинаОтмены
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Проведен
	|	И Событие.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И Событие.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Событие.Дата УБЫВ";
	
	ВыборкаПричиныОтмены = Запрос.Выполнить().Выбрать();
	ПричинаОтмены = ?(ВыборкаПричиныОтмены.Следующий(), ВыборкаПричиныОтмены.ПричинаОтмены, Неопределено);
	Если ЗначениеЗаполнено(ПричинаОтмены) Тогда 
		Возврат Справочники.ПричиныОтказов.ИнициализироватьПричинуОтказа(ПричинаОтмены, Истина);
	Иначе 	
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить сокращенное наименование врача
//
// Параметры:
//  Сделка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСокращенноеНаименованиеВрача(Сделка = Неопределено, Врач = Неопределено) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Сделка) И НЕ ЗначениеЗаполнено(Врач) Тогда 
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Врач) Тогда 
		Врач = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сделка, "Врач");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Врач) Тогда 
		Возврат "";
	КонецЕсли;
	
	Возврат Справочники.Сотрудники.ПолучитьСокращенноеНаименованиеСотрудника(, Врач);	
	
КонецФункции

// Функция - Допустим отказ согласно текущего этапа
// 
// Возвращаемое значение:
//   - 
//
Функция ДопустимОтказСогласноТекущегоЭтапа(Сделка, ВидСделкиПредопределенный = Неопределено) Экспорт 
	
	ДоступностьОтказа = Истина;
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда 
		Возврат ДоступностьОтказа;
	КонецЕсли;
	
	Если ВидСделкиПредопределенный = Неопределено ИЛИ НЕ ТипЗнч(ВидСделкиПредопределенный) = Тип("Булево") Тогда 
		ВидСделкиПредопределенный = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сделка, "ВидСделки") = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"); 
	КонецЕсли;	
	
	Если ВидСделкиПредопределенный Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сделка", Сделка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкиИсторияИзмененияЭтапов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сделки.ИсторияИзмененияЭтапов КАК СделкиИсторияИзмененияЭтапов
		|ГДЕ
		|	СделкиИсторияИзмененияЭтапов.Ссылка = &Сделка
		|	И (СделкиИсторияИзмененияЭтапов.ПереходСЭтапа.НомерЭтапа > 2
		|			ИЛИ СделкиИсторияИзмененияЭтапов.ПереходНаЭтап.НомерЭтапа > 2)";
		
		Возврат Запрос.Выполнить().Пустой() ИЛИ НЕ ЗначениеЗаполнено(Документы.Событие.ПолучитьПредварительнуюЗаписьПоСделке(Сделка));
	Иначе 
		Возврат ДоступностьОтказа;
	КонецЕсли;	
	
КонецФункции

// Процедура - Обработка получения полей представления
//
// Параметры:
//  Поля				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
    Поля.Добавить("Наименование");
	Поля.Добавить("ПометкаУдаления");
	Поля.Добавить("Примечание");
	
КонецПроцедуры

// Процедура - Обработка получения представления
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка 		= Ложь;
	Если Данные.ПометкаУдаления = Истина Тогда 
		Представление 			= Данные.Наименование + НСтр("ru= ' (удалена)';en= ' (deleted)'");
	Иначе 	
		Представление 			= Данные.Наименование + ?(ЗначениеЗаполнено(СокрЛП(Данные.Примечание)), " (" + СокрЛП(Данные.Примечание) + ")", "");
	КонецЕсли;
	
КонецПроцедуры

// Функция - Вернуть признак первичного пациента
//
// Параметры:
//  СделкаОбъект - 	 - 
//  ВидСделки	 - 	 - 
//  Контрагент	 - 	 - 
//  ДатаСделки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьПризнакПервичногоПациента(СделкаОбъект 	= Неопределено
										, ВидСделки 	= Неопределено
										, Контрагент 	= Неопределено
										, ДатаСделки 	= Неопределено) Экспорт
	
	ВидСделки 	= ?(СделкаОбъект = Неопределено, ВидСделки	, СделкаОбъект.ВидСделки);
	Контрагент 	= ?(СделкаОбъект = Неопределено, Контрагент	, СделкаОбъект.Контрагент);
	ДатаСделки 	= ?(СделкаОбъект = Неопределено, ?(ЗначениеЗаполнено(ДатаСделки), ДатаСделки, ТекущаяДатаСеанса()), СделкаОбъект.ДатаСделки);
	ДатаСделки 	= ?(НЕ ЗначениеЗаполнено(ДатаСделки) ИЛИ НачалоДня(ДатаСделки) = НачалоДня(ТекущаяДатаСеанса()), ТекущаяДатаСеанса(), ДатаСделки) + (60*60);
	
	СтатусПациента = Перечисления.СтатусыКонтрагентов.ПустаяСсылка();
	Если НЕ ЗначениеЗаполнено(Контрагент) ИЛИ НЕ ЗначениеЗаполнено(ВидСделки) Тогда 
		Возврат СтатусПациента;
	КонецЕсли;
	
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"		, ?(СделкаОбъект = Неопределено, Справочники.Сделки.ПустаяСсылка(), СделкаОбъект.Ссылка));		
	Запрос.УстановитьПараметр("ВидСделки"	, ВидСделки);	
	Запрос.УстановитьПараметр("Контрагент"	, Контрагент);
	Запрос.УстановитьПараметр("ДатаСделки"	, ДатаСделки); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.Регистратор) КАК КоличествоПриемов
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Контрагент = &Контрагент
	|	И Продажи.Период < &ДатаСделки
	|	И Продажи.Регистратор ССЫЛКА Документ.Прием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сделки.Ссылка) КАК КоличествоСделок,
	|	Сделки.ВидСделки КАК ВидСделки
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ПометкаУдаления = ЛОЖЬ
	|	И Сделки.ВидСделки = &ВидСделки
	|	И Сделки.Контрагент = &Контрагент
	|	И Сделки.ДатаСделки <= &ДатаСделки
	|	И Сделки.Ссылка <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Сделки.ВидСделки";
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;		
	
	РезультатПакетногоЗапроса 	= Запрос.ВыполнитьПакет();
	ВыборкаКоличестваПриемов 	= РезультатПакетногоЗапроса[0].Выбрать();
	ВыборкаКоличестваСделок 	= РезультатПакетногоЗапроса[1].Выбрать();
	
	Если ВыборкаКоличестваПриемов.Следующий() Тогда
		СтатусПациента = ?(ВыборкаКоличестваПриемов.КоличествоПриемов > 0, Перечисления.СтатусыКонтрагентов.Постоянный, Перечисления.СтатусыКонтрагентов.Первичный);
		Если СтатусПациента = Перечисления.СтатусыКонтрагентов.Первичный И ВыборкаКоличестваСделок.Следующий() Тогда 
			СтатусПациента = ?(ВыборкаКоличестваСделок.КоличествоСделок > 0, Перечисления.СтатусыКонтрагентов.Постоянный, Перечисления.СтатусыКонтрагентов.Первичный);
		КонецЕсли;	
	Иначе
		Если ВыборкаКоличестваСделок.Следующий() Тогда
			СтатусПациента = ?(ВыборкаКоличестваСделок.КоличествоСделок > 0, Перечисления.СтатусыКонтрагентов.Постоянный, Перечисления.СтатусыКонтрагентов.Первичный);
		Иначе 
			СтатусПациента = Перечисления.СтатусыКонтрагентов.Первичный;		
		КонецЕсли;	
	КонецЕсли;

	Возврат СтатусПациента;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция, формирует и возвращает наиемнование сделки.
// 
// Возвращаемое значение:
//   Наименование - Строка - Наименование сделки. 
//
Функция СоздатьНаименованиеСделки(Сделка) Экспорт
	
	Возврат СокрЛП(Строка(Сделка.ВидСделки))
				+ " № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Сделка.Код, "");
				//+ ?(ЗначениеЗаполнено(СокрЛП(Сделка.Примечание)), " (" + СокрЛП(Сделка.Примечание) + ")", "");
	
КонецФункции

// Функция - Инициализировать сокращенное наименование сделки
//
// Параметры:
//  Сделка						 - 	 - 
//  ДобавлятьВрача				 - 	 - 
//  ТолькоЕслиЗаполненПрефикс	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСокращенноеНаименованиеСделки(Сделка
													, ДобавлятьВрача = Ложь
													, ВрачКакПрефикс = Ложь
													, ТолькоЕслиЗаполненПрефикс = Ложь
													, СтруктураНаименованияВида = Неопределено
													, НаименованиеСокращенноеВрача = "") Экспорт
	
	Наименование = "";
	
	Если ТипЗнч(Сделка) = Тип("СправочникОбъект.Сделки") Тогда 
		ВидСделки 		= Сделка.ВидСделки;
		Код 			= Сделка.Код;
		Врач 			= Сделка.Врач;
		Специализация 	= Сделка.Специализация;
	ИначеЕсли ТипЗнч(Сделка) = Тип("СправочникСсылка.Сделки") Тогда
		ДанныеСделки 	= ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Сделка, "Код, ВидСделки, Врач, НаименованиеСокращенное, Специализация");
		ВидСделки 		= ДанныеСделки.ВидСделки;
		Код 			= ДанныеСделки.Код;
		Врач 			= ДанныеСделки.Врач;
		Специализация 	= ДанныеСделки.Специализация;		
	ИначеЕсли ТипЗнч(Сделка) = Тип("Структура") Тогда 
		ВидСделки 		= ?(Сделка.Свойство("ВидСделки")	, Сделка.ВидСделки		, Неопределено);
		Код 			= ?(Сделка.Свойство("Код")			, Сделка.Код			, Неопределено);
		Врач 			= ?(Сделка.Свойство("Врач")			, Сделка.Врач			, Неопределено);
		Специализация	= ?(Сделка.Свойство("Специализация"), Сделка.Специализация	, Неопределено);		
	Иначе 
		Возврат Наименование;
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ВидСделки) Тогда
		Если НЕ ЗначениеЗаполнено(СтруктураНаименованияВида) Тогда 
			СтруктураНаименованияВида = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ВидСделки, "Наименование, Префикс");
		КонецЕсли;	
		Если ТолькоЕслиЗаполненПрефикс И НЕ ЗначениеЗаполнено(СтруктураНаименованияВида.Префикс) И НЕ ТипЗнч(Сделка) = Тип("СправочникОбъект.Сделки") Тогда
			Возврат "";
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтруктураНаименованияВида.Префикс) Тогда
			СтруктураНаименованияВида.Префикс = Справочники.ВидыСделок.ПолучитьПрефиксВоронкиПоНаименованию(СтруктураНаименованияВида.Наименование);
		КонецЕсли;
		Наименование = СтруктураНаименованияВида.Префикс + ФормированиеПечатныхФорм.ПолучитьНомерНаПечатьПосле2011г(Код, Истина, Истина);
		Если ДобавлятьВрача Тогда 
			Если ЗначениеЗаполнено(Врач) Тогда
				Если НЕ ЗначениеЗаполнено(СокрЛП(НаименованиеСокращенноеВрача)) Тогда 
					НаименованиеСокращенноеВрача = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Врач, "НаименованиеСокращенное");
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(НаименованиеСокращенноеВрача) Тогда 
					НаименованиеСокращенноеВрача = Справочники.Сотрудники.ПолучитьСокращенноеНаименованиеСотрудника(, Врач);	
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Специализация) Тогда
				НаименованиеСокращенноеВрача = СокрЛП(Строка(Специализация));
			КонецЕсли;
			Если ЗначениеЗаполнено(СокрЛП(НаименованиеСокращенноеВрача)) Тогда
				Если ВрачКакПрефикс Тогда 
					Наименование = СокрЛП(НаименованиеСокращенноеВрача) + " " + Наименование;
				Иначе 	
					Наименование = Наименование + " " + СокрЛП(НаименованиеСокращенноеВрача);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

// Процедура - Конвертация сделок новый пациент
//
// Параметры:
//  ИнициализироватьВидСделки	 - 	 - 
//
Процедура КонвертацияСделокНовыйПациент(ИнициализироватьВидСделки = Ложь) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	

	ВидСделок__НовыеПациенты = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	Если НЕ ЗначениеЗаполнено(ВидСделок__НовыеПациенты) ИЛИ ИнициализироватьВидСделки Тогда 
		Справочники.ВидыСделок.ИнициализироватьПредопределенныйВид_ПервичныйПовторныйПациент(ВидСделок__НовыеПациенты);
	КонецЕсли;	
	
	ПричинаОтказа_КлиентНеПришел 	= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентНеПришел");
    ПричинаОтказа_КлиентОтказался 	= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентОтказался");
	
	Если ЗначениеЗаполнено(ВидСделок__НовыеПациенты) Тогда 
		Этап1 = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделок__НовыеПациенты, 1);
		Этап2 = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделок__НовыеПациенты, 2);
		Этап3 = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделок__НовыеПациенты, 3);
		Этап4 = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделок__НовыеПациенты, 4);
	Иначе 
		Возврат;
	КонецЕсли;
	
	МассивЭтапов = Новый Массив;
	ТаблицаЭтапов = ПолучитьРанееСозданныеЭтапы(ВидСделок__НовыеПациенты);
	МассивСтрок = ТаблицаЭтапов.НайтиСтроки(Новый Структура("НомерЭтапа", 2));
	Для Каждого СтрокаМассива Из МассивСтрок Цикл 
		МассивЭтапов.Добавить(СтрокаМассива.Этап);
	КонецЦикла;	
	МассивСтрок = ТаблицаЭтапов.НайтиСтроки(Новый Структура("НомерЭтапа", 4));
	Для Каждого СтрокаМассива Из МассивСтрок Цикл 
		МассивЭтапов.Добавить(СтрокаМассива.Этап);
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидСделки"	, ВидСделок__НовыеПациенты);
	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.Наименование КАК Наименование,
	|	Сделки.ПометкаУдаления КАК ПометкаУдаления,
	|	Сделки.ДатаСделки КАК ДатаСделки,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	Сделки.Контрагент КАК Контрагент,
	|	Сделки.Врач КАК Врач,
	|	Сделки.ПричинаОтказа КАК ПричинаОтказа,
	|	Сделки.РезультатСделки КАК РезультатСделки,
	|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сделки.ЭтапОтказа КАК ЭтапОтказа,
	|	Сделки.ЭтапОтказа.НомерЭтапа КАК ЭтапОтказаНомерЭтапа,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапСделки.НомерЭтапа КАК ЭтапСделкиНомерЭтапа,
	|	Сделки.ЭтапУспеха КАК ЭтапУспеха,
	|	Сделки.ЭтапУспеха.НомерЭтапа КАК ЭтапУспехаНомерЭтапа,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)) КАК ПредварительнаяЗапись,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)) КАК ЗапланированнаяПредварительнаяЗапись,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.Номер, 0) КАК Номер,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ЗапланированнаяЗадача, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ЗапланированнаяЗадача,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ПоследняяЗадача, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ПоследняяЗадача,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ПерваяДляВрача, ЛОЖЬ) КАК ПерваяДляВрача
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|		ПО Сделки.Ссылка = СделкиСведенияДляСписка.Сделка
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка,
	|	Контрагент,
	|	Врач,
	|	СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписьНаПрием.Ссылка КАК ПредварительнаяЗапись,
	|	ЗаписьНаПрием.Проведен КАК Проведен,
	|	ЗаписьНаПрием.Дата КАК ДатаПриема,
	|	ЗаписьНаПрием.Врач КАК Врач,
	|	ЗаписьНаПрием.ДатаСоздания КАК ДатаСоздания,
	|	ЗаписьНаПрием.Контрагент КАК Контрагент,
	|	ЗаписьНаПрием.ПричинаОтмены КАК ПричинаОтмены,
	|	ЗаписьНаПрием.Сделка КАК Сделка,
	|	ЗаписьНаПрием.Статус КАК Статус,
	|	ЗаписьНаПрием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗаписьНаПрием.СсылкаНаПрием КАК СсылкаНаПрием
	|ПОМЕСТИТЬ ТаблицаЗаписейНаПрием
	|ИЗ
	|	Документ.Событие КАК ЗаписьНаПрием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок
	|		ПО ЗаписьНаПрием.Сделка = ТаблицаСделок.Сделка
	|ГДЕ
	|	ЗаписьНаПрием.Резерв = ЛОЖЬ
	|	И ЗаписьНаПрием.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Врач,
	|	Контрагент,
	|	Сделка,
	|	СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаЗаписейНаПрием.ДатаПриема) КАК ДатаПриема,
	|	ТаблицаЗаписейНаПрием.Врач КАК Врач,
	|	ТаблицаЗаписейНаПрием.Контрагент КАК Контрагент,
	|	ТаблицаЗаписейНаПрием.Сделка КАК Сделка,
	|	ТаблицаЗаписейНаПрием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ТаблицаПоследнихЗаписейНаПрием
	|ИЗ
	|	ТаблицаЗаписейНаПрием КАК ТаблицаЗаписейНаПрием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок
	|		ПО ТаблицаЗаписейНаПрием.Врач = ТаблицаСделок.Врач
	|			И ТаблицаЗаписейНаПрием.Контрагент = ТаблицаСделок.Контрагент
	|			И ТаблицаЗаписейНаПрием.Сделка = ТаблицаСделок.Сделка
	|			И ТаблицаЗаписейНаПрием.СтруктурнаяЕдиница = ТаблицаСделок.СтруктурнаяЕдиница
	|ГДЕ
	|	ТаблицаЗаписейНаПрием.Проведен = ИСТИНА
	|	И ТаблицаЗаписейНаПрием.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПациентОжидает), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНачат), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОкончен))
	|	И ТаблицаСделок.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаСделок.ДатаЗавершенияСделки = ДАТАВРЕМЯ(1, 1, 1)
	|	И ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|	И ТаблицаСделок.ЭтапСделки В(&МассивЭтапов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаписейНаПрием.Врач,
	|	ТаблицаЗаписейНаПрием.СтруктурнаяЕдиница,
	|	ТаблицаЗаписейНаПрием.Контрагент,
	|	ТаблицаЗаписейНаПрием.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСделок.Сделка КАК Сделка,
	|	ТаблицаСделок.Наименование КАК Наименование,
	|	ТаблицаСделок.ПометкаУдаления КАК ПометкаУдаления,
	|	ТаблицаСделок.ДатаСделки КАК ДатаСделки,
	|	ТаблицаСделок.ВидСделки КАК ВидСделки,
	|	ТаблицаСделок.ВидСделки.Наименование КАК ВидСделкиНаименование,
	|	ТаблицаСделок.ВидСделки.Префикс КАК ВидСделкиПрефикс,
	|	ТаблицаСделок.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	ТаблицаСделок.Контрагент КАК Контрагент,
	|	ТаблицаСделок.Врач КАК Врач,
	|	ТаблицаСделок.Врач.НаименованиеСокращенное КАК ВрачНаименованиеСокращенное,
	|	ТаблицаСделок.ПричинаОтказа КАК ПричинаОтказа,
	|	ТаблицаСделок.РезультатСделки КАК РезультатСделки,
	|	ТаблицаСделок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаСделок.ЭтапОтказа КАК ЭтапОтказа,
	|	ТаблицаСделок.ЭтапОтказаНомерЭтапа КАК ЭтапОтказаНомерЭтапа,
	|	ТаблицаСделок.ЭтапСделки КАК ЭтапСделки,
	|	ТаблицаСделок.ЭтапСделкиНомерЭтапа КАК ЭтапСделкиНомерЭтапа,
	|	ТаблицаСделок.ЭтапУспеха КАК ЭтапУспеха,
	|	ТаблицаСделок.ЭтапУспехаНомерЭтапа КАК ЭтапУспехаНомерЭтапа,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.ПредварительнаяЗапись ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.ПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.ПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка))
	|	КОНЕЦ КАК ПредварительнаяЗапись,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.ДатаПриема ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаПриема,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.ДатаСоздания ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.ДатаСоздания, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.ДатаСоздания, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.ПричинаОтмены ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.ПричинаОтмены, ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаписи.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.ПричинаОтмены, ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаписи.ПустаяСсылка))
	|	КОНЕЦ КАК ПричинаОтмены,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.Статус ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПустаяСсылка))
	|	КОНЕЦ КАК Статус,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.СсылкаНаПрием ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.СсылкаНаПрием, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.СсылкаНаПрием, ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка))
	|	КОНЕЦ КАК СсылкаНаПрием,
	|	ТаблицаСделок.ЗапланированнаяПредварительнаяЗапись КАК ЗапланированнаяПредварительнаяЗапись,
	|	ТаблицаСделок.Номер КАК Номер,
	|	ТаблицаСделок.ЗапланированнаяЗадача КАК ЗапланированнаяЗадача,
	|	ТаблицаСделок.ПоследняяЗадача КАК ПоследняяЗадача,
	|	ТаблицаСделок.ПерваяДляВрача КАК ПерваяДляВрача
	|ПОМЕСТИТЬ ИтоговаяТаблицаСделок
	|ИЗ
	|	ТаблицаСделок КАК ТаблицаСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗаписейНаПрием КАК ТаблицаЗаписейНаПрием
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПоследнихЗаписейНаПрием КАК ТаблицаПоследнихЗаписейНаПрием
	|			ПО ТаблицаЗаписейНаПрием.ДатаПриема = ТаблицаПоследнихЗаписейНаПрием.ДатаПриема
	|				И ТаблицаЗаписейНаПрием.Врач = ТаблицаПоследнихЗаписейНаПрием.Врач
	|				И ТаблицаЗаписейНаПрием.Контрагент = ТаблицаПоследнихЗаписейНаПрием.Контрагент
	|				И ТаблицаЗаписейНаПрием.Сделка = ТаблицаПоследнихЗаписейНаПрием.Сделка
	|				И ТаблицаЗаписейНаПрием.СтруктурнаяЕдиница = ТаблицаПоследнихЗаписейНаПрием.СтруктурнаяЕдиница
	|		ПО ТаблицаСделок.Сделка = ТаблицаЗаписейНаПрием.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗаписейНаПрием КАК ТаблицаЗаписейНаПриемПоСсылке
	|		ПО ТаблицаСделок.ПредварительнаяЗапись = ТаблицаЗаписейНаПриемПоСсылке.ПредварительнаяЗапись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаписейНаПрием.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ТаблицаЗаписейНаПрием.Сделка КАК Сделка
	|ИЗ
	|	ТаблицаЗаписейНаПрием КАК ТаблицаЗаписейНаПрием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтоговаяТаблицаСделок КАК ИтоговаяТаблицаСделок
	|		ПО ТаблицаЗаписейНаПрием.Сделка = ИтоговаяТаблицаСделок.Сделка
	|ГДЕ
	|	ТаблицаЗаписейНаПрием.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И ИтоговаяТаблицаСделок.ЭтапСделкиНомерЭтапа = 3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументПрием.Ссылка КАК Прием,
	|	ДокументПрием.Сделка КАК Сделка
	|ИЗ
	|	Документ.Прием КАК ДокументПрием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтоговаяТаблицаСделок КАК ИтоговаяТаблицаСделок
	|		ПО ДокументПрием.Сделка = ИтоговаяТаблицаСделок.Сделка
	|ГДЕ
	|	ДокументПрием.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И ИтоговаяТаблицаСделок.ЭтапСделкиНомерЭтапа = 3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(Продажи.Период) КАК Период,
	|	Продажи.Регистратор КАК Прием,
	|	ТаблицаСделок.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаПриемовПациентаДоСделки
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок
	|		ПО Продажи.Контрагент = ТаблицаСделок.Контрагент
	|			И (ТаблицаСделок.ДатаСделки > Продажи.Период)
	|ГДЕ
	|	Продажи.Регистратор ССЫЛКА Документ.Прием
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Регистратор,
	|	ТаблицаСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаПриемовПациентаДоСделки.Прием) КАК КоличествоПриемов,
	|	ТаблицаПриемовПациентаДоСделки.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаКоличестваПриемовПациентаДоСделки
	|ИЗ
	|	ТаблицаПриемовПациентаДоСделки КАК ТаблицаПриемовПациентаДоСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПриемовПациентаДоСделки.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблицаСделок.Сделка КАК Сделка,
	|	ИтоговаяТаблицаСделок.Наименование КАК Наименование,
	|	ИтоговаяТаблицаСделок.ПометкаУдаления КАК ПометкаУдаления,
	|	ИтоговаяТаблицаСделок.ВидСделки КАК ВидСделки,
	|	ИтоговаяТаблицаСделок.ВидСделкиНаименование КАК ВидСделкиНаименование,
	|	ИтоговаяТаблицаСделок.ВидСделкиПрефикс КАК ВидСделкиПрефикс,
	|	ИтоговаяТаблицаСделок.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	ИтоговаяТаблицаСделок.Контрагент КАК Контрагент,
	|	ИтоговаяТаблицаСделок.Врач КАК Врач,
	|	ИтоговаяТаблицаСделок.ВрачНаименованиеСокращенное КАК ВрачНаименованиеСокращенное,
	|	ИтоговаяТаблицаСделок.ПричинаОтказа КАК ПричинаОтказа,
	|	ИтоговаяТаблицаСделок.РезультатСделки КАК РезультатСделки,
	|	ИтоговаяТаблицаСделок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ИтоговаяТаблицаСделок.ЭтапОтказа КАК ЭтапОтказа,
	|	ИтоговаяТаблицаСделок.ЭтапОтказаНомерЭтапа КАК ЭтапОтказаНомерЭтапа,
	|	ИтоговаяТаблицаСделок.ЭтапСделки КАК ЭтапСделки,
	|	ИтоговаяТаблицаСделок.ЭтапСделкиНомерЭтапа КАК ЭтапСделкиНомерЭтапа,
	|	ИтоговаяТаблицаСделок.ЭтапУспеха КАК ЭтапУспеха,
	|	ИтоговаяТаблицаСделок.ЭтапУспехаНомерЭтапа КАК ЭтапУспехаНомерЭтапа,
	|	ИтоговаяТаблицаСделок.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ИтоговаяТаблицаСделок.ДатаПриема КАК ДатаПриема,
	|	ИтоговаяТаблицаСделок.ДатаСоздания КАК ДатаСоздания,
	|	ИтоговаяТаблицаСделок.ПричинаОтмены КАК ПричинаОтмены,
	|	ИтоговаяТаблицаСделок.Статус КАК Статус,
	|	ИтоговаяТаблицаСделок.СсылкаНаПрием КАК СсылкаНаПрием,
	|	ИтоговаяТаблицаСделок.ЗапланированнаяПредварительнаяЗапись КАК ЗапланированнаяПредварительнаяЗапись,
	|	ИтоговаяТаблицаСделок.Номер КАК Номер,
	|	ИтоговаяТаблицаСделок.ЗапланированнаяЗадача КАК ЗапланированнаяЗадача,
	|	ИтоговаяТаблицаСделок.ПоследняяЗадача КАК ПоследняяЗадача,
	|	ИтоговаяТаблицаСделок.ПерваяДляВрача КАК ПерваяДляВрача,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаКоличестваПриемовПациентаДоСделки.КоличествоПриемов, 0) > 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	|	КОНЕЦ КАК СтатусПациента
	|ИЗ
	|	ИтоговаяТаблицаСделок КАК ИтоговаяТаблицаСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКоличестваПриемовПациентаДоСделки КАК ТаблицаКоличестваПриемовПациентаДоСделки
	|		ПО ИтоговаяТаблицаСделок.Сделка = ТаблицаКоличестваПриемовПациентаДоСделки.Сделка";	
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗаписей 			= РезультатПакетаЗапросов[4].Выгрузить();
	ТаблицаПриемов 			= РезультатПакетаЗапросов[5].Выгрузить();
	ТаблицаСделок 			= РезультатПакетаЗапросов[8].Выгрузить();
	
	ДатаНачалоДня 			= НачалоДня(ТекущаяДатаСеанса());
	МетаданныеСправочника 	= Метаданные.Справочники.Сделки;			
	Для Каждого СтрокаДанныеСделки Из ТаблицаСделок Цикл
		Сделка_Объект 							= СтрокаДанныеСделки.Сделка.ПолучитьОбъект();
		Сделка_Объект.СтатусПациента 			= СтрокаДанныеСделки.СтатусПациента;
		Сделка_Объект.Наименование 				= СоздатьНаименованиеСделки(Сделка_Объект);		
		Сделка_Объект.НаименованиеСокращенное 	= ИнициализироватьСокращенноеНаименованиеСделки(Сделка_Объект
																								, 
																								, 
																								, 
																								, Новый Структура("Наименование, Префикс", СтрокаДанныеСделки.ВидСделкиНаименование, СтрокаДанныеСделки.ВидСделкиПрефикс)
																								, СтрокаДанныеСделки.ВрачНаименованиеСокращенное);	
		
		Если СтрокаДанныеСделки.ЭтапОтказаНомерЭтапа = 1 ИЛИ СтрокаДанныеСделки.ЭтапОтказаНомерЭтапа = 3 Тогда 
			Сделка_Объект.ЭтапОтказа = Этап1;			
		ИначеЕсли СтрокаДанныеСделки.ЭтапОтказаНомерЭтапа = 2 ИЛИ СтрокаДанныеСделки.ЭтапОтказаНомерЭтапа = 4 Тогда
			Если СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда 
				Сделка_Объект.ЭтапОтказа = Этап4;			
			Иначе 
				Сделка_Объект.ЭтапОтказа = Этап3;			
			   КонецЕсли;
		КонецЕсли;
		Если СтрокаДанныеСделки.ЭтапУспехаНомерЭтапа = 1 ИЛИ СтрокаДанныеСделки.ЭтапУспехаНомерЭтапа = 3 Тогда 
			Сделка_Объект.ЭтапУспеха = Этап1;			
		ИначеЕсли СтрокаДанныеСделки.ЭтапУспехаНомерЭтапа = 2 ИЛИ СтрокаДанныеСделки.ЭтапУспехаНомерЭтапа = 4 Тогда
			Если СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда 
				Сделка_Объект.ЭтапУспеха = Этап4;			
			Иначе 
				Сделка_Объект.ЭтапУспеха = Этап3;			
			   КонецЕсли;
		КонецЕсли;
		
		ЗаписатьИзменениеСтатусаВПредварительнойЗаписи 	= Ложь;
		СтатусПредварительнойЗаписи 					= СтрокаДанныеСделки.Статус;
		ОчиститьЗапланированнуюЗапись 					= Ложь;
		Если СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 1 ИЛИ (СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 3 И ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием)) Тогда 
			Сделка_Объект.ЭтапСделки = Этап1;			
		ИначеЕсли СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 2 ИЛИ СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 4 ИЛИ (СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 3 И НЕ ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием)) Тогда
			Если СтрокаДанныеСделки.ДатаПриема < ДатаНачалоДня
				И ((НЕ СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемНачат И НЕ СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемОкончен) ИЛИ НЕ ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием)) Тогда
				Сделка_Объект.РезультатСделки 		= Перечисления.РезультатыСделок.Отказ;
				Сделка_Объект.ЭтапСделки 			= Справочники.ЭтапыСделок.Отказ;
				Сделка_Объект.ЭтапУспеха 			= Справочники.ЭтапыСделок.ПустаяСсылка();							
				Сделка_Объект.ДатаЗавершенияСделки 	= ?(ЗначениеЗаполнено(Сделка_Объект.ДатаЗавершенияСделки), Сделка_Объект.ДатаЗавершенияСделки, СтрокаДанныеСделки.ДатаПриема);				
				Если СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда 
					Сделка_Объект.ПричинаОтказа 	= ?(ЗначениеЗаполнено(Сделка_Объект.ПричинаОтказа), Сделка_Объект.ПричинаОтказа, ПричинаОтказа_КлиентОтказался);
				Иначе
					Сделка_Объект.ПричинаОтказа 	= ПричинаОтказа_КлиентНеПришел;
					Если НЕ СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся И ЗначениеЗаполнено(СтрокаДанныеСделки.ПредварительнаяЗапись) Тогда
						ЗаписатьИзменениеСтатусаВПредварительнойЗаписи = Истина;
						СтатусПредварительнойЗаписи = Перечисления.СтатусыСобытия.ПриемНеСостоялся;
					КонецЕсли;	
				КонецЕсли;
				ОчиститьЗапланированнуюЗапись 		= ЗначениеЗаполнено(СтрокаДанныеСделки.ЗапланированнаяПредварительнаяЗапись);
			ИначеЕсли ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием) И СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемОкончен Тогда	
				Сделка_Объект.РезультатСделки 		= Перечисления.РезультатыСделок.Успех;
				Сделка_Объект.ЭтапСделки 			= Справочники.ЭтапыСделок.Успех;
				Сделка_Объект.ЭтапУспеха 			= Справочники.ЭтапыСделок.Успех;											
				Сделка_Объект.ДатаЗавершенияСделки 	= ?(ЗначениеЗаполнено(Сделка_Объект.ДатаЗавершенияСделки), Сделка_Объект.ДатаЗавершенияСделки, СтрокаДанныеСделки.ДатаПриема);				
				ОчиститьЗапланированнуюЗапись 		= ЗначениеЗаполнено(СтрокаДанныеСделки.ЗапланированнаяПредварительнаяЗапись);				
			Иначе 	
				Если СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда 
					Сделка_Объект.ЭтапСделки 		= Этап4;			
				Иначе 
					Сделка_Объект.ЭтапСделки 		= Этап3;			
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаписатьИзменениеСтатусаВПредварительнойЗаписи Тогда 
			Запись_Объект 				= СтрокаДанныеСделки.ПредварительнаяЗапись.ПолучитьОбъект();
			Запись_Объект.Статус 		= СтатусПредварительнойЗаписи;
		КонецЕсли;
			
		Если ОчиститьЗапланированнуюЗапись Тогда
			СтрокаДанныеСделки.ЗапланированнаяПредварительнаяЗапись = Документы.Событие.ПустаяСсылка();
			НаборЗаписей 				= РегистрыСведений.СделкиСведенияДляСписка.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сделка.Установить(СтрокаДанныеСделки.Сделка);
			ЗаписьНабора 										= НаборЗаписей.Добавить();
			ЗаписьНабора.Сделка 								= СтрокаДанныеСделки.Сделка;
			ЗаписьНабора.ВидСделки 								= СтрокаДанныеСделки.ВидСделки;
			ЗаписьНабора.Номер 									= СтрокаДанныеСделки.Номер;
			ЗаписьНабора.ЗапланированнаяПредварительнаяЗапись 	= Документы.Событие.ПустаяСсылка();
			ЗаписьНабора.ЗапланированнаяЗадача 					= СтрокаДанныеСделки.ЗапланированнаяЗадача;
			ЗаписьНабора.ПоследняяЗадача 						= СтрокаДанныеСделки.ПоследняяЗадача;
			ЗаписьНабора.ПерваяДляВрача 						= СтрокаДанныеСделки.ПерваяДляВрача;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			Если ЗаписатьИзменениеСтатусаВПредварительнойЗаписи Тогда 
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Запись_Объект);
			ИначеЕсли СтрокаДанныеСделки.РезультатСделки = Перечисления.РезультатыСделок.ПустаяСсылка() И СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 3 И ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием) Тогда 
				МассивСтрок = ТаблицаПриемов.НайтиСтроки(Новый Структура("Сделка", СтрокаДанныеСделки.Сделка));
				Для Каждого ЭлементКоллекции Из МассивСтрок Цикл 
					Если ЗначениеЗаполнено(ЭлементКоллекции.Прием) Тогда 
						Прием_Объект 		= ЭлементКоллекции.Прием.ПолучитьОбъект();
						Прием_Объект.Сделка = Справочники.Сделки.ПустаяСсылка();
						Попытка
							ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Прием_Объект);
						Исключение
							
						КонецПопытки;							
					КонецЕсли;	
				КонецЦикла;	
				МассивСтрок = ТаблицаЗаписей.НайтиСтроки(Новый Структура("Сделка", СтрокаДанныеСделки.Сделка));
				Для Каждого ЭлементКоллекции Из МассивСтрок Цикл 
					Если ЗначениеЗаполнено(ЭлементКоллекции.ПредварительнаяЗапись) Тогда 
						Запись_Объект 		= ЭлементКоллекции.ПредварительнаяЗапись.ПолучитьОбъект();
						Запись_Объект.Сделка = Справочники.Сделки.ПустаяСсылка();
						Попытка
							ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Запись_Объект);
						Исключение
							
						КонецПопытки;							
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;
			Если ОчиститьЗапланированнуюЗапись Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сделка_Объект);
			ЗафиксироватьТранзакцию();			
		Исключение
			ОтменитьТранзакцию();
			МетаданныеСправочника 				= Метаданные.Справочники.Сделки;		
			ШаблонКомментария = НСтр("ru = 'Ошибка конвертации сделки ""%1"" 
			|по причине: %2'");
		
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																				, СтрокаДанныеСделки.Наименование
																				, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
									, УровеньЖурналаРегистрации.Ошибка
									, МетаданныеСправочника
									,
									, Комментарий);
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Конвертация сделок постоянный пациент
//
Процедура КонвертацияСделокПостоянныйПациент(Отказ = Ложь) Экспорт
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	ВидСделок__ПервичныйПовторныйПациент 	= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");	
	ВидСделок__ПостоянныеПациенты 			= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты");
	
	ПричинаОтказа_КлиентНеПришел 			= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентНеПришел");
    ПричинаОтказа_КлиентОтказался 			= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентОтказался");
	
	Если НЕ ЗначениеЗаполнено(ВидСделок__ПервичныйПовторныйПациент) ИЛИ НЕ ЗначениеЗаполнено(ВидСделок__ПостоянныеПациенты) Тогда 
		Возврат;
	Иначе 
		Этап1 = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделок__ПостоянныеПациенты, 1);
		Этап2 = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделок__ПостоянныеПациенты, 2);
		Этап3 = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделок__ПостоянныеПациенты, 3);
		Этап4 = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ВидСделок__ПостоянныеПациенты, 4);		
	КонецЕсли;	
	
	СтруктураНаименованияВида = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ВидСделок__ПервичныйПовторныйПациент, "Наименование, Префикс");
	
	МассивЭтапов = Новый Массив;
	ТаблицаЭтапов = ПолучитьРанееСозданныеЭтапы(ВидСделок__ПостоянныеПациенты, Ложь);
	МассивСтрок = ТаблицаЭтапов.НайтиСтроки(Новый Структура("НомерЭтапа", 2));
	Для Каждого СтрокаМассива Из МассивСтрок Цикл 
		МассивЭтапов.Добавить(СтрокаМассива.Этап);
	КонецЦикла;	
	МассивСтрок = ТаблицаЭтапов.НайтиСтроки(Новый Структура("НомерЭтапа", 4));
	Для Каждого СтрокаМассива Из МассивСтрок Цикл 
		МассивЭтапов.Добавить(СтрокаМассива.Этап);
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДатаСеанса());	
	Запрос.УстановитьПараметр("ВидСделки"	, ВидСделок__ПостоянныеПациенты);
	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сделки.Ссылка КАК Сделка,
	|	Сделки.Наименование КАК Наименование,
	|	Сделки.ПометкаУдаления КАК ПометкаУдаления,
	|	Сделки.ДатаСделки КАК ДатаСделки,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	Сделки.Контрагент КАК Контрагент,
	|	Сделки.Врач КАК Врач,
	|	Сделки.ПричинаОтказа КАК ПричинаОтказа,
	|	Сделки.РезультатСделки КАК РезультатСделки,
	|	Сделки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Сделки.ЭтапОтказа КАК ЭтапОтказа,
	|	Сделки.ЭтапОтказа.НомерЭтапа КАК ЭтапОтказаНомерЭтапа,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапСделки.НомерЭтапа КАК ЭтапСделкиНомерЭтапа,
	|	Сделки.ЭтапУспеха КАК ЭтапУспеха,
	|	Сделки.ЭтапУспеха.НомерЭтапа КАК ЭтапУспехаНомерЭтапа,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)) КАК ПредварительнаяЗапись,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ЗапланированнаяПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)) КАК ЗапланированнаяПредварительнаяЗапись,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.Номер, 0) КАК Номер,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ЗапланированнаяЗадача, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ЗапланированнаяЗадача,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ПоследняяЗадача, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ПоследняяЗадача,
	|	ЕСТЬNULL(СделкиСведенияДляСписка.ПерваяДляВрача, ЛОЖЬ) КАК ПерваяДляВрача
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СделкиСведенияДляСписка КАК СделкиСведенияДляСписка
	|		ПО Сделки.Ссылка = СделкиСведенияДляСписка.Сделка
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка,
	|	Контрагент,
	|	Врач,
	|	СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписьНаПрием.Ссылка КАК ПредварительнаяЗапись,
	|	ЗаписьНаПрием.Проведен КАК Проведен,
	|	ЗаписьНаПрием.Дата КАК ДатаПриема,
	|	ЗаписьНаПрием.Врач КАК Врач,
	|	ЗаписьНаПрием.ДатаСоздания КАК ДатаСоздания,
	|	ЗаписьНаПрием.Контрагент КАК Контрагент,
	|	ЗаписьНаПрием.ПричинаОтмены КАК ПричинаОтмены,
	|	ЗаписьНаПрием.Сделка КАК Сделка,
	|	ЗаписьНаПрием.Статус КАК Статус,
	|	ЗаписьНаПрием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗаписьНаПрием.СсылкаНаПрием КАК СсылкаНаПрием
	|ПОМЕСТИТЬ ТаблицаЗаписейНаПрием
	|ИЗ
	|	Документ.Событие КАК ЗаписьНаПрием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок
	|		ПО ЗаписьНаПрием.Сделка = ТаблицаСделок.Сделка
	|ГДЕ
	|	ЗаписьНаПрием.Резерв = ЛОЖЬ
	|	И ЗаписьНаПрием.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Врач,
	|	Контрагент,
	|	Сделка,
	|	СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаЗаписейНаПрием.ДатаПриема) КАК ДатаПриема,
	|	ТаблицаЗаписейНаПрием.Врач КАК Врач,
	|	ТаблицаЗаписейНаПрием.Контрагент КАК Контрагент,
	|	ТаблицаЗаписейНаПрием.Сделка КАК Сделка,
	|	ТаблицаЗаписейНаПрием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ТаблицаПоследнихЗаписейНаПрием
	|ИЗ
	|	ТаблицаЗаписейНаПрием КАК ТаблицаЗаписейНаПрием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок
	|		ПО ТаблицаЗаписейНаПрием.Врач = ТаблицаСделок.Врач
	|			И ТаблицаЗаписейНаПрием.Контрагент = ТаблицаСделок.Контрагент
	|			И ТаблицаЗаписейНаПрием.Сделка = ТаблицаСделок.Сделка
	|			И ТаблицаЗаписейНаПрием.СтруктурнаяЕдиница = ТаблицаСделок.СтруктурнаяЕдиница
	|ГДЕ
	|	ТаблицаЗаписейНаПрием.Проведен = ИСТИНА
	|	И ТаблицаЗаписейНаПрием.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПациентОжидает), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНачат), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОкончен))
	|	И ТаблицаСделок.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаСделок.ДатаЗавершенияСделки = ДАТАВРЕМЯ(1, 1, 1)
	|	И ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|	И ТаблицаСделок.ЭтапСделки В(&МассивЭтапов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаписейНаПрием.Врач,
	|	ТаблицаЗаписейНаПрием.СтруктурнаяЕдиница,
	|	ТаблицаЗаписейНаПрием.Контрагент,
	|	ТаблицаЗаписейНаПрием.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСделок.Сделка КАК Сделка,
	|	ТаблицаСделок.Наименование КАК Наименование,
	|	ТаблицаСделок.ПометкаУдаления КАК ПометкаУдаления,
	|	ТаблицаСделок.ДатаСделки КАК ДатаСделки,
	|	ТаблицаСделок.ВидСделки КАК ВидСделки,
	|	ТаблицаСделок.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	ТаблицаСделок.Контрагент КАК Контрагент,
	|	ТаблицаСделок.Врач КАК Врач,
	|	ТаблицаСделок.Врач.НаименованиеСокращенное КАК ВрачНаименованиеСокращенное,
	|	ТаблицаСделок.ПричинаОтказа КАК ПричинаОтказа,
	|	ТаблицаСделок.РезультатСделки КАК РезультатСделки,
	|	ТаблицаСделок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаСделок.ЭтапОтказа КАК ЭтапОтказа,
	|	ТаблицаСделок.ЭтапОтказаНомерЭтапа КАК ЭтапОтказаНомерЭтапа,
	|	ТаблицаСделок.ЭтапСделки КАК ЭтапСделки,
	|	ТаблицаСделок.ЭтапСделкиНомерЭтапа КАК ЭтапСделкиНомерЭтапа,
	|	ТаблицаСделок.ЭтапУспеха КАК ЭтапУспеха,
	|	ТаблицаСделок.ЭтапУспехаНомерЭтапа КАК ЭтапУспехаНомерЭтапа,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.ПредварительнаяЗапись ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.ПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.ПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка))
	|	КОНЕЦ КАК ПредварительнаяЗапись,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.ДатаПриема ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаПриема,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.ДатаСоздания ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.ДатаСоздания, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.ДатаСоздания, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.ПричинаОтмены ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.ПричинаОтмены, ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаписи.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.ПричинаОтмены, ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаписи.ПустаяСсылка))
	|	КОНЕЦ КАК ПричинаОтмены,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.Статус ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПустаяСсылка))
	|	КОНЕЦ КАК Статус,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаПрием.СсылкаНаПрием ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ТаблицаЗаписейНаПриемПоСсылке.СсылкаНаПрием, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗаписейНаПрием.СсылкаНаПрием, ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка))
	|	КОНЕЦ КАК СсылкаНаПрием,
	|	ТаблицаСделок.ЗапланированнаяПредварительнаяЗапись КАК ЗапланированнаяПредварительнаяЗапись,
	|	ТаблицаСделок.Номер КАК Номер,
	|	ТаблицаСделок.ЗапланированнаяЗадача КАК ЗапланированнаяЗадача,
	|	ТаблицаСделок.ПоследняяЗадача КАК ПоследняяЗадача,
	|	ТаблицаСделок.ПерваяДляВрача КАК ПерваяДляВрача
	|ПОМЕСТИТЬ ИтоговаяТаблицаСделок
	|ИЗ
	|	ТаблицаСделок КАК ТаблицаСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗаписейНаПрием КАК ТаблицаЗаписейНаПрием
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПоследнихЗаписейНаПрием КАК ТаблицаПоследнихЗаписейНаПрием
	|			ПО ТаблицаЗаписейНаПрием.ДатаПриема = ТаблицаПоследнихЗаписейНаПрием.ДатаПриема
	|				И ТаблицаЗаписейНаПрием.Врач = ТаблицаПоследнихЗаписейНаПрием.Врач
	|				И ТаблицаЗаписейНаПрием.Контрагент = ТаблицаПоследнихЗаписейНаПрием.Контрагент
	|				И ТаблицаЗаписейНаПрием.Сделка = ТаблицаПоследнихЗаписейНаПрием.Сделка
	|				И ТаблицаЗаписейНаПрием.СтруктурнаяЕдиница = ТаблицаПоследнихЗаписейНаПрием.СтруктурнаяЕдиница
	|		ПО ТаблицаСделок.Сделка = ТаблицаЗаписейНаПрием.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗаписейНаПрием КАК ТаблицаЗаписейНаПриемПоСсылке
	|		ПО ТаблицаСделок.ПредварительнаяЗапись = ТаблицаЗаписейНаПриемПоСсылке.ПредварительнаяЗапись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаписейНаПрием.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ТаблицаЗаписейНаПрием.Сделка КАК Сделка
	|ИЗ
	|	ТаблицаЗаписейНаПрием КАК ТаблицаЗаписейНаПрием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтоговаяТаблицаСделок КАК ИтоговаяТаблицаСделок
	|		ПО ТаблицаЗаписейНаПрием.Сделка = ИтоговаяТаблицаСделок.Сделка
	|ГДЕ
	|	ТаблицаЗаписейНаПрием.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И ИтоговаяТаблицаСделок.ЭтапСделкиНомерЭтапа = 3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументПрием.Ссылка КАК Прием,
	|	ДокументПрием.Сделка КАК Сделка
	|ИЗ
	|	Документ.Прием КАК ДокументПрием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтоговаяТаблицаСделок КАК ИтоговаяТаблицаСделок
	|		ПО ДокументПрием.Сделка = ИтоговаяТаблицаСделок.Сделка
	|ГДЕ
	|	ДокументПрием.Сделка <> ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|	И ИтоговаяТаблицаСделок.ЭтапСделкиНомерЭтапа = 3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(Продажи.Период) КАК Период,
	|	Продажи.Регистратор КАК Прием,
	|	ТаблицаСделок.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаПриемовПациентаДоСделки
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок
	|		ПО Продажи.Контрагент = ТаблицаСделок.Контрагент
	|			И (ТаблицаСделок.ДатаСделки > Продажи.Период)
	|ГДЕ
	|	Продажи.Регистратор ССЫЛКА Документ.Прием
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Регистратор,
	|	ТаблицаСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаПриемовПациентаДоСделки.Прием) КАК КоличествоПриемов,
	|	ТаблицаПриемовПациентаДоСделки.Сделка КАК Сделка
	|ПОМЕСТИТЬ ТаблицаКоличестваПриемовПациентаДоСделки
	|ИЗ
	|	ТаблицаПриемовПациентаДоСделки КАК ТаблицаПриемовПациентаДоСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПриемовПациентаДоСделки.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблицаСделок.Сделка КАК Сделка,
	|	ИтоговаяТаблицаСделок.Наименование КАК Наименование,
	|	ИтоговаяТаблицаСделок.ПометкаУдаления КАК ПометкаУдаления,
	|	ИтоговаяТаблицаСделок.ВидСделки КАК ВидСделки,
	|	ИтоговаяТаблицаСделок.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки,
	|	ИтоговаяТаблицаСделок.Контрагент КАК Контрагент,
	|	ИтоговаяТаблицаСделок.Врач КАК Врач,
	|	ИтоговаяТаблицаСделок.ВрачНаименованиеСокращенное КАК ВрачНаименованиеСокращенное,
	|	ИтоговаяТаблицаСделок.ПричинаОтказа КАК ПричинаОтказа,
	|	ИтоговаяТаблицаСделок.РезультатСделки КАК РезультатСделки,
	|	ИтоговаяТаблицаСделок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ИтоговаяТаблицаСделок.ЭтапОтказа КАК ЭтапОтказа,
	|	ИтоговаяТаблицаСделок.ЭтапОтказаНомерЭтапа КАК ЭтапОтказаНомерЭтапа,
	|	ИтоговаяТаблицаСделок.ЭтапСделки КАК ЭтапСделки,
	|	ИтоговаяТаблицаСделок.ЭтапСделкиНомерЭтапа КАК ЭтапСделкиНомерЭтапа,
	|	ИтоговаяТаблицаСделок.ЭтапУспеха КАК ЭтапУспеха,
	|	ИтоговаяТаблицаСделок.ЭтапУспехаНомерЭтапа КАК ЭтапУспехаНомерЭтапа,
	|	ИтоговаяТаблицаСделок.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ИтоговаяТаблицаСделок.ДатаПриема КАК ДатаПриема,
	|	ИтоговаяТаблицаСделок.ДатаСоздания КАК ДатаСоздания,
	|	ИтоговаяТаблицаСделок.ПричинаОтмены КАК ПричинаОтмены,
	|	ИтоговаяТаблицаСделок.Статус КАК Статус,
	|	ИтоговаяТаблицаСделок.СсылкаНаПрием КАК СсылкаНаПрием,
	|	ИтоговаяТаблицаСделок.ЗапланированнаяПредварительнаяЗапись КАК ЗапланированнаяПредварительнаяЗапись,
	|	ИтоговаяТаблицаСделок.Номер КАК Номер,
	|	ИтоговаяТаблицаСделок.ЗапланированнаяЗадача КАК ЗапланированнаяЗадача,
	|	ИтоговаяТаблицаСделок.ПоследняяЗадача КАК ПоследняяЗадача,
	|	ИтоговаяТаблицаСделок.ПерваяДляВрача КАК ПерваяДляВрача,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаКоличестваПриемовПациентаДоСделки.КоличествоПриемов, 0) > 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	|	КОНЕЦ КАК СтатусПациента
	|ИЗ
	|	ИтоговаяТаблицаСделок КАК ИтоговаяТаблицаСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКоличестваПриемовПациентаДоСделки КАК ТаблицаКоличестваПриемовПациентаДоСделки
	|		ПО ИтоговаяТаблицаСделок.Сделка = ТаблицаКоличестваПриемовПациентаДоСделки.Сделка";	
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗаписей 			= РезультатПакетаЗапросов[4].Выгрузить();
	ТаблицаПриемов 			= РезультатПакетаЗапросов[5].Выгрузить();
	ТаблицаСделок 			= РезультатПакетаЗапросов[8].Выгрузить();
	
	ДатаНачалоДня 			= НачалоДня(ТекущаяДатаСеанса());	
	МетаданныеСправочника 	= Метаданные.Справочники.Сделки;		
	Для Каждого СтрокаДанныеСделки Из ТаблицаСделок Цикл
		Сделка_Объект 							= СтрокаДанныеСделки.Сделка.ПолучитьОбъект();
		Сделка_Объект.СтатусПациента 			= СтрокаДанныеСделки.СтатусПациента;		
		Сделка_Объект.ВидСделки 				= ВидСделок__ПервичныйПовторныйПациент;
		Сделка_Объект.Наименование 				= СоздатьНаименованиеСделки(Сделка_Объект);		
		Сделка_Объект.НаименованиеСокращенное 	= ИнициализироватьСокращенноеНаименованиеСделки(Сделка_Объект
																								, 
																								, 
																								, 
																								, СтруктураНаименованияВида
																								, СтрокаДанныеСделки.ВрачНаименованиеСокращенное);	
		
		Если СтрокаДанныеСделки.ЭтапОтказаНомерЭтапа = 1 ИЛИ СтрокаДанныеСделки.ЭтапОтказаНомерЭтапа = 3 Тогда 
			Сделка_Объект.ЭтапОтказа = Этап1;			
		ИначеЕсли СтрокаДанныеСделки.ЭтапОтказаНомерЭтапа = 2 ИЛИ СтрокаДанныеСделки.ЭтапОтказаНомерЭтапа = 4 Тогда
			Если СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда 
				Сделка_Объект.ЭтапОтказа = Этап4;			
			Иначе 
				Сделка_Объект.ЭтапОтказа = Этап3;			
			   КонецЕсли;
		КонецЕсли;
		Если СтрокаДанныеСделки.ЭтапУспехаНомерЭтапа = 1 ИЛИ СтрокаДанныеСделки.ЭтапУспехаНомерЭтапа = 3 Тогда 
			Сделка_Объект.ЭтапУспеха = Этап1;			
		ИначеЕсли СтрокаДанныеСделки.ЭтапУспехаНомерЭтапа = 2 ИЛИ СтрокаДанныеСделки.ЭтапУспехаНомерЭтапа = 4 Тогда
			Если СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда 
				Сделка_Объект.ЭтапУспеха = Этап4;			
			Иначе 
				Сделка_Объект.ЭтапУспеха = Этап3;			
			   КонецЕсли;
		КонецЕсли;
		   
		ЗаписатьИзменениеСтатусаВПредварительнойЗаписи 	= Ложь;
		СтатусПредварительнойЗаписи 					= СтрокаДанныеСделки.Статус;
		ОчиститьЗапланированнуюЗапись 					= Ложь;
		Если СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 1 ИЛИ (СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 3 И ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием)) Тогда 
			Сделка_Объект.ЭтапСделки = Этап1;			
		ИначеЕсли СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 2 ИЛИ СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 4 ИЛИ (СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 3 И НЕ ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием)) Тогда
			Если СтрокаДанныеСделки.ДатаПриема < ДатаНачалоДня
				И ((НЕ СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемНачат И НЕ СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемОкончен) ИЛИ НЕ ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием)) Тогда
				Сделка_Объект.РезультатСделки 		= Перечисления.РезультатыСделок.Отказ;
				Сделка_Объект.ЭтапСделки 			= Справочники.ЭтапыСделок.Отказ;
				Сделка_Объект.ЭтапУспеха 			= Справочники.ЭтапыСделок.ПустаяСсылка();							
				Сделка_Объект.ДатаЗавершенияСделки 	= ?(ЗначениеЗаполнено(Сделка_Объект.ДатаЗавершенияСделки), Сделка_Объект.ДатаЗавершенияСделки, СтрокаДанныеСделки.ДатаПриема);				
				Если СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда 
					Сделка_Объект.ПричинаОтказа 	= ?(ЗначениеЗаполнено(Сделка_Объект.ПричинаОтказа), Сделка_Объект.ПричинаОтказа, ПричинаОтказа_КлиентОтказался);
				Иначе
					Сделка_Объект.ПричинаОтказа 	= ПричинаОтказа_КлиентНеПришел;
					Если НЕ СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся И ЗначениеЗаполнено(СтрокаДанныеСделки.ПредварительнаяЗапись) Тогда
						ЗаписатьИзменениеСтатусаВПредварительнойЗаписи = Истина;
						СтатусПредварительнойЗаписи = Перечисления.СтатусыСобытия.ПриемНеСостоялся;
					КонецЕсли;	
				КонецЕсли;
				ОчиститьЗапланированнуюЗапись 		= ЗначениеЗаполнено(СтрокаДанныеСделки.ЗапланированнаяПредварительнаяЗапись);
			ИначеЕсли ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием) И СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.ПриемОкончен Тогда	
				Сделка_Объект.РезультатСделки 		= Перечисления.РезультатыСделок.Успех;
				Сделка_Объект.ЭтапСделки 			= Справочники.ЭтапыСделок.Успех;
				Сделка_Объект.ЭтапУспеха 			= Справочники.ЭтапыСделок.Успех;											
				Сделка_Объект.ДатаЗавершенияСделки 	= ?(ЗначениеЗаполнено(Сделка_Объект.ДатаЗавершенияСделки), Сделка_Объект.ДатаЗавершенияСделки, СтрокаДанныеСделки.ДатаПриема);				
				ОчиститьЗапланированнуюЗапись 		= ЗначениеЗаполнено(СтрокаДанныеСделки.ЗапланированнаяПредварительнаяЗапись);				
			Иначе 	
				Если СтрокаДанныеСделки.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда 
					Сделка_Объект.ЭтапСделки 		= Этап4;			
				Иначе 
					Сделка_Объект.ЭтапСделки 		= Этап3;			
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаписатьИзменениеСтатусаВПредварительнойЗаписи Тогда 
			Запись_Объект 				= СтрокаДанныеСделки.ПредварительнаяЗапись.ПолучитьОбъект();
			Запись_Объект.Статус 		= СтатусПредварительнойЗаписи;
		КонецЕсли;
			
		Если ОчиститьЗапланированнуюЗапись Тогда
			СтрокаДанныеСделки.ЗапланированнаяПредварительнаяЗапись = Документы.Событие.ПустаяСсылка();
			НаборЗаписей 				= РегистрыСведений.СделкиСведенияДляСписка.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сделка.Установить(СтрокаДанныеСделки.Сделка);
			ЗаписьНабора 										= НаборЗаписей.Добавить();
			ЗаписьНабора.Сделка 								= СтрокаДанныеСделки.Сделка;
			ЗаписьНабора.ВидСделки 								= СтрокаДанныеСделки.ВидСделки;
			ЗаписьНабора.Номер 									= СтрокаДанныеСделки.Номер;
			ЗаписьНабора.ЗапланированнаяПредварительнаяЗапись 	= Документы.Событие.ПустаяСсылка();
			ЗаписьНабора.ЗапланированнаяЗадача 					= СтрокаДанныеСделки.ЗапланированнаяЗадача;
			ЗаписьНабора.ПоследняяЗадача 						= СтрокаДанныеСделки.ПоследняяЗадача;
			ЗаписьНабора.ПерваяДляВрача 						= СтрокаДанныеСделки.ПерваяДляВрача;
		КонецЕсли;

		НачатьТранзакцию();
		Попытка
			Если ЗаписатьИзменениеСтатусаВПредварительнойЗаписи Тогда 
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Запись_Объект);
			ИначеЕсли СтрокаДанныеСделки.РезультатСделки = Перечисления.РезультатыСделок.ПустаяСсылка() И СтрокаДанныеСделки.ЭтапСделкиНомерЭтапа = 3 И ЗначениеЗаполнено(СтрокаДанныеСделки.СсылкаНаПрием) Тогда 
				МассивСтрок = ТаблицаПриемов.НайтиСтроки(Новый Структура("Сделка", СтрокаДанныеСделки.Сделка));
				Для Каждого ЭлементКоллекции Из МассивСтрок Цикл 
					Если ЗначениеЗаполнено(ЭлементКоллекции.Прием) Тогда 
						Прием_Объект 		= ЭлементКоллекции.Прием.ПолучитьОбъект();
						Прием_Объект.Сделка = Справочники.Сделки.ПустаяСсылка();
						Попытка
							ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Прием_Объект);
						Исключение
							
						КонецПопытки;							
					КонецЕсли;	
				КонецЦикла;	
				МассивСтрок = ТаблицаЗаписей.НайтиСтроки(Новый Структура("Сделка", СтрокаДанныеСделки.Сделка));
				Для Каждого ЭлементКоллекции Из МассивСтрок Цикл 
					Если ЗначениеЗаполнено(ЭлементКоллекции.ПредварительнаяЗапись) Тогда 
						Запись_Объект 		= ЭлементКоллекции.ПредварительнаяЗапись.ПолучитьОбъект();
						Запись_Объект.Сделка = Справочники.Сделки.ПустаяСсылка();
						Попытка
							ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Запись_Объект);
						Исключение
							
						КонецПопытки;							
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;
			Если ОчиститьЗапланированнуюЗапись Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КонецЕсли;			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сделка_Объект);
			ЗафиксироватьТранзакцию();			
		Исключение
			ОтменитьТранзакцию();
			ШаблонКомментария = НСтр("ru = 'Ошибка конвертации сделки ""%1"" 
			|по причине: %2'");
		
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																				, СтрокаДанныеСделки.Наименование
																				, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
									, УровеньЖурналаРегистрации.Ошибка
									, МетаданныеСправочника
									,
									, Комментарий);
		КонецПопытки;	
	КонецЦикла;
	
	// Удаляем вид сделки
	ВидСделка_Объект = ВидСделок__ПостоянныеПациенты.ПолучитьОбъект();
	ВидСделка_Объект.ИмяПредопределенныхДанных = "";
	ВидСделка_Объект.ПометкаУдаления = Истина;
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ВидСделка_Объект);
	Исключение
		МетаданныеСправочника = Метаданные.Справочники.ВидыСделок;		
		ШаблонКомментария = НСтр("ru = 'Ошибка деактивации вида сделки ""%1"" 
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, ВидСделка_Объект.Наименование
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации()
								, УровеньЖурналаРегистрации.Ошибка
								, МетаданныеСправочника
								,
								, Комментарий);
	КонецПопытки;	
	
КонецПроцедуры

// Функция - Получить ранее созданные этапы
//
// Параметры:
//  ВидСделки	 - 	 - 
//  Удалены		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРанееСозданныеЭтапы(ВидСделки, Удалены = Истина)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСделки"		, ВидСделки);
	Запрос.УстановитьПараметр("ПометкаУдаления"	, Удалены);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сделки.ЭтапСделки КАК ЭтапСделки
	|ПОМЕСТИТЬ ТаблицаЭтапов
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сделки.ЭтапОтказа
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сделки.ЭтапУспеха
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ВидСделки = &ВидСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка КАК Этап,
	|	ЭтапыСделок.Наименование КАК Наименование,
	|	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	|	ЭтапыСделок.Предопределенный КАК Предопределенный
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаЭтапов.ЭтапСделки
	|			ИЗ
	|				ТаблицаЭтапов)
	|	И ЭтапыСделок.ПометкаУдаления = &ПометкаУдаления
	|	И ЭтапыСделок.ВидСделки = &ВидСделки
	|	И ЭтапыСделок.Предопределенный = ЛОЖЬ";
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

// Функция - Получить данные по сделкам для сквозной аналитики.
//
Функция ПолучитьДанныеПоСделкамДляСквознойАналитики(ТипВнешнейСистемы) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТипВнешнейСистемы) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтекИзмененийСтатусовСквознойАналитики.Объект КАК Объект,
	|	СтекИзмененийСтатусовСквознойАналитики.ВнешняяСистема КАК ВнешняяСистема,
	|	СтекИзмененийСтатусовСквознойАналитики.Статус КАК Статус,
	|	СтекИзмененийСтатусовСквознойАналитики.ЭтапСделки КАК ЭтапСделки,
	|	СтекИзмененийСтатусовСквознойАналитики.ДатаИзменения КАК ДатаИзменения
	|ПОМЕСТИТЬ ВТСтекССА
	|ИЗ
	|	РегистрСведений.СтекИзмененийСтатусовСквознойАналитики КАК СтекИзмененийСтатусовСквознойАналитики
	|ГДЕ
	|	СтекИзмененийСтатусовСквознойАналитики.ВнешняяСистема.ТипВнешнейСистемы = &ТипВнешнейСистемы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСтекССА.Объект КАК Объект,
	|	ЕСТЬNULL(Сделки.Ссылка, ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)) КАК Сделка
	|ПОМЕСТИТЬ ВТСделкиИзСтекаССА
	|ИЗ
	|	ВТСтекССА КАК ВТСтекССА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сделки КАК Сделки
	|		ПО (Сделки.Заявка = ВТСтекССА.Объект)
	|ГДЕ
	|	ВТСтекССА.Объект ССЫЛКА Справочник.Заявки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСтекССА.Объект,
	|	Сделки.Ссылка
	|ИЗ
	|	ВТСтекССА КАК ВТСтекССА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сделки КАК Сделки
	|		ПО (Сделки.Ссылка = ВТСтекССА.Объект)
	|			И (НЕ Сделки.ПометкаУдаления)
	|ГДЕ
	|	ВТСтекССА.Объект ССЫЛКА Справочник.Сделки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСтекССА.Объект КАК Объект,
	|	ВТСтекССА.ВнешняяСистема КАК ВнешняяСистема,
	|	ВТСтекССА.ВнешняяСистема.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВТСтекССА.Статус КАК Статус,
	|	ВТСтекССА.ДатаИзменения КАК ДатаИзменения,
	|	ЕСТЬNULL(ВТСтекССА.Объект.communication_id, 0) КАК communication_id,
	|	ЕСТЬNULL(ВТСтекССА.Объект.communication_type, 0) КАК communication_type,
	|	ЕСТЬNULL(Сделки.Ссылка, ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)) КАК Сделка,
	|	Сделки.Наименование КАК СделкаНаименование,
	|	Сделки.Код КАК СделкаКод,
	|	Сделки.ДатаСделки КАК СделкаДатаСделки,
	|	Сделки.Описание КАК СделкаОписание,
	|	Сделки.Заявка КАК Заявка,
	|	ЕСТЬNULL(Сделки.Прием.СуммаДокумента, 0) КАК ПриемСуммаДокумента,
	|	Сделки.СуммаСделки КАК СуммаСделки,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.Автор КАК СделкаАвтор,
	|	Сделки.Автор.Код КАК СделкаАвторКод,
	|	Сделки.Контрагент КАК Контрагент,
	|	Сделки.Контрагент.Наименование КАК КонтрагентНаименование,
	|	Сделки.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	Сделки.Контрагент.Код КАК КонтрагентКод,
	|	Сделки.Контрагент.ДатаРегистрации КАК КонтрагентДатаРегистрации,
	|	Сделки.Менеджер КАК Менеджер,
	|	Сделки.Менеджер.Наименование КАК МенеджерНаименование,
	|	Сделки.Менеджер.Код КАК МенеджерКод,
	|	Сделки.ВидСделки КАК ВидСделки,
	|	Сделки.ВидСделки.Наименование КАК ВидСделкиНаименование,
	|	Сделки.ВидСделки.Код КАК ВидСделкиКод
	|ИЗ
	|	ВТСделкиИзСтекаССА КАК ВТСделкиИзСтекаССА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтекССА КАК ВТСтекССА
	|		ПО ВТСделкиИзСтекаССА.Объект = ВТСтекССА.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сделки КАК Сделки
	|		ПО ВТСделкиИзСтекаССА.Сделка = Сделки.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИзменения");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", ТипВнешнейСистемы);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

// Функция - Получить таблицу истории изменений этапов сделки.
//
Функция ПолучитьТаблицуИсторииИзмененийЭтаповСделки(Сделка) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СделкиИсторияИзмененияЭтапов.Дата КАК Дата,
	|	СделкиИсторияИзмененияЭтапов.ПереходСЭтапа КАК ПереходСЭтапа,
	|	СделкиИсторияИзмененияЭтапов.ПереходНаЭтап КАК ПереходНаЭтап,
	|	СделкиИсторияИзмененияЭтапов.ПереходСЭтапа.Наименование КАК ПереходСЭтапаНаименование,
	|	СделкиИсторияИзмененияЭтапов.ПереходНаЭтап.Наименование КАК ПереходНаЭтапНаименование
	|ИЗ
	|	Справочник.Сделки.ИсторияИзмененияЭтапов КАК СделкиИсторияИзмененияЭтапов
	|ГДЕ
	|	СделкиИсторияИзмененияЭтапов.Ссылка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата");
	
	Запрос.УстановитьПараметр("Сделка", Сделка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли















