
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Номенклатура") 
		и Параметры.Отбор.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПередНачаломДобавления", элемент формы "Список"
//
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование и Элемент.ТекущиеДанные <> Неопределено Тогда
		отказ = Истина; 		
		Отбор = Новый Структура;
		Отбор.Вставить("Автор"              , Элемент.ТекущиеДанные.Автор);
		Отбор.Вставить("Актуальность"       , Элемент.ТекущиеДанные.Актуальность);
		Отбор.Вставить("ВидЦен"             , Элемент.ТекущиеДанные.ВидЦен);
		Отбор.Вставить("Номенклатура"       , Элемент.ТекущиеДанные.Номенклатура);
		Отбор.Вставить("Период"             , Элемент.ТекущиеДанные.Период);
		Отбор.Вставить("СтруктурнаяЕдиница" , Элемент.ТекущиеДанные.СтруктурнаяЕдиница);
		Отбор.Вставить("Цена"               , Элемент.ТекущиеДанные.Цена); 
		Отбор.Вставить("Упаковка"           , Элемент.ТекущиеДанные.Упаковка); 
		СтруктураПараметров = Новый Структура("КопированиеЦеныВРегистре", Отбор);
		ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.Форма.ФормаЗаписи", СтруктураПараметров);  		
	КонецЕсли;  	
	
КонецПроцедуры

#КонецОбласти