
#Область СлужебныеПроцедурыИФункции

// Функция, выполняющая отбор клиентов по заданному сегменту
//
Функция ВернутьКлиентовПоСегменту(Сегмент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыСегмента.Контрагент КАК Получатель,
		|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ПО КонтрагентыСегмента.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	КонтрагентыСегмента.Сегмент = &Сегмент
		|	И КонтрагентыКонтактнаяИнформация.Ссылка.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
		|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
		|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
		|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.НеУчаствоватьВРассылкеСообщений
		|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ЭтоГруппа";

	Запрос.УстановитьПараметр("Сегмент", Сегмент);	
		
	Таблица = Запрос.Выполнить().Выгрузить();
	МассивПолучателей 		= Таблица.ВыгрузитьКолонку("Получатель");
	МассивНомеровТелефонов 	= Таблица.ВыгрузитьКолонку("НомерТелефона");
	МассивНомеровИПолучателей = Новый Массив(2);
	МассивНомеровИПолучателей[0] = МассивПолучателей;
	МассивНомеровИПолучателей[1] = МассивНомеровТелефонов;
	Возврат МассивНомеровИПолучателей;
	
КонецФункции

#КонецОбласти