
#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды
//
Процедура Активировать(Команда)
	
	Если СофтФон = Неопределено Тогда
		ЭтаФорма.Закрыть();
	Иначе 		
		КодАктивации = Ключ1 + "-" + Ключ2 + "-" + Ключ3 + "-" + Ключ4 + "-" + Ключ5;				
		Ответ = СофтФон.ActivationHelixSoftPhone(КодАктивации, НазваниеОрганизации, Email);
		ПоказатьПредупреждение(,Ответ);
		Если СофтФон.GetActiveSoftPhone() Тогда		
			ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура Ключ1ПриИзменении(Элемент)
	
	КодАктивации = Ключ1 + "-" + Ключ2 + "-" + Ключ3 + "-" + Ключ4 + "-" + Ключ5;
	
	Если СтрДлина(КодАктивации) = 24 И ЗначениеЗаполнено(НазваниеОрганизации) и ЗначениеЗаполнено(Email) Тогда
		Элементы.Активировать.Доступность = Истина;
	Иначе
		Элементы.Активировать.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти