
#Область СлужебныеПроцедурыИФункции

// Функция возвращает текст надписи "Цены и валюта".
//
Функция СформироватьНадписьЦеныИВалюта(СтруктураНадписи, ВыводитьЗаголовок = Истина) Экспорт
	
	ТекстНадписи = "";
	
	//// Валюта.
	// Если СтруктураНадписи.УчетВалютныхОпераций Тогда
	//	Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
	//		ТекстНадписи = НСтр("ru = 'Валюта: %Валюта%, курс: %Курс%'");
	//		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
	//		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Курс%", ?((НЕ ЗначениеЗаполнено(СтруктураНадписи.ВалютаРасчетов)) ИЛИ
	//							СтруктураНадписи.ВалютаДокумента = СтруктураНадписи.ВалютаРасчетов, СокрЛП(Строка(СтруктураНадписи.Курс)),
	//							СокрЛП(Строка(СтруктураНадписи.КурсНациональнаяВалюта))));	
	//	Иначе
	//		ТекстНадписи = НСтр("ru = 'Валюта: <нет>'");
	//	КонецЕсли;
	// КонецЕсли;	
	
	// Вид цен.
	Если ВыводитьЗаголовок = Истина Тогда
		
		Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦен) Тогда
			Если ПустаяСтрока(ТекстНадписи) Тогда
				ТекстНадписи = ТекстНадписи + ?(СтруктураНадписи.Свойство("ВидЦенПродажи"), НСтр("ru = 'Вид цен закупки: %ВидЦен%'"), НСтр("ru = 'Вид цен: %ВидЦен%'"));
			Иначе	
				ТекстНадписи = ТекстНадписи + ?(СтруктураНадписи.Свойство("ВидЦенПродажи"), НСтр("ru = '; Вид цен закупки: %ВидЦен%'"), НСтр("ru = '; Вид цен: %ВидЦен%'"));
			КонецЕсли;	
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(СтруктураНадписи.ВидЦен)));
		КонецЕсли;  
		
	Иначе         
		
		Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦен) Тогда
			Если ПустаяСтрока(ТекстНадписи) Тогда
				ТекстНадписи = ТекстНадписи + НСтр("ru = '%ВидЦен%'");
			Иначе	
				ТекстНадписи = ТекстНадписи + НСтр("ru = '; %ВидЦен%'");
			КонецЕсли;	
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(СтруктураНадписи.ВидЦен)));
		КонецЕсли;       
		
	КонецЕсли;
	
	Если СтруктураНадписи.Свойство("ВидЦенПродажи") и ЗначениеЗаполнено(СтруктураНадписи.ВидЦенПродажи) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ru = 'Вид цен: %ВидЦен%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ru = '; Вид цен продажи: %ВидЦен%'");
		КонецЕсли;	
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(СтруктураНадписи.ВидЦенПродажи)));
	КонецЕсли;

	
	//// Вид скидки наценки.
	// Если ЗначениеЗаполнено(СтруктураНадписи.ВидСкидки) Тогда
	//	Если ПустаяСтрока(ТекстНадписи) Тогда
	//		ТекстНадписи = ТекстНадписи + НСтр("ru = 'Вид скидки: %ВидСкидкиНаценки%'");
	//	Иначе
	//		ТекстНадписи = ТекстНадписи + НСтр("ru = '; Вид скидки: %ВидСкидкиНаценки%'");
	//	КонецЕсли;	
	//	ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидСкидкиНаценки%", СокрЛП(Строка(СтруктураНадписи.ВидСкидки)));
	// КонецЕсли;
	
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьНадписьЦеныИВалюта()

// Функция, возвращает слово, которое конвертировано с русского на английский языки.
//  Параметры:
//   Текст - строка, содержит текст, который нужно конвертировать.
//  Возвращаемое значение:
//   Результат - строка, которая уже конвертирована.
//
Функция ТранслитерацияРусАнгл(Текст) Экспорт 

	Результат = "";
	СимволыРус = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"; 
	СимволыАнгл = "A|||B|||V|||G|||D|||E|||Yo||Zh||Z|||I|||Y|||K|||L|||M|||N|||O|||P|||R|||S|||T|||U|||F|||Kh||Ts||Ch||Sh||Sch|""|||Y|||`|||E|||Yu||Ja||"; 

	Для а = 1 по СтрДлина(Текст) Цикл 

		СимволТекста = Сред(Текст, а, 1); 

		Индекс = Найти(ВРег(СимволыРус), ВРег(СимволТекста)); 

		Если Индекс = 0 тогда 
			Результат = Результат + СимволТекста; 
		Иначе 
			ТрансСимволТекста = СтрЗаменить(Сред(СимволыАнгл, (Индекс - 1) * 4 + 1, 4), "|", "");
			Если (КодСимвола(СимволТекста) >= 97 И КодСимвола(СимволТекста) <= 122) ИЛИ (КодСимвола(СимволТекста) >= 1072 И КодСимвола(СимволТекста) <= 1103) Тогда
				ТрансСимволТекста = НРег(ТрансСимволТекста);
			КонецЕсли;
			Результат = Результат + ТрансСимволТекста;
		КонецЕсли 

	КонецЦикла ; 

	Возврат Результат; 

КонецФункции

// Функция, возвращает слово, которое конвертировано с английского на русский языки.
//  Параметры:
//   Текст - строка, содержит текст, который нужно конвертировать.
//  Возвращаемое значение:
//   Результат - строка, которая уже конвертирована.
//
Функция ТранслитерацияАнглРус(Текст) Экспорт 

	СимволыАнгл = "Sch|Yo||Zh||Kh||Ts||Ch||Sh||Yu||Ja||A|||B|||V|||G|||D|||E|||Z|||I|||Y|||K|||L|||M|||N|||O|||P|||R|||S|||T|||U|||F|||""|||Y|||`|||E|||"; 
	СимволыРус = "ЩЁЖХЦЧШЮЯАБВГДЕЗИЙКЛМНОПРСТУФЪЫЬЭ"; 

	Для а = 1 по СтрДлина(СимволыАнгл) / 4 Цикл 

		СимволСловаря = СтрЗаменить(Сред(СимволыАнгл, (а - 1) * 4 + 1, 4), "|", "");

		Текст = СтрЗаменить(Текст, НРег(СимволСловаря), НРег(Сред(СимволыРус, а, 1)));
		Текст = СтрЗаменить(Текст, ВРег(СимволСловаря), Сред(СимволыРус, а, 1));
		Текст = СтрЗаменить(Текст, СимволСловаря, Сред(СимволыРус, а, 1));
		
	КонецЦикла; 

	Возврат Текст; 

КонецФункции

&НаСервере
// Функция сортирует массив строк с указанным направлением сортировки
Функция СортироватьМассивСтрок(МассивСтрок,Напрвление = "Возр") Экспорт
	
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("Значения",Новый ОписаниеТипов("Строка"));
	Для Каждого ЭлементМ ИЗ МассивСтрок Цикл
		НоваяСтрока          = ТаблицаСортировки.Добавить();
		НоваяСтрока.Значения = ЭлементМ;
	КонецЦикла;		
	ТаблицаСортировки.Сортировать("Значения" + " " + Напрвление);
	Возврат ТаблицаСортировки.ВыгрузитьКолонку("Значения");
	
КонецФункции

// Функция "расщепляет" строку на подстроки, используя заданный
//      разделитель. Разделитель может иметь любую длину.
//      Если в качестве разделителя задан пробел, рядом стоящие пробелы
//      считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//      игнорируются.
//      Например,
//      РазложитьСтрокуВМассивПодстрок(",один,,,два", ",") возвратит массив значений из пяти элементов,
//      три из которых - пустые строки, а
//      РазложитьСтрокуВМассивПодстрок(" один   два", " ") возвратит массив значений из двух элементов
//
//  Параметры:
//      Стр -           строка, которую необходимо разложить на подстроки.
//                      Параметр передается по значению.
//      Разделитель -   строка-разделитель, по умолчанию - запятая.
//
//  Возвращаемое значение:
//      массив значений, элементы которого - подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
	
	// Результат = Новый Массив;
	//
	//// ------------для обеспечения обратной совместимости-----------
	// Если ПропускатьПустыеСтроки = Неопределено Тогда
	//	ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
	//	Если ПустаяСтрока(Строка) Тогда 
	//		Если Разделитель = " " Тогда
	//			Результат.Добавить("");
	//		КонецЕсли;
	//		Возврат Результат;
	//	КонецЕсли;
	// КонецЕсли;
	//// -------------------------------------------------------------
	//
	// Позиция = Найти(Строка, Разделитель);
	// Пока Позиция > 0 Цикл
	//	Подстрока = Лев(Строка, Позиция - 1);
	//	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
	//		Результат.Добавить(Подстрока);
	//	КонецЕсли;
	//	Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
	//	Позиция = Найти(Строка, Разделитель);
	// КонецЦикла;
	//
	// Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
	//	Результат.Добавить(Строка);
	// КонецЕсли;
	//
	// Возврат Результат;
	
	
	// -----------------------------Ранее написанный код--------------------------
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Строка = СокрЛП(Строка);
		Пока 1 = 1 Цикл
			Поз = Найти(Строка, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Строка);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Строка, Поз - 1));
			Строка = СокрЛ(Сред(Строка, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Строка, Разделитель);
			Если Поз = 0 Тогда
				Если (СокрЛП(Строка) <> "") Тогда
					МассивСтрок.Добавить(Строка);
				КонецЕсли;
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Строка,Поз - 1));
			Строка = Сред(Строка, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 

// Возвращает строку, полученную из массива элементов, разделенных символом разделителя
//
// Параметры:
//  Массив - Массив - массив элементов из которых необходимо получить строку
//  Разделитель - Строка - любой набор символов, который будет использован как разделитель между элементами в строке
//
// Возвращаемое значение:
//  Результат - Строка - строка, полученная из массива элементов, разделенных символом разделителя
// 
Функция ПолучитьСтрокуИзМассиваПодстрок(Массив, Разделитель = ",") Экспорт
	
	// возвращаемое значение функции
	Результат = "";
	
	Для Каждого Элемент ИЗ Массив Цикл
		
		Подстрока = ?(ТипЗнч(Элемент) = Тип("Строка"), Элемент, Строка(Элемент));
		
		РазделительПодстрок = ?(ПустаяСтрока(Результат), "", Разделитель);
		
		Результат = Результат + РазделительПодстрок + Подстрока;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// функция из текста формирует массив строк, разбитых по заданной ширине
//
Функция РазбитьТекстНаСтроки(Знач Текст, ШиринаСтрок) Экспорт
	
	ТаблицаШириныСимволов = Неопределено;
	
	МассивСтрок = Новый Массив;
	МассивШиринаСтрок = Новый Массив;
	Если ТипЗнч(ШиринаСтрок) = Тип("Строка") Тогда
		МассивШиринаСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШиринаСтрок, ",");
	ИначеЕсли ТипЗнч(ШиринаСтрок) = Тип("Число") Тогда
		МассивШиринаСтрок.Добавить(ШиринаСтрок);
	КонецЕсли;
	
	Для Каждого ШиринаСтроки Из МассивШиринаСтрок Цикл
		ШиринаСтроки = Число(ШиринаСтроки);// М*
		// Вычислим необходимое количество символов строки
		ВремШиринаСтроки = 0;
		ВремДлинаСтроки = 0;
		Пока ВремШиринаСтроки < ШиринаСтроки И ВремДлинаСтроки < СтрДлина(Текст) Цикл
			ВремДлинаСтроки = ВремДлинаСтроки + 1;
			ВремШиринаСтроки = ВремШиринаСтроки + ШиринаСимвола(Сред(Текст, ВремДлинаСтроки, 1), Истина, ТаблицаШириныСимволов);
			Если Сред(Текст, ВремДлинаСтроки, 1) = Символы.ПС Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Сделаем перенос по словам
		Если Сред(Текст, ВремДлинаСтроки, 1) <> Символы.ПС Тогда 
			Счетчик = 0;
			Пока Счетчик < ВремДлинаСтроки И ВремШиринаСтроки >= ШиринаСтроки Цикл
				Если Сред(Текст, ВремДлинаСтроки - Счетчик, 1) = " " Тогда
					ВремДлинаСтроки = ВремДлинаСтроки - Счетчик;
					Прервать;
				КонецЕсли;
				Счетчик = Счетчик + 1;
			КонецЦикла;
		КонецЕсли;
		
		ОбрезаннаяСтрока = Сред(Текст, 1, ВремДлинаСтроки);
		МассивСтрок.Добавить(ОбрезаннаяСтрока);
		Текст = Сред(Текст, СтрДлина(ОбрезаннаяСтрока) + 1);
		
		Если Текст <> "" И ТипЗнч(ШиринаСтрок) = Тип("Число") Тогда 
			МассивШиринаСтрок.Добавить(ШиринаСтрок);
		КонецЕсли;		
		
	КонецЦикла;

	Возврат МассивСтрок;
	
КонецФункции          

// функция определяет ширину символа
//
// Параметры
//  Символ - Строка, символ ширину которого необходимо вернуть
//  ПрямоеОпределение - Число, определять ширину символа, или среднюю ширину
//
// Возвращаемое значение:
//   Число
//
Функция ШиринаСимвола(Символ, ПрямоеОпределение = Истина, ТаблицаШириныСимволов = Неопределено) Экспорт
	
	Если ТаблицаШириныСимволов = Неопределено Тогда
		ТаблицаШириныСимволов = Новый ТабличныйДокумент;
		ТаблицаШириныСимволов.Область(1, 1).Текст = "ЙЫИ";
		ТаблицаШириныСимволов.Область(1, 1).Расшифровка = 40 / 31;
		ТаблицаШириныСимволов.Область(2, 1).Текст = "ЦУКНЗХВПЛСЬБвъRUSDHKZXCBN";
		ТаблицаШириныСимволов.Область(2, 1).Расшифровка = 40 / 40;
		ТаблицаШириныСимволов.Область(3, 1).Текст = "ЕГРИТЁ023456789_=+?йцуенхапролдэячситьбETPFLqeyuopasdghzxcvbn";
		ТаблицаШириныСимволов.Область(3, 1).Расшифровка = 40 / 47;
		ТаблицаШириныСимволов.Область(4, 1).Текст = "ШЩWw";
		ТаблицаШириныСимволов.Область(4, 1).Расшифровка = 40 / 28;
		ТаблицаШириныСимволов.Область(5, 1).Текст = "ЪФАОДЭЯМшщфыжмюQYOAGVMm";
		ТаблицаШириныСимволов.Область(5, 1).Расшифровка = 40 / 35;
		ТаблицаШириныСимволов.Область(6, 1).Текст = "Ж";
		ТаблицаШириныСимволов.Область(6, 1).Расшифровка = 40 / 23;
		ТаблицаШириныСимволов.Область(7, 1).Текст = "Ю";
		ТаблицаШириныСимволов.Область(7, 1).Расшифровка = 40 / 26;
		ТаблицаШириныСимволов.Область(8, 1).Текст = "1Jkз";
		ТаблицаШириныСимволов.Область(8, 1).Расшифровка = 40 / 57;	
		ТаблицаШириныСимволов.Область(9, 1).Текст = "-{}[]гкэrf";
		ТаблицаШириныСимволов.Область(9, 1).Расшифровка = 40 / 71;
		ТаблицаШириныСимволов.Область(10, 1).Текст = ".,:; t";
		ТаблицаШириныСимволов.Область(10, 1).Расшифровка = 40 / 95;
		ТаблицаШириныСимволов.Область(11, 1).Текст = "!Iijl";
		ТаблицаШириныСимволов.Область(11, 1).Расшифровка = 40 / 143;	
		ТаблицаШириныСимволов.Область(12, 1).Текст = "";
		ТаблицаШириныСимволов.Область(12, 1).Расшифровка = 40 / 71;
		ТаблицаШириныСимволов.Область(13, 1).Текст = "";
		ТаблицаШириныСимволов.Область(13, 1).Расшифровка = 40 / 95;
	КонецЕсли;

	Если ПрямоеОпределение = Истина Тогда
		НайденнаяШирина = ТаблицаШириныСимволов.НайтиТекст(Символ, , , , Ложь, , Ложь);
		ШиринаСимвола = ?(НайденнаяШирина <> Неопределено, НайденнаяШирина.Расшифровка, 0.78);
	Иначе
		ШиринаСимвола = 0.80;
	КонецЕсли;
	
	Возврат ШиринаСимвола*(40/37); // корректирующий коэффициент, т.к. в 8.3 ширина символов изменилась
	
КонецФункции

#КонецОбласти