
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ЦветФона) Тогда
		Элементы.КнопкаЦвет.ЦветФона = ЗначениеИзСтрокиВнутр(Объект.ЦветФона);
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Наименование при изменении.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура НаименованиеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.НаименованиеКратко) Тогда
		Объект.НаименованиеКратко = Объект.Наименование;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте  
// Процедура - Изменить цвет.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ИзменитьЦвет(Команда)
	
	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = Элементы.КнопкаЦвет.ЦветФона;
	#КонецЕсли
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатВыбораЦвета", ЭтотОбъект);
	ДиалогЦвета.Показать(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПройедурыИФункции

&НаКлиенте
// Процедура обработчик выбора цвета пользователем
//
Процедура РезультатВыбораЦвета(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда			
		Элементы.КнопкаЦвет.ЦветФона = Результат; 
		Объект.ЦветФона = ПолучитьСтрокуПоЦвету(Результат);			
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Изменить цвет фона на сервере.
//
// Параметры:
//  Цвет - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтрокуПоЦвету(Цвет)
	
	Возврат ЗначениеВСтрокуВнутр(Цвет);
	
КонецФункции

#КонецОбласти

