
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='Оборудование:'") + Символы.НПП  + Строка(Идентификатор);
	
	времПорт            	= Неопределено;
	времСервер          	= Неопределено;
	времКлюч	        	= Неопределено;
	времСтруктурнаяЕдиница 	= Неопределено;
    времВыбранныйОператор   = Неопределено;
	времАдресПубликации     = Неопределено;
	времТокен     			= Неопределено;
	
	Параметры.ПараметрыОборудования.Свойство("Сервер"          	  , времСервер);
	Параметры.ПараметрыОборудования.Свойство("Порт"            	  , времПорт);
	Параметры.ПараметрыОборудования.Свойство("Ключ"          	  , времКлюч);
	Параметры.ПараметрыОборудования.Свойство("СтруктурнаяЕдиница" , времСтруктурнаяЕдиница);
	Параметры.ПараметрыОборудования.Свойство("ВыбранныйОператор"  , времВыбранныйОператор);
	Параметры.ПараметрыОборудования.Свойство("АдресПубликации"    , времАдресПубликации);
	 
	
	Сервер             = ?(времСервер	          = Неопределено, ""	      , времСервер);	
	Порт               = ?(времПорт               = Неопределено, 80		  , времПорт);
	Ключ	           = ?(времКлюч	              = Неопределено, ""		  , времКлюч);
	СтруктурнаяЕдиница = ?(времСтруктурнаяЕдиница = Неопределено, Неопределено, времСтруктурнаяЕдиница);
	ВыбранныйОператор  = ?(времВыбранныйОператор  = Неопределено, Неопределено, времВыбранныйОператор);	
	Оператор		   = ?(ВыбранныйОператор     <> Неопределено И ВыбранныйОператор.Свойство("Представление"), ВыбранныйОператор.Представление, "");
	Токен 			   = ?(времТокен     		  = Неопределено, ПолучитьВнешнююСистему(), времТокен);   	
	АдресПубликации    = СменитьПубликацию(Ложь); 
	
	Если ПроверитьПодключениеВнешнейСистемы(Перечисления.ТипыВнешнихСистем.IPТелефония) Тогда
		ИспользоватьРетранслятор = Истина;
		АдресПубликации = СменитьПубликацию(Истина); 
	Иначе
		ИспользоватьРетранслятор = Ложь;		
	КонецЕсли;

	
	Если ЗначениеЗаполнено(Оператор) Тогда  		
		Элементы.ВыбратьОператора.Заголовок = "Изменить оператора";  		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьИЗакрытьВыполнить", ЭтотОбъект);

		ПоказатьВопрос(ОписаниеОповещения, "Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка выбора
//
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ВыбранныйОператор = ВыбранноеЗначение;
	Если ТипЗнч(ВыбранныйОператор) = Тип("Структура") И ВыбранныйОператор.Свойство("Представление") Тогда
		ЭтаФорма.Заголовок =  "Оборудование: 'IP-Телефония: ITOOLABS (" + ВыбранныйОператор.Представление + ")'";
		Оператор = ВыбранныйОператор.Представление;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Записать и закрыть выполнить
//
Процедура ЗаписатьИЗакрытьВыполнить(Результат, Параметры) Экспорт  	
	
	Если Результат = КодВозвратаДиалога.Да
		ИЛИ ТипЗнч(Результат) = Тип("КомандаФормы") Тогда
		
		НовыеЗначениеПараметров = Новый Структура;
		НовыеЗначениеПараметров.Вставить("Сервер"            , Сервер);
		НовыеЗначениеПараметров.Вставить("Порт"              , Порт);
		НовыеЗначениеПараметров.Вставить("Ключ"			     , Ключ);
		НовыеЗначениеПараметров.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		НовыеЗначениеПараметров.Вставить("ВыбранныйОператор" , ВыбранныйОператор);
		НовыеЗначениеПараметров.Вставить("АдресПубликации"   , АдресПубликации);
		НовыеЗначениеПараметров.Вставить("Токен"             , Токен);
		
		Результат = Новый Структура;
		Результат.Вставить("Идентификатор"        , ИзменитьНаименованиеИдентификатора(Идентификатор, ВыбранныйОператор));
		Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
		
		Модифицированность = Ложь;
		Закрыть(Результат);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключено к ретранслятору при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ИспользоватьРетрансляторПриИзменении(Элемент)
	
	ОписаниеОшибки   = "";
	ВыполненоУспешно = Ложь;
	Модифицированность = Истина;
	
	name_ATS = "";
	Если ТипЗнч(ЭтотОбъект.ВыбранныйОператор) = Тип("Структура") И ЭтотОбъект.ВыбранныйОператор.Свойство("Представление") Тогда		
		name_ATS = ЭтотОбъект.ВыбранныйОператор.Представление;		
	КонецЕсли;
	
	ДопПараметры = Новый Структура("operator_IP_telephony, name_ATS", "ITOOLABS", name_ATS);
	
	Если ИспользоватьРетранслятор Тогда 
		
		ВыполненоУспешно = ПодключитьВнешнююСистему(ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.IPТелефония"), ОписаниеОшибки, ДопПараметры);	
		
		Если ВыполненоУспешно Тогда			
			Токен = ПолучитьВнешнююСистему();
			АдресПубликации = СменитьПубликацию(Истина);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Источники заявок: " + ОписаниеОшибки); 		
		КонецЕсли;
		
	Иначе		
		
		ВыполненоУспешно = ОтключитьВнешнююСистему(ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.IPТелефония"), ОписаниеОшибки, ДопПараметры);
		
		Если ВыполненоУспешно Тогда  			
			Токен = ПолучитьВнешнююСистему();	
			АдресПубликации = СменитьПубликацию(Ложь);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Источники заявок: " + ОписаниеОшибки); 		
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Установить модифицированность при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура УстановитьМодифицированностьПриИзменении(Элемент)
	Модифицированность = Истина;
	 
	Токен = ?(ИспользоватьРетранслятор, Токен, Ключ);
КонецПроцедуры

&НаСервере
// Функция - Изменить наименование идентификатора
//
Функция ИзменитьНаименованиеИдентификатора(Ссылка, ВыбранныйОператор)
	
	Попытка
		ИдентификаторОбъект = Ссылка.ПолучитьОбъект();
		ИдентификаторОбъект.Наименование = "Оборудование: 'IP-Телефония: ITOOLABS (" + ВыбранныйОператор.Представление + ")'";
		ИдентификаторОбъект.Записать();
	Исключение
		Возврат Ссылка;
	КонецПопытки;	
	
	Возврат ИдентификаторОбъект.Ссылка;
	
КонецФункции

&НаКлиенте
// Процедура - Тест устройства
//
Процедура ТестУстройства(Команда)
	
	ОчиститьСообщения();
	СообщениеОшибки  = "";
	
	Результат = IPТелефония.ITOOLABS_ТестированиеСервера(Сервер, Порт, Ключ, СообщениеОшибки);
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден. Ошибка:" + Символы.ПС + " %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", СообщениеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, выбрать обератора.
//
Процедура ВыбратьОбератора(Команда)
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаСпискаОператоров", Новый Структура("ВыбранныйОператор", ВыбранныйОператор), ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, ПолучитьВнешнююСистему.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Функция ПроверитьПодключениеВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат ЗначениеЗаполнено(Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы));

КонецФункции

&НаСервереБезКонтекста
// Функция - Подключить внешнюю систему.
// 
Функция ПодключитьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Истина, ОписаниеОшибки, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат СоздатьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки, ДополнительныеПараметры);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Отключить внешнюю систему.
// 
Функция ОтключитьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда 		
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Ложь, ОписаниеОшибки, ДополнительныеПараметры);
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Создать внешнюю систему.
//
Функция СоздатьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема   = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(ТипВнешнейСистемы);
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();	
	РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, УидСессии,,, ДополнительныеПараметры);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Ложь, Ложь);
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
	Иначе
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Истина, Истина);
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
			
КонецФункции

&НаСервереБезКонтекста
// Функция, включает/отключает внешнюю систему.
//
Функция ОбновитьВнешнююСистему(ВнешняяСистема, Используется = Истина, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();		
	РезультатЗапроса = ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется, УидСессии,,, ДополнительныеПараметры);		
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Используется, Используется);				
	Иначе	
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;	
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Сменить публикацию
//
Функция СменитьПубликацию(Флаг = Ложь)
	
	АдресРетранслятора  = "http://cloud.stoma1c.ru/api";
	HTTPСервис = "/hs/Click2Call/itoolabs";			
	Токен = ?(ЗначениеЗаполнено(Токен), Токен, Ключ);	
	Если Флаг Тогда
		Возврат "" + АдресРетранслятора + HTTPСервис;
	Иначе 
		АдресПубликации = Константы.ВнешняяПубликацияАдрес.Получить();		
		АдресПубликации = СокрЛП(АдресПубликации);
		АдресПубликации = ?(СтрЗаканчиваетсяНа(АдресПубликации, "/"),  Лев(АдресПубликации, СтрДлина(АдресПубликации)-1), АдресПубликации);
		Возврат "" + АдресПубликации + HTTPСервис;
	КонецЕсли;		
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить внешнию систему
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВнешнююСистему() 	
	Возврат Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.IPТелефония).КлючПриложения;
КонецФункции   

#КонецОбласти