
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ОтборНомерЧекаККМПриИзменении(Элемент)
	
	ОтборНомерЧекаККМЧисло = 0;
	Попытка
		ОтборНомерЧекаККМЧисло = Число(ОтборНомерЧекаККМ);
	Исключение КонецПопытки;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "НомерЧекаККМ", ОтборНомерЧекаККМЧисло, ОтборНомерЧекаККМЧисло <> 0);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ОтборИдентификаторЗаписиПриИзменении(Элемент)
	
	ОтборИдентификаторЗаписи = СокрЛП(ОтборИдентификаторЗаписи);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ИдентификаторЗаписи", ОтборИдентификаторЗаписи, ОтборИдентификаторЗаписи <> "");
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ОтборДополнительныйРеквизитПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ДополнительныйРеквизит", ОтборДополнительныйРеквизит, ОтборДополнительныйРеквизит <> "");
	
КонецПроцедуры              

#КонецОбласти