
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КаталогДляСохраненияДанныхПечати = УправлениеПечатью.ПолучитьЛокальныйКаталогФайловПечати();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьККаталогуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПутьККаталогуПослеПодключения", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуПослеПодключения(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогОткрытияФайла.ПолноеИмяФайла = "";
		ДиалогОткрытияФайла.Каталог = КаталогДляСохраненияДанныхПечати;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите путь к каталогу для файлов печати'");
		ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ПутьККаталогуПослеВыбораФайла", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Для выбора каталога необходимо установить расширение для работы с файлами в Веб-клиенте.'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры1) Экспорт
	
	ДиалогОткрытияФайла = ДополнительныеПараметры1.ДиалогОткрытияФайла;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		КаталогДляСохраненияДанныхПечати = ДиалогОткрытияФайла.Каталог + "\";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	//УправлениеПечатью.СохранитьЛокальныйКаталогФайловПечати(КаталогДляСохраненияДанныхПечати);
	Закрыть(КаталогДляСохраненияДанныхПечати);
	
КонецПроцедуры

#КонецОбласти