
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница)  Тогда
		Объект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Период)  Тогда
		Объект.Период = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписки();

	ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ВсеСотрудники, ВсеСотрудники);
	ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.СотрудникиНаРабочемМесте, СотрудникиНаРабочемМесте);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВсеСотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомандаДобавитьВВыбранные(Неопределено);
КонецПроцедуры
		
&НаКлиенте
Процедура СотрудникиНаРабочемМестеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    КомандаУдалитьИзВыбранных(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДобавитьВВыбранные(Команда)
	
	// ТекущаяСтрока = Элементы.ВсеСотрудники.ТекущаяСтрока; 
	ТекДанные = Элементы.ВсеСотрудники.ТекущиеДанные;
	Если ТекДанные.Свойство("Сотрудник") Тогда
		ТекСтрока = ТекДанные.Сотрудник;
	Иначе
		ТекСтрока = Неопределено;
	КонецЕсли;	
	
	Если ТипЗнч(ТекСтрока)= Тип ("СправочникСсылка.Сотрудники")   Тогда
		ДатаПрибытия = ТекущаяДата();
		Ссылка = НайтиДокументСоздатьНовыйДокумент(ТекСтрока);
		Если Не Ссылка.Пустая() Тогда     
			НайтиСотрудника(Ссылка, ТекСтрока, ДатаПрибытия);
		КонецЕсли;
		
		ОбновитьСписки();
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ВсеСотрудники, ВсеСотрудники);
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.СотрудникиНаРабочемМесте, СотрудникиНаРабочемМесте);

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьИзВыбранных(Команда)	
	
	ТекущиеДанные = Элементы.СотрудникиНаРабочемМесте.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("Сотрудник") Тогда
		ТекущаяСтрока = ТекущиеДанные.Сотрудник;
	Иначе
		ТекущаяСтрока = Неопределено;
	КонецЕсли;	

	Если типЗнч(ТекущаяСтрока)= тип ("СправочникСсылка.Сотрудники")   Тогда
		ДатаПрибытия = Элементы.СотрудникиНаРабочемМесте.ТекущиеДанные.Начало;
		Ссылка = НайтиДокументСоздатьНовыйДокумент(ТекущаяСтрока);
		Если Не Ссылка.Пустая() Тогда     
			НайтиСотрудника(Ссылка, ТекущаяСтрока, ДатаПрибытия, Истина);
		КонецЕсли;		
		
		ОбновитьСписки();
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ВсеСотрудники, ВсеСотрудники);
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.СотрудникиНаРабочемМесте, СотрудникиНаРабочемМесте);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НайтиДокументСоздатьНовыйДокумент(Сотрудник)
	// Проверка на дубликат документа с ключевыми реквизитами
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕжедневныйОтчет.Ссылка
		|ИЗ
		|	Документ.ЕжедневныйОтчет КАК ЕжедневныйОтчет
		|ГДЕ
		|	ЕжедневныйОтчет.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ЕжедневныйОтчет.Дата >= &НачДата
		|	И ЕжедневныйОтчет.Дата <= &КонДата
		|	И ЕжедневныйОтчет.Проведен";

	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница); 	
	Запрос.УстановитьПараметр("НачДата", НачалоДня(ТекущаяДата())); 
	Запрос.УстановитьПараметр("КонДата",ТекущаяДата()); 

	РезультатТаблица = Запрос.Выполнить().Выгрузить();
	
	Если Не РезультатТаблица.Количество() > 0 Тогда
		// СоздатьНовыйДокумент
		// ТекущаяСтрока = Элементы.ВсеСотрудники.ТекущиеДанные.Сотрудник;//Элементы.ВсеСотрудники.ТекущаяСтрока;
		НовыйДокумент = Документы.ЕжедневныйОтчет.СоздатьДокумент();
		НовыйДокумент.ДатаОтчета = ТекущаяДата();
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Сотрудник = Сотрудник;
		НовыйДокумент.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
		НоваяСтрока = НовыйДокумент.ОтработанноеВремя.Добавить();
		НоваяСтрока.Сотрудник =  Сотрудник;
		НоваяСтрока.Начало = НачалоМинуты(ТекущаяДата());
		НоваяСтрока.Окончание = '00010101000000'; 
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Возврат  Документы.ЕжедневныйОтчет.ПустаяСсылка();
		// НовыйДокумент.Ссылка;
	Иначе
		Возврат РезультатТаблица[0].Ссылка;
    КонецЕсли;
КонецФункции

&НаСервере
Процедура НайтиСотрудника(Ссылка, ТекущаяСтрока, ДатаПрибытия, ЭтоУбытие = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                |	ЕжедневныйОтчетОтработанноеВремя.Сотрудник КАК Сотрудник,
	                |	ЕжедневныйОтчетОтработанноеВремя.Начало КАК Начало,
	                |	ЕжедневныйОтчетОтработанноеВремя.НомерСтроки КАК НомерСтроки
	                |ИЗ
	                |	Документ.ЕжедневныйОтчет.ОтработанноеВремя КАК ЕжедневныйОтчетОтработанноеВремя
	                |ГДЕ
	                |	ЕжедневныйОтчетОтработанноеВремя.Сотрудник = &Сотрудник
	                |	И ЕжедневныйОтчетОтработанноеВремя.Ссылка = &Ссылка
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	НомерСтроки УБЫВ";
	Запрос.УстановитьПараметр("Сотрудник", ТекущаяСтрока);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	ТекДок = Ссылка.ПолучитьОбъект();
	
	// если сотрудника не в найденном док
	Если Запрос.Выполнить().Пустой() Тогда
		НоваяСтрока = ТекДок.ОтработанноеВремя.Добавить();
		НоваяСтрока.Начало = НачалоМинуты(ТекущаяДата());
		НоваяСтрока.Окончание = '00010101000000';   
		НоваяСтрока.Сотрудник =  ТекущаяСтрока;
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);	// Прибытие первый раз
	КонецЕсли;
	// если сотрудник есть в док
	Пока Результат.Следующий() Цикл
		// нахожу в док строку найденного сотрудника
		Для каждого  ТекСтрока из  ТекДок.ОтработанноеВремя Цикл
			Если (ТекСтрока.НомерСтроки = Результат.НомерСтроки)  и (ТекСтрока.Сотрудник = Результат.Сотрудник) Тогда
				Начало = Лев(Прав(Строка(ТекСтрока.Начало),8),5);
				ДатаПрибытия = Лев(Прав(Строка(ДатаПрибытия),8),5);
				// если не заполнено окончание 
				Если  (Начало = ДатаПрибытия) и (ТекСтрока.Окончание = '00010101000000') Тогда 					
					ТекСтрока.Окончание = ТекущаяДата();
										
					// Проверим, есть ли начало и окончание работы сотрудника с одинаковым временем.
					Если ЭтоУбытие = Истина Тогда	
						МассивСтрокСОдинаковымВременем = ТекДок.ОтработанноеВремя.НайтиСтроки(Новый Структура("Сотрудник, Начало", ТекущаяСтрока, ТекСтрока.Начало));
						Если МассивСтрокСОдинаковымВременем.Количество() > 1 Тогда							
							ПриведеннаяДатаОкончания = Формат(ТекСтрока.Окончание, "ДФ='dd.MM.yyyy HH:mm'");							
							Для Каждого СтрокаТЧ ИЗ МассивСтрокСОдинаковымВременем Цикл								
								Если ПриведеннаяДатаОкончания = Формат(СтрокаТЧ.Окончание, "ДФ='dd.MM.yyyy HH:mm'") Тогда									
									ТекДок.ОтработанноеВремя.Удалить(ТекДок.ОтработанноеВремя.Индекс(ТекСтрока));
									Прервать;								
								КонецЕсли;							
							КонецЦикла;								
						КонецЕсли;  
					КонецЕсли;
					
					ТекДок.Записать(РежимЗаписиДокумента.Проведение); // Убытие
				Иначе
					// Прибытие - если сотрудник есть в док и заполены дата нач и оконч
					ТекСтрока = ТекДок.ОтработанноеВремя;
					НоваяСтрока = ТекСтрока.Добавить();
					НоваяСтрока.Начало = НачалоМинуты(ТекущаяДата());
					НоваяСтрока.Окончание = '00010101000000';    
					НоваяСтрока.Сотрудник =  ТекущаяСтрока;
					ТекДок.Записать(РежимЗаписиДокумента.Проведение); // Прибытие	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ОбновитьСписки();
	ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ВсеСотрудники, ВсеСотрудники);
	ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.СотрудникиНаРабочемМесте, СотрудникиНаРабочемМесте);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписки()
	
	ДеревоЭлементы = ВсеСотрудники.ПолучитьЭлементы();
	ДеревоЭлементы.Очистить();   	
	
	ЗапросВсеСотрудники = Новый Запрос("ВЫБРАТЬ   РАЗРЕШЕННЫЕ
	                                   |	Сотрудники.Ссылка КАК Сотрудник,
	                                   |	Сотрудники.Должность КАК Должность
	                                   |ИЗ
	                                   |	Справочник.Сотрудники КАК Сотрудники
	                                   |ГДЕ
	                                   |	Сотрудники.ЭтоГруппа = ЛОЖЬ
	                                   |	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	                                   |	И Сотрудники.Ссылка В
	                                   |			(ВЫБРАТЬ
	                                   |				НастройкиСотрудников.Сотрудник
	                                   |			ИЗ
	                                   |				РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	                                   |			ГДЕ
	                                   |				НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                                   |				И ВЫБОР
	                                   |					КОГДА НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	                                   |						ТОГДА НастройкиСотрудников.ДатаУвольнения > &НачалоПериод
	                                   |					ИНАЧЕ ИСТИНА
	                                   |				КОНЕЦ)
	                                   |	И НЕ Сотрудники.Ссылка В
	                                   |				(ВЫБРАТЬ
	                                   |					ВремяРаботыСотрудниковФакт.Сотрудник
	                                   |				ИЗ
	                                   |					РегистрСведений.ВремяРаботыСотрудниковФакт КАК ВремяРаботыСотрудниковФакт
	                                   |				ГДЕ
	                                   |					ВремяРаботыСотрудниковФакт.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                                   |					И ВремяРаботыСотрудниковФакт.ДатаВремяНачала >= &НачалоПериод
	                                   |					И ВремяРаботыСотрудниковФакт.ДатаВремяОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	                                   |
	                                   |УПОРЯДОЧИТЬ ПО
	                                   |	Сотрудники.Должность,
	                                   |	Сотрудники.Ссылка");
	
	
	ЗапросВсеСотрудники.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	ЗапросВсеСотрудники.УстановитьПараметр("НачалоПериод", НачалоДня(Объект.Период));
	
	Выборка = ЗапросВсеСотрудники.Выполнить().Выбрать();
	
	ВерхнийУровень = ДеревоЭлементы.Добавить();
	ВерхнийУровень.Сотрудник = "Все";
	ВерхнийУровень = ВерхнийУровень.ПолучитьЭлементы();
	
	Пока Выборка.СледующийПоЗначениюПоля("Должность") Цикл
						
		СтрокаДолжность           = ВерхнийУровень.Добавить();
		СтрокаДолжность.Сотрудник = Выборка.Должность;			 
		СтрокаДолжность = СтрокаДолжность.ПолучитьЭлементы();
		ВыборкаСотрудник = Выборка;
		
		Пока ВыборкаСотрудник.СледующийПоЗначениюПоля("Сотрудник") Цикл
			
			СтрокаСотрудник = СтрокаДолжность.Добавить();
			СтрокаСотрудник.Сотрудник = ВыборкаСотрудник.Сотрудник;
			
		КонецЦикла;	
			
	КонецЦикла;

	// ------------------------------------------	
	
	ДеревоЭлементы = СотрудникиНаРабочемМесте.ПолучитьЭлементы();
	ДеревоЭлементы.Очистить();  	
		
	ЗапросСотрудникиНаРабочемМесте = Новый Запрос("ВЫБРАТЬ
	                                              |	СпрСотрудники.Ссылка КАК Сотрудник,
	                                              |	СпрСотрудники.Должность КАК Должность,
	                                              |	МАКСИМУМ(ВремяРаботыСотрудниковФакт.ДатаВремяНачала) КАК Начало
	                                              |ИЗ
	                                              |	Справочник.Сотрудники КАК СпрСотрудники
	                                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВремяРаботыСотрудниковФакт КАК ВремяРаботыСотрудниковФакт
	                                              |		ПО СпрСотрудники.Ссылка = ВремяРаботыСотрудниковФакт.Сотрудник
	                                              |ГДЕ
	                                              |	ВремяРаботыСотрудниковФакт.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                                              |	И ВремяРаботыСотрудниковФакт.ДатаВремяНачала >= &НачалоПериод
	                                              |	И ВремяРаботыСотрудниковФакт.ДатаВремяОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                                              |
	                                              |СГРУППИРОВАТЬ ПО
	                                              |	СпрСотрудники.Должность,
	                                              |	СпрСотрудники.Ссылка
	                                              |
	                                              |УПОРЯДОЧИТЬ ПО
	                                              |	Должность,
	                                              |	Сотрудник,
	                                              |	Начало");
	
	ЗапросСотрудникиНаРабочемМесте.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	ЗапросСотрудникиНаРабочемМесте.УстановитьПараметр("НачалоПериод", НачалоДня(Объект.Период));
	
	Выборка = ЗапросСотрудникиНаРабочемМесте.Выполнить().Выбрать();
	
	ВерхнийУровень = ДеревоЭлементы.Добавить();
	ВерхнийУровень.Сотрудник = "Сотрудники на рабочем месте";
	ВерхнийУровень = ВерхнийУровень.ПолучитьЭлементы();
	
	Пока Выборка.СледующийПоЗначениюПоля("Должность") Цикл
						
		СтрокаДолжность           = ВерхнийУровень.Добавить();
		СтрокаДолжность.Сотрудник = Выборка.Должность;			 
		СтрокаДолжность = СтрокаДолжность.ПолучитьЭлементы();
		ВыборкаСотрудник = Выборка;
		
		Пока ВыборкаСотрудник.СледующийПоЗначениюПоля("Сотрудник") Цикл
			
			СтрокаСотрудник = СтрокаДолжность.Добавить();
			СтрокаСотрудник.Сотрудник = ВыборкаСотрудник.Сотрудник;
			СтрокаСотрудник.Начало = ВыборкаСотрудник.Начало;
			
		КонецЦикла;	
			
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти