
#Область СлужебныйПрограммныйИнтерфейс

#Область ХранилищеЛичногоКабинета

// Получить структуру данных хранения анкеты на клиенте
Функция ПолучитьПустуюСтруктуруДанныхАнкетыДляХраненияНаКлиенте() Экспорт
	
	ДанныеАнкеты = Новый Структура; 
	
	// Флаг успешной идентификации програмного продукта при первом запуске
	ДанныеАнкеты.Вставить("ИдентификацияПрограммногоПродуктаВыполнена" ,Неопределено);
	
    ДанныеАнкеты.Вставить("ПродуктРегистрационныйНомер"   ,Неопределено);
	
	// Фдаг успешного принятия регистрации на провреку
	ДанныеАнкеты.Вставить("РегистрацияПринята"                     ,Неопределено);	
	ДанныеАнкеты.Вставить("РегистрацияПоследнийКодСостояния"       ,Неопределено);
	ДанныеАнкеты.Вставить("РегистрацияОповещениеОСтатусеВыполнено" ,Неопределено);
    ДанныеАнкеты.Вставить("РегистрацияОтправитель"                 ,Неопределено);
	
	ДанныеАнкеты.Вставить("ДатаПоследнейВыпискиСчетаПоплненияСмсБаланса" ,Неопределено);
	
	Возврат ДанныеАнкеты; 
	
КонецФункции

// Функция - Личный кабинет создан
// 
// Возвращаемое значение:
//   - 
// 
Функция ЛичныйКабинетСоздан() Экспорт
	
  	 Возврат ПолучитьДанныеРегистрационнойАнкеты() <> Неопределено;
	
КонецФункции

// Функция - Получить регистрационный номер продукта
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьРегистрационныйНомерПродукта() Экспорт
	
	СтруктДанных = ПолучитьДанныеРегистрационнойАнкеты();
	
	Если СтруктДанных <> Неопределено 
		И СтруктДанных.Свойство("ПродуктРегистрационныйНомер")
		И ЗначениеЗаполнено(СтруктДанных.ПродуктРегистрационныйНомер) Тогда
		
		Возврат СтруктДанных.ПродуктРегистрационныйНомер;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Процедура - Записать код проверки рубликации
// 
Процедура ЗаписатьРегистрационныйНомер(РегистрационныйНомер) Экспорт
	
	ЗаписатьРеквизитВДанныеРегистрационнойАнкеты("ПродуктРегистрационныйНомер", РегистрационныйНомер);
	
КонецПроцедуры

// Функция, возвращает структуру данных анкеты продукта.
//
Функция ПолучитьСтруктуруДанныхРегистрационнойАнкеты() Экспорт
	
	ПараметрыРегистрации = ПолучитьДанныеРегистрационнойАнкеты();
	
	Если ПараметрыРегистрации = Неопределено Тогда
		ПараметрыРегистрации = ПолучитьПустуюСтруктуруДанныхАнкетыДляХраненияНаКлиенте();
	КонецЕсли;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

// Функция, возвращает реквизит из структуры данных регистрационной анкеты.
//
Функция ПолучитьРеквизитИзДанныхРегистрационнойАнкеты(НаименованиеРеквизита) Экспорт
	
	ПараметрыРегистрации = ПолучитьДанныеРегистрационнойАнкеты();
	
	Если ПараметрыРегистрации <> Неопределено И ПараметрыРегистрации.Свойство(НаименованиеРеквизита) Тогда
		Возврат ПараметрыРегистрации[НаименованиеРеквизита];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция вернет структуру данных анкеты продукта 
Функция ПолучитьДанныеРегистрационнойАнкеты() Экспорт
	
	СсылкаНаХранилище = Константы.ЛичныйКабинетХранилищеДанных.Получить();
	Если СсылкаНаХранилище <> Неопределено Тогда
		Возврат СсылкаНаХранилище.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Процедура, записывает реквизит в структуру данных регистрационной анкеты.
//
Процедура ЗаписатьРеквизитВДанныеРегистрационнойАнкеты(НаименованиеРеквизита, Значение) Экспорт
	
	ПараметрыРегистрации = ПолучитьСтруктуруДанныхРегистрационнойАнкеты();
	
	Если ПараметрыРегистрации.Свойство(НаименованиеРеквизита) Тогда
		ПараметрыРегистрации[НаименованиеРеквизита] = Значение;
	Иначе
		ПараметрыРегистрации.Вставить(НаименованиеРеквизита, Значение);
	КонецЕсли;
	
	ЗаписатьДанныеРегистрационнойАнкеты(ПараметрыРегистрации);
	
КонецПроцедуры

// Процедура запишит структуру данных анкеты продукта
// в хранилище данных
Процедура ЗаписатьДанныеРегистрационнойАнкеты(СтруктураДанных) Экспорт
	
	Константы.ЛичныйКабинетХранилищеДанных.Установить(Новый ХранилищеЗначения(СтруктураДанных));
	
КонецПроцедуры

// Процедура - Очистить хранилище личного кабинета
// 
Процедура ОчиститьХранилищеЛичногоКабинета() Экспорт
	
	Константы.ЛичныйКабинетХранилищеДанных.Установить(Неопределено);

КонецПроцедуры

// Процедура - Записать код проверки рубликации
// 
Процедура ЗаписатьКодПроверкиРубликации(КодПроверкиРубликации) Экспорт
	
	ЗаписатьРеквизитВДанныеРегистрационнойАнкеты("КодПроверкиРубликации", КодПроверкиРубликации);
	
КонецПроцедуры

// Функция - Получить код проверки рубликации
// 
// Возвращаемое значение:
//   - 
// 
функция ПолучитьКодПроверкиРубликации() Экспорт 
		
	ПараметрыРегистрации = ПолучитьДанныеРегистрационнойАнкеты();
	
	Если НЕ ПараметрыРегистрации = Неопределено
		И ПараметрыРегистрации.Свойство("КодПроверкиРубликации") Тогда
		
		Возврат ПараметрыРегистрации.КодПроверкиРубликации;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Методы_API_CRM

// Функция - Параметры подклчюения КAPIЛичного кабинета
// 
// Возвращаемое значение:
//   - 
// 
Функция ПараметрыПодклчюенияК_API_CRM() Экспорт
	
	// // Тестовый сервер                            
	// СтрПараметров = Новый Структура();
	// СтрПараметров.Вставить("АдресСервера"   , "localhost");
	// СтрПараметров.Вставить("АдресПубликации", "/CRM/hs/api/v1/");
	// СтрПараметров.Вставить("Пользователь"   , "wsdl");
	// СтрПараметров.Вставить("Пароль"         , "wsdl");
	
	// Боевой сервер
	СтрПараметров = Новый Структура();
	СтрПараметров.Вставить("АдресСервера"   , "app.1c.fitness");
	СтрПараметров.Вставить("АдресПубликации", "/mediator/hs/api/v1/");
	СтрПараметров.Вставить("Пользователь"   , Неопределено);
	СтрПараметров.Вставить("Пароль"         , Неопределено);
	
	Возврат СтрПараметров;
	
КонецФункции

#Область РегситрацияПродуктаИПоддержка

// Процедура - Зарегистрировать программный продукт
// 
функция ЗарегистрироватьПрограммныйПродукт() Экспорт
	
	Попытка
		
		УИД = ПолучитьУИДИнформационнойБазы();		
		Если НЕ ЗначениеЗаполнено(УИД) Тогда		
			УИД = УстановитьУИДИнформационнойБазы();			
		КонецЕсли;
		
		ДатаПервогоЗапуска = Константы.ДатаПервогоВходаВСистему.Получить();	
		Если НЕ ЗначениеЗаполнено(ДатаПервогоЗапуска) Тогда
			ДатаПервогоЗапуска = ТекущаяДата();
		КонецЕсли;
		
		Артикул                = ПолучитьАртикулПродукта();
		КлючЗащитыИспользуется = КлючЗащитыИспользуется();
		
		ПарамтерыЗапроса = Новый Структура("info_base_uid,date_first_launch,security_key_used,vendor_code",
		УИД,
		ДатаПервогоЗапуска,
		КлючЗащитыИспользуется,
		Артикул);
		
		ТекстЗапроса      = СобратьJson(ПарамтерыЗапроса);	
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("products/installation", ТекстЗапроса); 
	    РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);

		// Запись в журнал регистрации
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			ЗаписатьРеквизитВДанныеРегистрационнойАнкеты("ИдентификацияПрограммногоПродуктаВыполнена", Истина);
		КонецЕсли;
		
	Исключение
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Проверить регистрационный номер
// 
// Параметры:
//  РегистрационныйНомер - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПроверитьРегистрационныйНомер(РегистрационныйНомер) Экспорт
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("registrationnumber", РегистрационныйНомер);		
		ЗаголовкиHTTP.Вставить("vendorcode"        , ПолучитьАртикулПродукта());
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("registration_number/validate", ЗаголовкиHTTP);		
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			
			РезультатаОперции.Вставить("ФорматНомераВерен" , РезультатаОперции.ПараметрыРезультата.number_valid);
			РезультатаОперции.Вставить("ОписаниеРезультата", РезультатаОперции.ПараметрыРезультата.description);
			
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());

	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Отправить запрос на RemoteAccessService для регистрации новой анкеты.
// Результат - код ответа и тектс описания резкльтата
Функция ЗарегистрироватьАнкетуПродукта(ПараметрыРегистрации) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка				
		
		СкринАнкетыBase64 = Base64Строка(ПараметрыРегистрации.ПродуктСкринАнкеты);
		
		contact_person = Новый Структура();
		contact_person.Вставить("name" , ПараметрыРегистрации.КонтактноеЛицоИмя);
		contact_person.Вставить("phone", ПараметрыРегистрации.КонтактноеЛицоТелефон);
		contact_person.Вставить("mail" , ПараметрыРегистрации.КонтактноеЛицоПочта);
		
		clinic = Новый Структура();
		clinic.Вставить("type" , ПараметрыРегистрации.КлиникаТип);
		clinic.Вставить("name" , ПараметрыРегистрации.КлиникаНаименование);
		clinic.Вставить("city" , ПараметрыРегистрации.КлиникаГород);
		clinic.Вставить("area" , ПараметрыРегистрации.КлиникаРазмер);
		
		organization = Новый Структура();
		organization.Вставить("name"                   , ПараметрыРегистрации.ОрганизацияНаименование);
		organization.Вставить("address_string"         , ПараметрыРегистрации.ОрганизацияАдресСтрокой);
		organization.Вставить("address_xml"            , ПараметрыРегистрации.ОрганизацияАдресXML);
		organization.Вставить("phone"                  , ПараметрыРегистрации.ОрганизацияТелефон);
		organization.Вставить("mail"                   , ПараметрыРегистрации.ОрганизацияПочта);
		organization.Вставить("inn"                    , ПараметрыРегистрации.ОрганизацияИНН);
		organization.Вставить("responsible_id"         , ПараметрыРегистрации.ОрганизацияОтправительИД);
		organization.Вставить("responsible_full_name"  , ПараметрыРегистрации.ОрганизацияОтправительПолноеИмя);
		
		product = Новый Структура();
		product.Вставить("registration_number"         , ПараметрыРегистрации.ПродуктРегистрационныйНомер);
		product.Вставить("password_to_access"          , ПараметрыРегистрации.ПродуктПароль);
		product.Вставить("vendor_code"                 , ПараметрыРегистрации.ПродуктАртикул);
		product.Вставить("profile_picture"             , СкринАнкетыBase64);
		product.Вставить("name"                        , ПараметрыРегистрации.ПродуктНаименование);
		product.Вставить("date_first_launch"           , ПараметрыРегистрации.ПродуктДатаПевогоЗапуска);
		product.Вставить("uid_info_base"               , ПараметрыРегистрации.ПродуктУИДБазы);
		product.Вставить("security_key_used"           , ПараметрыРегистрации.ПродуктСЛКиспользуется);
		
		ПарамтерыЗапроса = Новый Структура("contact_person,club,organization,product",
		contact_person,
		clinic,
		organization,
		product);
		
		ТекстЗапроса     = СобратьJson(ПарамтерыЗапроса);		
		РезультатЗапроса = ВыполнитьPOSTЗапрос("products/registration", ТекстЗапроса); 
		
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);	
		
		РезультатаОперции.Вставить("РегистрацияПринята");
		РезультатаОперции.Вставить("ОписаниеРезультата");
		РезультатаОперции.Вставить("СтатусАнкетыКод");
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			
			РезультатаОперции.РегистрацияПринята     = РезультатЗапроса.parameters.result;
			РезультатаОперции.ОписаниеРезультата     = РезультатЗапроса.parameters.description;
			РезультатаОперции.СтатусАнкетыКод        = РезультатЗапроса.parameters.state_code;
			
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		РезультатаОперции.Вставить("ОписаниеРезультата");
		РезультатаОперции.ОписаниеРезультата = "Не удалось зарегистрировать анкету";
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция, возвращает состояние анкеты из CRM.
//
Функция ДанныеПоСостояниюАнкетыПродукта(РегистрационныйНомер) Экспорт
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("registrationnumber", РегистрационныйНомер);
		ЗаголовкиHTTP.Вставить("vendorcode"		   , ПолучитьАртикулПродукта());
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("products/registration", ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		РезультатаОперции.Вставить("СтатусРегистрацииКод");
		РезультатаОперции.Вставить("СтатусРегистрацииОписание");
		РезультатаОперции.Вставить("РегистрацияПринята", Ложь);
		
		РезультатаОперции.Вставить("ТехническаяПоддержкаРазрешена");
		РезультатаОперции.Вставить("ТехническаяПоддержкаСтатус");
		РезультатаОперции.Вставить("ТехническаяПоддержкаОписание");
			
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			
			РезультатаОперции.СтатусРегистрацииКод      = РезультатаОперции.ПараметрыРезультата.registration.state_code;
			РезультатаОперции.СтатусРегистрацииОписание = РезультатаОперции.ПараметрыРезультата.registration.description;
			РезультатаОперции.РегистрацияПринята        = РезультатаОперции.СтатусРегистрацииКод = 304;
			
			РезультатаОперции.ТехническаяПоддержкаРазрешена  = РезультатаОперции.ПараметрыРезультата.support.allow;
			РезультатаОперции.ТехническаяПоддержкаСтатус     = РезультатаОперции.ПараметрыРезультата.support.state_code;
			РезультатаОперции.ТехническаяПоддержкаОписание   = РезультатаОперции.ПараметрыРезультата.support.description;
			
		КонецЕсли;
		
	Исключение
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

#КонецОбласти

#Область ЛичныйКабинет

// Функция - Войти в личный кабинет
// 
// Параметры:
//  РегистрационныйНомер - 	 - 
//  ПарольДоступа		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВойтиВЛичныйКабинет(РегистрационныйНомер, ПарольДоступа) Экспорт
		
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("registrationnumber", РегистрационныйНомер);	
		ЗаголовкиHTTP.Вставить("userpassword"      , ПарольДоступа);
		ЗаголовкиHTTP.Вставить("vendorcode"        , ПолучитьАртикулПродукта());
	
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("account/auth", Неопределено, ЗаголовкиHTTP);	
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			
			РезультатаОперции.Вставить("ВходРазрешен"      , РезультатаОперции.ПараметрыРезультата.access_allow);
			РезультатаОперции.Вставить("ОписаниеРезультата", РезультатаОперции.ПараметрыРезультата.description);
			РезультатаОперции.Вставить("УИДСессии"         , РезультатаОперции.ПараметрыРезультата.uid_session);
			
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	    РезультатаОперции.Вставить("ВходРазрешен"      , Неопределено);
		РезультатаОперции.Вставить("ОписаниеРезультата", "Ошибка работы с личным кабинетом");
		РезультатаОперции.Вставить("УИДСессии"         , Неопределено);

	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

// Функция - Войти в личный кабинет модель сервиса
// 
// Возвращаемое значение:
//   - 
// 
Функция ВойтиВЛичныйКабинетМодельСервиса() Экспорт
	
	Попытка 
		
		АдресЛичногоКабинетаВМоделиСервиса = Константы.АдресЛичногоКабинетаВМоделиСервиса.Получить();
		
		Если НЕ ЗначениеЗаполнено(АдресЛичногоКабинетаВМоделиСервиса) Тогда
			ВызватьИсключение "Константа АдресЛичногоКабинетаВМоделиСервиса не заполнена!";
		КонецЕсли;
		
		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресЛичногоКабинетаВМоделиСервиса 
		     + ?(СтрЗаканчиваетсяНа(АдресЛичногоКабинетаВМоделиСервиса,"/"), "hs/api_private/v1/", "/hs/api_private/v1/")); 
		
		ПараметрыОсновные = ПараметрыПодклчюенияК_API_CRM();
		СтрПараметров     = Новый Структура;
		СтрПараметров.Вставить("АдресСервера"   , СтруктураURI.Хост);
		СтрПараметров.Вставить("АдресПубликации", СтруктураURI.ПутьНаСервере);
		СтрПараметров.Вставить("Пользователь"   , ПараметрыОсновные.Пользователь);
		СтрПараметров.Вставить("Пароль"         , ПараметрыОсновные.Пароль);
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("areanumber", ПолучитьНомерОбласти());
		
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("account/auth", Неопределено, ЗаголовкиHTTP, СтрПараметров);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			
			РезультатаОперции.Вставить("ВходРазрешен"        , РезультатаОперции.ПараметрыРезультата.access_allow);
			РезультатаОперции.Вставить("ОписаниеРезультата"  , РезультатаОперции.ПараметрыРезультата.description);
			РезультатаОперции.Вставить("УИДСессии"           , РезультатаОперции.ПараметрыРезультата.uid_session);
			РезультатаОперции.Вставить("РегистрационныйНомер", РезультатаОперции.ПараметрыРезультата.registration_number);

		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	    РезультатаОперции.Вставить("ВходРазрешен"        , Неопределено);
		РезультатаОперции.Вставить("ОписаниеРезультата"  , "Ошибка работы с личным кабинетом");
		РезультатаОперции.Вставить("УИДСессии"           , Неопределено);
        РезультатаОперции.Вставить("РегистрационныйНомер", Неопределено);

	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

// Функция - Проверить состояние сессии
// 
// Параметры:
//  РегистрационныйНомер - 	 - 
//  УидСессии			 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПроверитьСостояниеСессии(УидСессии) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("uidsession", УидСессии);
	
		РезультатЗапроса  = ВыполнитьGETЗапрос("account/session", ЗаголовкиHTTP);	
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			
			РезультатаОперции.Вставить("ВходРазрешен"      , РезультатаОперции.ПараметрыРезультата.access_allow);
			РезультатаОперции.Вставить("ОписаниеРезультата", РезультатаОперции.ПараметрыРезультата.description);
			
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

#Область СессииКлиента

// Процедура - Установить уид открытой сессии
// 
// Параметры:
//  УидСессии	 - 	 - 
// 
Процедура УстановитьУидОткрытойСессии(УидСессии) Экспорт
	
	Константы.ЛичныйКабинетИдентификаторСессии.Установить(УидСессии);
	
КонецПроцедуры

// Функция - Получить уид текущей сессии
// 
// Возвращаемое значение:
//   - 
// 
Функция УидТекущейСессии() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.ЛичныйКабинетИдентификаторСессии.Получить();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Смс_сервисы 

// Функция - Получить предложение для пополения баланса смс сервиса
// 
// Параметры:
//  СмсСервис	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьПредложениеДляПополенияБалансаСмсСервиса(СмсСервис) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("smsservicelogin", СмсСервис.Пользователь); 	
		ЗаголовкиHTTP.Вставить("productname"    , ПолучитьАртикулПродукта());		
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("sms_service/recommendable_payment", ЗаголовкиHTTP);	
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Выставить счет на пополнение смс сервиса
// 
// Параметры:
//  СмсСервис	 - 	 - 
//  СуммаСчета	 - 	 - 
//  ЭлПота		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
функция ВыставитьСчетНаПополнениеСмсСервиса(СмсСервис, СуммаСчета, ЭлектроннаяПочта) Экспорт
		
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ПарамтерыЗапроса = Новый Структура("sms_service_login,amount_payment,email_for_invoice",
		СмсСервис.Пользователь,
		СуммаСчета,
		ЭлектроннаяПочта);
				
		ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
		
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("sms_service/invoice", ТекстЗапроса);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

// Функция - Изменить значение критического баланса смс сервиса
// 
// Параметры:
//  МинимальныйБаланс	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ИзменитьЗначениеКритическогоБалансаСмсСервиса(СмсСервис, МинимальныйБаланс) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ПарамтерыЗапроса = Новый Структура("sms_service_login,update_min_balance,product_name",
		СмсСервис.Пользователь,
		МинимальныйБаланс, 
		ПолучитьАртикулПродукта());		
		
		ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
		
		РезультатЗапроса  = ВыполнитьPUTЗапрос("sms_service/min_balance", ТекстЗапроса);    
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

// Функция возвращает информацию по договорам СМС пользователя в CRM
// 
Функция ПолучитьДоговорыПользователя(УидСессии) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("uidsession", УидСессии);
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("sms_service/contracts", ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция возвращает договоры пользователя из CRM и массив счетов по каждому договору
// 
Функция ПолучитьДоговорыПользователяСИсториейСчетов(УидСессии) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("uidsession" , УидСессии);
		ЗаголовкиHTTP.Вставить("getinvoices", "True");
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("contracts_and_invoices", ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция возвращает историю счетов на оплату по СМС-сервису пользователя
// 
Функция ПолучитьИсториюСчетов(УидСессии, СмсСервис) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("uidsession"		, УидСессии);
		ЗаголовкиHTTP.Вставить("smsservicelogin", СмсСервис.Пользователь);
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("sms_service/invoice", ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция отправляет счет на оплату на указанную почту
// 
Функция ОтправитьСчетаНаОплатуНаПочту(УидСессии, УидСчета, Email) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("uidsession"	, УидСессии);
		ЗаголовкиHTTP.Вставить("uidinvoice" , УидСчета);
		ЗаголовкиHTTP.Вставить("mailaddress", Email);
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("sms_service/invoice/printed_form_to_mail", ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция получает файл .pdf со счетом на оплату
// 
Функция ПолучитьДвоичныеДанныеФайлаСчета(УидСессии, УидСчета) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("uidsession"	, УидСессии);
		ЗаголовкиHTTP.Вставить("uidinvoice" , УидСчета);
		
		РезультатаОперции = ВыполнитьGETЗапрос("sms_service/invoice/printed_form_pdf", ЗаголовкиHTTP,, Истина);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция проверяет наличие подарочной приветственной суммы СМС
// 
Функция ПроверитьНаличиеПодарка(РегистрационныйНомер = Неопределено, НомерОбласти = Неопределено) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;
		
		Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
			ЗаголовкиHTTP.Вставить("registrationnumber", РегистрационныйНомер);
		ИначеЕсли ЗначениеЗаполнено(НомерОбласти) Тогда
			ЗаголовкиHTTP.Вставить("areanumber"		   , НомерОбласти);
		Иначе
			ВызватьИсключение "Не передан регистрационный номер и номер области!";
		КонецЕсли;
		
		ЗаголовкиHTTP.Вставить("vendorcode"        , ПолучитьАртикулПродукта());
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("sms_service/welcome_amount", ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение     	
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция возвращает подарочную сумму, начисляемую при регистрации
// 
Функция ПолучитьПодарочнуюСумму() Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("sms_service/welcome_amount_sum");
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция отправляет запрос на начисление приветственной суммы на счет СМС-сервиса
// 
Функция ПолучитьПодарок(УидСессии) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("uidsession", УидСессии);
		
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("sms_service/welcome_amount",, ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Проверить модерацию подписи сервиса СМС
// 
// Параметры:
//  ЛогинСервисаСМС	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПроверитьМодерациюПодписиСервисаСМС(ЛогинСервисаСМС) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("smsservicelogin", ЛогинСервисаСМС);
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("sms_service/contracts/sign_statuses", ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

#КонецОбласти

#Область ВнешниеСистемы

// Функция - Создать внешнюю систему в CRM
// 
// Параметры:
//  ВнешняяСистемаВБазе	 - 	 - 
//  ТекущаяСессия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема
								 , ТекущаяСессия
								 , loginEvotor = Неопределено
								 , passwordEvotor =  Неопределено
								 , ДополнительныеПараметры = Неопределено) Экспорт
	
	Возврат ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема,, ТекущаяСессия, loginEvotor, passwordEvotor, ДополнительныеПараметры);
	
КонецФункции

// Функция - Обновить внешнюю систему в CRM
// 
// Параметры:
//  ВнешняяСистемаВБазе	 - 	 - 
//  Используется		 - 	 - 
//  ТекущаяСессия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема
								  , Используется = Истина
								  , ТекущаяСессия
								  , loginEvotor = Неопределено
								  , passwordEvotor =  Неопределено
								  , ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Попытка 
		
		ПользовательПубликации = Константы.ВнешняяПубликацияПользователь.Получить();
		
		Если Не ЗначениеЗаполнено(ПользовательПубликации) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
			
			Если Не ЗначениеЗаполнено(СлужебныйПользователь) Тогда			
				СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();				
			КонецЕсли;
			
			Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
			
			ПользовательПубликации = СлужебныйПользователь;
			
		КонецЕсли;
		
		ПользовательСистемный = ПользователиСтоматология.ПолучитьПользователяПоУникальномуИдентификатору(ПользовательПубликации.ИдентификаторПользователяИБ);
		
		Если ПользовательСистемный = Неопределено Тогда				
			ПользователиСтоматология.СоздатьСлужебногоПользователяAPIДляСотрудника(ПользовательПубликации);
			ПользовательСистемный = ПользователиСтоматология.ПолучитьПользователяПоУникальномуИдентификатору(ПользовательПубликации.ИдентификаторПользователяИБ);				
		КонецЕсли;
		
		ЭтоОблачник 		  = ЛичныйКабинет.ЛиныйКабинетВМоделиСервиса();
		АдресПубликации       = Константы.ВнешняяПубликацияАдрес.Получить();
		КодПроверкиПубликации = Строка(Новый УникальныйИдентификатор);
		
		ЗаписатьКодПроверкиРубликации(КодПроверкиПубликации);
		
		ДанныеАнкеты = ЛичныйКабинет.ПолучитьДанныеРегистрационнойАнкеты();
		Если Не ЗначениеЗаполнено(ДанныеАнкеты) Тогда
			ВызватьИсключение "Данные регистрационной анкеты не заполнены";
		КонецЕсли;
		
		РегистрационныйНомерАнкеты = ДанныеАнкеты.ПродуктРегистрационныйНомер;
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("session", ТекущаяСессия);
		
		ПарамтерыЗапроса = Новый Структура;
		ПарамтерыЗапроса.Вставить("publication_address", АдресПубликации);
		ПарамтерыЗапроса.Вставить("publication_user"   , ПользовательСистемный.Имя);
		ПарамтерыЗапроса.Вставить("check_code"         , КодПроверкиПубликации);		
		ПарамтерыЗапроса.Вставить("registration_number", РегистрационныйНомерАнкеты);
		
		ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
		
		Попытка
			РезультатЗапроса = ВыполнитьPOSTЗапрос("products/publication_validate", ТекстЗапроса, ЗаголовкиHTTP);
		Исключение
			Возврат ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		КонецПопытки;
		
		РезультатПроверкиПубликации = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);	
		
		// Ошибка 1057 - в случае когда на стороне crm нет внешних систем по данной анкете.
		Если Не РезультатПроверкиПубликации.ВыполненоУспешно
			И РезультатПроверкиПубликации.КодОшибки <> 1057 Тогда
			
			Возврат РезультатПроверкиПубликации;
		КонецЕсли;
		
		ПроверкаПубликацииУспешна = (РезультатПроверкиПубликации.ВыполненоУспешно И РезультатПроверкиПубликации.ПараметрыРезультата.publication_valid = Истина);
		
		// Формирование запроса данных внешней системы для отправки в CRM.
		ПарамтерыЗапроса = Новый Структура;
		ПарамтерыЗапроса.Вставить("apikey"             , ВнешняяСистема.КлючПриложения);
		ПарамтерыЗапроса.Вставить("type_app"           , ПолучитьИмяПеречисления("ТипыВнешнихСистем", ВнешняяСистема.ТипВнешнейСистемы));
		ПарамтерыЗапроса.Вставить("publication_address", ?(Не ЭтоОблачник, АдресПубликации, Неопределено));
		ПарамтерыЗапроса.Вставить("check_code"         , ?(Не ЭтоОблачник, КодПроверкиПубликации, Неопределено));
		ПарамтерыЗапроса.Вставить("publication_user"   , ПользовательСистемный.Имя);
		ПарамтерыЗапроса.Вставить("loginEvotor"		   , loginEvotor);		
		ПарамтерыЗапроса.Вставить("passwordEvotor"     , passwordEvotor);
		ПарамтерыЗапроса.Вставить("secret_key"		   , ВнешняяСистема.КлючШифрованияОбратногоЗвонка);
		
		// Дополняем запрос доп. параметрами из структуры.
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
			Для Каждого ЭлементСтруктуры Из ДополнительныеПараметры Цикл
				ПарамтерыЗапроса.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			КонецЦикла;
		КонецЕсли;
				
		УстановленНовыйПароль = Ложь;
		
		Если ПроверкаПубликацииУспешна Тогда
			ПарамтерыЗапроса.Вставить("registration_number", РегистрационныйНомерАнкеты);
		Иначе
			ПарольПользователя = ПолучитьПарольServiceUserAPI(ПользовательПубликации, УстановленНовыйПароль);
			ПарамтерыЗапроса.Вставить("publication_password", ПарольПользователя);
		КонецЕсли;
		
		ПарамтерыЗапроса.Вставить("used", Используется);
		
		ТекстЗапроса      = СобратьJson(ПарамтерыЗапроса);		
		РезультатЗапроса  = ВыполнитьPUTЗапрос("products/stoma", ТекстЗапроса, ЗаголовкиHTTP);	
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);	
		
		Если УстановленНовыйПароль Тогда
			ЗаписатьРеквизитВДанныеРегистрационнойАнкеты("ПарольServiceUserAPIВнесенВCRM", РезультатаОперции.ВыполненоУспешно);
		КонецЕсли;
		
	Исключение
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Обновить данные публикации внешней системы
// 
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  Используется	 - 	 - 
//  ТекущаяСессия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ОбновитьДанныеПубликацииВнешнейСистемы(ВнешняяСистема = Неопределено
											 , Используется = Неопределено
											 , ТекущаяСессия
											 , СтруктураДополнительныхПараметров = Неопределено) Экспорт
	
	Попытка 
				
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("session", ТекущаяСессия);	
		
		ПользовательПубликации = Константы.ВнешняяПубликацияПользователь.Получить();
		
		Если НЕ ЗначениеЗаполнено(ПользовательПубликации) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
			
			Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
				СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			КонецЕсли;
			
			Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
			
		КонецЕсли;
				
		ПользовательСистемный = ПользователиСтоматология.ПолучитьПользователяПоУникальномуИдентификатору(ПользовательПубликации.ИдентификаторПользователяИБ);
		
		Если ПользовательСистемный = Неопределено Тогда
			ПользователиСтоматология.СоздатьСлужебногоПользователяAPIДляСотрудника(ПользовательПубликации);
			ПользовательСистемный = ПользователиСтоматология.ПолучитьПользователяПоУникальномуИдентификатору(ПользовательПубликации.ИдентификаторПользователяИБ);
		КонецЕсли;
		
		УстановленНовыйПароль = Ложь;
		ПарольПользователя 	  = ПолучитьПарольServiceUserAPI(ПользовательПубликации, УстановленНовыйПароль);
		КодПроверкиПубликации = Неопределено;
		ЭтоОблачник			  = ЛичныйКабинет.ЛиныйКабинетВМоделиСервиса();
		
		Если Не ЭтоОблачник Тогда
			КодПроверкиПубликации = Строка(Новый УникальныйИдентификатор);
			ЗаписатьКодПроверкиРубликации(КодПроверкиПубликации);
		КонецЕсли;
		
		ПарамтерыЗапроса = Новый Структура;
		ПарамтерыЗапроса.Вставить("apikey"				, ?(ЗначениеЗаполнено(ВнешняяСистема), ВнешняяСистема.КлючПриложения, Неопределено));
		ПарамтерыЗапроса.Вставить("publication_address"	, ?(Не ЭтоОблачник, Константы.ВнешняяПубликацияАдрес.Получить(), Неопределено));
		ПарамтерыЗапроса.Вставить("publication_user"	, ПользовательСистемный.Имя);
		ПарамтерыЗапроса.Вставить("publication_password", ПарольПользователя);
		ПарамтерыЗапроса.Вставить("used"				, Используется);
		ПарамтерыЗапроса.Вставить("check_code"			, КодПроверкиПубликации);
		
		// Дополняем запрос доп. параметрами из структуры.
		Если ЗначениеЗаполнено(СтруктураДополнительныхПараметров) Тогда
			Для Каждого СтрокаСтруктуры Из СтруктураДополнительныхПараметров Цикл
				ПарамтерыЗапроса.Вставить(СтрокаСтруктуры.Ключ, СтрокаСтруктуры.Значение);
			КонецЦикла;
		КонецЕсли;
		
		// В CRM обновляется пароль публикации в анкете, при обновлении внешней системы.
		// В этом методе - нет. Дописано чтоб обновлялся.
		Если УстановленНовыйПароль = Истина Тогда
			ПарамтерыЗапроса.Вставить("publication_password_update", Истина);	
		КонецЕсли;
		
		ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
		
		РезультатЗапроса  = ВыполнитьPUTЗапрос("external_app/publication", ТекстЗапроса, ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если УстановленНовыйПароль Тогда
			ЗаписатьРеквизитВДанныеРегистрационнойАнкеты("ПарольServiceUserAPIВнесенВCRM", РезультатаОперции.ВыполненоУспешно);
		КонецЕсли;
		
	Исключение
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

// Функция - Проверить публикацию внешней системы
// 
// Возвращаемое значение:
//   - 
// 
функция ПроверитьПубликациюВнешнейСистемы(знач ИмяПубликации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка 
				
		Пользователь = Константы.ВнешняяПубликацияПользователь.Получить();
		
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ВызватьИсключение "Пользователь внешней системы не настроен";
		КонецЕсли;
		
		ПользовательСситемный = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ);
		
		УстановленНовыйПароль = Ложь;
		ПарольПользователя 	  = ПолучитьПарольServiceUserAPI(Пользователь, УстановленНовыйПароль);
		КодПроверкиПубликации = Строка(Новый УникальныйИдентификатор); 
		ЗаписатьКодПроверкиРубликации(КодПроверкиПубликации);
		
		ПарамтерыЗапроса = Новый Структура;
		ПарамтерыЗапроса.Вставить("publication_address" , ИмяПубликации);
		ПарамтерыЗапроса.Вставить("publication_user"    , ПользовательСситемный.Имя);
		ПарамтерыЗапроса.Вставить("publication_password", ПарольПользователя);
		ПарамтерыЗапроса.Вставить("check_code"          , КодПроверкиПубликации);
		
		ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
		
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("products/publication_validate", ТекстЗапроса);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			РезультатаОперции.Вставить("ПубликацияВерна", РезультатаОперции.ПараметрыРезультата.publication_valid);
		КонецЕсли;
		
		Если УстановленНовыйПароль Тогда
			ЗаписатьРеквизитВДанныеРегистрационнойАнкеты("ПарольServiceUserAPIВнесенВCRM", РезультатаОперции.ВыполненоУспешно);
		КонецЕсли;
		
	Исключение
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Обновить список сотрудников внешней системы в CRM
// 
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  ТекущаяСессия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ОбновитьСписокСотрудниковВнешнейСистемыВ_CRM(ВнешняяСистема, ТекущаяСессия, Сотрудник, Использовать = Ложь, ФлагИспользованияЗаписи = Неопределено) Экспорт

	РезультатаОперции = Неопределено;
	
	Попытка 
			
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("session", ТекущаяСессия);	
		ЗаголовкиHTTP.Вставить("apikey" , ВнешняяСистема.КлючПриложения);
		
		ТаблицаДанных = РегистрыСведений.КлючиВнешнихСистем.ПолучитьСотрудниковВнешнейСистемыИМестаРаботы(ВнешняяСистема, Сотрудник, Использовать);
		
		Если ТаблицаДанных.Количество() = 0 Тогда
			Возврат Новый Структура("ВыполненоУспешно, ОписаниеОшибки", Ложь, "Данные для синхронизации с CRM отсутствуют");
		КонецЕсли;
		
		МассивДанных = Новый Массив;
		Для Каждого СтрокаТ ИЗ ТаблицаДанных Цикл
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("phone"	 , СтрокаТ.НомерТелефона);
			СтруктураДанных.Вставить("user_token", СтрокаТ.КлючКлиента);
			СтруктураДанных.Вставить("use"		 , ?(ФлагИспользованияЗаписи <> Неопределено, ФлагИспользованияЗаписи И СотрудникНеУволенИзСЕ(Сотрудник, СтрокаТ.СтруктурнаяЕдиница), СтрокаТ.Использовать));
			
			СтруктураДанных.Вставить("club_id"	 , Строка(СтрокаТ.СтруктурнаяЕдиница.УникальныйИдентификатор()));
			СтруктураДанных.Вставить("club_name" , СтрокаТ.СтруктурнаяЕдиницаНаименование);
			
			МассивДанных.Добавить(СтруктураДанных);
			
		КонецЦикла;
	
		ТекстЗапроса = СобратьJson(МассивДанных);
		
		Метод = "director_app/director";
		
		РезультатЗапроса  = ВыполнитьPOSTЗапрос(Метод, ТекстЗапроса, ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

Функция СотрудникНеУволенИзСЕ(Сотрудник, СтруктурнаяЕдиница)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкиПользователей.ДатаУвольнения КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Сотрудник = &Сотрудник
	|	И НастройкиПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("Сотрудник"      		, Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Не ЗначениеЗаполнено(Выборка.Значение), Истина);  
		
КонецФункции
	
// Функция, выполняет синхронизацию статуса моб приложения с CRM.
// 
Функция АктуализироватьДоступКличномуРасписанию_CRM(ВнешняяСистема, Сотрудник) Экспорт

	РезультатаОперции = Неопределено;
	
	Попытка 
		
		Параметры = РегистрыСведений.КлючиВнешнихСистем.ПолучитьПараметрыСотрудника(ВнешняяСистема, Сотрудник);
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("apikey"    , ВнешняяСистема.КлючПриложения);
		ЗаголовкиHTTP.Вставить("usertoken" , Параметры.КлючКлиента);
		
		Метод = "director_app/status";
		
		РезультатЗапроса  = ВыполнитьGETЗапрос(Метод, ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
		
КонецФункции

#Область МобильноеПриложениеМастера

// Функция, проверяет, настроена ли внешняя публикация.
// 
Функция ВнешняяПубликацияНастроена() Экспорт
	
	Возврат ЗначениеЗаполнено(Константы.ВнешняяПубликацияАдрес.Получить())
	И ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить());
	
КонецФункции

// Функция, возвращает код подтверждения.
// 
Функция ПолучитьКодПодтвержденияДляАвторизации(НомерТелефона, ВнешняяСистема) Экспорт
	
	РезультатаОперции = Неопределено;
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("phone", НомерТелефона);
		
		Метод = "director_app/confirmation_code";
		
		РезультатЗапроса  = ВыполнитьGETЗапрос(Метод, ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

#КонецОбласти

#Область МобильноеПриложениеДиректора

// Функция - Зарегистрировать ключ пользователя
// 
// Параметры:
//  НомерТелефона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ЗарегистрироватьКлючПользователя(НомерТелефона, ОписаниеОшибки = "") Экспорт
		
	Попытка
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("login", НомерТелефона);
		
		ТекстЗапроса = СобратьJson(ПараметрыЗапроса);
		
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("director_app/auth", ТекстЗапроса);
		Если ЗначениеЗаполнено(РезультатЗапроса.errors.message) Тогда		
			ОписаниеОшибки = РезультатЗапроса.errors.message;
		ИначеЕсли РезультатЗапроса.parameters.Свойство("sent_sms") Тогда
			Возврат Истина;
		КонецЕсли;
		
	Исключение	
		ОписаниеОшибки = "Ошибка обращения к серверу: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

// Функция - Обновить список салонов внешней системы в CRM
//
// Параметры:
//  ВнешняяСистема			 - 	 - 
//  ТекущаяСессия			 - 	 - 
//  СтруктурнаяЕдиница		 - 	 - 
//  Использовать			 - 	 - 
//  ФлагИспользованияЗаписи	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбновитьСписокСалоновВнешнейСистемыВ_CRM(ВнешняяСистема, ТекущаяСессия, СтруктурнаяЕдиница, ТаблицаДанных, ФлагИспользованияЗаписи = Неопределено) Экспорт

	РезультатаОперции = Неопределено;
		
	Попытка 
			
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("session", ТекущаяСессия);	
		ЗаголовкиHTTP.Вставить("apikey" , ВнешняяСистема.КлючПриложения);
		
		МассивДанных = Новый Массив;
		Для Каждого СтрокаТ ИЗ ТаблицаДанных Цикл
			
			Использовать = ?(ФлагИспользованияЗаписи <> Неопределено, ФлагИспользованияЗаписи И СотрудникНеУволенИзСЕ(СтрокаТ.Клиент, СтруктурнаяЕдиница), СтрокаТ.Использовать);	
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("phone"	 , СтрокаТ.НомерТелефона);
			СтруктураДанных.Вставить("user_token", СтрокаТ.КлючКлиента);
			СтруктураДанных.Вставить("use"		 , Использовать);
			СтруктураДанных.Вставить("clinic_id"	 , Строка(СтруктурнаяЕдиница.УникальныйИдентификатор()));
			СтруктураДанных.Вставить("clinic_name" , СтруктурнаяЕдиница.Наименование);
			
			МассивДанных.Добавить(СтруктураДанных);
			
		КонецЦикла;
		
		ТекстЗапроса = СобратьJson(МассивДанных);
				
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("director_app/director", ТекстЗапроса, ЗаголовкиHTTP);
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

#Область ОтправкаPushУведомлений   

// Процедура, отправляет запрос CRM, для отправки push уведомления врачу.
//
Процедура ОтправитьPushУведомлениеMobile(СтруктураPushУведомления) Экспорт
	
	Попытка 
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("RegNumber", СтруктураPushУведомления.ПродуктРегистрационныйНомер);
		ЗаголовкиHTTP.Вставить("Apikey"   , СтруктураPushУведомления.КлючПриложения);
		
		ТелоЗапроса = СобратьJson(СтруктураPushУведомления);	
		
		ОписаниеОшибки = "";
		ОтветОтСервера = ВыполнитьPOSTЗапрос("/salonmob_app/push_mobile", ТелоЗапроса, ЗаголовкиHTTP);  
		
		Если НЕ ОтветОтСервера.parameters.result И ЗначениеЗаполнено(ОтветОтСервера.errors.message) Тогда 
			ОписаниеОшибки = "Код ошибки: " + ОтветОтСервера.errors.code + " Описание ошибки: " + ОтветОтСервера.errors.message;
		КонецЕсли;
		
	Исключение	
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
	КонецПопытки;			
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Мессенджер

// Функция - Получить список тарифов подключения.
//
// Параметры:
//  КодВнешнейСистемы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСписокТарифовПодключения(КодВнешнейСистемы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатаОперции = Неопределено;
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("apptypecode", КодВнешнейСистемы);
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("/external_app/subscriptions", ЗаголовкиHTTP);
		
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			РезультатаОперции.Вставить("ТарифыПодключения", РезультатаОперции.ПараметрыРезультата.subscriptions);
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());

	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции	

// Функция - Сформировать договор и счет на оплату тарифа подключения.
//
// Параметры:
//  КодТарифа		 - 	 - 
//  ТекущаяСессия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьДоговорСчетНаОплатуТарифаПодключения(ПланПодписки, ТекущаяСессия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатаОперции = Неопределено;
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("session"     , ТекущаяСессия);
		ЗаголовкиHTTP.Вставить("sub-plan-set", ПланПодписки);
		
		РезультатЗапроса  = ВыполнитьPUTЗапрос("/external_app/registration/sub_plan",, ЗаголовкиHTTP);    
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			РезультатаОперции.Вставить("УидСчета", РезультатаОперции.ПараметрыРезультата.invoice);
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Проверить наличие оплаты счета тарифа подключения.
//
// Параметры:
//  КодВнешнейСистемы	 - 	 - 
//  ТекущаяСессия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьНаличиеОплатыСчетаТарифаПодключения(УидСчета, ТекущаяСессия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатаОперции = Неопределено;
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("invoice", УидСчета);
		ЗаголовкиHTTP.Вставить("session", ТекущаяСессия);
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("/external_app/invoice/availability_payment", ЗаголовкиHTTP);
		
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			РезультатаОперции.Вставить("Оплачен", РезультатаОперции.ПараметрыРезультата.paid);
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());

	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции	

// Функция - Получить ссылку на оплату счета.
//
// Параметры:
//  КодВнешнейСистемы	 - 	 - 
//  ТекущаяСессия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыВнешнейСистемы(ВнешняяСистема, ТекущаяСессия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатаОперции = Неопределено;
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("apikey" , ВнешняяСистема.КлючПриложения);
		ЗаголовкиHTTP.Вставить("session", ТекущаяСессия);
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("/external_app/params", ЗаголовкиHTTP);
		
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			РезультатаОперции.Вставить("Параметры", РезультатаОперции.ПараметрыРезультата.params);
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());

	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции	

// Функция - Получить ссылку на оплату счета.
//
// Параметры:
//  КодВнешнейСистемы	 - 	 - 
//  ТекущаяСессия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСсылкуНаОплатуТарифаПодключения(УидСчета, ТекущаяСессия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатаОперции = Неопределено;
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("invoice", УидСчета);
		ЗаголовкиHTTP.Вставить("session", ТекущаяСессия);
		
		РезультатЗапроса  = ВыполнитьGETЗапрос("/external_app/invoice/payment_link", ЗаголовкиHTTP);
		
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
		Если РезультатаОперции.ВыполненоУспешно = Истина Тогда
			РезультатаОперции.Вставить("СсылкаНаОплату", РезультатаОперции.ПараметрыРезультата.link);
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());

	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#Область СервисныеПроцедурыИФункции

// Функция - Выполнить POSTЗапрос
// 
// Параметры:
//  Метод		 - 	 - 
//  ТекстЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВыполнитьPOSTЗапрос(Метод, ТекстЗапроса, ДопЗаголовки = Неопределено, Параметры = Неопределено, ОбработатьРезультат = Истина)
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыПодклчюенияК_API_CRM();
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
	Параметры.АдресСервера,, 
	Параметры.Пользователь,
	Параметры.Пароль);
		
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language", "ru");	
	
	Если ДопЗаголовки <> Неопределено Тогда
		
		Для Каждого Заголовок ИЗ ДопЗаголовки Цикл		
			ЗаголовкиHTTP.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	// /CRM/hs/api/v1/
	HTTPЗапрос = Новый HTTPЗапрос(Параметры.АдресПубликации + Метод, ЗаголовкиHTTP);		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		

    ВозвращаемыйРезультат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если ОбработатьРезультат = Истина Тогда 
		Возврат РазобратьJson(ВозвращаемыйРезультат);
	Иначе
		Возврат ВозвращаемыйРезультат;
	КонецЕсли;
		
КонецФункции

// Функция - Выполнить PUTЗапрос
// 
// Параметры:
//  Метод		 - 	 - 
//  ТекстЗапроса - 	 - 
//  ДопЗаголовки - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВыполнитьPUTЗапрос(Метод, ТекстЗапроса, ДопЗаголовки = Неопределено, Параметры = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыПодклчюенияК_API_CRM();
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
	Параметры.АдресСервера,, 
	Параметры.Пользователь,
	Параметры.Пароль);
		
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language", "ru");	
	
	Если ДопЗаголовки <> Неопределено Тогда
		
		Для Каждого Заголовок ИЗ ДопЗаголовки Цикл		
			ЗаголовкиHTTP.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	// /CRM/hs/api/v1/
	HTTPЗапрос = Новый HTTPЗапрос(Параметры.АдресПубликации + Метод, ЗаголовкиHTTP);		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		

    ВозвращаемыйРезультат = Соединение.ВызватьHTTPМетод("PUT", HTTPЗапрос);
	
	Возврат РазобратьJson(ВозвращаемыйРезультат);
		
КонецФункции

// Функция - Выполнить GETЗапрос
// 
// Параметры:
//  Метод		 - 	 - 
//  ДопЗаголовки - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ВыполнитьGETЗапрос(Метод, ДопЗаголовки = Неопределено, Параметры = Неопределено, ВозвратДвоичныхДанных = Ложь)
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыПодклчюенияК_API_CRM();
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
	Параметры.АдресСервера,, 
	Параметры.Пользователь,
	Параметры.Пароль);
		
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language", "ru");	
	
	Если ДопЗаголовки <> Неопределено Тогда                     
		
		Для Каждого Заголовок ИЗ ДопЗаголовки Цикл		
			ЗаголовкиHTTP.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	// /CRM/hs/api/v1/
	HTTPЗапрос = Новый HTTPЗапрос(Параметры.АдресПубликации + Метод, ЗаголовкиHTTP);				
		
    ВозвращаемыйРезультат = Соединение.Получить(HTTPЗапрос);
	
	Возврат ?(ВозвратДвоичныхДанных, ВозвращаемыйРезультат.ПолучитьТелоКакДвоичныеДанные(), РазобратьJson(ВозвращаемыйРезультат));
		
КонецФункции

// Функция - Обработать стандартный результат HTTPЗапроса
// 
// Параметры:
//  РезультатЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса)
	
	РезультатаОперции                     = СтруктураСтандартынхПараметровРезОперации();	
	РезультатаОперции.ПараметрыРезультата = РезультатЗапроса.parameters;
	
	Если РезультатЗапроса.parameters.result = Истина Тогда
		
		Если ЗначениеЗаполнено(РезультатЗапроса.parameters) Тогда
			РезультатаОперции.ВыполненоУспешно = РезультатЗапроса.parameters.result;
		КонецЕсли;
		
	Иначе
		
		РезультатаОперции.КодОшибки       = РезультатЗапроса.errors.code;
		РезультатаОперции.ОписаниеОшибки  = РезультатЗапроса.errors.message;
		
		Если РезультатаОперции.КодОшибки <> 1074 Тогда
			
			ДанныеИсключения = Новый Структура("Описание,ИмяМодуля,НомерСтроки,ИсходнаяСтрока,Причина",
			РезультатЗапроса.errors.message,
			"МодульОбщегоНазначения.ЛичныйКабинет");	
			
			ЗаписатьОшибкуВЖурналРегистрации(ДанныеИсключения);
			
		КонецЕсли;
	
	КонецЕсли;

	Возврат РезультатаОперции;
	
КонецФункции

// Функция - Обработать исключение при выполнении HTTPЗапроса
//
// Параметры:
//  ДанныеИсключения - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбработатьИсключениеПриВыполненииHTTPЗапроса(ДанныеИсключения, ТекстОшибки = "")
	
	РезультатаОперции = СтруктураСтандартынхПараметровРезОперации();
	
	Описание = СтрШаблон(
	"Описание: %1
	|ИмяМодуля: %2
	|НомерСтроки: %3
	|ИсходнаяСтрока: %4
	|Причина: %5",
	ДанныеИсключения.Описание,
	ДанныеИсключения.ИмяМодуля,
	ДанныеИсключения.НомерСтроки,
	ДанныеИсключения.ИсходнаяСтрока,
	ДанныеИсключения.Причина);
	
	РезультатаОперции.КодОшибки       = 400;
	РезультатаОперции.ОписаниеОшибки  = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки, Описание);
	
	ЗаписатьОшибкуВЖурналРегистрации(ДанныеИсключения);
			
	Возврат РезультатаОперции;
		
КонецФункции

// Процедура - Записать ошибку в журнал регистрации
// 
// Параметры:
//  ДанныеОшибки - 	 - 
// 
Процедура ЗаписатьОшибкуВЖурналРегистрации(ДанныеОшибки)
	
	Описание = СтрШаблон(
	"Описание: %1
	|ИмяМодуля: %2
	|НомерСтроки: %3
	|ИсходнаяСтрока: %4
	|Причина: %5",
	ДанныеОшибки.Описание,
	ДанныеОшибки.ИмяМодуля,
	ДанныеОшибки.НомерСтроки,
	ДанныеОшибки.ИсходнаяСтрока,
	ДанныеОшибки.Причина);
	
	ЗаписьЖурналаРегистрации(
	"API CRM",
	УровеньЖурналаРегистрации.Ошибка,,,
	Описание);
	
КонецПроцедуры

// Функция - Разобрать json
// 
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РазобратьJson(Запрос, ИменаСвойствСоЗначениямиДата = Неопределено)
	
	ТекстJSON = "";
	
	Попытка
		
		ТекстJSON = Запрос.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		Возврат ПрочитатьJSON(ЧтениеJSON,,ИменаСвойствСоЗначениямиДата);
		
	Исключение
		
		ВызватьИсключение "Ошибка: " + ОписаниеОшибки() + ". Исходный текст JSON: " + ТекстJSON;
		
	КонецПопытки;
	
КонецФункции

// Функция - Собрать json
// 
// Параметры:
//  СтруктураДанных	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция СобратьJson(СтруктураДанных)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

#КонецОбласти

#Область ЯндексКарты

&НаСервере
// Функция - Отправить данные яндекс карт в CRM.
// 
Функция ОтправитьДанныеЯндексКартыВCRM(ПараметрыЗапроса) Экспорт
	
	Попытка
		
		ЗаголовкиHTTP = Новый Соответствие;	
		ЗаголовкиHTTP.Вставить("session"		, ПараметрыЗапроса.session);
		ЗаголовкиHTTP.Вставить("structuralunit" , ПараметрыЗапроса.structuralunit);
		
		ТекстЗапроса = СобратьJson(ПараметрыЗапроса);
		ПараметрыПодключения = ПараметрыПодклчюенияК_API_CRM();
		РезультатЗапроса  = ВыполнитьPOSTЗапрос("GetDataForYandexMaps", ТекстЗапроса, ЗаголовкиHTTP, ПараметрыПодключения);
		
		РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);
		
	Исключение	
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());	
	КонецПопытки;
	
	Возврат РезультатаОперции;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Методы_API_Виджета

// Функция, отправляет запрос в reservi.ru.
//
Функция ВыполнитьPOSTЗапросВReservi(Метод, ПарамтерыЗапроса) Экспорт
	
	ТекстЗапроса 		 = СобратьJson(ПарамтерыЗапроса);
	
	ПараметрыПодключения = ПараметрыПодклчюенияК_API_Виджета();
	
	ДопЗаголовки = Новый Массив;
	ДопЗаголовки.Добавить(Новый Структура("Ключ,Значение", "content-type", "application/json"));
	ДопЗаголовки.Добавить(Новый Структура("Ключ,Значение", "api-key"     , ПараметрыПодключения.ApiKeyToken));

	Возврат ВыполнитьPOSTЗапрос(Метод, ТекстЗапроса, ДопЗаголовки, ПараметрыПодключения, Ложь);
	
КонецФункции

// Функция - Параметры подклчюения к API виджета
// 
// Возвращаемое значение:
//   - 
// 
Функция ПараметрыПодклчюенияК_API_Виджета()
	
	// Боевой сервер
	СтрПараметров = Новый Структура();
	СтрПараметров.Вставить("АдресСервера"   , "reservi.ru");
	СтрПараметров.Вставить("АдресПубликации", "/api/cloud1c/");
	СтрПараметров.Вставить("Пользователь"   , Неопределено);
	СтрПараметров.Вставить("Пароль"         , Неопределено);
	СтрПараметров.Вставить("ApiKeyToken"    , "W69mPUzgmeHLHXrJn4szEr2hn");

	Возврат СтрПараметров;
	
КонецФункции

// Функция - Зарегистировать виджет
// 
// Параметры:
//  Организация	 - 	 - 
//  ApiKey		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ЗарегистироватьВиджет(Организация, ApiKeyВн, СтруктурныеЕдиницы) Экспорт
	
	Результат = РегистрацияОрганизацииВиджета(Организация, ApiKeyВн);
	
	Если Результат.ВыполненоУспешно И СтруктурныеЕдиницы <> Неопределено И ТипЗнч(СтруктурныеЕдиницы) = Тип("Массив") И СтруктурныеЕдиницы.Количество() > 0 Тогда
	    Результат = РегистрацияСтруктурныхЕдиницВиджета(СтруктурныеЕдиницы);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Регистрация организации виджета
// 
// Параметры:
//  Организация	 - 	 - 
//  ApiKey		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РегистрацияОрганизацииВиджета(Организация, ApiKey) Экспорт
	
	Попытка 
				
		ПараметрыОрганизации = Новый Структура;
		ПараметрыОрганизации.Вставить("id"	       			, ЛичныйКабинет.ПолучитьУИДИнформационнойБазы());
		ПараметрыОрганизации.Вставить("name"       			, ?(Не ЗначениеЗаполнено(Организация), ПолучитьНаименованиеОрганизации(), Организация.Наименование));
		ПараметрыОрганизации.Вставить("api_key"	   			, ApiKey);
		ПараметрыОрганизации.Вставить("use_advanced_name"	, Ложь);
		ПараметрыОрганизации.Вставить("use_birthday"		, Ложь);
					
		ВнешняяСитемаОнлайнЗаписи = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey);    
		
		Если ЗначениеЗаполнено(ВнешняяСитемаОнлайнЗаписи) Тогда
			
			ПараметрыОрганизации.Вставить("auth_skip_confirm", ВнешняяСитемаОнлайнЗаписи.АвторизацияПоКодуБезСМС);
			
			ПараметрыВС = ВнешняяСитемаОнлайнЗаписи.Параметры.Получить();
			
			Если ТипЗнч(ПараметрыВС) = Тип("Структура") Тогда 					
				ПараметрыОрганизации.Вставить("use_advanced_name"	, ?(ПараметрыВС.Свойство("РазделенныеПоляФИО")		, ПараметрыВС.РазделенныеПоляФИО		, Ложь));
				ПараметрыОрганизации.Вставить("use_birthday"		, ?(ПараметрыВС.Свойство("ВыводитьДатуРождения")	, ПараметрыВС.ВыводитьДатуРождения		, Ложь));
				ПараметрыОрганизации.Вставить("use_email"			, ?(ПараметрыВС.Свойство("ВыводитьПочту")			, ПараметрыВС.ВыводитьПочту				, Ложь));
				ПараметрыОрганизации.Вставить("use_notify"			, ?(ПараметрыВС.Свойство("ВыводитьПолеНапоминания")	, ПараметрыВС.ВыводитьПолеНапоминания	, Ложь));
				ПараметрыОрганизации.Вставить("metric_js"			, ?(ПараметрыВС.Свойство("FacebookPixel")			, ПараметрыВС.FacebookPixel				, ""));
			КонецЕсли;
			
		КонецЕсли;
			
		МассивОрганизаций = Новый Массив;
		МассивОрганизаций.Добавить(ПараметрыОрганизации);
		
		ПарамтерыЗапроса = Новый Структура("organizations", МассивОрганизаций);
		РезультатЗапроса = ВыполнитьPOSTЗапросВReservi("add_org", ПарамтерыЗапроса);
		
		РезультатаОперции = СтруктураСтандартынхПараметровРезОперации();

		Если РезультатЗапроса.КодСостояния <> 200  Тогда
			ВызватьИсключение "КодОшибки = " + РезультатЗапроса.КодСостояния + ", Ошибка: " +  РезультатЗапроса.ПолучитьТелоКакСтроку();
		Иначе
			
			Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
			
			Если СтрНайти(Ответ, """status"":true") > 0 Тогда
				РезультатаОперции.ВыполненоУспешно = Истина;
			Иначе
				ВызватьИсключение "Ошибка: " + Ответ;
			КонецЕсли;
						
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

// Функция - Регистрация структурных единиц виджета
// 
// Параметры:
//  СтруктурныеЕдиницы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РегистрацияСтруктурныхЕдиницВиджета(СтруктурныеЕдиницы) Экспорт
	
	Попытка
		
		МассивПараметровСтруктурныхЕдиниц = Новый Массив;
		
		Для Каждого СтрЕдиница ИЗ СтруктурныеЕдиницы Цикл
			
			Контакты = КонтактнаяИнформацияВызовСервераСтома.ПолучитьКонтактнуюИнформацию(СтрЕдиница);
			id = ?(ЗначениеЗаполнено(СтрЕдиница.УникальныйИдентификаторСтруктурнойЕдиницы), СтрЕдиница.УникальныйИдентификаторСтруктурнойЕдиницы, Строка(СтрЕдиница.УникальныйИдентификатор()));
			
			ПараметрыСтруктурнойЕдиницы = Новый Структура;
			ПараметрыСтруктурнойЕдиницы.Вставить("name"		    , СтрЕдиница.Наименование);
			ПараметрыСтруктурнойЕдиницы.Вставить("id"		    , id);
			ПараметрыСтруктурнойЕдиницы.Вставить("org_id"	    , ЛичныйКабинет.ПолучитьУИДИнформационнойБазы());
			ПараметрыСтруктурнойЕдиницы.Вставить("email"		, Контакты.Email);
			ПараметрыСтруктурнойЕдиницы.Вставить("address_full" , Контакты.Адрес);
			ПараметрыСтруктурнойЕдиницы.Вставить("address_short", ?(ЗначениеЗаполнено(Контакты.КороткийАдрес),Контакты.КороткийАдрес, ""));
			ПараметрыСтруктурнойЕдиницы.Вставить("phone"		, Контакты.Телефон);
			ПараметрыСтруктурнойЕдиницы.Вставить("country"		, Контакты.Город);
			ПараметрыСтруктурнойЕдиницы.Вставить("gmap_point"   , СтрШаблон("%1,%2", СтрЕдиница.Широта, СтрЕдиница.Долгота));
			ПараметрыСтруктурнойЕдиницы.Вставить("type"         , "stoma");
			ПараметрыСтруктурнойЕдиницы.Вставить("city"	        , Контакты.Город);
						
			МассивФайловКартинок = ПолучитьВсеПодчиненныеФайлы(СтрЕдиница.Ссылка, "ЛоготипМагазина");
			МассивФайловКартинокЗаполнен = МассивФайловКартинок.Количество() > 0;
			Если МассивФайловКартинокЗаполнен Тогда
				ВнешняяСистемаReservi	= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи);
				ЛогоМагазина 			= "http://cloud.stoma1c.ru/api/hs/api/files/" + ВнешняяСистемаReservi.КлючПриложения 
					+ "/" + Строка(МассивФайловКартинок[0].УникальныйИдентификатор()) + "." + МассивФайловКартинок[0].Расширение;
				ПараметрыСтруктурнойЕдиницы.Вставить("logo"  		, ЛогоМагазина);
			КонецЕсли;
			МассивПараметровСтруктурныхЕдиниц.Добавить(ПараметрыСтруктурнойЕдиницы);
			
		КонецЦикла;
		
		ПарамтерыЗапроса = Новый Структура("units", МассивПараметровСтруктурныхЕдиниц);
		РезультатЗапроса = ВыполнитьPOSTЗапросВReservi("add_se", ПарамтерыЗапроса);
		
		РезультатаОперции = СтруктураСтандартынхПараметровРезОперации();

		Если РезультатЗапроса.КодСостояния <> 200  Тогда
			ВызватьИсключение "КодОшибки = " +РезультатЗапроса.КодСостояния + ", Ошибка: " +  РезультатЗапроса.ПолучитьТелоКакСтроку();
		Иначе
			
			Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
			
			Если СтрНайти(Ответ, """status"":true") > 0 Тогда 
				РезультатаОперции.ВыполненоУспешно = Истина;
			Иначе
				ВызватьИсключение "Ошибка: " + Ответ;
			КонецЕсли;
						
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;

КонецФункции

// Функция - Удалить регистрацию виджета
// 
// Параметры:
//  Организация			 - 	 - 
//  СтруктурныеЕдиницы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция УдалитьРегистрациюВиджета(Организация, СтруктурныеЕдиницы, ПоУИД = Ложь) Экспорт
	
	Результат = УдалитьРегистрациюСтруктурныхЕдиницВиджета(СтруктурныеЕдиницы, ПоУИД);
	
	Если Результат.ВыполненоУспешно Тогда
	    Результат = УдалитьРегистрациюОрганизацииВиджета(Организация);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Функция - Удалить регистрацию структурных единиц виджета
// 
// Параметры:
//  СтруктурныеЕдиницы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция УдалитьРегистрациюСтруктурныхЕдиницВиджета(СтруктурныеЕдиницы, ПоУИД = Ложь) Экспорт
	
	Попытка
		
		МассивПараметровСтруктурныхЕдиниц = Новый Массив;
		
		Для Каждого СтрЕдиница ИЗ СтруктурныеЕдиницы Цикл
			
			Если ПоУИД = Истина Или Не ЗначениеЗаполнено(СтрЕдиница.УникальныйИдентификаторСтруктурнойЕдиницы) Тогда
				ПараметрыСтруктурнойЕдиницы = Новый Структура("id", Строка(СтрЕдиница.УникальныйИдентификатор()));  
			Иначе
				ПараметрыСтруктурнойЕдиницы = Новый Структура("id", СтрЕдиница.УникальныйИдентификаторСтруктурнойЕдиницы); 
			КонецЕсли;	
			МассивПараметровСтруктурныхЕдиниц.Добавить(ПараметрыСтруктурнойЕдиницы);
			
		КонецЦикла;
		
		ПарамтерыЗапроса = Новый Структура("units", МассивПараметровСтруктурныхЕдиниц);
		РезультатЗапроса = ВыполнитьPOSTЗапросВReservi("remove_se", ПарамтерыЗапроса);
		
		РезультатаОперции = СтруктураСтандартынхПараметровРезОперации();
		
		//Если РезультатЗапроса.КодСостояния <> 200 Тогда
		//	ВызватьИсключение "КодОшибки = " + РезультатЗапроса.КодСостояния + ", Ошибка: " +  РезультатЗапроса.ПолучитьТелоКакСтроку();
		//Иначе
			// Так как код состояния равен 404 даже при успешном соединении, поэтому проверку на код состояния комментим
			Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
			
			Если СтрНайти(Ответ, "true") > 0 Тогда 
				РезультатаОперции.ВыполненоУспешно = Истина;
			Иначе
				ВызватьИсключение "КодОшибки = " + РезультатЗапроса.КодСостояния + ", Ошибка: " +  Ответ;
			КонецЕсли;
			
		//КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
		
КонецФункции

// Функция - Удалить регистрацию организации виджета
// 
// Параметры:
//  Организация	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция УдалитьРегистрациюОрганизацииВиджета(Организация) 
	
	Попытка 
		
		ПараметрыОрганизации = Новый Структура("id", ЛичныйКабинет.ПолучитьУИДИнформационнойБазы());
		
		МассивОрганизаций = Новый Массив;
		МассивОрганизаций.Добавить(ПараметрыОрганизации);
		
		ПарамтерыЗапроса = Новый Структура("organizations", МассивОрганизаций);
		РезультатЗапроса = ВыполнитьPOSTЗапросВReservi("remove_org", ПарамтерыЗапроса);
		
		РезультатаОперции = СтруктураСтандартынхПараметровРезОперации();
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			ВызватьИсключение "КодОшибки = " + РезультатЗапроса.КодСостояния + ", Ошибка: " +  РезультатЗапроса.ПолучитьТелоКакСтроку();
		Иначе
			
			Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
			
			Если СтрНайти(Ответ, """status"":true") > 0 Тогда 
				РезультатаОперции.ВыполненоУспешно = Истина;
			Иначе
				ВызватьИсключение "Ошибка: " + Ответ;
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатаОперции;
		
КонецФункции

#КонецОбласти

#Область ВнешниеПодключаемыеОбработчики

// Процедура - При начале работы системы
// 
Процедура ПриНачалеРаботыСистемы(ПараметрыКлиента = Неопределено) Экспорт
	
	Если (ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных())
		ИЛИ (ПараметрыКлиента <> Неопределено И ПараметрыКлиента.Свойство("НеобходимоОбновлениеПараметровРаботыПрограммы") И ПараметрыКлиента.НеобходимоОбновлениеПараметровРаботыПрограммы = Истина) Тогда
		
		Возврат ;
		
	КонецЕсли;
	
	Если ПользовательИмеетПравоНаРаботуСличнымКабинетом() = Истина Тогда
		
		ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
		
		Если ДанныеАнкеты = Неопределено
			ИЛИ ДанныеАнкеты.Свойство("ИдентификацияПрограммногоПродуктаВыполнена") = Ложь
			ИЛИ НЕ ДанныеАнкеты.ИдентификацияПрограммногоПродуктаВыполнена = Истина Тогда
						
			ЗарегистрироватьПрограммныйПродукт();
			
		КонецЕсли;
					
	КонецЕсли;
		
КонецПроцедуры

// Функция - Фоновое задание запустить
// 
// Параметры:
//  ПланОбмена					 - 	 - 
//  УникальныйИдентификаторФормы - 	 - 
// Возвращаемое значение:
//   - 
Функция ПроверитьБалансаСмсСервисаИПредложитьПополнение() Экспорт
		
	Если ТекущийПользовательИмеетПравоНаРаботуССмсСервисами() = Ложь Тогда		
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Проверка баланса";
	ПараметрыВыполнения.ОжидатьЗавершение           = 0;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("ЛичныйКабинет.ПроверитьБалансаСмсСервисаДлительнаяОперация", Новый Структура, ПараметрыВыполнения);

КонецФункции

// Процедура - Проверить необходимость предложения пополнения баланса смс сервиса helix
// 
// Параметры:
//  СтруктураПараметров		 - 	 - 
//  АдресХранилищаРезультата - 	 - 
// 
Процедура ПроверитьБалансаСмсСервисаДлительнаяОперация(СтруктураПараметров, АдресХранилищаРезультата = Неопределено, СервисSMSРассылки = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СервисSMSРассылки) Тогда
		СервисСмс = СервисSMSРассылки;
	ИначеЕсли Константы.СервисSMSРассылкиПоУмолчанию.Получить().Пустая() Тогда
		СервисСмс = Справочники.СервисыРассылки.НайтиПоРеквизиту("SMSСервис", Перечисления.СервисыSMSРассылки.HelixSMS);
	Иначе
		СервисСмс = Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СервисСмс)
		И СервисСмс.ПометкаУдаления = Ложь
		И СервисСмс.SMSСервис = Перечисления.СервисыSMSРассылки.HelixSMS Тогда
		
		Баланс = Неопределено;
		
		Попытка
			Баланс = Справочники.СервисыРассылки.ПолучитьБалансАккаунтаSMS(СервисСмс);
		Исключение
			ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке());
		КонецПопытки;
		
		Если Баланс <> Неопределено
			И Баланс.Ошибка = Ложь Тогда
			
			РезультатаОперции   = ПолучитьПредложениеДляПополенияБалансаСмсСервиса(СервисСмс);							
			МинимальныйБаланс   = 1000;
			ПараметрыПополнения = Новый Структура();
			
			Если РезультатаОперции.ВыполненоУспешно = Истина
				И РезультатаОперции.ПараметрыРезультата <> Неопределено Тогда	
				
				ПараметрыПополнения = РезультатаОперции.ПараметрыРезультата; 
				МинимальныйБаланс   = РезультатаОперции.ПараметрыРезультата.min_balance;
				
			ИначеЕсли РезультатаОперции.ВыполненоУспешно = Ложь Тогда 	
				
				ПараметрыПополнения.Вставить("КодОшибки", РезультатаОперции.КодОшибки);
				
			КонецЕсли;		
			
			ПараметрыПополнения.Вставить("ТекущийБаланс",Баланс.Баланс);
			
			ПоместитьВоВременноеХранилище(ПараметрыПополнения, АдресХранилищаРезультата);  
			
			// Если это проверка пополнения баланса
			Если СтруктураПараметров = Неопределено
				ИЛИ НЕ СтруктураПараметров.Свойство("НеКонтролироватьДатаПоследнегоСчета")
				ИЛИ СтруктураПараметров.НеКонтролироватьДатаПоследнегоСчета = Ложь Тогда
				
				Если Баланс.Баланс <= МинимальныйБаланс Тогда  
					
					ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
					
					Если ДанныеАнкеты <> Неопределено
						И ДанныеАнкеты.Свойство("ДатаПоследнейВыпискиСчетаПоплненияСмсБаланса")
						И ЗначениеЗаполнено(ДанныеАнкеты.ДатаПоследнейВыпискиСчетаПоплненияСмсБаланса) Тогда
						
						Период = (НачалоДня(ТекущаяДата()) - НачалоДня(ДанныеАнкеты.ДатаПоследнейВыпискиСчетаПоплненияСмсБаланса)) / 86400;
						
						Если Период < 3 Тогда
							
							ПоместитьВоВременноеХранилище(Неопределено, АдресХранилищаРезультата);
							Возврат;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					ПоместитьВоВременноеХранилище(Неопределено, АдресХранилищаРезультата);
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилищаРезультата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция, возвращает или создает новый пароль пользователя "ServiceUserAPI".
//
Функция ПолучитьПарольServiceUserAPI(ПользовательПубликации, УстановленНовыйПароль)
	
	Если ПолучитьРеквизитИзДанныхРегистрационнойАнкеты("ПарольServiceUserAPIВнесенВCRM") = Истина Тогда
		Возврат ПолучитьРеквизитИзДанныхРегистрационнойАнкеты("ПарольServiceUserAPI");
	Иначе
		УстановленНовыйПароль = Истина;
		Возврат ПользователиСтоматология.УстановитьНовыйСлучайныйПарольСлужебномуПользователюAPI(ПользовательПубликации.ИдентификаторПользователяИБ);
	КонецЕсли;
	
КонецФункции

// Функция вернет пустую структру данных передаваемых 
// в RemoteAccessService для регистрвции новой анкеты
Функция ПолучитьПустуюСтруктуруДанныхРегистрацииАнкеты() Экспорт
	
	ПарамтерыРегистрации = Новый Структура;
	
	ПарамтерыРегистрации.Вставить("КонтактноеЛицоИмя"                 ,Неопределено);
    ПарамтерыРегистрации.Вставить("КонтактноеЛицоТелефон"             ,Неопределено);
    ПарамтерыРегистрации.Вставить("КонтактноеЛицоПочта"               ,Неопределено);
	
	ПарамтерыРегистрации.Вставить("КлиникаТип"                        ,Неопределено);
	ПарамтерыРегистрации.Вставить("КлиникаНаименование"               ,Неопределено);
    ПарамтерыРегистрации.Вставить("КлиникаГород"                      ,Неопределено);
    ПарамтерыРегистрации.Вставить("КлиникаРазмер"                     ,Неопределено);
	
	ПарамтерыРегистрации.Вставить("ОрганизацияНаименование"           ,Неопределено);
	ПарамтерыРегистрации.Вставить("ОрганизацияАдресСтрокой"           ,Неопределено);
	ПарамтерыРегистрации.Вставить("ОрганизацияАдресXML"               ,Неопределено);
	ПарамтерыРегистрации.Вставить("ОрганизацияТелефон"                ,Неопределено);
	ПарамтерыРегистрации.Вставить("ОрганизацияПочта"                  ,Неопределено);
	ПарамтерыРегистрации.Вставить("ОрганизацияИНН"                    ,Неопределено);

	ПарамтерыРегистрации.Вставить("ОрганизацияОтправительИД"          ,Неопределено); 
	ПарамтерыРегистрации.Вставить("ОрганизацияОтправительПолноеИмя"   ,Неопределено);
	
	ПарамтерыРегистрации.Вставить("ПродуктНаименование"               ,ПолучитьАртикулПродукта());
	ПарамтерыРегистрации.Вставить("ПродуктАртикул"                    ,ПолучитьАртикулПродукта());
	ПарамтерыРегистрации.Вставить("ПродуктДатаПевогоЗапуска"          ,Константы.ДатаПервогоВходаВСистему.Получить());
	
	ПарамтерыРегистрации.Вставить("ПродуктРегистрационныйНомер"       ,Неопределено);
	ПарамтерыРегистрации.Вставить("ПродуктСкринАнкеты"                ,Неопределено);	
	ПарамтерыРегистрации.Вставить("ПродуктПароль"                     ,Неопределено);
	ПарамтерыРегистрации.Вставить("ПродуктУИДБазы"                    ,Неопределено); 
	ПарамтерыРегистрации.Вставить("ПродуктСЛКиспользуется"            ,Неопределено);
		
	Возврат ПарамтерыРегистрации;
	
КонецФункции

// Функция - Структура стандартынх параметров рез операции
// 
// Возвращаемое значение:
//   - 
// 
Функция СтруктураСтандартынхПараметровРезОперации()
	
	 Возврат Новый Структура("ВыполненоУспешно,ПараметрыРезультата,КодОшибки,ОписаниеОшибки",
	 Ложь,
	 Неопределено,
	 Неопределено, 
	 Неопределено);
	
КонецФункции

// Функция - Пользователь имеет право на работу сличным кабинетом
// 
// Возвращаемое значение:
//   - 
// 
Функция ПользовательИмеетПравоНаРаботуСличнымКабинетом()
	
	// Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
	// 	Возврат РольДоступна("ПолныеПрава")
	// Иначе
		Возврат РольДоступна("ИспользованиеЛичногоКабинета");
	// КонецЕсли;
	
КонецФункции

// Функция - Текущий пользователь имеет право на работу с смс сервисами
// 
// Возвращаемое значение:
//   - 
// 
Функция ТекущийПользовательИмеетПравоНаРаботуССмсСервисами()
	
	РольПользователя = ПараметрыСеанса.ТекущийПользователь.РольПользователя;
	
	Если РольПользователя = Перечисления.РольПользователя.АдминистраторБазыДанных
		ИЛИ РольПользователя = Перечисления.РольПользователя.Руководитель
		ИЛИ РольПользователя = Перечисления.РольПользователя.Бухгалтер Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

// Процедура выполняет операции проверки стутса регистрационной 
// анкеты при запуске системы. 
функция ПроверитьНеобходимостьОповещенияПользователяОСтатусеАнкеты() Экспорт
	
	Ответ = Новый Структура("ОжиданиеПодтвержденияАнкеты,СтатусАнкетыИзмен,СтатусАнкетыОписание");
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		Возврат Ответ;
		
	КонецЕсли;

	// Операция доступна только для пользователей с полными правами
	Если НЕ ПользовательИмеетПравоНаРаботуСличнымКабинетом() Тогда
		
		Возврат Ответ;
		
	КонецЕсли;
	
	Попытка
		
		ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
		
		Если ДанныеАнкеты <> Неопределено Тогда
			
			ПродуктРегистрационныйНомер            = Неопределено;
			РегистрацияПринята                     = Неопределено;
			ИдентификаторПользователя              = Неопределено;
			РегистрацияОповещениеОСтатусеВыполнено = Неопределено;
			
			ДанныеАнкеты.Свойство("ПродуктРегистрационныйНомер"              ,ПродуктРегистрационныйНомер);
			ДанныеАнкеты.Свойство("РегистрацияПринята"                       ,РегистрацияПринята);
			ДанныеАнкеты.Свойство("РегистрацияОтправитель"                   ,ИдентификаторПользователя);
			ДанныеАнкеты.Свойство("РегистрацияОповещениеОСтатусеВыполнено"   ,РегистрацияОповещениеОСтатусеВыполнено);
			
			Ответ.ОжиданиеПодтвержденияАнкеты = НЕ РегистрацияОповещениеОСтатусеВыполнено = Истина;
			
			Если Ответ.ОжиданиеПодтвержденияАнкеты = Ложь Тогда
				
				Возврат Ответ;
				
			КонецЕсли;

			// Выполнять операцию только если совпадает текущий пользователь и пользователь 
			// зарегистрировавший анкету
			Если ИдентификаторПользователя = Неопределено 
				ИЛИ НЕ ПараметрыСеанса.ТекущийПользователь = Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПользователя)) Тогда
				
				Ответ.ОжиданиеПодтвержденияАнкеты = Ложь;
				Возврат Ответ;
				
			КонецЕсли;
			
			// Если анкета зарегистрирована, но не подтверждена
			Если РегистрацияПринята = Истина 
				И НЕ РегистрацияОповещениеОСтатусеВыполнено = Истина Тогда
				
				// Получаем статус анкеты на данный момент
				ОписаниеСтатуса = ДанныеПоСостояниюАнкетыПродукта(ПродуктРегистрационныйНомер);
				
				Если ОписаниеСтатуса.СтатусРегистрацииКод >= 303 
					И ОписаниеСтатуса.СтатусРегистрацииКод <= 306 Тогда					
										
					Ответ.СтатусАнкетыИзмен    = Истина;
					Ответ.СтатусАнкетыОписание = ОписаниеСтатуса.СтатусРегистрацииОписание;
					
				КонецЕсли;
								
			Иначе
				
				Ответ.ОжиданиеПодтвержденияАнкеты = Ложь;
				
			КонецЕсли;
			
		Иначе
			
			Ответ.ОжиданиеПодтвержденияАнкеты = Истина;
			
		КонецЕсли;
		
	Исключение
		
		пОписаниеОшибки = ОписаниеОшибки();
		// Запись в журнал регистрации
	    ЗаписьЖурналаРегистрации("Web-сервис регистрация анкет", УровеньЖурналаРегистрации.Ошибка, , , "Вызов функции>>ПриНачалеРаботыСистемы" + Символы.ПС + "Ошибка: " + пОписаниеОшибки);

	КонецПопытки;
	
	Возврат Ответ;

КонецФункции

// Проверить необходимость оповещения пользователя при отсутствии регистрации программного продукта
Функция ПроверитьНеобходимостьОповещенияОРегистрацииПрограммногоПродукта() Экспорт	
	
	ОповеститьПользователя = Ложь;
	// Операция доступна только для пользователей с полными правами
	Если НЕ ПользовательИмеетПравоНаРаботуСличнымКабинетом() Тогда
		
		Возврат ОповеститьПользователя;
		
	КонецЕсли;
			
	// анкета не зарегистрирована
	ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
	
	Если ДанныеАнкеты = Неопределено 
		ИЛИ ДанныеАнкеты.Свойство("РегистрацияПринята") = Ложь
		ИЛИ НЕ ДанныеАнкеты.РегистрацияПринята = Истина Тогда
		
		ОповеститьПользователя = Истина;
		
	КонецЕсли;	
	
	Возврат ОповеститьПользователя;
	
КонецФункции

// Функция - Проверить разрешение получения счетов
// 
// Возвращаемое значение:
//   - 
// 
Функция ПроверитьРазрешениеПолученияСчетов() Экспорт
	
	Возврат ПользовательИмеетПравоНаРаботуСличнымКабинетом();
	
КонецФункции

// Проверить необходимость оповещения пользователя при отсутствии регистрации программного продукта
Функция ПроверитьНеобходимостьОповещенияОПолученииПодарка() Экспорт
	
	ОповеститьПользователя = Ложь;
	// Операция доступна только для пользователей с полными правами
	Если НЕ ПользовательИмеетПравоНаРаботуСличнымКабинетом() Тогда
		
		Возврат ОповеститьПользователя;
		
	КонецЕсли;
	
	ДанныеАнкеты = ПолучитьДанныеРегистрационнойАнкеты();
	
	Если ДанныеАнкеты = Неопределено 
		ИЛИ ДанныеАнкеты.Свойство("ПриветственноеНачислениеПолучено") = Ложь
		ИЛИ ДанныеАнкеты.ПриветственноеНачислениеПолучено <> Истина Тогда
		
		ОповеститьПользователя = Истина;
	КонецЕсли;
	
	Возврат ОповеститьПользователя;
	
КонецФункции

// Процедура - Записать флаг получения приветственного начисления
// 
Процедура ЗаписатьФлагПолученияПриветственногоНачисления(ПриветственноеНачислениеПолучено) Экспорт
	
	ЗаписатьРеквизитВДанныеРегистрационнойАнкеты("ПриветственноеНачислениеПолучено", ПриветственноеНачислениеПолучено);
	
КонецПроцедуры

// Функция, возвращает артикул продукта.
//
Функция ПолучитьАртикулПродукта() 
	
	Возврат "stomatology_2";
	
КонецФункции

// Функция - Ключ защиты используется
// 
// Возвращаемое значение:
//   - 
// 
Функция КлючЗащитыИспользуется() Экспорт
	
	КлючЗащитыИспользуется = Ложь;
	
	Попытка 
		
		ЗащитаСервер.СоздатьОбъект("Helix");
		КлючЗащитыИспользуется = Истина;
		
	Исключение	
		
		КлючЗащитыИспользуется = Ложь;
		
	КонецПопытки;	
	
	Возврат КлючЗащитыИспользуется;
	
КонецФункции

// Процедура - Установить УИДИнформационной базы
// 
Функция УстановитьУИДИнформационнойБазы() Экспорт
	
	Уид = Строка(Новый УникальныйИдентификатор());
	
	Константы.ЛичныйКабинетИдентификаторИБ.Установить(Уид);
	
	Возврат Уид;
	
КонецФункции

// Функция - Получить УИДИнформационной базы
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьУИДИнформационнойБазы() Экспорт
	
	Уид = Константы.ЛичныйКабинетИдентификаторИБ.Получить();
	
	Если Не ЗначениеЗаполнено(СокрЛП(Уид)) Тогда
		Уид = УстановитьУИДИнформационнойБазы();
	КонецЕсли;
	
	Возврат Уид;

КонецФункции

// Функция - Необходимо обновление параметров работы программы
// 
// Возвращаемое значение:
//   - 
// 
Функция НеобходимоОбновлениеПараметровРаботыПрограммы() Экспорт
	
	//ПараметрыКлиента = Новый Структура;
	//ПараметрыКлиента = СтандартныеПодсистемыВызовСервера.ПараметрыРаботыКлиентаПриЗапуске(ПараметрыКлиента);
	//
	//Возврат ПараметрыКлиента <> Неопределено И ПараметрыКлиента.Свойство("НеобходимоОбновлениеПараметровРаботыПрограммы") И ПараметрыКлиента.НеобходимоОбновлениеПараметровРаботыПрограммы = Истина;
	
	Возврат Ложь;
	
КонецФункции

// Функция - Линый кабинет в модели сервиса
// 
// Возвращаемое значение:
//   - 
// 
Функция ЛиныйКабинетВМоделиСервиса() Экспорт
	
	Возврат ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных();
			
КонецФункции

// Функция - Получить номер области
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьНомерОбласти() Экспорт
	
	Возврат РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
	
КонецФункции

// Функция - Получить имя перечисления
// 
// Параметры:
//  ИмяТипа				 - 	 - 
//  ЗначениеПеречисления - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьИмяПеречисления(ИмяТипа, ЗначениеПеречисления)
	
	Индекс = Перечисления[ИмяТипа].Индекс(ЗначениеПеречисления);
	
	Возврат ЗначениеПеречисления.Метаданные().ЗначенияПеречисления[Индекс].Имя;
	
КонецФункции

// Функция - Получить организацию салона
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьНаименованиеОрганизации()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка.Наименование КАК ОрганизацияНаименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ОрганизацияНаименование, Неопределено);
	
КонецФункции

// Получает все подчиненные файлы.
//
// Параметры:
//   ВладелецФайла - ЛюбаяСсылка - владелец файла.
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.Файлы - массив файлов.
//
Функция ПолучитьВсеПодчиненныеФайлы(ВладелецФайла, Описание)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ Файлы.ПометкаУдаления
	|	И (ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(100))) = &Описание");
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	Запрос.УстановитьПараметр("Описание"     , Описание);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция, создает или обновляет внешнюю систему в CRM.
//
Функция ОбработкаВнешнейСистемыВ_CRM_Ретранслятор(
		ВнешняяСистема, 
		ТекущаяСессия, 
		Используется = Истина, 
		СтруктураДополнительныхПараметров = Неопределено, 
		loginEvotor = Неопределено, 
		passwordEvotor =  Неопределено) Экспорт
	
	Попытка 
		
		ПользовательПубликации = Константы.ВнешняяПубликацияПользователь.Получить();
		
		Если Не ЗначениеЗаполнено(ПользовательПубликации) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
			
			Если Не ЗначениеЗаполнено(СлужебныйПользователь) Тогда
				СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			КонецЕсли;
			
			Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
			
		КонецЕсли;
		
		ПользовательСистемный = ПользователиСтоматология.ПолучитьПользователяПоУникальномуИдентификатору(ПользовательПубликации.ИдентификаторПользователяИБ);
		
		Если ПользовательСистемный = Неопределено Тогда
			ПользователиСтоматология.СоздатьСлужебногоПользователяAPIДляСотрудника(ПользовательПубликации);
			ПользовательСистемный = ПользователиСтоматология.ПолучитьПользователяПоУникальномуИдентификатору(ПользовательПубликации.ИдентификаторПользователяИБ);
		КонецЕсли;
		
		ЭтоОблачник 		  = (ЛичныйКабинет.ЛиныйКабинетВМоделиСервиса() = Истина);
		АдресПубликации       = Константы.ВнешняяПубликацияАдрес.Получить();
		КодПроверкиПубликации = Строка(Новый УникальныйИдентификатор); 		
		
		ЗаписатьКодПроверкиРубликации(КодПроверкиПубликации);
		
		Если Не ЭтоОблачник Тогда
			
			// Проверка публикации по регистрационному номеру анкеты.
			ДанныеАнкеты = ЛичныйКабинет.ПолучитьДанныеРегистрационнойАнкеты();
			
			Если Не ЗначениеЗаполнено(ДанныеАнкеты) Тогда
				ВызватьИсключение "Данные регистрационной анкеты не заполнены";
			ИначеЕсли Не ЗначениеЗаполнено(АдресПубликации) Тогда
				ВызватьИсключение "В ЛК не указан адрес публикации";
			КонецЕсли;
			
			Если Не ЭтоОблачник ИЛИ ПолучитьРеквизитИзДанныхРегистрационнойАнкеты("ПарольServiceUserAPIВнесенВCRM") <> Истина Тогда
				// Установка нового пароля Системному пользователю при неудачной поверке публикации. 	
				ПарольПользователя = ПользователиСтоматология.УстановитьНовыйСлучайныйПарольСлужебномуПользователюAPI(ПользовательПубликации.ИдентификаторПользователяИБ);
			Иначе
				ПарольПользователя = ПолучитьРеквизитИзДанныхРегистрационнойАнкеты("ПарольServiceUserAPI")
			КонецЕсли;
			
		
			
			ПарамтерыЗапроса = Новый Структура;
			ПарамтерыЗапроса.Вставить("publication_address", АдресПубликации);
			ПарамтерыЗапроса.Вставить("publication_user"   , ПользовательСистемный.Имя);
			ПарамтерыЗапроса.Вставить("check_code"         , КодПроверкиПубликации);		
			ПарамтерыЗапроса.Вставить("registration_number", ДанныеАнкеты.ПродуктРегистрационныйНомер);
			ПарамтерыЗапроса.Вставить("publication_password", ПарольПользователя);

			ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
			
			ДопЗаголовкиHTTP = Новый Соответствие;	
			ДопЗаголовкиHTTP.Вставить("session", ТекущаяСессия);
			
			Попытка
				РезультатЗапроса = ВыполнитьPUTЗапрос("external_app/publication", ТекстЗапроса, ДопЗаголовкиHTTP);
			Исключение
				Возврат ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке(), НСтр("ru = 'Произошла ошибка, связанная с подключением к серверу. Повторите попытку.'; en = 'An error occurred while connecting to the server. Try again.'"));
			КонецПопытки;
			
			РезультатаОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(РезультатЗапроса);	
			
			// Ошибка 1057 - в случае когда на стороне crm нет внешних систем по данной анкете.
			Если Не РезультатаОперции.ВыполненоУспешно
				И РезультатаОперции.КодОшибки <> 1057 Тогда
				
				Возврат РезультатаОперции;
			КонецЕсли;
			
			ПроверкаПубликацииУспешна = РезультатаОперции.ВыполненоУспешно;
			
		Иначе
			ПроверкаПубликацииУспешна = Ложь;
		КонецЕсли;
		
	Исключение
		РезультатаОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат РезультатаОперции; 

КонецФункции 

// Функция, получает активные подписки из ЦРМ.
//
Функция ПолучитьАктивныеПодпискиWhatsapp() Экспорт
	
	РезультатОперции = Неопределено; 
	
	ПараметрыAPIЦрм = ПараметрыПодклчюенияК_API_CRM();
	Метод = "/whatsapp/active_subscriptions";
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыAPIЦрм.АдресСервера,, ПараметрыAPIЦрм.Пользователь, ПараметрыAPIЦрм.Пароль); 	
	ЗаголовкиHTTP  = Новый Соответствие; 
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
	
	НомерОбласти 		= ЛичныйКабинет.ПолучитьНомерОбласти();
	РегНомерПродукта 	= ЛичныйКабинет.ПолучитьРегистрационныйНомерПродукта(); 
	
	Если НомерОбласти <> 0 Тогда
		ЗаголовкиHTTP.Вставить("areanumber"	, НомерОбласти);
	КонецЕсли; 
	
	ЗаголовкиHTTP.Вставить("registrationnumber" , РегНомерПродукта);
	
	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыAPIЦрм.АдресПубликации + Метод, ЗаголовкиHTTP);				
	
	Попытка
		
		Запрос = HTTPСоединение.Получить(HTTPЗапрос);
		
		ТекстJSON  = Запрос.ПолучитьТелоКакСтроку(); 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
		
		РезультатОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(ПараметрыJSON);
		
	Исключение
		
		РезультатОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатОперции; 
	
КонецФункции

// Функция, получает активные подписки из ЦРМ.
//
Функция ПолучитьНастройкиWhatsapp(ПодпискаUID, КлючПриложения) Экспорт
	
	РезультатОперции = Неопределено; 
	
	ПараметрыAPIЦрм = ПараметрыПодклчюенияК_API_CRM();
	Метод = "/whatsapp/settings";
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыAPIЦрм.АдресСервера,, ПараметрыAPIЦрм.Пользователь, ПараметрыAPIЦрм.Пароль); 	
	ЗаголовкиHTTP  = Новый Соответствие; 
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
	
	НомерОбласти 		= ЛичныйКабинет.ПолучитьНомерОбласти();
	РегНомерПродукта 	= ЛичныйКабинет.ПолучитьРегистрационныйНомерПродукта(); 
	
	Если НомерОбласти <> 0 Тогда
		ЗаголовкиHTTP.Вставить("areanumber" , НомерОбласти);
	КонецЕсли; 
	
	ЗаголовкиHTTP.Вставить("registrationnumber" , РегНомерПродукта); 
		
	ЗаголовкиHTTP.Вставить("subscription-uid", ПодпискаUID);
	ЗаголовкиHTTP.Вставить("application-key" , КлючПриложения);
	ЗаголовкиHTTP.Вставить("integrationtype", "GeneralGreenApiAccount");
	
	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыAPIЦрм.АдресПубликации + Метод, ЗаголовкиHTTP);				
	
	Попытка
		
		Запрос = HTTPСоединение.Получить(HTTPЗапрос);
		
		ТекстJSON  = Запрос.ПолучитьТелоКакСтроку(); 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
		
		РезультатОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(ПараметрыJSON);
		
	Исключение
		
		РезультатОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатОперции; 
	
КонецФункции 

// Функция, получает данные о сроке действия подписки.
//
Функция ОбновитьДанныеПодписки(КлючПриложения) Экспорт
	
	РезультатОперции = Неопределено; 
	
	ПараметрыAPIЦрм = ПараметрыПодклчюенияК_API_CRM();
	Метод = "/whatsapp/validity";
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыAPIЦрм.АдресСервера,, ПараметрыAPIЦрм.Пользователь, ПараметрыAPIЦрм.Пароль); 	
	ЗаголовкиHTTP  = Новый Соответствие; 
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
	
	//ЭтоОблачник = (ЛичныйКабинет.ЛиныйКабинетВМоделиСервиса() = Истина); 
	
	ЗаголовкиHTTP.Вставить("application-key", КлючПриложения); 

	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыAPIЦрм.АдресПубликации + Метод, ЗаголовкиHTTP);				
	
	Попытка
		
		Запрос = HTTPСоединение.Получить(HTTPЗапрос);
		
		ТекстJSON  = Запрос.ПолучитьТелоКакСтроку(); 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
		
		РезультатОперции = ОбработатьСтандартныйРезультатHTTPЗапроса(ПараметрыJSON);
		
	Исключение
		
		РезультатОперции = ОбработатьИсключениеПриВыполненииHTTPЗапроса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатОперции; 
	
КонецФункции 

#КонецОбласти


