
#Область ОбработчикиСобытий

&НаКлиенте
// Процедура - обработчик события "ОбработкаКоманды".
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОткрытьФорму("Документ.Прием.Форма.ФормаВыбораПриемовДляПечати", Новый Структура("МассивДокументов, ПечатьСправки", ПараметрКоманды, Истина),,,,, Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды", ПараметрКоманды)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Обработка команды завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	
	
	МассивДокументов = Результат;
	Если МассивДокументов = КодВозвратаДиалога.Отмена ИЛИ МассивДокументов = Неопределено Тогда 
		Возврат;
	ИначеЕсли ТипЗнч(МассивДокументов) = Тип("Массив") Тогда 	
		// поиск или создание документа "справка"
		СправкаВНалоговую = НайтиСоздатьДокументСправкаВНалоговую(ПараметрКоманды, МассивДокументов);
		МассивДокументов.Добавить(СправкаВНалоговую);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Прием", "ПФ_MXL_Справка", МассивДокументов, Неопределено, Неопределено);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Насервере
// Функция - Найти создать документ справка в налоговую
//
// Параметры:
//  Прием			 - 	 - 
//  МассивПриемов	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция НайтиСоздатьДокументСправкаВНалоговую(Прием, МассивПриемов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СправкаВНалоговуюПриемы.Ссылка КАК Справка
	|ИЗ
	|	Документ.СправкаВНалоговую.Приемы КАК СправкаВНалоговуюПриемы
	|ГДЕ
	|	СправкаВНалоговуюПриемы.Прием В(&Приемы)
	|	И СправкаВНалоговуюПриемы.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Справка");
	
	Запрос.УстановитьПараметр("Приемы", МассивПриемов);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Справка;
	Иначе
		
		ДанныеЗаполнения = Новый Структура("Прием, МассивПриемов", Прием[0], МассивПриемов);
		
		СправкаВНалоговую = Документы.СправкаВНалоговую.СоздатьДокумент();
		СправкаВНалоговую.Заполнить(ДанныеЗаполнения);
		СправкаВНалоговую.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат СправкаВНалоговую.Ссылка;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти