
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Запись.ИдентификаторЗаписи) Тогда
		ДокументыФискальнойОперации.Параметры.УстановитьЗначениеПараметра("ИдентификаторЗаписи", Запись.ИдентификаторЗаписи);
		КорректируемыеДокументыФискальнойОперации.Параметры.УстановитьЗначениеПараметра("ИдентификаторЗаписи", Запись.ИдентификаторЗаписи);
	//КонецЕсли;
		
	Реквизиты = МенеджерОборудованияВызовСервера.ДанныеФискальнойОперации(Запись.ИдентификаторЗаписи);
	Если Реквизиты <> Неопределено Тогда
		ТекстСообщенияXML = Реквизиты.ДанныеXML.Получить();
	КонецЕсли;
	
	//Элементы.КорректируемыйДокумент.Видимость = Не ПустаяСтрока(Запись.КорректируемыйДокумент);
	Если ЗначениеЗаполнено(ТекстСообщенияXML) И Реквизиты.ДополнительныйРеквизит = "Эвотор" Тогда
		
		ТекстXML.УстановитьТекст(ТекстСообщенияXML);
		
	ИначеЕсли ЗначениеЗаполнено(ТекстСообщенияXML) 
		И (Реквизиты.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек 
		Или Реквизиты.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧекКоррекции) Тогда
		
		ПараметрыФорматирования = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина, Истина, "  ");
		Попытка
			ТекстXML.УстановитьТекст(ФорматироватьXMLСПараметрами(ТекстСообщенияXML, ПараметрыФорматирования));
		Исключение
			ТекстXML.УстановитьТекст(ТекстСообщенияXML);
		КонецПопытки;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		Попытка
			ОбщиеПараметры = МенеджерОборудованияВызовСервера.ЗагрузитьДанныеФискализацииИзXML(ТекстСообщенияXML);
			Текст = МенеджерОборудованияКлиентСервер.СформироватьТекстНефискальногоДокумента(0, ОбщиеПараметры, 46);
		Исключение КонецПопытки;
	Иначе
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Форматирует текст сообщения в формате XML.
//
Функция ФорматироватьXMLСПараметрами(ТекстСообщенияXML, ПараметрыФорматирования)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстСообщенияXML);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(ПараметрыФорматирования);
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

&НаКлиенте
// Процедура - обработчик события "Выбор".
//
Процедура ДокументыФискальнойОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ДокументыФискальнойОперации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,Элементы.ДокументыФискальнойОперации.ТекущиеДанные.ДокументОснование);	   
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Выбор".
//
Процедура КорректируемыеДокументыФискальнойОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.КорректируемыеДокументыФискальнойОперации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,Элементы.КорректируемыеДокументыФискальнойОперации.ТекущиеДанные.ДокументОснование);	   
	
КонецПроцедуры 

#КонецОбласти
