
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	ИзменитьПорядокУТекущегоЭлемента(Истина);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	ИзменитьПорядокУТекущегоЭлемента(Ложь);
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура изменяет порядок текущего элемента
//
Процедура ИзменитьПорядокУТекущегоЭлемента(ПоднятьВверх)

	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СкидкиНаценки.Ссылка
		|ИЗ
		|	Справочник.СкидкиНаценки КАК СкидкиНаценки
		|ГДЕ
		|	СкидкиНаценки.Родитель = &Родитель
		|	И СкидкиНаценки.ПорядокПрименения " + ?(ПоднятьВверх, "<", ">") + " &Порядок
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкидкиНаценки.ПорядокПрименения " + ?(ПоднятьВверх, "Убыв", "Возр");
	
	Запрос.УстановитьПараметр("Родитель", ТекущаяСтрока.Родитель);
	Запрос.УстановитьПараметр("Порядок", ТекущаяСтрока.ПорядокПрименения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Объект1 = ТекущаяСтрока.ПолучитьОбъект();
	Объект2 = Выборка.Ссылка.ПолучитьОбъект();
	
	НачатьТранзакцию();
	
	Объект1.ПорядокПрименения = Объект2.Ссылка.ПорядокПрименения;
	Объект2.ПорядокПрименения = Объект1.Ссылка.ПорядокПрименения;
	Объект1.Записать();
	Объект2.Записать();
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	
	Если Элементы.Найти("ФормаСоздать") <> Неопределено Тогда
		Элементы.ФормаСоздать.Доступность  = НЕ (ТекСтрока = Неопределено);
	КонецЕсли; 
	Если  Элементы.Найти("СоздатьГруппу") <> Неопределено Тогда
	    Элементы.СоздатьГруппу.Доступность = НЕ (ТекСтрока = Неопределено);
    КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура, установить условное оформление.
//
Процедура УстановитьУсловноеОформление()
	
	// Задаем условное оформление.
	ОформлениеСписка = Список.УсловноеОформление.Элементы.Добавить();
		
	ЭлементОтбора = ОформлениеСписка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Активность");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементОтбора = ОформлениеСписка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтоГруппа");
	ЭлементОтбора.ПравоеЗначение = Ложь;

	ЦветТекста = ОформлениеСписка.Оформление.Элементы.Найти("ЦветТекста");
	ЦветТекста.Значение 	 = Новый Цвет(169,169,169);
	ЦветТекста.Использование = Истина;
	
КонецПроцедуры

//&НаКлиенте
//// Процедура Список перед началом добавления.
////
//Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//	
//	Если Элемент.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("Справочник.СкидкиНаценки.Скидки") ИЛИ 
//		Элемент.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("Справочник.СкидкиНаценки.Бонусы") И
//		Элемент.ТекущиеДанные.ЭтоГруппа = Истина Тогда
//		
//		Отказ 	  = Истина;
//		Структура = Новый Структура("ЗначенияЗаполнения", Новый Структура("Родитель", Элемент.ТекущиеДанные.Ссылка));
//		
//		ОткрытьФорму("Справочник.СкидкиНаценки.Форма.ФормаЭлемента", Структура);
//	КонецЕсли;

//КонецПроцедуры

#КонецОбласти
