
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОткатСторнированиеДокументовАванса.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ОткатСторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ОткатСторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ОткатСторнированиеДокументовАванса.Ссылка.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ОткатСторнированиеДокументовАванса.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ОткатСторнированиеДокументовАванса.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА ОткатСторнированиеДокументовАванса.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ ОткатСторнированиеДокументовАванса.Ссылка.Организация
	|	КОНЕЦ КАК Организация,
	|	NULL КАК ДокументОснования,
	|	ОткатСторнированиеДокументовАванса.ДокументАванса КАК ДокументАванса,
	|	СУММА(ОткатСторнированиеДокументовАванса.Сумма) КАК Сумма,
	|	NULL КАК ЭтоАванс
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ВозвратОтПокупателяЛечение.Сумма) КАК Сумма,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ВозвратОтПокупателяЛечение.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ КАК ДокументАванса,
	|		ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования КАК ДокументОснования,
	|		ВозвратОтПокупателяЛечение.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|			ПО ВозвратОтПокупателяЛечение.ДокументАванса = НарядЗаказЗапасы.Ссылка
	|				И ВозвратОтПокупателяЛечение.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа,
	|		Константа.НарядЗаказУвеличиваетЗадолженность КАК НарядЗаказУвеличиваетЗадолженность,
	|		Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|	ГДЕ
	|		ВозвратОтПокупателяЛечение.Ссылка = &Ссылка
	|		И ВозвратОтПокупателяЛечение.ДокументАванса В(&ДокументыАвансов)
	|		И ВозвратОтПокупателяЛечение.ДокументАванса ССЫЛКА Документ.НарядЗаказ
	|		И НарядЗаказУвеличиваетЗадолженность.Значение = ЛОЖЬ
	|		И УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования,
	|		ВозвратОтПокупателяЛечение.Ссылка,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ВозвратОтПокупателяЛечение.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВозвратОтПокупателяЗапасы.Сумма),
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ВозвратОтПокупателяЗапасы.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ,
	|		ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования,
	|		ВозвратОтПокупателяЗапасы.Ссылка
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|			ПО ВозвратОтПокупателяЗапасы.ДокументАванса = НарядЗаказЗапасы.Ссылка
	|				И ВозвратОтПокупателяЗапасы.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа,
	|		Константа.НарядЗаказУвеличиваетЗадолженность КАК НарядЗаказУвеличиваетЗадолженность,
	|		Константа.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов КАК УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов
	|	ГДЕ
	|		ВозвратОтПокупателяЗапасы.Ссылка = &Ссылка
	|		И ВозвратОтПокупателяЗапасы.ДокументАванса В(&ДокументыАвансов)
	|		И ВозвратОтПокупателяЗапасы.ДокументАванса ССЫЛКА Документ.НарядЗаказ
	|		И НарядЗаказУвеличиваетЗадолженность.Значение = ЛОЖЬ
	|		И УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов.Значение = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования,
	|		ВозвратОтПокупателяЗапасы.Ссылка,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ВозвратОтПокупателяЗапасы.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ) КАК ОткатСторнированиеДокументовАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	ОткатСторнированиеДокументовАванса.ДокументАванса,
	|	ОткатСторнированиеДокументовАванса.Ссылка.Дата,
	|	ОткатСторнированиеДокументовАванса.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ОткатСторнированиеДокументовАванса.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА ОткатСторнированиеДокументовАванса.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ ОткатСторнированиеДокументовАванса.Ссылка.Организация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ОткатСторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ОткатСторнированиеДокументовАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ОткатСторнированиеДокументовАванса.Ссылка.Контрагент
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	СторнированиеЗадолженностиНаОснованииАванса.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА НЕ СторнированиеЗадолженностиНаОснованииАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА СторнированиеЗадолженностиНаОснованииАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СторнированиеЗадолженностиНаОснованииАванса.Ссылка.Контрагент
	|	КОНЕЦ,
	|	СторнированиеЗадолженностиНаОснованииАванса.Ссылка.СтруктурнаяЕдиница,
	|	СторнированиеЗадолженностиНаОснованииАванса.Ссылка.СтруктурнаяЕдиница.Организация,
	|	СторнированиеЗадолженностиНаОснованииАванса.ДокументОснования,
	|	СторнированиеЗадолженностиНаОснованииАванса.ДокументАванса,
	|	СУММА(-СторнированиеЗадолженностиНаОснованииАванса.Сумма),
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ВозвратОтПокупателяЛечение.Сумма) КАК Сумма,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ВозвратОтПокупателяЛечение.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ КАК ДокументАванса,
	|		ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования КАК ДокументОснования,
	|		ВозвратОтПокупателяЛечение.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|			ПО ВозвратОтПокупателяЛечение.ДокументАванса = НарядЗаказЗапасы.Ссылка
	|				И ВозвратОтПокупателяЛечение.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа
	|	ГДЕ
	|		ВозвратОтПокупателяЛечение.Ссылка = &Ссылка
	|		И ВозвратОтПокупателяЛечение.ДокументАванса В(&ДокументыАвансов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования,
	|		ВозвратОтПокупателяЛечение.Ссылка,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ВозвратОтПокупателяЛечение.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВозвратОтПокупателяЗапасы.Сумма),
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ВозвратОтПокупателяЗапасы.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ,
	|		ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования,
	|		ВозвратОтПокупателяЗапасы.Ссылка
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
	|			ПО ВозвратОтПокупателяЗапасы.ДокументАванса = НарядЗаказЗапасы.Ссылка
	|				И ВозвратОтПокупателяЗапасы.НомерЗаказа = НарядЗаказЗапасы.НомерЗаказа
	|	ГДЕ
	|		ВозвратОтПокупателяЗапасы.Ссылка = &Ссылка
	|		И ВозвратОтПокупателяЗапасы.ДокументАванса В(&ДокументыАвансов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования,
	|		ВозвратОтПокупателяЗапасы.Ссылка,
	|		ВЫБОР
	|			КОГДА НарядЗаказЗапасы.ПланЛечения ЕСТЬ NULL
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = НЕОПРЕДЕЛЕНО
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|					ИЛИ НарядЗаказЗапасы.ПланЛечения = ЗНАЧЕНИЕ(Документ.ПланЛечения.ПустаяСсылка)
	|				ТОГДА ВозвратОтПокупателяЗапасы.ДокументАванса
	|			ИНАЧЕ НарядЗаказЗапасы.ПланЛечения
	|		КОНЕЦ) КАК СторнированиеЗадолженностиНаОснованииАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	СторнированиеЗадолженностиНаОснованииАванса.ДокументАванса,
	|	СторнированиеЗадолженностиНаОснованииАванса.ДокументОснования,
	|	СторнированиеЗадолженностиНаОснованииАванса.Ссылка.Дата,
	|	СторнированиеЗадолженностиНаОснованииАванса.Ссылка.СтруктурнаяЕдиница,
	|	СторнированиеЗадолженностиНаОснованииАванса.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ВЫБОР
	|		КОГДА НЕ СторнированиеЗадолженностиНаОснованииАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА СторнированиеЗадолженностиНаОснованииАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СторнированиеЗадолженностиНаОснованииАванса.Ссылка.Контрагент
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	СторнированиеЗадолженностиБезОснованияАванса.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА НЕ СторнированиеЗадолженностиБезОснованияАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА СторнированиеЗадолженностиБезОснованияАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СторнированиеЗадолженностиБезОснованияАванса.Ссылка.Контрагент
	|	КОНЕЦ,
	|	СторнированиеЗадолженностиБезОснованияАванса.Ссылка.СтруктурнаяЕдиница,
	|	СторнированиеЗадолженностиБезОснованияАванса.Ссылка.СтруктурнаяЕдиница.Организация,
	|	СторнированиеЗадолженностиБезОснованияАванса.ДокументОснования,
	|	NULL,
	|	СУММА(-СторнированиеЗадолженностиБезОснованияАванса.Сумма),
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования КАК ДокументОснования,
	|		СУММА(ВозвратОтПокупателяЛечение.Сумма) КАК Сумма,
	|		ВозвратОтПокупателяЛечение.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
	|	ГДЕ
	|		ВозвратОтПокупателяЛечение.Ссылка = &Ссылка
	|		И НЕ ВозвратОтПокупателяЛечение.ДокументАванса В (&ДокументыАвансов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозвратОтПокупателяЛечение.Ссылка.ДокументОснования,
	|		ВозвратОтПокупателяЛечение.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования,
	|		СУММА(ВозвратОтПокупателяЗапасы.Сумма),
	|		ВозвратОтПокупателяЗапасы.Ссылка
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	|	ГДЕ
	|		ВозвратОтПокупателяЗапасы.Ссылка = &Ссылка
	|		И НЕ ВозвратОтПокупателяЗапасы.ДокументАванса В (&ДокументыАвансов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования,
	|		ВозвратОтПокупателяЗапасы.Ссылка) КАК СторнированиеЗадолженностиБезОснованияАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	СторнированиеЗадолженностиБезОснованияАванса.ДокументОснования,
	|	СторнированиеЗадолженностиБезОснованияАванса.Ссылка.Дата,
	|	СторнированиеЗадолженностиБезОснованияАванса.Ссылка.СтруктурнаяЕдиница,
	|	СторнированиеЗадолженностиБезОснованияАванса.Ссылка.СтруктурнаяЕдиница.Организация,
	|	ВЫБОР
	|		КОГДА НЕ СторнированиеЗадолженностиБезОснованияАванса.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА СторнированиеЗадолженностиБезОснованияАванса.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СторнированиеЗадолженностиБезОснованияАванса.Ссылка.Контрагент
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА НЕ ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница,
	|	ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница.Организация,
	|	NULL,
	|	ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.ДокументАванса,
	|	ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.СуммаАванса,
	|	ИСТИНА
	|ИЗ
	|	Документ.ВозвратОтПокупателя.УчтенныеАвансы КАК ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы
	|ГДЕ
	|	ОткатСторнированияВозвратОтПокупателяУчтенныеАвансы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	СторнированиеВозвратОтПокупателяУчтенныеАвансы.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА НЕ СторнированиеВозвратОтПокупателяУчтенныеАвансы.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА СторнированиеВозвратОтПокупателяУчтенныеАвансы.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ СторнированиеВозвратОтПокупателяУчтенныеАвансы.Ссылка.Контрагент
	|	КОНЕЦ,
	|	СторнированиеВозвратОтПокупателяУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница,
	|	СторнированиеВозвратОтПокупателяУчтенныеАвансы.Ссылка.СтруктурнаяЕдиница.Организация,
	|	СторнированиеВозвратОтПокупателяУчтенныеАвансы.Ссылка.ДокументОснования,
	|	СторнированиеВозвратОтПокупателяУчтенныеАвансы.ДокументАванса,
	|	-СторнированиеВозвратОтПокупателяУчтенныеАвансы.СуммаАванса,
	|	NULL
	|ИЗ
	|	Документ.ВозвратОтПокупателя.УчтенныеАвансы КАК СторнированиеВозвратОтПокупателяУчтенныеАвансы
	|ГДЕ
	|	СторнированиеВозвратОтПокупателяУчтенныеАвансы.Ссылка = &Ссылка
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВложенныйЗапрос.НомерСтроки,
	//|	ВложенныйЗапрос.ВидДвижения,
	//|	ВложенныйЗапрос.Период,
	//|	ВложенныйЗапрос.Контрагент,
	//|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	//|	ВложенныйЗапрос.Организация,
	//|	NULL,
	//|	NULL,
	//|	ВложенныйЗапрос.Сумма,
	//|	NULL
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|		ПриемСкидкиНаценки.Ссылка.Дата КАК Период,
	//|		ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|		ПриемСкидкиНаценки.Ссылка.Контрагент КАК Контрагент,
	//|		СУММА(ПриемСкидкиНаценки.Сумма) * -1 КАК Сумма,
	//|		6 КАК НомерСтроки,
	//|		ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница.Организация КАК Организация
	//|	ИЗ
	//|		Документ.ВозвратОтПокупателя.СкидкиНаценки КАК ПриемСкидкиНаценки
	//|	ГДЕ
	//|		ПриемСкидкиНаценки.Ссылка = &Ссылка
	//|		И ПриемСкидкиНаценки.СкидкаНаценка.НачислениеНаЛицевойСчетУдалить = ИСТИНА
	//|		И ПриемСкидкиНаценки.НачислениеНаЛицевойСчетУдалить = ИСТИНА
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница,
	//|		ПриемСкидкиНаценки.Ссылка,
	//|		ПриемСкидкиНаценки.Ссылка.Контрагент,
	//|		ПриемСкидкиНаценки.Ссылка.Дата,
	//|		ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница.Организация) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВозвратОтПокупателя.Ссылка.Дата КАК Период,
	|	ВозвратОтПокупателя.Ссылка.Склад КАК Склад,
	|	ВозвратОтПокупателя.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВозвратОтПокупателя.Номенклатура КАК Номенклатура,
	|	ВозвратОтПокупателя.Количество КАК Количество,
	|	ВозвратОтПокупателя.Партия КАК Партия
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателя
	|ГДЕ
	|	ВозвратОтПокупателя.Ссылка = &Ссылка
	|	И НЕ ВозвратОтПокупателя.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВозвратОтПокупателяПодарки.Ссылка.Дата,
	|	ВозвратОтПокупателяПодарки.Ссылка.Склад,
	|	ВозвратОтПокупателяПодарки.Ссылка.СтруктурнаяЕдиница,
	|	ВозвратОтПокупателяПодарки.Номенклатура,
	|	ВозвратОтПокупателяПодарки.Количество,
	|	NULL
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Подарки КАК ВозвратОтПокупателяПодарки
	|ГДЕ
	|	ВозвратОтПокупателяПодарки.Ссылка = &Ссылка
	|	И НЕ ВозвратОтПокупателяПодарки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателяПродажи.Ссылка.Дата КАК Период,
	|	ВозвратОтПокупателяПродажи.НомерСтроки КАК НомерСтроки,
	|	ВозвратОтПокупателяПродажи.Ссылка.ДокументОснования КАК ДокументОснования,
	|	ВозвратОтПокупателяПродажи.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВозвратОтПокупателяПродажи.Ссылка.Сотрудник КАК Сотрудник,
	|	ВозвратОтПокупателяПродажи.Ссылка.Ассистент КАК Ассистент,
	|	ВозвратОтПокупателяПродажи.Ссылка.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВозвратОтПокупателяПродажи.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ ВозвратОтПокупателяПродажи.Ссылка.Склад
	|	КОНЕЦ КАК Склад,
	|	ВозвратОтПокупателяПродажи.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ВозвратОтПокупателяПродажи.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВозвратОтПокупателяПродажи.Количество * -1 КАК Количество,
	|	ВозвратОтПокупателяПродажи.СтоимостьБезСкидки * -1 КАК СтоимостьБезСкидки,
	|	ВозвратОтПокупателяПродажи.Стоимость * -1 КАК Стоимость,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратОтПокупателяПродажи.Ссылка.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяСсылка)
	|			ТОГДА ВозвратОтПокупателяПродажи.Ссылка.ПолисМедСтрахования.СтраховаяКомпания
	|		ИНАЧЕ ВозвратОтПокупателяПродажи.Ссылка.Контрагент
	|	КОНЕЦ КАК КонтрагентПлательщик,
	|	ВозвратОтПокупателяПродажи.НомерЗуба КАК НомерЗуба
	|ПОМЕСТИТЬ ВременнаяТаблицаПродажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаЗапасы.Ссылка КАК Ссылка,
	|		ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|		ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|		ТаблицаЗапасы.Партия КАК Партия,
	|		ТаблицаЗапасы.Количество КАК Количество,
	|		ТаблицаЗапасы.Цена * ТаблицаЗапасы.КоличествоУпаковок КАК СтоимостьБезСкидки,
	|		ТаблицаЗапасы.Сумма КАК Стоимость,
	|		NULL КАК НомерЗуба
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Запасы КАК ТаблицаЗапасы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаЛечение.Ссылка,
	|		ТаблицаЛечение.НомерСтроки,
	|		ТаблицаЛечение.Номенклатура,
	|		NULL,
	|		ТаблицаЛечение.Количество,
	|		ТаблицаЛечение.Цена * ТаблицаЛечение.Количество,
	|		ТаблицаЛечение.Сумма,
	|		ТаблицаЛечение.Зуб
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Лечение КАК ТаблицаЛечение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаПодарки.Ссылка,
	|		ТаблицаПодарки.НомерСтроки,
	|		ТаблицаПодарки.Номенклатура,
	|		NULL,
	|		ТаблицаПодарки.Количество,
	|		0,
	|		0,
	|		NULL
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.Подарки КАК ТаблицаПодарки) КАК ВозвратОтПокупателяПродажи
	|ГДЕ
	|	ВозвратОтПокупателяПродажи.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемСкидкиНаценки.Ссылка.ДокументОснования КАК ДокументОснования,
	|	ПриемСкидкиНаценки.Ссылка.Дата КАК Период,
	|	ПриемСкидкиНаценки.Ссылка.Контрагент КАК Контрагент,
	|	ПриемСкидкиНаценки.Ссылка.Сотрудник КАК Сотрудник,
	|	ПриемСкидкиНаценки.НоменклатураСкидки КАК Номенклатура,
	|	ЕСТЬNULL(ПриемСкидкиНаценки.СкидкаНаценка, ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка)) КАК СкидкаНаценка,
	|	ЕСТЬNULL(ПриемСкидкиНаценки.СкидкаНаценка.ЗначениеСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки,
	|	ПриемСкидкиНаценки.Сумма * -1 КАК СуммаСкидки
	|ПОМЕСТИТЬ ТаблицаПредоставленныеСкидки
	|ИЗ
	|	Документ.ВозвратОтПокупателя.СкидкиНаценки КАК ПриемСкидкиНаценки
	|ГДЕ
	|	ПриемСкидкиНаценки.Ссылка = &Ссылка
	|	И ЕСТЬNULL(ПриемСкидкиНаценки.Сумма, 0) <> 0
	|	И ПриемСкидкиНаценки.Использование = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ПриемЗапасы.Ссылка.ДокументОснования,
	|	ПриемЗапасы.Ссылка.Дата,
	|	ПриемЗапасы.Ссылка.Контрагент,
	|	ПриемЗапасы.Ссылка.Сотрудник,
	|	ПриемЗапасы.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка),
	|	ПриемЗапасы.ПроцентСкидкиНаценки,
	|	ПриемЗапасы.Количество * ПриемЗапасы.Цена * ПриемЗапасы.ПроцентСкидкиНаценки * 0.01
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка = &Ссылка
	|	И ПриемЗапасы.ПроцентСкидкиНаценки > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемЛечение.Ссылка.СтруктурнаяЕдиница,
	|	ПриемЛечение.Ссылка.ДокументОснования,
	|	ПриемЛечение.Ссылка.Дата,
	|	ПриемЛечение.Ссылка.Контрагент,
	|	ПриемЛечение.Ссылка.Сотрудник,
	|	ПриемЛечение.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СкидкиНаценки.ПустаяСсылка),
	|	ПриемЛечение.ПроцентСкидкиНаценки,
	|	ПриемЛечение.Количество * ПриемЛечение.Цена * ПриемЛечение.ПроцентСкидкиНаценки * 0.01
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Лечение КАК ПриемЛечение
	|ГДЕ
	|	ПриемЛечение.Ссылка = &Ссылка
	|	И ПриемЛечение.ПроцентСкидкиНаценки > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриемЗапасы.Ссылка.Дата КАК Период,
	|	ПриемЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриемЗапасы.Номенклатура КАК Сертификат,
	|	ПриемЗапасы.Партия КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА НЕ ПриемЗапасы.Номенклатура.ВидНоминала
	|			ТОГДА ПриемЗапасы.Номенклатура.Номинал * ПриемЗапасы.КоличествоУпаковок * -1
	|		ИНАЧЕ ПриемЗапасы.Цена * ПриемЗапасы.КоличествоУпаковок * -1
	|	КОНЕЦ КАК Сумма,
	|	ПриемЗапасы.Количество * -1 КАК Количество,
	|	ВЫБОР
	|		КОГДА ПриемЗапасы.Номенклатура.ЭтоИменнойСертификат
	|			ТОГДА ПриемЗапасы.Ссылка.Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Контрагент
	|ПОМЕСТИТЬ ВременнаяТаблицаСертификаты
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка = &Ссылка
	|	И ПриемЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПриемПодарки.Ссылка.Дата,
	|	ПриемПодарки.Ссылка.СтруктурнаяЕдиница,
	|	ПриемПодарки.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	|	ПриемПодарки.Номенклатура.Номинал * -1,
	|	ПриемПодарки.Количество * -1,
	|	NULL
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Подарки КАК ПриемПодарки
	|ГДЕ
	|	ПриемПодарки.Ссылка = &Ссылка
	|	И ПриемПодарки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|	ПриемСкидкиНаценки.Ссылка.Дата КАК Период,
	//|	ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ПриемСкидкиНаценки.Ссылка.Контрагент КАК Контрагент,
	//|	ЗНАЧЕНИЕ(Справочник.ВидыЛицевыхсчетов.ОсновнойЛицевойСчет) КАК ВидСчета,
	//|	СУММА(ПриемСкидкиНаценки.Сумма) * -1 КАК Сумма
	//|ПОМЕСТИТЬ ТаблицаДенежныеСредстваНаЛицевыхСчетах
	//|ИЗ
	//|	Документ.ВозвратОтПокупателя.СкидкиНаценки КАК ПриемСкидкиНаценки
	//|ГДЕ
	//|	ПриемСкидкиНаценки.Ссылка = &Ссылка
	//|	И ПриемСкидкиНаценки.СкидкаНаценка.НачислениеНаЛицевойСчетУдалить = ИСТИНА
	//|	И ПриемСкидкиНаценки.НачислениеНаЛицевойСчетУдалить = ИСТИНА
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПриемСкидкиНаценки.Ссылка.СтруктурнаяЕдиница,
	//|	ПриемСкидкиНаценки.Ссылка,
	//|	ПриемСкидкиНаценки.Ссылка.Контрагент,
	//|	ПриемСкидкиНаценки.Ссылка.Дата
	//|
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВозвратОтПокупателяЛечение.НомерСтроки) КАК НомерСтроки,
	|	ВозвратОтПокупателяЛечение.Ссылка.Дата КАК Период,
	|	ВозвратОтПокупателяЛечение.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыВыручка) КАК СчетКт,
	|	ВозвратОтПокупателяЛечение.Ссылка.Контрагент КАК СубконтоДт1,
	|	ВозвратОтПокупателяЛечение.Номенклатура.Специализация КАК СубконтоКт1,
	|	ВозвратОтПокупателяЛечение.Номенклатура КАК СубконтоКт2,
	|	ВозвратОтПокупателяЛечение.Ссылка.Сотрудник КАК СубконтоКт3,
	|	ВозвратОтПокупателяЛечение.Ссылка.Контрагент КАК СубконтоКт4,
	|	-СУММА(ВозвратОтПокупателяЛечение.Сумма) КАК Сумма,
	|	-СУММА(ВозвратОтПокупателяЛечение.Количество) КАК Количество,
	|	""Возврат от покупателя(Лечение)"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяЛечение
	|ГДЕ
	|	ВозвратОтПокупателяЛечение.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяЛечение.Ссылка.Дата,
	|	ВозвратОтПокупателяЛечение.Ссылка.СтруктурнаяЕдиница,
	|	ВозвратОтПокупателяЛечение.Ссылка.Контрагент,
	|	ВозвратОтПокупателяЛечение.Номенклатура,
	|	ВозвратОтПокупателяЛечение.Номенклатура.Специализация,
	|	ВозвратОтПокупателяЛечение.Ссылка.Сотрудник,
	|	ВозвратОтПокупателяЛечение.Ссылка.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ВозвратОтПокупателяЗапасы.НомерСтроки),
	|	ВозвратОтПокупателяЗапасы.Ссылка.Дата,
	|	ВозвратОтПокупателяЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыВыручка),
	|	ВозвратОтПокупателяЗапасы.Ссылка.Контрагент,
	|	ВозвратОтПокупателяЗапасы.Номенклатура.Специализация,
	|	ВозвратОтПокупателяЗапасы.Номенклатура,
	|	ВозвратОтПокупателяЗапасы.Ссылка.Сотрудник,
	|	ВозвратОтПокупателяЗапасы.Ссылка.Контрагент,
	|	-СУММА(ВозвратОтПокупателяЗапасы.Сумма),
	|	-СУММА(ВозвратОтПокупателяЗапасы.Количество),
	|	""Возврат от покупателя(Запасы)""
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	|ГДЕ
	|	ВозвратОтПокупателяЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяЗапасы.Ссылка.Дата,
	|	ВозвратОтПокупателяЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ВозвратОтПокупателяЗапасы.Ссылка.Контрагент,
	|	ВозвратОтПокупателяЗапасы.Номенклатура,
	|	ВозвратОтПокупателяЗапасы.Номенклатура.Специализация,
	|	ВозвратОтПокупателяЗапасы.Ссылка.Сотрудник,
	|	ВозвратОтПокупателяЗапасы.Ссылка.Контрагент";
			
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылка);
	Запрос.УстановитьПараметр("Контрагент"        , ДокументСсылка.Контрагент);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("ДокументыАвансов"  , ПолучитьДокументыАванса(ДокументСсылка));
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаЗапасыНаСкладах(СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства);
	СформироватьТаблицаПродажи(СтруктураДополнительныеСвойства);
	СформироватьТаблицаПредоставленныеСкидки(СтруктураДополнительныеСвойства);
//	СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(СтруктураДополнительныеСвойства);
	СформироватьТаблицаСертификаты(СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки КАК НомерСтроки,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументОснования КАК ДокументРеализации,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса КАК ДокументАванса,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ЭтоАванс КАК ЭтоАванс,
	|	СУММА(ТаблицаВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|ГДЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументОснования,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ЭтоАванс,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПродажи(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.НомерСтроки,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Склад,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ДокументОснования КАК ДокументПродажи,
	|	ТаблицаПродажи.Контрагент,
	|	ТаблицаПродажи.КонтрагентПлательщик,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СтоимостьБезСкидки) КАК СтоимостьБезСкидки,
	|	СУММА(ТаблицаПродажи.Стоимость) КАК Стоимость,
	|	ТаблицаПродажи.Сотрудник,
	|	ТаблицаПродажи.Ассистент,
	|	ТаблицаПродажи.НомерЗуба
	|ИЗ
	|	ВременнаяТаблицаПродажи КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.НомерСтроки,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Склад,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ДокументОснования,
	|	ТаблицаПродажи.Контрагент,
	|	ТаблицаПродажи.КонтрагентПлательщик,
	|	ТаблицаПродажи.Сотрудник,
	|	ТаблицаПродажи.Ассистент,
	|	ТаблицаПродажи.НомерЗуба";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПредоставленныеСкидки(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПредоставленныеСкидки.Период,
	|	ТаблицаПредоставленныеСкидки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПредоставленныеСкидки.ДокументОснования КАК ДокументПродажи,
	|	ТаблицаПредоставленныеСкидки.Контрагент,
	|	ТаблицаПредоставленныеСкидки.Сотрудник,
	|	ТаблицаПредоставленныеСкидки.Номенклатура,
	|	ТаблицаПредоставленныеСкидки.СкидкаНаценка,
	|	СУММА(ТаблицаПредоставленныеСкидки.СуммаСкидки) КАК СуммаСкидки,
	|	ТаблицаПредоставленныеСкидки.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки
	|ИЗ
	|	ТаблицаПредоставленныеСкидки КАК ТаблицаПредоставленныеСкидки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПредоставленныеСкидки.Период,
	|	ТаблицаПредоставленныеСкидки.СтруктурнаяЕдиница,
	|	ТаблицаПредоставленныеСкидки.ДокументОснования,
	|	ТаблицаПредоставленныеСкидки.Контрагент,
	|	ТаблицаПредоставленныеСкидки.Сотрудник,
	|	ТаблицаПредоставленныеСкидки.Номенклатура,
	|	ТаблицаПредоставленныеСкидки.СкидкаНаценка,
	|	ТаблицаПредоставленныеСкидки.ПроцентСкидкиНаценки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПредоставленныеСкидки", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры
                                        
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	|	ДенежныеСредстваНаЛицевыхСчетах.Период,
	|	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
	|	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета,
	|	ДенежныеСредстваНаЛицевыхСчетах.Сумма КАК Сумма
	|ИЗ
	|	ТаблицаДенежныеСредстваНаЛицевыхСчетах КАК ДенежныеСредстваНаЛицевыхСчетах";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаЛицевыхСчетах", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСертификаты(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПродажи.ВидДвижения,
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Сертификат,
	|	ТаблицаПродажи.СерийныйНомер,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	ТаблицаПродажи.Контрагент
	|ИЗ
	|	ВременнаяТаблицаСертификаты КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.ВидДвижения,
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.СтруктурнаяЕдиница,
	|	ТаблицаПродажи.Сертификат,
	|	ТаблицаПродажи.СерийныйНомер,
	|	ТаблицаПродажи.Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСертификаты", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	NULL КАК СубконтоДт2,
	|	NULL КАК СубконтоДт3,
	|	NULL КАК СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт3,
	|	ВременнаяТаблицаУправленческий.СубконтоКт4,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаУправленческий.НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|ГДЕ
	|	ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Содержание УБЫВ,
	|	НомерСтроки";
	
	//ВНИМАНИЕ!!! ДОП. ОБЪНДИНЕНИЕ НЕОБХОДИМО ДЛЯ ПРОСТАВЛЕНИЯ НЕОБХОДИМЫХ ТИПОВ В КОЛОНКИ
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыФункции

// Получить массив обязательных для заполнения реквизитов реквизитов
//
Процедура ПолучитьМассивыОбязательныхРеквизитов(ДокументОбъект, МассивОбязательныхРеквизитов) Экспорт
	
	МассивОбязательныхРеквизитов.Добавить("Контрагент");
	МассивОбязательныхРеквизитов.Добавить("СтруктурнаяЕдиница");
	МассивОбязательныхРеквизитов.Добавить("ВидЦен");
	МассивОбязательныхРеквизитов.Добавить("Склад");	
	// ---------------------------Запасы-----------------------------
	МассивОбязательныхРеквизитов.Добавить("Запасы.Номенклатура");
	МассивОбязательныхРеквизитов.Добавить("Запасы.Количество");
	МассивОбязательныхРеквизитов.Добавить("Запасы.КоличествоУпаковок");	
	МассивОбязательныхРеквизитов.Добавить("Запасы.Цена");
	МассивОбязательныхРеквизитов.Добавить("Запасы.СтавкаНДС");	
	// ---------------------------Лечение----------------------------
    МассивОбязательныхРеквизитов.Добавить("Лечение.Номенклатура");
	МассивОбязательныхРеквизитов.Добавить("Лечение.Количество");
    МассивОбязательныхРеквизитов.Добавить("Лечение.КоличествоУпаковок");
	МассивОбязательныхРеквизитов.Добавить("Лечение.Цена");
	МассивОбязательныхРеквизитов.Добавить("Лечение.СтавкаНДС");	

	Если НЕ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		МассивОбязательныхРеквизитов.Добавить("Запасы.Сумма");
		МассивОбязательныхРеквизитов.Добавить("Лечение.Сумма");
	КонецЕсли;	
	 
КонецПроцедуры

// Функция вернет массив не повторяющихся ссылок на документы аванса из указанного приема
Функция ПолучитьДокументыАванса(ДокументСсылка) Экспорт
	
	МассивВозврата  = Новый Массив;
	Для Каждого СтрокаТЧ ИЗ ДокументСсылка.Лечение Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ДокументАванса) И МассивВозврата.Найти(СтрокаТЧ.ДокументАванса) = Неопределено Тогда
		    МассивВозврата.Добавить(СтрокаТЧ.ДокументАванса);	
		КонецЕсли;
	КонецЦикла;
		Для Каждого  СтрокаТЧ ИЗ ДокументСсылка.Запасы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ДокументАванса) И МассивВозврата.Найти(СтрокаТЧ.ДокументАванса) = Неопределено Тогда
		    МассивВозврата.Добавить(СтрокаТЧ.ДокументАванса);	
		КонецЕсли;
	КонецЦикла;

	Возврат  МассивВозврата;
КонецФункции

// Функция, возвращает данные для возврата.
// 
Функция ПолучитьДанныеВозврата(СтруктурнаяЕдиница
								, Контрагент
								, НачалоПериода = Неопределено
								, КонецПериода = Неопределено
								, ДокументПродажи = Неопределено
								, ИсключениеТекущийДокумент = Неопределено) Экспорт
	
	ТаблицаТоваров        = ПолучитьДанныеВозвратаТоваров(СтруктурнаяЕдиница, Контрагент, НачалоПериода, КонецПериода, ДокументПродажи, ИсключениеТекущийДокумент);
	ТаблицаУслуг          = ПолучитьДанныеВозвратаУслуг(СтруктурнаяЕдиница, Контрагент, НачалоПериода, КонецПериода, ДокументПродажи, ИсключениеТекущийДокумент);
		//ТаблицаСертификатов   = ПолучитьДанныеВозвратаПоСертификатам(СтруктурнаяЕдиница, Контрагент, НачалоПериода, КонецПериода, ДокументПродажи, ИсключениеТекущийДокумент);
		
	Для Каждого СтрокаТ ИЗ ТаблицаТоваров Цикл
		
		ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(СтрокаТ);
		ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТ);	

		Если НЕ ЗначениеЗаполнено(СтрокаТ.Партия) Тогда
			СтрокаТ.Партия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТ ИЗ ТаблицаУслуг Цикл
		
		ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(СтрокаТ);
		ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТ);	

	КонецЦикла;
	
	Возврат Новый Структура("ТаблицаЗапасы, ТаблицаУслуги", ТаблицаТоваров, ТаблицаУслуг);
	
КонецФункции

// Функция - Получить данные возврата товаров
// 
// Параметры:
//  Дата						 - 	 - 
//  СтруктурнаяЕдиница			 - 	 - 
//  Контрагент					 - 	 - 
//  ДокументПродажи				 - 	 - 
//  ИсключениеТекущийДокумент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьДанныеВозвратаТоваров(СтруктурнаяЕдиница, Контрагент, НачалоПериода = Неопределено, КонецПериода = Неопределено, ДокументПродажи = Неопределено, ИсключениеТекущийДокумент = Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемЗапасы.Ссылка КАК Ссылка,
	|	ПриемЗапасы.КлючСтроки КАК КлючСтроки,
	|	ПриемЗапасы.Номенклатура КАК Номенклатура,
	|	ПриемЗапасы.Партия КАК Партия,
	|	ПриемЗапасы.Количество КАК Количество,
	|	ПриемЗапасы.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПриемЗапасы.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ПриемЗапасы.СуммаАвтоматическойСкидкиНаценки КАК СуммаАвтоматическойСкидкиНаценки,
	|	ПриемЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ПриемЗапасы.Сумма КАК Сумма,
	|	ПриемЗапасы.Цена КАК Цена,
	|	ПриемЗапасы.Ссылка.Склад КАК Склад,
	|	ПриемЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ПриемЗапасы.СуммаНДС КАК СуммаНДС,
	|	ПриемЗапасы.Упаковка КАК Упаковка,
	|	ПриемЗапасы.Ссылка.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВременнаяТаблицаПриемыРеализации
	|ИЗ
	|	Документ.Прием.Запасы КАК ПриемЗапасы
	|ГДЕ
	|	ПриемЗапасы.Ссылка.Проведен = ИСТИНА
	|	И (ПриемЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ ПриемЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество))
	|	И ПриемЗапасы.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ПриемЗапасы.Ссылка.Контрагент = &Контрагент
	|	И &УсловиеНачалоПериодаПрием
	|	И &УсловиеКонецПериодаПрием
	|	И &УсловиеДокументПрием
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияЗапасы.Ссылка,
	|	РеализацияЗапасы.КлючСтроки,
	|	РеализацияЗапасы.Номенклатура,
	|	РеализацияЗапасы.Партия,
	|	РеализацияЗапасы.Количество,
	|	РеализацияЗапасы.КоличествоУпаковок,
	|	РеализацияЗапасы.СуммаРучнойСкидки,
	|	РеализацияЗапасы.СуммаАвтоматическойСкидкиНаценки,
	|	РеализацияЗапасы.ПроцентСкидкиНаценки,
	|	РеализацияЗапасы.Сумма,
	|	РеализацияЗапасы.Цена,
	|	РеализацияЗапасы.Ссылка.Склад,
	|	РеализацияЗапасы.СтавкаНДС,
	|	РеализацияЗапасы.СуммаНДС,
	|	РеализацияЗапасы.Упаковка,
	|	РеализацияЗапасы.Ссылка.Сотрудник
	|ИЗ
	|	Документ.Реализация.Запасы КАК РеализацияЗапасы
	|ГДЕ
	|	РеализацияЗапасы.Ссылка.Проведен = ИСТИНА
	|	И (РеализацияЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ РеализацияЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество))
	|	И РеализацияЗапасы.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеализацияЗапасы.Ссылка.Контрагент = &Контрагент
	|	И &УсловиеНачалоПериодаРеализация
	|	И &УсловиеКонецПериодаРеализация
	|	И &УсловиеДокументРеализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования КАК ОснованиеВозврата,
	|	ВозвратОтПокупателяЗапасы.КлючСтроки КАК КлючСтроки,
	|	ВозвратОтПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ВозвратОтПокупателяЗапасы.Партия КАК Партия,
	|	ВозвратОтПокупателяЗапасы.Упаковка КАК Упаковка,
	|	СУММА(ВозвратОтПокупателяЗапасы.Количество) КАК Количество,
	|	СУММА(ВозвратОтПокупателяЗапасы.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ВозвратОтПокупателяЗапасы.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
	|	СУММА(ВозвратОтПокупателяЗапасы.СуммаАвтоматическойСкидкиНаценки) КАК СуммаАвтоматическойСкидкиНаценки,
	|	СУММА(ВозвратОтПокупателяЗапасы.Сумма) КАК Сумма,
	|	СУММА(ВозвратОтПокупателяЗапасы.Цена) КАК Цена,
	|	ВозвратОтПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВозвратОтПокупателяЗапасы.СуммаНДС) КАК СуммаНДС,
	|	ЕСТЬNULL(ВременнаяТаблицаПриемыРеализации.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
	|	ВозвратОтПокупателяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки
	|ПОМЕСТИТЬ ВременнаяТаблицаВозвраты
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Запасы КАК ВозвратОтПокупателяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПриемыРеализации КАК ВременнаяТаблицаПриемыРеализации
	|		ПО ВозвратОтПокупателяЗапасы.КлючСтроки = ВременнаяТаблицаПриемыРеализации.КлючСтроки
	|ГДЕ
	|	ВозвратОтПокупателяЗапасы.Ссылка.Проведен = ИСТИНА
	|	И (ВозвратОтПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ ВозвратОтПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество))
	|	И ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования.Контрагент = &Контрагент
	|	И ВозвратОтПокупателяЗапасы.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &УсловиеДокументВозвратОтПокупателя
	|	И ВозвратОтПокупателяЗапасы.Ссылка <> &ИсключаемыйДокументВозврата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования,
	|	ВозвратОтПокупателяЗапасы.КлючСтроки,
	|	ВозвратОтПокупателяЗапасы.Номенклатура,
	|	ВозвратОтПокупателяЗапасы.Партия,
	|	ВозвратОтПокупателяЗапасы.Упаковка,
	|	ВозвратОтПокупателяЗапасы.СтавкаНДС,
	|	ЕСТЬNULL(ВременнаяТаблицаПриемыРеализации.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)),
	|	ВозвратОтПокупателяЗапасы.ПроцентСкидкиНаценки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.КлючСтроки КАК КлючСтроки,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Партия КАК Партия,
	|	ВложенныйЗапрос.Упаковка КАК Упаковка,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	СУММА(ВложенныйЗапрос.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ВложенныйЗапрос.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
	|	СУММА(ВложенныйЗапрос.СуммаАвтоматическойСкидкиНаценки) КАК СуммаАвтоматическойСкидкиНаценки,
	|	СУММА(ВложенныйЗапрос.СуммаРучнойСкидки + ВложенныйЗапрос.СуммаАвтоматическойСкидкиНаценки) КАК СуммаСкидки,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Всего,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
	|	ВложенныйЗапрос.ДокументПродажи КАК ДокументПродажи,
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.ДокументПродажи.Дата КАК ДатаДокумента,
	|	ВложенныйЗапрос.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВложенныйЗапрос.ДокументПродажи.Представление КАК ДокументПродажиПредставление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВременнаяТаблицаПриемыРеализации.Ссылка КАК ДокументПродажи,
	|		ВременнаяТаблицаПриемыРеализации.КлючСтроки КАК КлючСтроки,
	|		ВременнаяТаблицаПриемыРеализации.Номенклатура КАК Номенклатура,
	|		ВременнаяТаблицаПриемыРеализации.Партия КАК Партия,
	|		ВременнаяТаблицаПриемыРеализации.Количество - ЕСТЬNULL(ВременнаяТаблицаВозвраты.Количество, 0) КАК Количество,
	|		ВременнаяТаблицаПриемыРеализации.КоличествоУпаковок - ЕСТЬNULL(ВременнаяТаблицаВозвраты.КоличествоУпаковок, 0) КАК КоличествоУпаковок,
	|		ВременнаяТаблицаПриемыРеализации.СуммаРучнойСкидки - ЕСТЬNULL(ВременнаяТаблицаВозвраты.СуммаРучнойСкидки, 0) КАК СуммаРучнойСкидки,
	|		ВременнаяТаблицаПриемыРеализации.СуммаАвтоматическойСкидкиНаценки - ЕСТЬNULL(ВременнаяТаблицаВозвраты.СуммаАвтоматическойСкидкиНаценки, 0) КАК СуммаАвтоматическойСкидкиНаценки,
	|		ВременнаяТаблицаПриемыРеализации.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ВременнаяТаблицаПриемыРеализации.Сумма - ЕСТЬNULL(ВременнаяТаблицаВозвраты.Сумма, 0) КАК Сумма,
	|		ВременнаяТаблицаПриемыРеализации.Цена КАК Цена,
	|		ВременнаяТаблицаПриемыРеализации.Склад КАК Склад,
	|		ВременнаяТаблицаПриемыРеализации.СтавкаНДС КАК СтавкаНДС,
	|		ВременнаяТаблицаПриемыРеализации.СуммаНДС - ЕСТЬNULL(ВременнаяТаблицаВозвраты.СуммаНДС, 0) КАК СуммаНДС,
	|		ВременнаяТаблицаПриемыРеализации.Упаковка КАК Упаковка,
	|		ВременнаяТаблицаПриемыРеализации.Сотрудник КАК Сотрудник
	|	ИЗ
	|		ВременнаяТаблицаПриемыРеализации КАК ВременнаяТаблицаПриемыРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВозвраты КАК ВременнаяТаблицаВозвраты
	|			ПО ВременнаяТаблицаПриемыРеализации.КлючСтроки = ВременнаяТаблицаВозвраты.КлючСтроки) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Упаковка,
	|	ВложенныйЗапрос.КлючСтроки,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Партия,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.ДокументПродажи,
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.ДокументПродажи.Дата,
	|	ВложенныйЗапрос.Номенклатура.ТипНоменклатуры,
	|	ВложенныйЗапрос.ДокументПродажи.Представление
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.КоличествоУпаковок) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументПродажи УБЫВ");
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНачалоПериодаПрием"		, "ПриемЗапасы.Ссылка.Дата >= &НачалоПериода");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНачалоПериодаРеализация"	, "РеализацияЗапасы.Ссылка.Дата >= &НачалоПериода");		
		Запрос.УстановитьПараметр("НачалоПериода"              , НачалоПериода);		
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНачалоПериодаПрием"		, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНачалоПериодаРеализация"	, "ИСТИНА");		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонецПериодаПрием"		, "ПриемЗапасы.Ссылка.Дата <= &КонецПериода");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонецПериодаРеализация"	, "РеализацияЗапасы.Ссылка.Дата <= &КонецПериода");		
		Запрос.УстановитьПараметр("КонецПериода"              , КонецПериода);		
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонецПериодаПрием"		, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонецПериодаРеализация"	, "ИСТИНА");		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументПродажи) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументПрием"				, "ПриемЗапасы.Ссылка = &ДокументПродажи");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументРеализация"			, "РеализацияЗапасы.Ссылка = &ДокументПродажи");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументВозвратОтПокупателя"	, "ВозвратОтПокупателяЗапасы.Ссылка.ДокументОснования = &ДокументПродажи");
		Запрос.УстановитьПараметр("ДокументПродажи" 		, ДокументПродажи);		
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументПрием"				, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументРеализация"			, "ИСТИНА");		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументВозвратОтПокупателя"	, "ИСТИНА");		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"         , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Контрагент"                 , Контрагент);
	Запрос.УстановитьПараметр("ИсключаемыйДокументВозврата", ИсключениеТекущийДокумент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция - Получить данные возврата по реализациям для услуг.
// 
// Параметры:
//  Дата						 - 	 - 
//  СтруктурнаяЕдиница			 - 	 - 
//  Контрагент					 - 	 - 
//  ДокументПродажи				 - 	 - 
//  ИсключениеТекущийДокумент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьДанныеВозвратаУслуг(СтруктурнаяЕдиница, Контрагент, НачалоПериода = Неопределено, КонецПериода = Неопределено, ДокументПродажи = Неопределено, ИсключениеТекущийДокумент = Неопределено)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемУслуги.Ссылка КАК Ссылка,
	|	ПриемУслуги.КлючСтроки КАК КлючСтроки,
	|	ПриемУслуги.Номенклатура КАК Номенклатура,
	|	ПриемУслуги.Количество КАК Количество,
	|	ПриемУслуги.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПриемУслуги.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ПриемУслуги.СуммаАвтоматическойСкидкиНаценки КАК СуммаАвтоматическойСкидкиНаценки,
	|	ПриемУслуги.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ПриемУслуги.Сумма КАК Сумма,
	|	ПриемУслуги.Цена КАК Цена,
	|	ПриемУслуги.Ссылка.Склад КАК Склад,
	|	ПриемУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ПриемУслуги.СуммаНДС КАК СуммаНДС,
	|	ПриемУслуги.Упаковка КАК Упаковка,
	|	ПриемУслуги.Ссылка.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВременнаяТаблицаПриемыРеализации
	|ИЗ
	|	Документ.Прием.Лечение КАК ПриемУслуги
	|ГДЕ
	|	ПриемУслуги.Ссылка.Проведен = ИСТИНА
	|	И ПриемУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И ПриемУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ПриемУслуги.Ссылка.Контрагент = &Контрагент
	|	И &УсловиеНачалоПериодаПрием
	|	И &УсловиеКонецПериодаПрием
	|	И &УсловиеДокументПрием
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Ссылка,
	|	РеализацияУслуги.КлючСтроки,
	|	РеализацияУслуги.Номенклатура,
	|	РеализацияУслуги.Количество,
	|	РеализацияУслуги.КоличествоУпаковок,
	|	РеализацияУслуги.СуммаРучнойСкидки,
	|	РеализацияУслуги.СуммаАвтоматическойСкидкиНаценки,
	|	РеализацияУслуги.ПроцентСкидкиНаценки,
	|	РеализацияУслуги.Сумма,
	|	РеализацияУслуги.Цена,
	|	РеализацияУслуги.Ссылка.Склад,
	|	РеализацияУслуги.СтавкаНДС,
	|	РеализацияУслуги.СуммаНДС,
	|	РеализацияУслуги.Упаковка,
	|	РеализацияУслуги.Ссылка.Сотрудник
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка.Проведен = ИСТИНА
	|	И РеализацияУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И РеализацияУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И РеализацияУслуги.Ссылка.Контрагент = &Контрагент
	|	И &УсловиеНачалоПериодаРеализация
	|	И &УсловиеКонецПериодаРеализация
	|	И &УсловиеДокументРеализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателяУслуги.Ссылка.ДокументОснования КАК ОснованиеВозврата,
	|	ВозвратОтПокупателяУслуги.КлючСтроки КАК КлючСтроки,
	|	ВозвратОтПокупателяУслуги.Номенклатура КАК Номенклатура,
	|	ВозвратОтПокупателяУслуги.Упаковка КАК Упаковка,
	|	СУММА(ВозвратОтПокупателяУслуги.Количество) КАК Количество,
	|	СУММА(ВозвратОтПокупателяУслуги.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ВозвратОтПокупателяУслуги.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
	|	СУММА(ВозвратОтПокупателяУслуги.СуммаАвтоматическойСкидкиНаценки) КАК СуммаАвтоматическойСкидкиНаценки,
	|	СУММА(ВозвратОтПокупателяУслуги.Сумма) КАК Сумма,
	|	СУММА(ВозвратОтПокупателяУслуги.Цена) КАК Цена,
	|	ВозвратОтПокупателяУслуги.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВозвратОтПокупателяУслуги.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаВозвраты
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Лечение КАК ВозвратОтПокупателяУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПриемыРеализации КАК ВременнаяТаблицаПриемыРеализации
	|		ПО ВозвратОтПокупателяУслуги.КлючСтроки = ВременнаяТаблицаПриемыРеализации.КлючСтроки
	|ГДЕ
	|	ВозвратОтПокупателяУслуги.Ссылка.Проведен = ИСТИНА
	|	И ВозвратОтПокупателяУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И ВозвратОтПокупателяУслуги.Ссылка.ДокументОснования.Контрагент = &Контрагент
	|	И ВозвратОтПокупателяУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &УсловиеДокументВозвратОтПокупателя
	|	И ВозвратОтПокупателяУслуги.Ссылка <> &ИсключаемыйДокументВозврата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяУслуги.Ссылка.ДокументОснования,
	|	ВозвратОтПокупателяУслуги.КлючСтроки,
	|	ВозвратОтПокупателяУслуги.Номенклатура,
	|	ВозвратОтПокупателяУслуги.Упаковка,
	|	ВозвратОтПокупателяУслуги.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.КлючСтроки КАК КлючСтроки,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Упаковка КАК Упаковка,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	СУММА(ВложенныйЗапрос.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ВложенныйЗапрос.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
	|	СУММА(ВложенныйЗапрос.СуммаАвтоматическойСкидкиНаценки) КАК СуммаАвтоматическойСкидкиНаценки,
	|	СУММА(ВложенныйЗапрос.СуммаРучнойСкидки + ВложенныйЗапрос.СуммаАвтоматическойСкидкиНаценки) КАК СуммаСкидки,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Всего,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
	|	ВложенныйЗапрос.ДокументПродажи КАК ДокументПродажи,
	|	ВложенныйЗапрос.ДокументПродажи.Дата КАК ДатаДокумента,
	|	ВложенныйЗапрос.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВложенныйЗапрос.ДокументПродажи.Представление КАК ДокументПродажиПредставление
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВременнаяТаблицаПриемыРеализации.Ссылка КАК ДокументПродажи,
	|		ВременнаяТаблицаПриемыРеализации.КлючСтроки КАК КлючСтроки,
	|		ВременнаяТаблицаПриемыРеализации.Номенклатура КАК Номенклатура,
	|		ВременнаяТаблицаПриемыРеализации.Количество - ЕСТЬNULL(ВременнаяТаблицаВозвраты.Количество, 0) КАК Количество,
	|		ВременнаяТаблицаПриемыРеализации.КоличествоУпаковок - ЕСТЬNULL(ВременнаяТаблицаВозвраты.КоличествоУпаковок, 0) КАК КоличествоУпаковок,
	|		ВременнаяТаблицаПриемыРеализации.СуммаРучнойСкидки - ЕСТЬNULL(ВременнаяТаблицаВозвраты.СуммаРучнойСкидки, 0) КАК СуммаРучнойСкидки,
	|		ВременнаяТаблицаПриемыРеализации.СуммаАвтоматическойСкидкиНаценки - ЕСТЬNULL(ВременнаяТаблицаВозвраты.СуммаАвтоматическойСкидкиНаценки, 0) КАК СуммаАвтоматическойСкидкиНаценки,
	|		ВременнаяТаблицаПриемыРеализации.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ВременнаяТаблицаПриемыРеализации.Сумма - ЕСТЬNULL(ВременнаяТаблицаВозвраты.Сумма, 0) КАК Сумма,
	|		ВременнаяТаблицаПриемыРеализации.Цена КАК Цена,
	|		ВременнаяТаблицаПриемыРеализации.Склад КАК Склад,
	|		ВременнаяТаблицаПриемыРеализации.СтавкаНДС КАК СтавкаНДС,
	|		ВременнаяТаблицаПриемыРеализации.СуммаНДС - ЕСТЬNULL(ВременнаяТаблицаВозвраты.СуммаНДС, 0) КАК СуммаНДС,
	|		ВременнаяТаблицаПриемыРеализации.Упаковка КАК Упаковка
	|	ИЗ
	|		ВременнаяТаблицаПриемыРеализации КАК ВременнаяТаблицаПриемыРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаВозвраты КАК ВременнаяТаблицаВозвраты
	|			ПО ВременнаяТаблицаПриемыРеализации.КлючСтроки = ВременнаяТаблицаВозвраты.КлючСтроки) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Упаковка,
	|	ВложенныйЗапрос.КлючСтроки,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.ДокументПродажи,
	|	ВложенныйЗапрос.ДокументПродажи.Дата,
	|	ВложенныйЗапрос.Номенклатура.ТипНоменклатуры,
	|	ВложенныйЗапрос.ДокументПродажи.Представление
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.КоличествоУпаковок) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументПродажи УБЫВ");	
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНачалоПериодаПрием"		, "ПриемУслуги.Ссылка.Дата >= &НачалоПериода");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНачалоПериодаРеализация"	, "РеализацияУслуги.Ссылка.Дата >= &НачалоПериода");		
		Запрос.УстановитьПараметр("НачалоПериода"              , НачалоПериода);		
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНачалоПериодаПрием"		, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНачалоПериодаРеализация"	, "ИСТИНА");		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонецПериодаПрием"		, "ПриемУслуги.Ссылка.Дата <= &КонецПериода");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонецПериодаРеализация"	, "РеализацияУслуги.Ссылка.Дата <= &КонецПериода");		
		Запрос.УстановитьПараметр("КонецПериода"              , КонецПериода);		
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонецПериодаРеализация"				, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонецПериодаВводНачальныхОстатков"	, "ИСТИНА");		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументПродажи) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументПрием"				, "ПриемУслуги.Ссылка = &ДокументПродажи");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументРеализация"			, "РеализацияУслуги.Ссылка = &ДокументПродажи");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументВозвратОтПокупателя" 	, "ВозвратОтПокупателяУслуги.Ссылка.ДокументОснования = &ДокументПродажи");
		Запрос.УстановитьПараметр("ДокументПродажи"            , ДокументПродажи);		
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументПрием"				, "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументРеализация"			, "ИСТИНА");		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументВозвратОтПокупателя"	, "ИСТИНА");		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"         , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Контрагент"                 , Контрагент);
	Запрос.УстановитьПараметр("ИсключаемыйДокументВозврата", ИсключениеТекущийДокумент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
	Возврат РезультатЗапроса;
		
КонецФункции

// Функция - Получить объединенную таблицу данных возврата.
//
Функция ПолучитьОбъединеннуюТаблицуДанныхВозврата(СтруктурнаяЕдиница
												, Контрагент
												, НачалоПериода = Неопределено
												, КонецПериода = Неопределено
												, ДокументПродажи = Неопределено
												, ИсключениеТекущийДокумент = Неопределено) Экспорт

	ДанныеВозврата = ПолучитьДанныеВозврата(СтруктурнаяЕдиница
											, Контрагент
											, НачалоПериода
											, КонецПериода
											, ДокументПродажи
											, ИсключениеТекущийДокумент);
		
	РезультирующаяТаблица = ДанныеВозврата.ТаблицаЗапасы.Скопировать();	
	
	ОбщегоНазначения.ОбъединитьТаблицыЗначений(РезультирующаяТаблица, ДанныеВозврата.ТаблицаУслуги);	
	РезультирующаяТаблица.Сортировать("ДатаДокумента Убыв");
	
	Возврат РезультирующаяТаблица;
												
КонецФункции												
												
												
#КонецОбласти

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли