
#Область СлужебныеПроцедурыИФункции

Функция ПроверитьИИсправитьНарушенностьВложений(Помещение, Исправление = Ложь) Экспорт
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Помещения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И Помещения.Ссылка <> &Ссылка
		|	И &СсылкаПустая = ЛОЖЬ
		|	И Помещения.СтруктурнаяЕдиница <> &УстановленнаяСтруктурнаяЕдиница";

	Запрос.УстановитьПараметр("Ссылка", Помещение.Ссылка);
	Запрос.УстановитьПараметр("СсылкаПустая", Помещение.Ссылка.Пустая());
	Запрос.УстановитьПараметр("УстановленнаяСтруктурнаяЕдиница", Помещение.СтруктурнаяЕдиница);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если Исправление = Истина Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() И Исправление = Истина Цикл
			ПомещениеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ПомещениеОбъект.СтруктурнаяЕдиница = Помещение.СтруктурнаяЕдиница;
			ПомещениеОбъект.Записать();    
		КонецЦикла;
	ИначеЕсли ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Функция, возвращает помещения, отобранные по указанным параметрам.
//
Функция ОтборПомещений(СтруктурнаяЕдиница, ВыбранныеПомещения = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Помещения.Родитель КАК Родитель,
	|	Помещения.Ссылка КАК Помещения
	|ИЗ
	|	Справочник.Помещения КАК Помещения
	|ГДЕ
	|	Помещения.ПометкаУдаления = ЛОЖЬ
	|	И Помещения.ОтображатьВРасписанииЗанятий = ИСТИНА
	|	И Помещения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Помещения.ЭтоГруппа = ЛОЖЬ                        
	|	И &УсловиеПомещения
	|
	|СГРУППИРОВАТЬ ПО
	|	Помещения.Ссылка,
	|	Помещения.Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Родитель,
	|	Помещения.Наименование");		
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Помещения"		  , ВыбранныеПомещения); 
	
	УсловиеПомещения = ?(ВыбранныеПомещения <> Неопределено, "И Помещения.Ссылка В (&Помещения) ИЛИ Помещения.Ссылка.Родитель В (&Помещения)", "");
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеПомещения", УсловиеПомещения);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещения");
	
		
КонецФункции

#КонецОбласти