
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на правельность принадлежности структурной единицы в иерархии
	Если СтруктурнаяЕдиница <> Родитель.СтруктурнаяЕдиница И Не Родитель.Пустая() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка - Клиника помещения должна совпадать с клиникой группы помещений!");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Родитель") И Не ДанныеЗаполнения.Родитель.СтруктурнаяЕдиница.Пустая() Тогда
			СтруктурнаяЕдиница = ДанныеЗаполнения.Родитель.СтруктурнаяЕдиница;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница") Тогда	
			Если ТипЗнч(ДанныеЗаполнения.СтруктурнаяЕдиница) = Тип("Массив") Тогда
				
				Если ДанныеЗаполнения.СтруктурнаяЕдиница.Количество() > 0 Тогда
					
					СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница[0];
					
				КонецЕсли;
				
			ИначеЕсли Не ДанныеЗаполнения.СтруктурнаяЕдиница.Пустая() Тогда
				
				СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;	
				
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктурнаяЕдиница.Пустая() Тогда
			
			СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	КодСинхронизации = "";
КонецПроцедуры

#КонецОбласти