
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Дата", ЭтотОбъект.Дата);
	Параметры.Свойство("Сотрудник", ЭтотОбъект.Сотрудник);	
	Параметры.Свойство("СтруктурнаяЕдиница", ЭтотОбъект.СтруктурнаяЕдиница);
	Параметры.Свойство("СоздаватьПриемПриЗаписи", ЭтотОбъект.СоздаватьПриемПриЗаписи);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница) Тогда
		ЭтотОбъект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	РезультатПостроенияСписка = ЗаполнитьТаблицуЛистОжиданияПациентовИСоздатьЭлементыСписка();
	
	Если РезультатПостроенияСписка = Ложь Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры 

// Процедура - При открытии.
//
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ДекорацияВыравнивание;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, удаляет пациента из листа ожидания.
//
Процедура УдалитьИзЛистаОжидания(Команда)
	
	НомерСтроки = ВернутьНомерСтрокиСписка(ТекущийЭлемент.Имя);
	Если НЕ НомерСтроки = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("УдалитьИзЛистаОжиданияЗавершение", ЭтотОбъект, Новый Структура("НомерСтроки", НомерСтроки));
		ПоказатьВопрос(Оповещение, "Вы действительно хотите удалить данного пациента из листа ожидания?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает журнал приемов для записи пациента.
//
Процедура ЗаписатьКонтрагента(Команда)

	НомерСтроки = ВернутьНомерСтрокиСписка(ТекущийЭлемент.Имя);
	
	Если НЕ НомерСтроки = Неопределено Тогда
		
		ВыбранныйКонтрагент = ЭтотОбъект.ЛистОжиданияПациентов[НомерСтроки].Контрагент;
		
		Если СоздаватьПриемПриЗаписи Тогда
			
			ЭтаФорма.Закрыть(ВыбранныйКонтрагент);
			
		Иначе
			
			ПараметрыОткрытия = Новый Структура("Контрагент, КонтролироватьЗаписьПациентаПоСотруднику, СотрудникПриКонтролеЗаписиПациента",
												ВыбранныйКонтрагент, Истина, ЭтотОбъект.Сотрудник);
			
			ЭтаФорма.Закрыть();
			
			Оповестить("СозданиеСобытияСКонтрагентом", ПараметрыОткрытия);
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, осуществляет исходящий звонок пациенту.
//
Процедура ПозвонитьКонтрагенту(Команда)
	
	НомерСтроки = ВернутьНомерСтрокиСписка(ТекущийЭлемент.Имя);	
	
	Если НЕ НомерСтроки = Неопределено Тогда
		
		НомерТелефона = ЭтотОбъект.ЛистОжиданияПациентов[НомерСтроки].НомерТелефона;
		
		Если НЕ СтрНайти(НомерТелефона, ",") = 0 Тогда
			МассивТелефонов = СтрРазделить(НомерТелефона, ",", Ложь);
			Если ЗначениеЗаполнено(МассивТелефонов) Тогда
				НомерТелефона = МассивТелефонов[0];
			КонецЕсли;			
		КонецЕсли;
		
		IPТелефонияКлиент.ИсходящийЗвонокОсуществитьПоКонтрагенту(ЭтотОбъект.ЛистОжиданияПациентов[НомерСтроки].Контрагент, НомерТелефона);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, заполняет таблицу ЛистОжиданияПациентов. 
//
Функция ЗаполнитьТаблицуЛистОжиданияПациентовИСоздатьЭлементыСписка()
	
	ЭтотОбъект.ЛистОжиданияПациентов.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнтервалыЛистаОжидания.Контрагент КАК Контрагент,
	|	ИнтервалыЛистаОжидания.ПериодДняСтрокой КАК ПериодДняСтрокой,
	|	ИнтервалыЛистаОжидания.Комментарий КАК Комментарий,
	|	ИнтервалыЛистаОжидания.Контрагент.Телефон КАК НомерТелефона,
	|	ИнтервалыЛистаОжидания.ДатаЗаписи КАК ДатаЗаписи
	|ИЗ
	|	РегистрСведений.ИнтервалыЛистаОжидания КАК ИнтервалыЛистаОжидания
	|ГДЕ
	|	ИнтервалыЛистаОжидания.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ИнтервалыЛистаОжидания.Дата = &Дата
	|	И ИнтервалыЛистаОжидания.Сотрудник = &Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнтервалыЛистаОжидания.ДатаЗаписи");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ЭтотОбъект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.Сотрудник);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Элементы.Найти("ГруппаСписокПациентовДинамический") = Неопределено Тогда
		Элементы.Удалить(Элементы.ГруппаСписокПациентовДинамический);
	КонецЕсли;
	
	ПараметрыСоздаваемойГруппы = Новый Структура;
	ПараметрыСоздаваемойГруппы.Вставить("ИмяЭлемента", "ГруппаСписокПациентовДинамический");
	ПараметрыСоздаваемойГруппы.Вставить("ШиринаГруппы", 0);
	ПараметрыСоздаваемойГруппы.Вставить("ГруппаЭлемента", Элементы.ОбщаяГруппаДляСпискаЛистаОжидания);
	ПараметрыСоздаваемойГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ГруппаСписокПациентов = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыСоздаваемойГруппы, Ложь);
	ГруппаСписокПациентов.РастягиватьПоГоризонтали = Истина;
	
	ПрефиксЭлемента = 0;
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ЭтотОбъект.ЛистОжиданияПациентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	
		// Создадим элементы списка динамически.
		
		ОбщаяГруппаСтрокаСписка = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ОбщаяГруппаСтрокаСписка_, ПрефиксЭлемента, ГруппаСписокПациентов);
		
		ГруппаСтрокаСписка = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ГруппаСтрокаСписка_, ПрефиксЭлемента, ОбщаяГруппаСтрокаСписка);
		
		ПериодДня = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Элементы.ПериодЗаписи_, ПрефиксЭлемента,, ГруппаСтрокаСписка);
		ПериодДня.ПутьКДанным = "ЛистОжиданияПациентов["+ПрефиксЭлемента+"].ПериодДняСтрокой";
		
		Контрагент = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Элементы.Контрагент_, ПрефиксЭлемента,, ГруппаСтрокаСписка);
		Контрагент.ПутьКДанным = "ЛистОжиданияПациентов["+ПрефиксЭлемента+"].Контрагент";
		
		ТелефонКонтрагента = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Элементы.ТелефонКонтрагента_, ПрефиксЭлемента,, ГруппаСтрокаСписка);
		ТелефонКонтрагента.ПутьКДанным = "ЛистОжиданияПациентов["+ПрефиксЭлемента+"].НомерТелефона";
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.НомерТелефона) Тогда
			ТелефонКонтрагента.Доступность = Ложь;
		КонецЕсли;
				
		ПозвонитьКонтрагенту = УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Элементы.ПозвонитьКонтрагенту_, ПрефиксЭлемента, ГруппаСтрокаСписка,,,, Ложь);
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.НомерТелефона) Тогда
			ПозвонитьКонтрагенту.Доступность = Ложь;
		КонецЕсли;
		
		ГруппаЗаписатьКонтрагента = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ГруппаЗаписатьКонтрагента_, ПрефиксЭлемента, ГруппаСтрокаСписка);
        ЗаписатьКонтрагента = УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Элементы.ЗаписатьКонтрагента_, ПрефиксЭлемента, ГруппаЗаписатьКонтрагента,,,, Ложь);
		
		УдалитьИзЛистаОжидания = УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, Элементы.УдалитьИзЛистаОжидания_, ПрефиксЭлемента, ГруппаСтрокаСписка,,,, Ложь);
		
		Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
			
			ГруппаКомментарийСтрокиСписка = УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, Элементы.ГруппаКомментарийСтрокиСписка_, ПрефиксЭлемента, ОбщаяГруппаСтрокаСписка);
			
			ДекорацияДляКомментария = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Элементы.ДекорацияДляКомментария_, ПрефиксЭлемента, Тип("ДекорацияФормы"), ГруппаКомментарийСтрокиСписка);
			
			ДекорацияКомментарий = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Элементы.ДекорацияКомментарий_, ПрефиксЭлемента, Тип("ДекорацияФормы"), ГруппаКомментарийСтрокиСписка);
			ДекорацияКомментарий.Заголовок = Выборка.Комментарий;
			
			//Комментарий = УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, Элементы.Комментарий_, ПрефиксЭлемента,, ГруппаКомментарийСтрокиСписка);
			//Комментарий.ПутьКДанным = "ЛистОжиданияПациентов["+ПрефиксЭлемента+"].Комментарий";
			
		КонецЕсли;
		
		ПрефиксЭлемента = ПрефиксЭлемента + 1;
		
	КонецЦикла;

	Элементы.ГруппаСтрокаСписка_.Видимость = Ложь;
	Элементы.ГруппаКомментарийСтрокиСписка_.Видимость = Ложь;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения "УдалитьИзЛистаОжиданияЗавершение".
//
Процедура УдалитьИзЛистаОжиданияЗавершение(Результат, ДопПараметры) Экспорт

	Если НЕ Результат = Неопределено И Результат = КодВозвратаДиалога.Да
		И ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("НомерСтроки") Тогда
		
		РезультатПостроенияСписка = Истина;
		УдалитьПациентаИзЛистаОжиданияИПерерисоватьФормуНаСервере(ДопПараметры.НомерСтроки, РезультатПостроенияСписка);
		
		Оповестить("ОбновлениеРабочегоСтола");
		
		Если РезультатПостроенияСписка = Ложь Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, удаляет пациента из листа ожидания, а также строку из списка.
//
Процедура УдалитьПациентаИзЛистаОжиданияИПерерисоватьФормуНаСервере(НомерСтрокиЛиста, РезультатПостроенияСписка)
	
	КонтрагентДляУдаленияЗаписей = ЭтотОбъект.ЛистОжиданияПациентов[НомерСтрокиЛиста].Контрагент;
	РегистрыСведений.ИнтервалыЛистаОжидания.УдалитьПациентаИзЛистаОжидания(ЭтотОбъект.СтруктурнаяЕдиница, ЭтотОбъект.Сотрудник, КонтрагентДляУдаленияЗаписей);
	РезультатПостроенияСписка = ЗаполнитьТаблицуЛистОжиданияПациентовИСоздатьЭлементыСписка();
	
КонецПроцедуры

&НаКлиенте
// Функция, возвращает номер строки нажатого элемента.
//
Функция ВернутьНомерСтрокиСписка(НажатыйЭлемент)
	
	Если НажатыйЭлемент = Неопределено Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	ДанныеКнопки = СтрРазделить(НажатыйЭлемент, "_", Ложь);
	
	Если НЕ ДанныеКнопки.Количество() = 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НомерСтроки = Число(ДанныеКнопки[1]);
	
	Если НомерСтроки > ЭтотОбъект.ЛистОжиданияПациентов.Количество()-1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НомерСтроки;
	
КонецФункции

#КонецОбласти
