
#Область ОбработчикиСобытийФормы

// Процедура, обработчик события "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	РаботаСДиалогами.УстановитьДоступностьЭлементовФормДокументаПоПравамПользователя(ЭтаФорма, Объект);

	// Установим реквизиты
	Если Не ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		Объект.ВидЦен = Справочники.ВидыЦен.Закупочная;
	КонецЕсли;

	ВывестиВидЦенИСтруктурнуюЕдиницу();	
	
	ВидОперации = Объект.ВидОперации;	
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы); 	

	// Исключим настройку доступности из стандартной по правам пользователя
	Элементы.ЗапасыЦена.ТолькоПросмотр 	= Ложь;
	Элементы.ЗапасыЦена.Доступность 	= Истина;		

	СоздатьМенюУправленияТабличнымиЧастями();
	ОбновитьЗаголовкиТабЧастейНаСервере();
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.ОприходованиеЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
		РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события "ПослеЗаписи"
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСтоматология.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура, обработчик события "ПриИзменении" поле ввода "Склад"
//
&НаКлиенте
Процедура СкладПриИзменении(Элемент)  		
	УстановитьДоступностьЭлементов();	
КонецПроцедуры
 
// Процедура, обработчик события "ПриИзменении" поле ввода "КоличествоУпаковок"
//
&НаКлиенте
Процедура ЗапасыКоличествоУпаковокПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТабличнойЧасти);  	
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "Цена"
//
&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры
                                                            
// Процедура, обработчик события "ПриИзменении" поле ввода "Сумма"
//
&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииСуммыВТабличнойЧасти(СтрокаТабличнойЧасти);
	
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТабличнойЧасти);	
	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "Номенклатура"
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент, СтрокаДанных = Неопределено)
	
	Если СтрокаДанных = Неопределено Тогда
		СтрокаДанных = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.Упаковка) Тогда	
		СтрокаДанных.Упаковка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "УпаковкаПоумолчанию");	
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", 		СтрокаДанных.Номенклатура);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Упаковка", 			СтрокаДанных.Упаковка);
	
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаДанных.Упаковка = СтруктураДанные.Упаковка;
	СтрокаДанных.Цена = СтруктураДанные.Цена; 
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.КоличествоУпаковок) Тогда
		СтрокаДанных.КоличествоУпаковок = 1;
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаДанных);
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаДанных); 
	
	СтрокаДанных.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ИспользоватьПартии");
	СтрокаДанных.ЭтоСертификат = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ТипНоменклатуры") = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));
	
	ОбновитьЗаголовкиТабЧастейНаСервере();
	
КонецПроцедуры

// Процедура, обработчик  события "ПриИзменении" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;	
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);	

	ОбработкаТабличныхЧастейКлиент.ПриИзмененииУпаковкиТабЧасти(ТекущаяСтрока, СтруктураДанные);
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)

	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции

// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.Запасы.ТекущиеДанные);
	
КонецПроцедуры

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	 ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
	 ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТабличнойЧасти);	
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаКлиенте 
// Процедура, Обработчик события "ВидЦенНадписьНажатие".
//
Процедура ВидЦенНадписьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидЦен", 	  			Объект.ВидЦен);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	Ложь);
	
	// 2. Открвыаем форму "Цены и Валюта".
	ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,,Новый ОписаниеОповещения("РедактироватьЦеныЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура, обработчик события нажатие кнопки "ПерезаполнитьПоИнвентаризации"
//
&НаКлиенте
Процедура ПерезаполнитьПоИнвентаризации(Команда)
	
	Если Объект.ДокументОснование.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Этот документ не имеет основания!'");
		Сообщение.Сообщить();
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьПоИнвентаризацииЗавершение", ЭтотОбъект), "Вы уверены, что хотите перезаполнить документ по основанию?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перезаполнить по инвентаризации завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПерезаполнитьПоИнвентаризацииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Запасы.Очистить();
		ЗаполнитьПоИнвентаризацииНаСервере();
	КонецЕсли;

КонецПроцедуры

// Процедура, выполняет заполнение таблицы "Запасы" данными по инвентаризации.
//  Параметры:
//   Нет;
//
&НаСервере
Процедура ЗаполнитьПоИнвентаризацииНаСервере()

	ВремОбъект = РеквизитФормыВЗначение("Объект");

	ВремОбъект.ОбработкаЗаполнения(Объект.ДокументОснование, );

	ЗначениеВРеквизитФормы(ВремОбъект, "Объект");
		   
	Модифицированность = Истина;

КонецПроцедуры
	
// Процедура оработчик команды "Подбор"
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти  = "Запасы";
	ЕстьПартии		   = Истина;
		
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",				   Объект.Дата);
	ПараметрыПодбора.Вставить("Склад",	   			   Объект.Склад);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница",	   Объект.СтруктурнаяЕдиница);
	ПараметрыПодбора.Вставить("ВидЦен",	   			   Объект.ВидЦен);
	ПараметрыПодбора.Вставить("ИспользуетсяСодержание",Истина);
	ПараметрыПодбора.Вставить("ПодборДляПоступленияНаСклад",Истина);

	Если Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда
		АдресЗапасовВХранилище = ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии);
		ПараметрыПодбора.Вставить("АдресЗапасовДокумента", АдресЗапасовВХранилище);
	КонецЕсли; 
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры",	   ТипНоменклатуры);
		
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда			
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("СтатусПартии",	   		СтатусПартии);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ЕстьПартии", ЕстьПартии);

	ОткрытьФорму("ОбщаяФорма.ФормаПодбора",
	ПараметрыПодбора,,,,,
	Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура - После выбора подбора
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПодборЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ПолучитьЗапасыИзХранилища(РезультатВыбора, ДополнительныеПараметры.ИмяТабличнойЧасти, ДополнительныеПараметры.ЕстьПартии);
		ОбновитьЗаголовкиТабЧастейНаСервере();
	КонецЕсли; 	
	
КонецПроцедуры
&НаКлиенте
//  Процедура обработчик команды "Импорт".
//
Процедура Импорт(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "ОприходованиеЗапасов.Запасы");
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяОбъектаЗаполнения", "Документ.ОприходованиеЗапасов.ТабличнаяЧасть.Запасы");	
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ru = 'Загрузка запасов из файла'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	//	НастройкиЗагрузкиДанных.Вставить("ПоложениеДатыВЗаказе", Объект.ПоложениеДатыОтгрузки);
	//  НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайлаЗапасы");
	//	НастройкиЗагрузкиДанных.Вставить("ПоложениеСклада", Объект.ПоложениеСклада);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);

КонецПроцедуры

&НаСервере
// Функция получает список товаров из временного хранилища
//
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
		СтруктураОтбора.Вставить("Упаковка", СтрокаЗагрузки.Упаковка);
		Если ЕстьПартии Тогда
			СтруктураОтбора.Вставить("Партия", СтрокаЗагрузки.Партия);
		КонецЕсли;
		
		Строки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			
			СтрокаТабличнойЧасти = Строки[0];
		Иначе
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти].Добавить();
		КонецЕсли;
			
	    СтрокаТабличнойЧасти.Номенклатура                    = СтрокаЗагрузки.Номенклатура;
		СтрокаТабличнойЧасти.ХарактеристикиИспользуются      = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "ИспользоватьПартии");
		СтрокаТабличнойЧасти.ЭтоСертификат                   = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "ТипНоменклатуры") = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));
		СтрокаТабличнойЧасти.Партия                          = СтрокаЗагрузки.Партия;
		// СтрокаТабличнойЧасти.КоличествоУпаковок =  СтрокаЗагрузки.Количество;
		// СтрокаТабличнойЧасти.Количество = СтрокаЗагрузки.Количество * ?(СтрокаТабличнойЧасти.Упаковка.Пустая() = Ложь, СтрокаТабличнойЧасти.Упаковка.Коэффициент, 1);
		СтрокаТабличнойЧасти.КоличествоУпаковок              = СтрокаЗагрузки.КоличествоУпаковок;
		СтрокаТабличнойЧасти.Количество                      = СтрокаЗагрузки.Количество;
		СтрокаТабличнойЧасти.Цена                            = СтрокаЗагрузки.Цена;
		СтрокаТабличнойЧасти.Упаковка                        = СтрокаЗагрузки.Упаковка;
		
		СтрокаТабличнойЧасти.Сумма 		                     = СтрокаЗагрузки.Сумма;
		СтрокаТабличнойЧасти.Всего 		                     = СтрокаЗагрузки.Всего;
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтатьяДоходов) Тогда
		     СтрокаТабличнойЧасти.СтатьяДоходов = ?(ЗначениеЗаполнено(Объект.СтатьяДоходов),Объект.СтатьяДоходов,ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ИзлишкиЗапасов"));	
        КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаСервере
// Функция помещает список запасов во временное хранилище и возвращает адрес 
//
Функция ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии) 
	
	СписокКолонок = "Номенклатура, Количество, КоличествоУпаковок, Цена, Сумма, Всего, Упаковка";
	Если ЕстьПартии Тогда
		СписокКолонок = СписокКолонок + ", Партия";
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Объект[ИмяТабличнойЧасти].Выгрузить(, СписокКолонок), УникальныйИдентификатор);
	
КонецФункции // ПоместитьЗапасыВХранилище()

&НаКлиенте
// Процедура обработчик команды вызывает форму настройки и редактирования цен.
//
Процедура РедактироватьЦены(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидЦен", 	  			Объект.ВидЦен);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	Ложь);
	
	// 2. Открвыаем форму "Цены и Валюта".
	ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,,Новый ОписаниеОповещения("РедактироватьЦеныЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "РедактироватьЦеныЗавершение"
//
Процедура РедактироватьЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// 3. Перезаполняем табличную часть "Запасы" если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		
		Объект.ВидЦен = Результат.ВидЦен;
		
		// Пересчитываем цены по виду цен.					
		Если Результат.ПерезаполнитьЦены Тогда
			ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы");
		КонецЕсли;

	КонецЕсли;
	
	ВывестиВидЦенИСтруктурнуюЕдиницу();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриОкрытии
//
Процедура ПриОткрытии(Отказ)
	
		// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования 
	
	УстановитьДоступностьЭлементов();
    Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			ПолученыШтрихкоды(Данные);
		ИначеЕсли ИмяСобытия = "DataCollectionTerminal" Тогда
			ПолученыШтрихкоды(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ВнешнееОборудование 
	
	Если Источник = "ВнешнееОборудование" И ИмяСобытия = "НеизвестныеШтрихкоды" 
			И УникальныйИдентификатор = Параметр.ФормаВладелецУникальныйИдентификатор Тогда
		ПолученыШтрихкоды(Параметр.ЗарегистрированныеШтрихкоды);
	КонецЕсли;	
	
КонецПроцедуры

// ==================================================МеханизмВнешнегоОборудования======================================================

&НаКлиенте
// ПодключаемоеОборудование
//
//
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	
	Для Каждого ЭлементШтрихкода Из ДанныеШтрикодов Цикл
		Если ОбработкаТабличныхЧастейКлиент.СШКОбработкаТабличнойЧасти(Элементы.Запасы, ЭлементШтрихкода, , , Объект.Ссылка, Объект.Запасы, НеизвестныеШтрихкоды) Тогда
			ЗапасыНоменклатураПриИзменении(Элементы.Запасы.ТекущиеДанные);
			ЗапасыУпаковкаПриИзменении(Элементы.Запасы.ТекущиеДанные);		
		КонецЕсли;
		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда 
			СтруктураПараметров = Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
			ОткрытьФорму("РегистрСведений.Штрихкоды.Форма.РегистрацияШтрихкодовНоменклатуры", СтруктураПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЦикла;						
	
КонецФункции // ПолученыШтрихкоды()

&НаКлиенте
// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
Процедура ПоискПоШтрихкоду(Команда)
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект),"", НСтр("ru = 'Введите штрихкод'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Значение = Неопределено, "", Значение);
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		МассивШтрихкод = Новый Массив;
		МассивШтрихкод.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
		ПолученыШтрихкоды(МассивШтрихкод);
	КонецЕсли;

КонецПроцедуры

// ================================================Конец МеханизмВнешнегоОборудования==================================================

&НаКлиенте
// Процедура - обработчик события на сервере "ПриИзменении" поля "ВидОперации".
//
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации <> ВидОперации Тогда
		Объект.Склад = Неопределено;
		УстановитьДоступностьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события на сервере "НачалоВыбора" поля "ВидОперации".
//
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВидОперации = Объект.ВидОперации;
КонецПроцедуры

&НаКлиенте
// При изменении статьи затрат
Процедура СтатьяДоходовПриИзменении(Элемент)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СтатьяДоходовПриИзмененииЗавершение", ЭтотОбъект), "Перезаполнять заполненные значения?",РежимДиалогаВопрос.ДаНет);	

КонецПроцедуры

&НаКлиенте 
// Процедура - Статья доходов при изменении завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СтатьяДоходовПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПерезаполнятьЗаполненные = РезультатВопроса = КодВозвратаДиалога.Да;
	Для Каждого СтрокаТ ИЗ Объект.Запасы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТ.СтатьяДоходов) ИЛИ ПерезаполнятьЗаполненные = Истина Тогда
			СтрокаТ.СтатьяДоходов = Объект.СтатьяДоходов;
		КонецЕсли;;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события на сервере "ПриИзменении" поля "ДокументОснование".
//
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ЗаполнитьШапкуДокументаПоОснованию();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
// Процедура - заполняет шапку документа по основанию
//
Процедура ЗаполнитьШапкуДокументаПоОснованию()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 
		ЗаполнитьЗначенияСвойств(Объект, Объект.ДокументОснование, "Склад, СтруктурнаяЕдиница, ВидЦен, ВидОперации");
		Объект.Запасы.Очистить();
		ВывестиВидЦенИСтруктурнуюЕдиницу();
	КонецЕсли;

КонецПроцедуры // ЗаполнитьШапкуДокументаПоОснованию()

&НаСервере
// Процедура - выводит вид цен и структурную единицу документа
//
Процедура ВывестиВидЦенИСтруктурнуюЕдиницу()
	
	// Сформируем надписи
	
	// По виду цен
	СтруктураНадписи = Новый Структура("ВидЦен", Объект.ВидЦен);
	ВидЦенНадпись = СтроковыеФункцииКлиентСерверСтоматология.СформироватьНадписьЦеныИВалюта(СтруктураНадписи, Ложь);		
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов(ТипСтр = "СправочникСсылка.")
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоСкладу") Тогда
		ТипСтр = ТипСтр + "Склады";
		Элементы.Склад.Заголовок = "Склад";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоСотруднику") Тогда
		ТипСтр = ТипСтр + "Сотрудники";
		Элементы.Склад.Заголовок = "Персонал";
	Иначе
		Возврат;
	КонецЕсли;
	
	Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	
КонецПроцедуры

&НаКлиенте   
// При начале редактирвания таблицы
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока = Истина Тогда
		Элементы.Запасы.ТекущиеДанные.СтатьяДоходов = ?(ЗначениеЗаполнено(Объект.СтатьяДоходов),Объект.СтатьяДоходов,ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ИзлишкиЗапасов"));	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ЗапасыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"                       , СтрокаТабличнойЧасти.Номенклатура);
		мПараметрыВыбора.Вставить("Склад"                          , Объект.Склад);
		мПараметрыВыбора.Вставить("СтруктурнаяЕдиница"             , Объект.СтруктурнаяЕдиница);
		мПараметрыВыбора.Вставить("Дата"                           , Объект.Дата);
        мПараметрыВыбора.Вставить("НеКонтролироватьОстаткиПоСкладу", Истина);
        мПараметрыВыбора.Вставить("МножественныйВыбор"             , Истина);

		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,,Новый ОписаниеОповещения("ЗапасыПартияНачалоВыбораЗавершение", ЭтотОбъект, СтрокаТабличнойЧасти), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗапасыПартияНачалоВыбораЗавершение"
//
Процедура ЗапасыПартияНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено и Результат.Количество() <> 0 Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Партия", Результат[0]);
		НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Серийный номер уже был указан в документе!");		
		Иначе	
			Параметры.Партия = Результат[0];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере"
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗагрузитьДанныеИзТСД", загружает данные из ТСД
//
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	МенеджерОборудованияКлиент.ЗагрузитьДанныеИзТСД(УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура СтруктурнаяЕдиницаНадписьНажатие(Элемент)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
    СтруктураПараметров.Вставить("Ссылка", ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы());  
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
    ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров,,,,,Новый ОписаниеОповещения("СтруктурнаяЕдиницаНадписьНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	

   
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "СтруктурнаяЕдиницаНадписьНажатиеЗавершение"
//
Процедура СтруктурнаяЕдиницаНадписьНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
	   Если Объект.СтруктурнаяЕдиница <> Результат Тогда
	     Объект.СтруктурнаяЕдиница = Результат;
	     Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
	     Объект.Склад = Неопределено;
	     Объект.ДокументОснование  = Неопределено;
	   КонецЕсли;	
   КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, создает меню управления табличными частями.
//
Процедура СоздатьМенюУправленияТабличнымиЧастями()
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Запасы"        , "ГруппаЗапасы");
	СтруктураМеню.Вставить("Дополнительно" , "ГруппаДополнительно");
		
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет подсчет количества строк в таб.частях и выводит его в заголовок панели.
//
Процедура ОбновитьЗаголовкиТабЧастейНаСервере()
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработатьНажатиеМеню(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, обрабатывает нажатие динамических кнопок.
//
Процедура ОбработатьНажатиеМеню(ИмяЭлемента)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
			
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления".
//
Процедура ЗапасыПослеУдаления(Элемент)
	
	ОбновитьЗаголовкиТабЧастейНаСервере();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЗапасыПриИзменении(Элемент)
	ОбновитьЗаголовкиТабЧастейНаСервере();

КонецПроцедуры

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТовары = Объект.Запасы.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;		
		НоваяСтрокаТовары.Цена = СтрокаТаблицы.Цена;
		НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
				
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
			НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		Иначе
			НоваяСтрокаТовары.СтавкаНДС = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация.СтавкаНДС;
		КонецЕсли;
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных)
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	Для каждого СтрокаТаблицы Из Объект.Запасы Цикл 
		ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ИменаСвойств = "Номенклатура, Количество, Партия";
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, ИменаСвойств);

				Если СтрокаТаблицы.Цена > 0 Тогда				
					НоваяСтрока.Цена = СтрокаТаблицы.Цена;					
				Иначе
					
					СтруктураДанные = Новый Структура();
					СтруктураДанные.Вставить("СтруктурнаяЕдиница",  Объект.СтруктурнаяЕдиница);
					СтруктураДанные.Вставить("ДатаОбработки",	 	Объект.Дата);
					СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
					СтруктураДанные.Вставить("Номенклатура", 		НоваяСтрока.Номенклатура);
					СтруктураДанные.Вставить("Упаковка", 			НоваяСтрока.Упаковка);
					
					СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
					
					НоваяСтрока.Упаковка = СтруктураДанные.Упаковка;
					НоваяСтрока.Цена 	  = СтруктураДанные.Цена; 
					
				КонецЕсли; 
				
				НоваяСтрока.КоличествоУпаковок = СтрокаТаблицы.Количество;
				// НоваяСтрока.КоличествоУпаковокПоДаннымУчета = СтрокаТаблицы.Количество;
				// НоваяСтрока.СуммаУчет = НоваяСтрока.КоличествоУпаковокПоДаннымУчета * НоваяСтрока.Цена;	
				НоваяСтрока.Упаковка = ?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаПоУмолчанию), СтрокаТаблицы.УпаковкаПоУмолчанию, СтрокаТаблицы.Номенклатура.УпаковкаПоумолчанию);	
				НоваяСтрока.ХарактеристикиИспользуются = СтрокаТаблицы.Номенклатура.ИспользоватьПартии;
				
				ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(НоваяСтрока);			
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(НоваяСтрока);
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(НоваяСтрока);
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяДоходов) Тогда
					НоваяСтрока.СтатьяДоходов = ?(ЗначениеЗаполнено(Объект.СтатьяДоходов), Объект.СтатьяДоходов, Справочники.СтатьиДоходовИРасходов.ИзлишкиЗапасов);	
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		ОбновитьЗаголовкиТабЧастейНаСервере();

	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ОприходованиеЗапасов, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
// Процедура При чтении на Сервере.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
	Иначе
		Элементы.ГруппаСостояниеОбъекта.Видимость = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ОприходованиеЗапасов");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.ОприходованиеЗапасов.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти
