
#Область ОбработчикиСобытийФормы

// Получаем в реквизиты формы значения перечислений
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЧасовойПоясПрограммы = ПолучитьЧасовойПоясИнформационнойБазы();
	Если ПустаяСтрока(ЧасовойПоясПрограммы) Тогда
		ЧасовойПоясПрограммы = ЧасовойПояс();
	КонецЕсли;
	Элементы.ЧасовойПоясПрограммы.СписокВыбора.Добавить(ЧасовойПоясПрограммы);
	
	Элементы.СтранаУчета.СписокВыбора.Вставить(0,Справочники.СтраныМира.Россия);
	Элементы.СтранаУчета.СписокВыбора.Вставить(1,Справочники.СтраныМира.НайтиПоНаименованию("БЕЛАРУСЬ").Ссылка);
	Элементы.СтранаУчета.СписокВыбора.Вставить(2,Справочники.СтраныМира.НайтиПоНаименованию("УКРАИНА").Ссылка);
	Элементы.СтранаУчета.СписокВыбора.Вставить(3,Справочники.СтраныМира.НайтиПоНаименованию("КАЗАХСТАН").Ссылка);
	

	РежимРаботыПрограммы = ОбщегоНазначенияПовтИсп.РежимРаботыПрограммы();

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПользовательЛокально", "Видимость", НЕ РежимРаботыПрограммы.МодельСервиса);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПользовательСервис", "Видимость", РежимРаботыПрограммы.МодельСервиса);
		
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("Пользователь", Пользователи.АвторизованныйПользователь());
	КэшЗначений.Вставить("РазрешитьЗакрытие", Ложь);
	КэшЗначений.Вставить("ДополнительныйПараметр", НачалоРаботыСПрограммойСервер.ЗначениеДополнительногоПараметра());
	КэшЗначений.Вставить("ТекущийИндексОрганизации", Неопределено);

	ЗаполнитьДанныеПользователя(РежимРаботыПрограммы);

	
КонецПроцедуры // ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСпискиВыбораВремениРаботы();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПользователя(РежимРаботыПрограммы)
	
	ПользовательСсылка	= КэшЗначений.Пользователь;
	
	Если РежимРаботыПрограммы.МодельСервиса Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательСсылка.ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда 
			ПользовательИмя 		= ПользовательИБ.Имя;
			ПользовательПолноеИмя   = ПользовательИБ.ПолноеИмя; 
			ПользовательТелефон 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПользовательСсылка, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
 
// Проверка ввода времени работы салона
// 
&НаКлиенте
Процедура ОкончаниеРаботыПриИзменении(Элемент)

	Если ЗначениеЗаполнено(ВремяНачалаРаботы) И ЗначениеЗаполнено(ВремяОкончанияРаботы) Тогда
		
		Если ВремяОкончанияРаботы < ВремяНачалаРаботы Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно введено время работы клиники. Время окончания работы должно быть больше чем время начала работы.");
		КонецЕсли;
		
	КонецЕсли;


КонецПроцедуры // ОкончаниеРаботыПриИзменении(Элемент)

// Проверка ввода времени работы салона
// 
&НаКлиенте
Процедура НачалоРаботыПриИзменении(Элемент)
		
	Если не ЗначениеЗаполнено(ВремяОкончанияРаботы) или  ВремяОкончанияРаботы < ВремяНачалаРаботы Тогда
		
		ВремяОкончанияРаботы = ВремяНачалаРаботы;
		 
	КонецЕсли;
	
	ЗаполнитьСпискиВыбораВремениРаботы();

	
КонецПроцедуры // НачалоРаботыПриИзменении(Элемент)

&НаКлиенте
// Заполнить список выбора времени выполнения задачи
Процедура ЗаполнитьСпискиВыбораВремениРаботы()
	
	МассивПериодовНачала = Новый Массив;
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания");
	ПериодРаботы.ДатаНачала = Дата("00010101000000");
	ПериодРаботы.ДатаОкончания = Дата("00010102000000");
	МассивПериодовНачала.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботы(МассивПериодовНачала,Ложь,30);

	Элементы.ВремяНачалаРаботы.СписокВыбора.Очистить();
	
	Для Каждого Элемент из СписокВремени Цикл
	
		Элементы.ВремяНачалаРаботы.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		
	КонецЦикла;
	
	
	МассивПериодовКонца = Новый Массив;
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания");
	ПериодРаботы.ДатаНачала = ВремяНачалаРаботы;
	ПериодРаботы.ДатаОкончания = ВремяНачалаРаботы+24*60*60;
	МассивПериодовКонца.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляОкончанияРаботы(МассивПериодовКонца,Ложь,30);

	Элементы.ВремяОкончанияРаботы.СписокВыбора.Очистить();
	
	
	Для Каждого Элемент из  СписокВремени Цикл
	
		Элементы.ВремяОкончанияРаботы.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	  
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура СтранаУчетаПриИзменении(Элемент)
	// Заполним ставки
	СтавкиНДС.Очистить();
	НС = СтавкиНДС.Добавить();
	НС.Наименование = "Без НДС";
	
	Если Строка(СтранаУчета) = "РОССИЯ" Тогда
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 0";
		НС.Ставка = 0;
		
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 10";
		НС.Ставка = 10;
		
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 18";
		НС.Ставка = 18;
		
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 20";
		НС.Ставка = 20;
		
		ВалютаУчета = "643";		
	ИначеЕсли Строка(СтранаУчета) = "УКРАИНА" Тогда
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 20";
		НС.Ставка = 20;
		
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 0";
		НС.Ставка = 0;
		
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 7";
		НС.Ставка = 7;
		
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НЕ НДС";
		НС.Ставка = 0;

		
		ВалютаУчета = "980";
	ИначеЕсли Строка(СтранаУчета) = "БЕЛАРУСЬ" Тогда
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 20";
		НС.Ставка = 20;
		
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 10";
		НС.Ставка = 10;
		
		ВалютаУчета = "974";
	ИначеЕсли Строка(СтранаУчета) = "КАЗАХСТАН" Тогда
		НС = СтавкиНДС.Добавить();
		НС.Наименование = "НДС 12";
		НС.Ставка = 12;		
		
		ВалютаУчета = "398";
	КонецЕсли;	
	
	МассивНДС = Новый Массив();
	
	Для Каждого СтрНДС Из СтавкиНДС Цикл
		МассивНДС.Добавить(СтрНДС.Наименование);
	КонецЦикла;	
		
	Элементы.СтавкаНДС.СписокВыбора.ЗагрузитьЗначения(МассивНДС); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЧасовойПоясПрограммыПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧасовойПоясПрограммыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.СписокВыбора.Количество() < 2 Тогда
		ЗагрузитьЧасовыеПояса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура ПоказатьВремяТекущегоСеанса(Команда)
	
	ПоказатьПредупреждение(,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Время сеанса: %1
				|На сервере: %2
				|На клиенте: %3
				|
				|Время сеанса - это время сервера,
				|приведенное к часовому поясу клиента.'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=T"),
			Формат(ДатаСервера(), "ДЛФ=T"),
			Формат(ТекущаяДата(), "ДЛФ=T")));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РеквизитыЗаполненыКорректно(Ошибки)
	
	Если Не ЗначениеЗаполнено(ПользовательИмя) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ПользовательИмя", НСтр("ru ='Заполните логин'"), "");
		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(СтранаУчета) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "СтранаУчета", НСтр("ru ='Выберите страну'"), "");
		
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(НазваниеСалона) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "НазваниеСалона", НСтр("ru ='Заполните название клиники'"), "");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВремяНачалаРаботы) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ВремяНачалаРаботы", НСтр("ru ='Укажите начало работы клиники'"), "")
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВремяОкончанияРаботы) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ВремяОкончанияРаботы", НСтр("ru ='Укажите окончание работы клиники'"), "")
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "СтавкаНДС", НСтр("ru ='Выберите ставку НДС'"), "")
		
	КонецЕсли;
	
	
	// проверка, чтоб время окончания работы не было раньше времени начала
	Если ЗначениеЗаполнено(ВремяНачалаРаботы) И ЗначениеЗаполнено(ВремяОкончанияРаботы) Тогда
		
		Если ВремяОкончанияРаботы < ВремяНачалаРаботы Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "НачалоРаботы", НСтр("ru ='Неверно введено время работы клиники. Время окончания работы должно быть больше чем время начала работы.'"), "")
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	Результат = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	// УправлениеИнтерфейсамиКлиент.ПоказатьРезультатВыполнения(ЭтотОбъект, Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЧасовыеПояса()
	
	Элементы.ЧасовойПоясПрограммы.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеЧасовыеПояса());
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	Результат = Новый Структура;
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "ЧасовойПоясПрограммы" Тогда
		Если ЧасовойПоясПрограммы <> ПолучитьЧасовойПоясИнформационнойБазы() Тогда 
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				ОбщегоНазначения.ЗаблокироватьИБ();
				УстановитьЧасовойПоясИнформационнойБазы(ЧасовойПоясПрограммы);
				ОбщегоНазначения.РазблокироватьИБ();
			Исключение
				ОбщегоНазначения.РазблокироватьИБ();
				ВызватьИсключение;
			КонецПопытки;
			// УстановитьПривилегированныйРежим(Ложь);
			УстановитьЧасовойПоясСеанса(ЧасовойПоясПрограммы);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДатаСервера()
	
	Возврат ТекущаяДата();
	
КонецФункции

&НаКлиенте
Процедура НачатьРаботуСПрограммой(Команда)
	
		
	Перем Ошибки;
	
	ДополнительныйПараметр = "";
	Если ВРЕГ(ПользовательИмя) = КэшЗначений.ДополнительныйПараметр Тогда
		
		ДополнительныйПараметр = КэшЗначений.ДополнительныйПараметр;
		КэшЗначений.РазрешитьЗакрытие = Истина;
		
	Иначе
	
		РеквизитыЗаполненыКорректно(Ошибки);
		КэшЗначений.РазрешитьЗакрытие = (Ошибки = Неопределено);
		
		Если НЕ КэшЗначений.РазрешитьЗакрытие Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("НачатьРаботу", 					Истина);
	
	ПараметрыЗакрытия.Вставить("Пользователь",					КэшЗначений.Пользователь);
	ПараметрыЗакрытия.Вставить("ПользовательEmail",				ПользовательEmail);
	ПараметрыЗакрытия.Вставить("ПользовательИмя",				ПользовательИмя);
	ПараметрыЗакрытия.Вставить("ПользовательПолноеИмя",			ПользовательПолноеИмя);
	ПараметрыЗакрытия.Вставить("ПользовательПароль",			ПользовательПароль);
	ПараметрыЗакрытия.Вставить("ПользовательТелефон",			ПользовательТелефон);
	ПараметрыЗакрытия.Вставить("ДополнительныйПараметр",		ДополнительныйПараметр);
	ПараметрыЗакрытия.Вставить("ЧасовойПоясПрограммы",			ЧасовойПоясПрограммы);
	ПараметрыЗакрытия.Вставить("СтранаУчета",					СтранаУчета);
	ПараметрыЗакрытия.Вставить("НазваниеСалона",			    НазваниеСалона);
	ПараметрыЗакрытия.Вставить("СтавкаНДС",						СтавкаНДС);
	ПараметрыЗакрытия.Вставить("ВремяНачалаРаботы",				ВремяНачалаРаботы);
	ПараметрыЗакрытия.Вставить("ВремяОкончанияРаботы",			ВремяОкончанияРаботы);

	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПарольПодтверждениеПриИзменении(Элемент)
	
	Если ПользовательПароль <> ПользовательПарольПодтверждение Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Не совпадают пароли'"), , "ПользовательПарольПодтверждение");
		
	КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти
