#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	
	
// Процедура - обработчик получения формы
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры <> Неопределено И Параметры.Свойство("Ключ") И Параметры.Ключ.Резерв Тогда 
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаРезерва";
	КонецЕсли;
	
КонецПроцедуры

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("Талон", "Талон", , БиблиотекаКартинок.Документ);
	Список.Добавить("ЗапланированныеПриемы", "Запланированные приемы", , БиблиотекаКартинок.Документ); 
	
	Возврат Список;
	
КонецФункции

// Функция - Сформировать печатную форму талон.
//
Функция СформироватьПечатнуюФорму_Талон(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Талон"; //?	
		ПакетЗапросов = ПолучитьРезультатЗапроса(ТекущийДокумент);
		Событие = ПакетЗапросов[0].Выбрать();
		Событие.Следующий();
		
		Макет = Документы.Событие.ПолучитьМакет("Талон_А4");
		
		Область_Талон 	= Макет.ПолучитьОбласть("Талон");
		Область_Талон.Параметры.Дата				=  Формат(Событие.ДатаНачала, "ДЛФ=DD");   
		Область_Талон.Параметры.ВремяЗаписи			=  Формат(Событие.ДатаНачала, "ДФ=HH:mm"); 
		Область_Талон.Параметры.ВремяПриема			=  Формат(ТекущаяДата(), "ДФ=HH:mm"); 
		Область_Талон.Параметры.СтруктурнаяЕдиница 	= ?(ЗначениеЗаполнено(Событие.Организация.ПолноеНаименование), Событие.Организация.ПолноеНаименование, Событие.Организация.Наименование);
		Область_Талон.Параметры.Врач 				= Событие.Сотрудник; 		
		Область_Талон.Параметры.Клиент 		        = Событие.Контрагент;
		Область_Талон.Параметры.АмбулаторнаяКарта 	= Событие.ТекущаяМедицинскаяКарта;
		МассивПолисов = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(Событие.Контрагент, Событие.ДатаНачала);
		Если МассивПолисов.Количество() <> 0 Тогда   
			Для Каждого СтраховойПолис Из МассивПолисов Цикл 
				Область_Талон.Параметры.СтарховойПолис = СтраховойПолис.Наименование;
			КонецЦикла;
		КонецЕсли;
		ТабличныйДокумент.Вывести(Область_Талон);
	    Область_ШтрихКод 	= Макет.ПолучитьОбласть("ШтрихКод");
		ТаблицаШтрихКодов 	= СформироватьШтрихКоды(ТекущийДокумент); 
		// Печать штрихкода
		КоличествоМиллиметровВПикселе = Макет.Рисунки.РисунокШтрихКода_ПланЛечения.Высота / 100;

		Для каждого Рисунок Из Область_ШтрихКод.Рисунки Цикл
			
			Если Лев(Рисунок.Имя, 28) = "РисунокШтрихКода_ПланЛечения" Тогда
				
				СтрокаТаблицыШтрихКодов = ТаблицаШтрихКодов.Найти(1, "Действие");
				Если СтрокаТаблицыШтрихКодов <> Неопределено Тогда 
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
					ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
					ПараметрыШтрихкода.Вставить("Штрихкод",        СтрокаТаблицыШтрихКодов.Штрихкод);
					ПараметрыШтрихкода.Вставить("ТипКода",         1);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
					ПараметрыШтрихкода.Вставить("РазмерШрифта",    14);
					
					Рисунок.Картинка = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
				КонецЕсли;
				
			ИначеЕсли Лев(Рисунок.Имя, 22) = "РисунокШтрихКода_Прием" Тогда
				
				СтрокаТаблицыШтрихКодов = ТаблицаШтрихКодов.Найти(0, "Действие");
				Если СтрокаТаблицыШтрихКодов <> Неопределено Тогда 
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
					ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
					ПараметрыШтрихкода.Вставить("Штрихкод",        СтрокаТаблицыШтрихКодов.Штрихкод);
					ПараметрыШтрихкода.Вставить("ТипКода",         1);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
					ПараметрыШтрихкода.Вставить("РазмерШрифта",    14);
					
					Рисунок.Картинка = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		ТабличныйДокумент.Вывести(Область_ШтрихКод);
	КонецЦикла;
	
	Если Константы.ФорматПечатиТалона.Получить() = 0 Тогда 
		ТабличныйДокумент.РазмерСтраницы = "A4";
		// ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;		
	Иначе 
		ТабличныйДокумент.РазмерСтраницы = "A5";
		// ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;		
	КонецЕсли;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	                               
	Возврат ТабличныйДокумент;              

КонецФункции

// Функция - Сформировать печатную форму запланированные приемы.
//
Функция СформироватьПечатнуюФорму_ЗапланированныеПриемы(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Контрагент = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если НЕ ЗначениеЗаполнено(МассивОбъектов) Тогда		
		Возврат ТабличныйДокумент;		
	КонецЕсли;
	
	СсылкаОбъекта = МассивОбъектов[0];
	Если ТипЗнч(СсылкаОбъекта) = Тип("СправочникСсылка.Контрагенты") Тогда
		Контрагент = СсылкаОбъекта;	
	ИначеЕсли ТипЗнч(СсылкаОбъекта) = Тип("ДокументСсылка.Событие") Тогда
		Контрагент = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СсылкаОбъекта, "Контрагент");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда	
		Возврат ТабличныйДокумент;		
	КонецЕсли;
	
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ЗапланированныеПриемы";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Событие.Ссылка КАК Событие,
		|	Событие.Дата КАК Дата,
		|	Событие.Врач.Представление КАК ВрачПредставление,
		|	СобытиеУслуги.Номенклатура.Представление КАК НоменклатураПредставление,
		|	СобытиеУслуги.ПричинаЗаписи.Представление КАК ПричинаЗаписиПредставление
		|ИЗ
		|	Документ.Событие КАК Событие
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие.Услуги КАК СобытиеУслуги
		|		ПО Событие.Ссылка = СобытиеУслуги.Ссылка
		|ГДЕ
		|	Событие.Ссылка.Проведен
		|	И НЕ Событие.ПометкаУдаления
		|	И НЕ Событие.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОкончен))
		|	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И Событие.Контрагент = &Контрагент
		|	И Событие.Дата > &ТекущаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	МАКСИМУМ(Дата)
		|ПО
		|	Событие";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСервера());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	Макет = Документы.Событие.ПолучитьМакет("ЗапланированныеПриемы");
	
	Область_Талон 	= Макет.ПолучитьОбласть("ШапкаМакета");	
	ДанныеПациента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Контрагент, "НаименованиеПолное, Наименование");
	Область_Талон.Параметры.ФИОПациента = ?(ЗначениеЗаполнено(ДанныеПациента.НаименованиеПолное), ДанныеПациента.НаименованиеПолное, ДанныеПациента.Наименование);   
    ТабличныйДокумент.Вывести(Область_Талон);
	
	Область_ШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");	   
    ТабличныйДокумент.Вывести(Область_ШапкаТаблицы);
	
	ВыборкаСобытие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	НомерСтроки = 1;
	
	Пока ВыборкаСобытие.Следующий() Цикл
		
		Область_СтрокаТаблицы 	= Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		Область_СтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
		Область_СтрокаТаблицы.Параметры.ДатаИВремя = Формат(ВыборкаСобытие.Дата, "ДЛФ=DD") + Символы.ПС + Формат(ВыборкаСобытие.Дата, "ДФ='ЧЧ:мм'");
		Область_СтрокаТаблицы.Параметры.Врач = ВыборкаСобытие.ВрачПредставление;		

		ПричинаЗаписи = "";
		Услуги = "";
		
		ВыборкаДетальныеЗаписи = ВыборкаСобытие.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Услуги = Услуги + ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НоменклатураПредставление), ВыборкаДетальныеЗаписи.НоменклатураПредставление + ", ", "");
			ПричинаЗаписи = ?(ЗначениеЗаполнено(ПричинаЗаписи), ПричинаЗаписи, ВыборкаДетальныеЗаписи.ПричинаЗаписиПредставление);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Услуги) Тогда		
			Услуги = Лев(Услуги, СтрДлина(Услуги) - 2);			
		КонецЕсли;
				
		Область_СтрокаТаблицы.Параметры.ПричинаЗаписи = ПричинаЗаписи;
		Область_СтрокаТаблицы.Параметры.Услуги = Услуги;
		
		ТабличныйДокумент.Вывести(Область_СтрокаТаблицы);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ТабличныйДокумент.РазмерСтраницы = "A4";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент; 	           

КонецФункции

// Процедура формирует штрихкод
//
Функция СформироватьШтрихКоды(ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Штрихкоды.Штрихкод,
	               |	Штрихкоды.Действие
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Объект = &Объект";
				   
	Запрос.УстановитьПараметр("Объект", ТекущийДокумент);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ИзначальноеКоличествоОбъектов 	= Таблица.Количество();
	КоличествоОбъектов 				= Таблица.Количество();
	
	Пока КоличествоОбъектов < 2 Цикл 
		ЕстьШтрихКод = 1;
		Пока ЕстьШтрихКод = 1 Цикл
			Штрихкод = РегистрыСведений.Штрихкоды.СформироватьШтрихкодEAN13();
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	Штрихкоды.Штрихкод
			               |ИЗ
			               |	РегистрСведений.Штрихкоды КАК Штрихкоды
			               |ГДЕ
			               |	Штрихкоды.Штрихкод = &Штрихкод";
			
			Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
			
			Выборка = Запрос.Выполнить();
			
			Если Выборка.Пустой() Тогда
				ЕстьШтрихКод = 0;
			Иначе
				ЕстьШтрихКод = 1;
			КонецЕсли
		КонецЦикла;	
		НовыйШтрихкод = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
		НовыйШтрихкод.Объект 	= ТекущийДокумент;
		НовыйШтрихкод.Штрихкод 	= Штрихкод;
		НовыйШтрихкод.Действие 	= ?(ИзначальноеКоличествоОбъектов = 1, ?(Таблица[0].Действие = 1, 0, 1), КоличествоОбъектов);
		// Добавим в таблицу штрихкод
		НоваяСтрокаТаблицы = Таблица.Добавить();
		НоваяСтрокаТаблицы.ШтрихКод = НовыйШтрихкод.Штрихкод;
		НоваяСтрокаТаблицы.Действие = НовыйШтрихкод.Действие;
		
		// Для того, чтобы пользователь с ограниченными правами также мог создать новый штрихкод
		УстановитьПривилегированныйРежим(Истина);
		НовыйШтрихкод.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		
		КоличествоОбъектов = КоличествоОбъектов + 1;
	КонецЦикла;
	
	Возврат Таблица;	
	
КонецФункции

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Талон") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Талон", "Талон", СформироватьПечатнуюФорму_Талон(МассивОбъектов, ОбъектыПечати, "НашТалон"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗапланированныеПриемы") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗапланированныеПриемы", "ЗапланированныеПриемы"
															 , СформироватьПечатнуюФорму_ЗапланированныеПриемы(МассивОбъектов, ОбъектыПечати, "ЗапланированныеПриемы"));
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить результат запроса
//
// Параметры:
//  ТекущийДокумент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРезультатЗапроса(ТекущийДокумент)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытиеУслуги.Ссылка.Контрагент КАК Контрагент,
	|	СобытиеУслуги.Сотрудник КАК Сотрудник,
	|	СобытиеУслуги.Ссылка.СтруктурнаяЕдиница.Организация КАК Организация,
	|	СобытиеУслуги.ДатаНачала КАК ДатаНачала,
	|	СобытиеУслуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей КАК ТекущаяМедицинскаяКарта
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытиеУслуги.Ссылка.Контрагент,
	|	СобытиеУслуги.Сотрудник,
	|	СобытиеУслуги.Ссылка.СтруктурнаяЕдиница.Организация,
	|	СобытиеУслуги.ДатаНачала,
	|	СобытиеУслуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	
	Возврат Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

// Процедура, обработчик команды ПослеЗаписиНаСервере
//
Процедура УстановитьЗаданияВыполненным(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаПользователей.Ссылка
		|ИЗ
		|	Задача.ЗадачаПользователей КАК ЗадачаПользователей
		|ГДЕ
		|	ЗадачаПользователей.ЗадачаПредмет = &ЗадачаПредмет
		|	И ЗадачаПользователей.Выполнена = ЛОЖЬ";

	Запрос.УстановитьПараметр("ЗадачаПредмет", Ссылка);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗадачаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.ДатаИсполнения = ТекущаяДата();
		ЗадачаОбъект.Выполнена = Истина;
		ЗадачаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Функция, ПолучитьПродолжительностьСобытия.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ПолучитьПродолжительностьСобытия(Событие) Экспорт 
	
	Если Не ЗначениеЗаполнено(Событие) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	МИНИМУМ(СобытиеУслуги.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(СобытиеУслуги.ДатаОкончания) КАК ДатаОкончания,
	|	СобытиеУслуги.Ссылка КАК Ссылка,
	|	СУММА(РАЗНОСТЬДАТ(СобытиеУслуги.ДатаНачала, СобытиеУслуги.ДатаОкончания, МИНУТА)) КАК Длительность,
	|	СобытиеУслуги.Ссылка.Контрагент КАК Контрагент,
	|	СобытиеУслуги.Ссылка.Контрагент.Телефон КАК КонтрагентТелефон,
	|	СобытиеУслуги.Ссылка.Врач КАК Врач,
	|	СобытиеУслуги.Ссылка.Статус КАК Статус,
	|	СобытиеУслуги.Помещение КАК Помещение
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытиеУслуги.Ссылка,
	|	СобытиеУслуги.Ссылка.Контрагент,
	|	СобытиеУслуги.Ссылка.Контрагент.Телефон,
	|	СобытиеУслуги.Ссылка.Врач,
	|	СобытиеУслуги.Ссылка.Статус,
	|	СобытиеУслуги.Помещение";
	
	Запрос.УстановитьПараметр("Ссылка", Событие);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Длительность = Новый Структура();
	Пока Выборка.Следующий() Цикл
		Длительность.Вставить("ДатаНачала",			Выборка.ДатаНачала);
		Длительность.Вставить("ДатаОкончания",		Выборка.ДатаОкончания);
		Длительность.Вставить("Длительность",		Выборка.Длительность);
		Длительность.Вставить("Контрагент",			Выборка.Контрагент);
		Длительность.Вставить("КонтрагентТелефон",	Выборка.КонтрагентТелефон);
		Длительность.Вставить("Сотрудник",			Выборка.Врач);
		Длительность.Вставить("Статус",				Выборка.Статус);
		Длительность.Вставить("Помещение",			Выборка.Помещение);
	КонецЦикла;
	
	Возврат Длительность;
	
КонецФункции // ПолучитьПродолжительностьСобытия

#Область ПредставленияДанных

// Процедура - Обработка получения полей представления
// 
// Параметры:
//  Поля				 - 	 - 
//  СтандартнаяОбработка - 	 - 
// 
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Ссылка");
	Поля.Добавить("Дата");
	Поля.Добавить("ДатаОкончания");
	Поля.Добавить("Номер");
	Поля.Добавить("Проведен");
	Поля.Добавить("ПометкаУдаления");
	Поля.Добавить("Статус");
	Поля.Добавить("Резерв");
	
КонецПроцедуры

// Процедура - Обработка получения представления
// 
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
// 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Представление = "";
	
	Если Данные.Номер = Null ИЛИ НЕ ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПредставлениеСостояния = "";
	Если Данные.ПометкаУдаления Тогда
		ПредставлениеСостояния = НСтр("ru='(удален)'");
	ИначеЕсли Не Данные.Проведен Тогда
		ПредставлениеСостояния = НСтр("ru='(не проведен)'");
	КонецЕсли;
	
	ПредставлениеДатыОкончания	 = ?(ЗначениеЗаполнено(Данные.ДатаОкончания), " - " + Формат(Данные.ДатаОкончания, "ДФ=HH:мм"), "");
	ПредставлениеДатыСобытия	 = Формат(Данные.Дата, "ДФ=HH:мм") + ПредставлениеДатыОкончания + ", " + Формат(Данные.Дата, "ДЛФ=DD");
	
	ПредставлениеДокумента = ?(
		Данные.Резерв = Истина,
		НСтр("ru = 'Резерв времени'") + ?(Данные.Статус = Перечисления.СтатусыСобытия.ПриемОтменен, НСтр("ru = ' (отменен)'"), ""),
		Строка(Данные.Статус)
	) + ", " + ПредставлениеДатыСобытия;
	
	Представление = ПредставлениеДокумента + " " +  ПредставлениеСостояния;
	
КонецПроцедуры

// Функция - вернет представление документа Событие.
// 
// Параметры:
//  ЗанятиеСсылка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПредставлениеСобытия(ВизитСтруктура, ОтборПоРесурсу = Ложь, НастройкиОтображения) Экспорт		
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрРез = "";
	
	ВариантНастройкиНеОтображать = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантНеОтображать;
	
	ПредставлениеТелефон     = "";
	ПредставлениеУслуг       = "";
	ПредставлениеСотрудников = "";
	ПредставлениеРесурсов    = "";
	ПредставлениеВозраста    = "";
	ПредставлениеПричинаЗаписи = "";
	
	// Представление времени визита.	
	Если НастройкиОтображения.ОтображениеВремени <> ВариантНастройкиНеОтображать Тогда  
		ПолучитьПредставлениеВремениВизита(ВизитСтруктура.ДатаНачала, ВизитСтруктура.ДатаОкончания, НастройкиОтображения.ОтображениеВремени, СтрРез);	
	КонецЕсли;
	
	// Мед карта
	Если ЗначениеЗаполнено(ВизитСтруктура.ДанныеКонтрагента.НомерМедКарты) 
		И НастройкиОтображения.ОтображениеМедКарты <> ВариантНастройкиНеОтображать Тогда  
		СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез), ", №", "№") + ВизитСтруктура.ДанныеКонтрагента.НомерМедКарты;
	КонецЕсли;
		
	// Для расширения переопределяется там, что бы сделать полужирным.
	// Представление клиента визита.	
	Если НастройкиОтображения.ОтображениеКлиента <> ВариантНастройкиНеОтображать Тогда	
		ПолучитьПредставлениеКлиентаВизита(ВизитСтруктура.ДанныеКонтрагента, НастройкиОтображения.ОтображениеКлиента, СтрРез);	
	КонецЕсли;
	
	// Представление возраста.	
	Если НастройкиОтображения.ОтображениеВозраста <> ВариантНастройкиНеОтображать Тогда
		
		ПредставлениеВозраста = ОбщегоНазначенияСтоматология.ВозвратитьВозрастСтрокой(ВизитСтруктура.ДанныеКонтрагента.ДатаРождения);
		СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез) И ЗначениеЗаполнено(ПредставлениеВозраста), ", ", "") + ПредставлениеВозраста;
		
	КонецЕсли;
	
	// Представление телефона клиента.
	ПредставлениеТелефон = ВизитСтруктура.ДанныеКонтрагента.Телефон;
	
	Если ЗначениеЗаполнено(ПредставлениеТелефон) И НЕ (ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач) 
		И НастройкиОтображения.ОтображениеТелефона <> ВариантНастройкиНеОтображать Тогда  
		СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез) И ЗначениеЗаполнено(ПредставлениеТелефон), ", ", "") + ПредставлениеТелефон;
	КонецЕсли;
	
	// Представление причина записи.
	Если ВизитСтруктура.Свойство("Событие") Тогда
		
		Резерв = Ложь;
		ОснованиеРезерва = "";
		ПричинаЗаписи = Неопределено;
		
		ВизитСтруктура.Свойство("Резерв", Резерв);
		ВизитСтруктура.Свойство("ОснованиеРезерва", ОснованиеРезерва);
		ВизитСтруктура.Свойство("ПричинаЗаписи", ПричинаЗаписи);
		
		Если Резерв Тогда
			СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез), ", ", "") + ОснованиеРезерва;		
		Иначе
			
			Если ЗначениеЗаполнено(ПричинаЗаписи) Тогда
				СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез), Символы.ПС, "") + ПричинаЗаписи;		
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;
		
	// Представление услуг визита.
	Для Каждого Номенклатура Из ВизитСтруктура.МассивНоменклатур Цикл
		ПредставлениеУслуг = ПредставлениеУслуг + ?(ЗначениеЗаполнено(ПредставлениеУслуг) И ЗначениеЗаполнено(Номенклатура), ", ", "") + Номенклатура;	
	КонецЦикла;

	Если ЗначениеЗаполнено(ПредставлениеУслуг)
		И НастройкиОтображения.ОтображениеУслуги <> ВариантНастройкиНеОтображать Тогда
		
		СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез), ", ", "") + ПредставлениеУслуг;	
	КонецЕсли;
	
	// Представление сотрудников визита.		
	Для Каждого Сотрудник Из ВизитСтруктура.МассивСотрудников Цикл
		ПредставлениеСотрудников = ПредставлениеСотрудников + ?(ЗначениеЗаполнено(ПредставлениеСотрудников), ", ", "") + Сотрудник.Наименование;	
	КонецЦикла;
	
	Если ОтборПоРесурсу Тогда
		ПолучитьПредставлениеСотрудниковВизита(ВизитСтруктура.МассивСотрудников, НастройкиОтображения.ОтображениеСотрудника, СтрРез);
	КонецЕсли;
	
	// Представление помещений визита.
	Для Каждого Помещение Из ВизитСтруктура.МассивПомещений Цикл
		ПредставлениеРесурсов = ПредставлениеРесурсов + ?(ЗначениеЗаполнено(ПредставлениеРесурсов), ", ", "") + Помещение;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредставлениеРесурсов)
		И НастройкиОтображения.ОтображениеРесурса <> ВариантНастройкиНеОтображать
		И ОтборПоРесурсу = Ложь Тогда
		
		СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез), ", ", "") + ПредставлениеРесурсов;	
	КонецЕсли;
	
	// Представление комментария визита.
	Если ЗначениеЗаполнено(ВизитСтруктура.Комментарий)
		И НастройкиОтображения.ОтображениеКомментария <> ВариантНастройкиНеОтображать Тогда
		
		СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез), ", ", "") + ВизитСтруктура.Комментарий;
	КонецЕсли;
	
	// Подсказка
	ПредставлениеВремени = Формат(ВизитСтруктура.ДатаНачала,"ДФ=HH:mm") + " - " + Формат(ВизитСтруктура.ДатаОкончания, "ДФ=HH:mm");
	ПредставлениеКлиента = СокрЛП(ВизитСтруктура.ДанныеКонтрагента.Наименование);
	
	Подсказка = ПредставлениеВремени + 
	?(ЗначениеЗаполнено(ПредставлениеКлиента), Символы.ПС + ПредставлениеКлиента + 
	?(ЗначениеЗаполнено(ПредставлениеВозраста), " " + ПредставлениеВозраста, "") + 
	?(ЗначениеЗаполнено(ПредставлениеТелефон), " " + ПредставлениеТелефон, ""), "") +
	?(ЗначениеЗаполнено(ПредставлениеСотрудников), Символы.ПС + ПредставлениеСотрудников, "") + 
	?(ЗначениеЗаполнено(ПредставлениеРесурсов), Символы.ПС + ПредставлениеРесурсов, "") + 
	?(ЗначениеЗаполнено(ПредставлениеУслуг), Символы.ПС + ПредставлениеУслуг, "") +
	//?(ЗначениеЗаполнено(ВизитСтруктура.Основание), Символы.ПС + Строка(ВизитСтруктура.Основание), "") +
	?(ЗначениеЗаполнено(ВизитСтруктура.Комментарий), Символы.ПС + ВизитСтруктура.Комментарий, "");
	
	Возврат Новый Структура("Текст, Подсказка", СтрЗаменить(СтрРез, Символы.ПС, "\n"), Подсказка);
	
	// Возврат Новый Структура("Текст, Подсказка", "", "");
	
КонецФункции

// Процедура - Получить представление времени визита
// 
Процедура ПолучитьПредставлениеВремениВизита(ВремяНачала, ВремяОкончания, ВариантОтображения, СтрРез)
	
	// Время начала - время окончания
	Если ВариантОтображения = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВремениВариант1 Тогда		
		СтрРез = Формат(ВремяНачала, "ДФ=HH:mm") + " - " + Формат(ВремяОкончания, "ДФ=HH:mm");		
		
	// Время начала, длительность
	ИначеЕсли ВариантОтображения = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВремениВариант2 Тогда		
		
		СтрРез = Формат(ВремяНачала, "ДФ=HH:mm") + ", " + Формат((ВремяОкончания - ВремяНачала) / 60, "ЧДЦ=")  + " мин.";		
		
	// Время начала
	ИначеЕсли ВариантОтображения = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВремениВариант3 Тогда			
		СтрРез = Формат(ВремяНачала, "ДФ=HH:mm");		
		
	// Представление Начало - Окончание
	Иначе
		СтрРез = Формат(ВремяНачала, "ДФ=HH:mm") + "-" + Формат(ВремяОкончания, "ДФ=HH:mm");
	КонецЕсли;

КонецПроцедуры

// Процедура - Получить представление клиента визита
// 
Процедура ПолучитьПредставлениеКлиентаВизита(ДанныеКонтрагента, ВариантОтображения, СтрРез) Экспорт 
	
	ПредставлениеКонтрагента = "";
	
	// Имя Фамилия
	Если ВариантОтображения = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеКлиентаВариант1 Тогда
		
		ПредставлениеКонтрагента = СокрЛП(ДанныеКонтрагента.Имя) + ?(ЗначениеЗаполнено(ДанныеКонтрагента.Имя) И ЗначениеЗаполнено(ДанныеКонтрагента.Фамилия), " " + СокрЛП(ДанныеКонтрагента.Фамилия), СокрЛП(ДанныеКонтрагента.Фамилия));
		
	// Фамилия Имя
	ИначеЕсли ВариантОтображения = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеКлиентаВариант2 Тогда		
		
		ПредставлениеКонтрагента = СокрЛП(ДанныеКонтрагента.Фамилия) + ?(ЗначениеЗаполнено(ДанныеКонтрагента.Имя) И ЗначениеЗаполнено(ДанныеКонтрагента.Фамилия), " " + СокрЛП(ДанныеКонтрагента.Имя), СокрЛП(ДанныеКонтрагента.Имя));		
		
	ИначеЕсли ВариантОтображения = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеКлиентаВариант3 Тогда		
		
		// Фамилия И.О.
		Если ЗначениеЗаполнено(ДанныеКонтрагента.Фамилия) ИЛИ ЗначениеЗаполнено(ДанныеКонтрагента.Имя) Тогда 
			ПредставлениеКонтрагента = ?(ЗначениеЗаполнено(ДанныеКонтрагента.Фамилия), ДанныеКонтрагента.Фамилия + "","") +
			                           ?(ЗначениеЗаполнено(ДанныеКонтрагента.Имя)," " + Лев(СокрЛП(ДанныеКонтрагента.Имя), 1) + ".","") +
									   ?(ЗначениеЗаполнено(ДанныеКонтрагента.Отчество)," " + Лев(СокрЛП(ДанныеКонтрагента.Отчество), 1) + ".", "");
		Иначе
			ПредставлениеКонтрагента = ДанныеКонтрагента.Наименование;
		КонецЕсли;
		
	// Фамилия Имя Отчество.
	ИначеЕсли ВариантОтображения = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеКлиентаВариант5 Тогда
		
		Если ЗначениеЗаполнено(ДанныеКонтрагента.Наименование) Тогда
			ПредставлениеКонтрагента = ДанныеКонтрагента.Наименование;
		Иначе
			ПредставлениеКонтрагента = СокрЛП(ДанныеКонтрагента.Фамилия) + ?(ЗначениеЗаполнено(ДанныеКонтрагента.Имя) 
										И ЗначениеЗаполнено(ДанныеКонтрагента.Фамилия), " " + СокрЛП(ДанныеКонтрагента.Имя), СокрЛП(ДанныеКонтрагента.Имя));
		КонецЕсли;
		
	// Имя
	ИначеЕсли ЗначениеЗаполнено(ДанныеКонтрагента.Имя) Тогда
		ПредставлениеКонтрагента = СокрЛП(ДанныеКонтрагента.Имя);
		
	Иначе
		ПредставлениеКонтрагента = ДанныеКонтрагента.Наименование;
	КонецЕсли;
	
	СтрРез = ?(ЗначениеЗаполнено(СтрРез), СтрРез + ", ", "") + ПредставлениеКонтрагента;
	
КонецПроцедуры

// Процедура - Получить представление клиента визита
// 
Процедура ПолучитьПредставлениеСотрудниковВизита(МассивСотрудников, ВариантОтображения, СтрРез)
		
	ПредставлениеСотрудников = "";
		
	Для Каждого Сотрудник Из МассивСотрудников Цикл
		
		Представление = Справочники.Сотрудники.ПолучитьПредставлениеСотрудникаПоНастройкеОтображения(Сотрудник.Ссылка, ВариантОтображения);
		
		ПредставлениеСотрудников = ПредставлениеСотрудников + ?(ЗначениеЗаполнено(ПредставлениеСотрудников), ", ", "") + Представление;	

	КонецЦикла;
		
	СтрРез = СтрРез + ?(ЗначениеЗаполнено(СтрРез) И ЗначениеЗаполнено(ПредставлениеСотрудников), ", ", "") + ПредставлениеСотрудников;
	
КонецПроцедуры

#КонецОбласти

// Функция, возвращает события за указанный период.
// 
Функция СобытияЗаУказанныйПериод(
	Знач НачалоПериода,
	Знач КонецПериода, 
	Знач СтатусыСобытия      = Неопределено,
	Знач СтруктурнаяЕдиница  = Неопределено,
	Знач КлиентСегмент       = Неопределено,
	Знач СотрудникСегмент    = Неопределено,
	Знач Помещение           = Неопределено,
	Знач СтатусПодтверждено  = Неопределено,
	Знач МассивИсключаемыхСобытий = Неопределено,
	Знач СписокМетокОтбор	 = Неопределено) Экспорт

	
	МассивКлиентов    = ПереданныйПараметрВМассивЭлементов(КлиентСегмент, Тип("СправочникСсылка.Контрагенты") , Тип("СправочникСсылка.СегментыКонтрагентов"));	
	
	Должность         = Неопределено;
	МассивДолжностей  = Неопределено;
	
	Если ЗначениеЗаполнено(СотрудникСегмент) Тогда
		
		// Если передана должность.
		Если ТипЗнч(СотрудникСегмент) = Тип("СправочникСсылка.Должности") Тогда
			Должность = СотрудникСегмент;
		ИначеЕсли ТипЗнч(СотрудникСегмент) = Тип("Строка") Тогда
			МассивСотрудников = Неопределено; 
		Иначе
			МассивСотрудников = Новый Массив();
			МассивСотрудников.Добавить(СотрудникСегмент); 
				// ПереданныйПараметрВМассивЭлементов(СотрудникСегмент, Тип("СправочникСсылка.Сотрудники") , Тип("СправочникСсылка.СегментыСотрудников"));			
		КонецЕсли;
				
	КонецЕсли;

	Если СписокМетокОтбор <> Неопределено И ЗначениеЗаполнено(СписокМетокОтбор) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Услуги.Ссылка КАК Событие,
		|	Услуги.Ссылка.УИД КАК УИДСобытия,
		|	Услуги.Ссылка.Контрагент КАК Контрагент,
		|	Услуги.Ссылка.Контрагент.Фамилия КАК КонтрагентФамилия,
		|	Услуги.Ссылка.Контрагент.Имя КАК КонтрагентИмя,
		|	Услуги.Ссылка.Контрагент.Отчество КАК КонтрагентОтчество,
		|	Услуги.Ссылка.Контрагент.Наименование КАК ФИОПациента,
		|	Услуги.Ссылка.Контрагент.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
		|	Услуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей КАК КонтрагентТекущаяМедицинскаяКартаКодБезНулей,
		|	Услуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта КАК КонтрагентТекущаяМедицинскаяКарта,
		|	Услуги.Ссылка.Контрагент.Телефон КАК КонтрагентТелефон,
		|	Услуги.Ссылка.ТелефонныйЗвонок КАК ТелефонныйЗвонок,
		|	Услуги.Ссылка.ОснованиеРезерва КАК ОснованиеРезерва,
		|	Услуги.Ссылка.Комментарий КАК Комментарий,
		|	Услуги.ДатаНачала КАК ДатаНачала,
		|	Услуги.ДатаОкончания КАК ДатаОкончания,
		|	Услуги.Сотрудник КАК Сотрудник,
		|	Услуги.Сотрудник.Наименование КАК СотрудникНаименование,
		|	Услуги.Помещение КАК Помещение,
		|	Услуги.Помещение.Наименование КАК ПомещениеНаименование,
		|	Услуги.Номенклатура КАК Услуга,
		|	Услуги.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	Услуги.ПричинаЗаписи КАК ПричинаЗаписи,
		|	Услуги.ПризнакЗаблокированно КАК ПризнакЗаблокировано,
		|	Услуги.НомерСтроки - 1 КАК ИндексВТЧ,
		|	0 КАК НомерБлокаСобытий,
		|	Услуги.Ссылка.АвторДокумента КАК АвторДокумента,
		|	Услуги.Ссылка.Дата КАК ДатаСобытия,
		|	Услуги.Ссылка.Резерв КАК Резерв,
		|	Услуги.Ссылка.Статус КАК Статус,
		|	Услуги.Ссылка.ЦветФонаРезерва КАК ЦветФонаРезерва,
		|	ЛОЖЬ КАК ЕстьЗадолженность,
		|	ЛОЖЬ КАК ЕстьНезавершенныеНарядЗаказы,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыНарядЗаказа.Заказано) КАК ОбщийСтатусНезавершенныхНарядЗаказов,
		|	Услуги.Ссылка.ПолисМедСтрахования КАК ПолисМедСтрахования,
		|	Услуги.Ссылка.ПолисМедСтрахования.Договор КАК ПолисМедСтрахованияДоговор,
		|	Услуги.Ссылка.ПолисМедСтрахования.Договор.Контрагент КАК ПолисМедСтрахованияДоговорКонтрагент,
		|	Услуги.Ссылка.ПолисМедСтрахования.Договор.ПрограммаСтрахования КАК ПолисМедСтрахованияДоговорПрограммаСтрахования,
		|	Услуги.Ссылка.ПолисМедСтрахования.СтраховаяКомпания.КраткоеНаименование КАК ПолисМедСтрахованияКраткоеНаименованиеСтраховойКомпании,
		|	Услуги.Ссылка.ИдентификаторДиалога КАК ИдентификаторДиалога,
		|	Услуги.Ссылка.СсылкаНаПрием КАК СсылкаНаПрием
		|ПОМЕСТИТЬ ТаблицаПредварительныхЗаписей
		|ИЗ
		|	РегистрСведений.МеткиКлиентов.СрезПоследних(, Метка В (&СписокМетокОтбор)) КАК МеткиКлиентовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие.Услуги КАК Услуги
		|		ПО МеткиКлиентовСрезПоследних.Клиент = Услуги.Ссылка
		|ГДЕ
		|	Услуги.Ссылка.Проведен
		|	И Услуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И Услуги.Ссылка.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
		|	И Услуги.ДатаНачала МЕЖДУ &ДатаОт И &ДатаПо
		|	И НЕ Услуги.Ссылка В (&МассивИсключаемыхСобытий)
		|	И ВЫБОР
		|			КОГДА НЕ Услуги.Сотрудник.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|				ТОГДА Услуги.Сотрудник.Должность.ОтображатьВЖурналеПредварительнойЗаписи = ИСТИНА
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И Услуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Событие,
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПредварительныхЗаписей.Событие КАК Событие,
		|	ТаблицаПредварительныхЗаписей.УИДСобытия КАК УИДСобытия,
		|	ТаблицаПредварительныхЗаписей.Контрагент КАК Контрагент,
		|	ТаблицаПредварительныхЗаписей.КонтрагентФамилия КАК КонтрагентФамилия,
		|	ТаблицаПредварительныхЗаписей.КонтрагентИмя КАК КонтрагентИмя,
		|	ТаблицаПредварительныхЗаписей.КонтрагентОтчество КАК КонтрагентОтчество,
		|	ТаблицаПредварительныхЗаписей.ФИОПациента КАК ФИОПациента,
		|	ТаблицаПредварительныхЗаписей.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
		|	ТаблицаПредварительныхЗаписей.КонтрагентТекущаяМедицинскаяКартаКодБезНулей КАК КонтрагентТекущаяМедицинскаяКартаКодБезНулей,
		|	ТаблицаПредварительныхЗаписей.КонтрагентТекущаяМедицинскаяКарта КАК КонтрагентТекущаяМедицинскаяКарта,
		|	ТаблицаПредварительныхЗаписей.КонтрагентТелефон КАК КонтрагентТелефон,
		|	ТаблицаПредварительныхЗаписей.ТелефонныйЗвонок КАК ТелефонныйЗвонок,
		|	ТаблицаПредварительныхЗаписей.ОснованиеРезерва КАК ОснованиеРезерва,
		|	ТаблицаПредварительныхЗаписей.Комментарий КАК Комментарий,
		|	ТаблицаПредварительныхЗаписей.ДатаНачала КАК ДатаНачала,
		|	ТаблицаПредварительныхЗаписей.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаПредварительныхЗаписей.Сотрудник КАК Сотрудник,
		|	ТаблицаПредварительныхЗаписей.СотрудникНаименование КАК СотрудникНаименование,
		|	ТаблицаПредварительныхЗаписей.Помещение КАК Помещение,
		|	ТаблицаПредварительныхЗаписей.ПомещениеНаименование КАК ПомещениеНаименование,
		|	ТаблицаПредварительныхЗаписей.Услуга КАК Услуга,
		|	ТаблицаПредварительныхЗаписей.НоменклатураНаименование КАК НоменклатураНаименование,
		|	ТаблицаПредварительныхЗаписей.ПричинаЗаписи КАК ПричинаЗаписи,
		|	ТаблицаПредварительныхЗаписей.ПризнакЗаблокировано КАК ПризнакЗаблокировано,
		|	ТаблицаПредварительныхЗаписей.ИндексВТЧ КАК ИндексВТЧ,
		|	ТаблицаПредварительныхЗаписей.НомерБлокаСобытий КАК НомерБлокаСобытий,
		|	ТаблицаПредварительныхЗаписей.АвторДокумента КАК АвторДокумента,
		|	ТаблицаПредварительныхЗаписей.ДатаСобытия КАК ДатаСобытия,
		|	ТаблицаПредварительныхЗаписей.Резерв КАК Резерв,
		|	ТаблицаПредварительныхЗаписей.Статус КАК Статус,
		|	ТаблицаПредварительныхЗаписей.ЦветФонаРезерва КАК ЦветФонаРезерва,
		|	ТаблицаПредварительныхЗаписей.ЕстьЗадолженность КАК ЕстьЗадолженность,
		|	ТаблицаПредварительныхЗаписей.ЕстьНезавершенныеНарядЗаказы КАК ЕстьНезавершенныеНарядЗаказы,
		|	ТаблицаПредварительныхЗаписей.ОбщийСтатусНезавершенныхНарядЗаказов КАК ОбщийСтатусНезавершенныхНарядЗаказов,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахования КАК ПолисМедСтрахования,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговор КАК ПолисМедСтрахованияДоговор,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговорКонтрагент КАК ПМСДоговорКонтрагент,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговорПрограммаСтрахования КАК ПМСДоговорПрограммаСтрахования,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияКраткоеНаименованиеСтраховойКомпании КАК ПМСКраткоеНаименованиеСтраховойКомпании,
		|	ВЫБОР
		|		КОГДА Профосмотры.ПредварительнаяЗапись ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПоНаправлению,
		|	ТаблицаПредварительныхЗаписей.ИдентификаторДиалога КАК ИдентификаторДиалога,
		|	ТаблицаПредварительныхЗаписей.СсылкаНаПрием КАК СсылкаНаПрием
		|ИЗ
		|	ТаблицаПредварительныхЗаписей КАК ТаблицаПредварительныхЗаписей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Профосмотры КАК Профосмотры
		|		ПО ТаблицаПредварительныхЗаписей.Событие = Профосмотры.ПредварительнаяЗапись
		|			И ТаблицаПредварительныхЗаписей.Контрагент = Профосмотры.Контрагент
		|			И (Профосмотры.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Направление))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Событие,
		|	Сотрудник,
		|	Контрагент,
		|	Помещение,
		|	ДатаНачала";
		
		Запрос.УстановитьПараметр("СписокМетокОтбор", СписокМетокОтбор);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Услуги.Ссылка КАК Событие,
		|	Услуги.Ссылка.УИД КАК УИДСобытия,
		|	Услуги.Ссылка.Контрагент КАК Контрагент,
		|	Услуги.Ссылка.Контрагент.Фамилия КАК КонтрагентФамилия,
		|	Услуги.Ссылка.Контрагент.Имя КАК КонтрагентИмя,
		|	Услуги.Ссылка.Контрагент.Отчество КАК КонтрагентОтчество,
		|	Услуги.Ссылка.Контрагент.Наименование КАК ФИОПациента,
		|	Услуги.Ссылка.Контрагент.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
		|	Услуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта.КодБезНулей КАК КонтрагентТекущаяМедицинскаяКартаКодБезНулей,
		|	Услуги.Ссылка.Контрагент.ТекущаяМедицинскаяКарта КАК КонтрагентТекущаяМедицинскаяКарта,
		|	Услуги.Ссылка.Контрагент.Телефон КАК КонтрагентТелефон,
		|	Услуги.Ссылка.ТелефонныйЗвонок КАК ТелефонныйЗвонок,
		|	Услуги.Ссылка.ОснованиеРезерва КАК ОснованиеРезерва,
		|	Услуги.Ссылка.Комментарий КАК Комментарий,
		|	Услуги.ДатаНачала КАК ДатаНачала,
		|	Услуги.ДатаОкончания КАК ДатаОкончания,
		|	Услуги.Сотрудник КАК Сотрудник,
		|	Услуги.Сотрудник.Наименование КАК СотрудникНаименование,
		|	Услуги.Помещение КАК Помещение,
		|	Услуги.Помещение.Наименование КАК ПомещениеНаименование,
		|	Услуги.Номенклатура КАК Услуга,
		|	Услуги.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	Услуги.ПричинаЗаписи КАК ПричинаЗаписи,
		|	Услуги.ПризнакЗаблокированно КАК ПризнакЗаблокировано,
		|	Услуги.НомерСтроки - 1 КАК ИндексВТЧ,
		|	0 КАК НомерБлокаСобытий,
		|	Услуги.Ссылка.АвторДокумента КАК АвторДокумента,
		|	Услуги.Ссылка.Дата КАК ДатаСобытия,
		|	Услуги.Ссылка.Резерв КАК Резерв,
		|	Услуги.Ссылка.Статус КАК Статус,
		|	Услуги.Ссылка.ЦветФонаРезерва КАК ЦветФонаРезерва,
		|	ЛОЖЬ КАК ЕстьЗадолженность,
		|	ЛОЖЬ КАК ЕстьНезавершенныеНарядЗаказы,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыНарядЗаказа.Заказано) КАК ОбщийСтатусНезавершенныхНарядЗаказов,
		|	Услуги.Ссылка.ПолисМедСтрахования КАК ПолисМедСтрахования,
		|	Услуги.Ссылка.ПолисМедСтрахования.Договор КАК ПолисМедСтрахованияДоговор,
		|	Услуги.Ссылка.ПолисМедСтрахования.Договор.Контрагент КАК ПолисМедСтрахованияДоговорКонтрагент,
		|	Услуги.Ссылка.ПолисМедСтрахования.Договор.ПрограммаСтрахования КАК ПолисМедСтрахованияДоговорПрограммаСтрахования,
		|	Услуги.Ссылка.ПолисМедСтрахования.СтраховаяКомпания.КраткоеНаименование КАК ПолисМедСтрахованияКраткоеНаименованиеСтраховойКомпании,
		|	Услуги.Ссылка.ИдентификаторДиалога КАК ИдентификаторДиалога,
		|	Услуги.Ссылка.СсылкаНаПрием КАК СсылкаНаПрием
		|ПОМЕСТИТЬ ТаблицаПредварительныхЗаписей
		|ИЗ
		|	Документ.Событие.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.Ссылка.Проведен
		|	И Услуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И Услуги.Ссылка.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
		|	И Услуги.ДатаНачала МЕЖДУ &ДатаОт И &ДатаПо
		|	И &УсловиеКонтрагент
		|	И &УсловиеСотрудник
		|	И &УсловиеДолжность
		|	И &УсловиеПомещение
		|	И НЕ Услуги.Ссылка В (&МассивИсключаемыхСобытий)
		|	И ВЫБОР
		|			КОГДА НЕ Услуги.Сотрудник.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|				ТОГДА Услуги.Сотрудник.Должность.ОтображатьВЖурналеПредварительнойЗаписи = ИСТИНА
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И &УсловиеСтатусСобытия
		|	И &УсловиеСтатусПодтверждено
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Событие,
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПредварительныхЗаписей.Событие КАК Событие,
		|	ТаблицаПредварительныхЗаписей.УИДСобытия КАК УИДСобытия,
		|	ТаблицаПредварительныхЗаписей.Контрагент КАК Контрагент,
		|	ТаблицаПредварительныхЗаписей.КонтрагентФамилия КАК КонтрагентФамилия,
		|	ТаблицаПредварительныхЗаписей.КонтрагентИмя КАК КонтрагентИмя,
		|	ТаблицаПредварительныхЗаписей.КонтрагентОтчество КАК КонтрагентОтчество, 
		|	ТаблицаПредварительныхЗаписей.ФИОПациента КАК ФИОПациента,
		|	ТаблицаПредварительныхЗаписей.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
		|	ТаблицаПредварительныхЗаписей.КонтрагентТекущаяМедицинскаяКартаКодБезНулей КАК КонтрагентТекущаяМедицинскаяКартаКодБезНулей,
		|	ТаблицаПредварительныхЗаписей.КонтрагентТекущаяМедицинскаяКарта КАК КонтрагентТекущаяМедицинскаяКарта,
		|	ТаблицаПредварительныхЗаписей.КонтрагентТелефон КАК КонтрагентТелефон,
		|	ТаблицаПредварительныхЗаписей.ТелефонныйЗвонок КАК ТелефонныйЗвонок,
		|	ТаблицаПредварительныхЗаписей.ОснованиеРезерва КАК ОснованиеРезерва,
		|	ТаблицаПредварительныхЗаписей.Комментарий КАК Комментарий,
		|	ТаблицаПредварительныхЗаписей.ДатаНачала КАК ДатаНачала,
		|	ТаблицаПредварительныхЗаписей.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаПредварительныхЗаписей.Сотрудник КАК Сотрудник,
		|	ТаблицаПредварительныхЗаписей.СотрудникНаименование КАК СотрудникНаименование,
		|	ТаблицаПредварительныхЗаписей.Помещение КАК Помещение,
		|	ТаблицаПредварительныхЗаписей.ПомещениеНаименование КАК ПомещениеНаименование,
		|	ТаблицаПредварительныхЗаписей.Услуга КАК Услуга,
		|	ТаблицаПредварительныхЗаписей.НоменклатураНаименование КАК НоменклатураНаименование,
		|	ТаблицаПредварительныхЗаписей.ПричинаЗаписи КАК ПричинаЗаписи,
		|	ТаблицаПредварительныхЗаписей.ПризнакЗаблокировано КАК ПризнакЗаблокировано,
		|	ТаблицаПредварительныхЗаписей.ИндексВТЧ КАК ИндексВТЧ,
		|	ТаблицаПредварительныхЗаписей.НомерБлокаСобытий КАК НомерБлокаСобытий,
		|	ТаблицаПредварительныхЗаписей.АвторДокумента КАК АвторДокумента,
		|	ТаблицаПредварительныхЗаписей.ДатаСобытия КАК ДатаСобытия,
		|	ТаблицаПредварительныхЗаписей.Резерв КАК Резерв,
		|	ТаблицаПредварительныхЗаписей.Статус КАК Статус,
		|	ТаблицаПредварительныхЗаписей.ЦветФонаРезерва КАК ЦветФонаРезерва,
		|	ТаблицаПредварительныхЗаписей.ЕстьЗадолженность КАК ЕстьЗадолженность,
		|	ТаблицаПредварительныхЗаписей.ЕстьНезавершенныеНарядЗаказы КАК ЕстьНезавершенныеНарядЗаказы,
		|	ТаблицаПредварительныхЗаписей.ОбщийСтатусНезавершенныхНарядЗаказов КАК ОбщийСтатусНезавершенныхНарядЗаказов,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахования КАК ПолисМедСтрахования,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговор КАК ПолисМедСтрахованияДоговор,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговорКонтрагент КАК ПМСДоговорКонтрагент,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияДоговорПрограммаСтрахования КАК ПМСДоговорПрограммаСтрахования,
		|	ТаблицаПредварительныхЗаписей.ПолисМедСтрахованияКраткоеНаименованиеСтраховойКомпании КАК ПМСКраткоеНаименованиеСтраховойКомпании,
		|	ВЫБОР
		|		КОГДА Профосмотры.ПредварительнаяЗапись ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПоНаправлению,
		|	ТаблицаПредварительныхЗаписей.ИдентификаторДиалога КАК ИдентификаторДиалога,
		|	ТаблицаПредварительныхЗаписей.СсылкаНаПрием КАК СсылкаНаПрием
		|ИЗ
		|	ТаблицаПредварительныхЗаписей КАК ТаблицаПредварительныхЗаписей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Профосмотры КАК Профосмотры
		|		ПО ТаблицаПредварительныхЗаписей.Событие = Профосмотры.ПредварительнаяЗапись
		|			И ТаблицаПредварительныхЗаписей.Контрагент = Профосмотры.Контрагент
		|			И (Профосмотры.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Направление))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Событие,
		|	Сотрудник,
		|	Контрагент,
		|	Помещение,
		|	ДатаНачала");
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ДатаОт"					, НачалоПериода);
	Запрос.УстановитьПараметр("ДатаПо"					, КонецПериода);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"      , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Контрагент"              , МассивКлиентов);
	Запрос.УстановитьПараметр("Сотрудники"              , МассивСотрудников);
	Запрос.УстановитьПараметр("Должность"               , Должность);
	Запрос.УстановитьПараметр("Помещение"               , Помещение);
	Запрос.УстановитьПараметр("СтатусСобытия"         	, СтатусыСобытия);
	Запрос.УстановитьПараметр("СтатусПодтверждено"    	, СтатусПодтверждено);
	Запрос.УстановитьПараметр("МассивИсключаемыхСобытий", ?(МассивИсключаемыхСобытий <> Неопределено, МассивИсключаемыхСобытий, Новый Массив));
	
	УсловиеКонтрагент         = ?(ЗначениеЗаполнено(МассивКлиентов), "И Услуги.Ссылка.Контрагент В (&Контрагент)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеКонтрагент", УсловиеКонтрагент);
	
	УсловиеСотрудник          = ?(ЗначениеЗаполнено(МассивСотрудников), "И Услуги.Сотрудник В (&Сотрудники)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСотрудник", УсловиеСотрудник);
	
	УсловиеДолжность          = ?(ЗначениеЗаполнено(Должность), "И Услуги.Сотрудник.Должность В (&Должность)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеДолжность", УсловиеДолжность);

	УсловиеПомещение          = ?(ЗначениеЗаполнено(Помещение), "И Услуги.Помещение В (&Помещение)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеПомещение", УсловиеПомещение);
	
	УсловиеСтатусСобытия      = ?(ЗначениеЗаполнено(СтатусыСобытия), "И Услуги.Ссылка.Статус В (&СтатусСобытия)", "И Услуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтатусСобытия", УсловиеСтатусСобытия);
	
	УсловиеСтатусПодтверждено = ?(ЗначениеЗаполнено(СтатусПодтверждено), "И Услуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтатусПодтверждено", УсловиеСтатусПодтверждено);

	ТаблицаСобытий = Запрос.Выполнить().Выгрузить();

	Если ТаблицаСобытий.Количество() > 0 Тогда 
		ОбщегоНазначенияСтоматология.ПроставимНекоторыеСтатусы(ТаблицаСобытий, СтруктурнаяЕдиница);
	КонецЕсли;
	
	Возврат ТаблицаСобытий;
	
КонецФункции

// Функция - Возвращает первое (следующее) событие, размещенное в рамках переданного периода
//
Функция ФактСобытийЗаУказаныйПериод(
	Знач НачалоПериода,
	Знач КонецПериода,
	Знач СтруктурнаяЕдиница,
	Знач Сотрудник	= Неопределено,
	Знач Помещение	= Неопределено) Экспорт
	
    Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Услуги.Ссылка КАК Событие,
		|	Услуги.ДатаНачала КАК ДатаНачала,
		|	Услуги.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.Событие.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.Ссылка.Проведен
		|	И Услуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И Услуги.ДатаНачала > &ДатаОт
		|	И Услуги.ДатаНачала < &ДатаДо
		|	И &УсловиеСотрудник
		|	И &УсловиеПомещение
		|	И НЕ Услуги.Ссылка.Статус.Ссылка = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала");
				
	Запрос.УстановитьПараметр("ДатаОт"					, НачалоПериода);
	Запрос.УстановитьПараметр("ДатаДо"					, КонецПериода);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"      , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудники"              , Сотрудник);
	Запрос.УстановитьПараметр("Помещение"               , Помещение);
	
	УсловиеСотрудник          = ?(ЗначениеЗаполнено(Сотрудник), "И Услуги.Сотрудник В (&Сотрудники)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСотрудник", УсловиеСотрудник);
	
	УсловиеПомещение          = ?(ЗначениеЗаполнено(Помещение), "И Услуги.Помещение В (&Помещение)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеПомещение", УсловиеПомещение);
	
	ТаблицаСобытий = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСобытий;

КонецФункции

// Функция - Вернуть события за указанный период
//
Функция ВернутьСобытияЗаУказанныйПериод(
	Знач НачалоПериода,
	Знач КонецПериода,
	Знач СтруктурнаяЕдиница,
	Знач Сотрудник	= Неопределено,
	Знач Помещение	= Неопределено,
	ИсключаемоеСобытие = Неопределено,
	СтатусСобытия = Неопределено,
	Пациент = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = ВыполнитьЗапросНаПроверкуНаличияСобытийЗаУказаныйПериод(НачалоПериода, КонецПериода,
																			   СтруктурнаяЕдиница, Сотрудник, 
																			   Помещение, ИсключаемоеСобытие, 
																			   СтатусСобытия, Пациент);	
	
	Возврат РезультатЗапроса.Выгрузить();	
		
КонецФункции
	
// Функция - Возвращает булево - есть ли события между двумя датами
// 
Функция НаличиеСобытийЗаУказаныйПериод(
	Знач НачалоПериода,
	Знач КонецПериода,
	Знач СтруктурнаяЕдиница,
	Знач Сотрудник	= Неопределено,
	Знач Помещение	= Неопределено,
	ИсключаемоеСобытие = Неопределено,
	СтатусСобытия = Неопределено,
	Пациент = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = ВыполнитьЗапросНаПроверкуНаличияСобытийЗаУказаныйПериод(НачалоПериода, КонецПериода,
																			   СтруктурнаяЕдиница, Сотрудник,
																			   Помещение, ИсключаемоеСобытие,
																			   СтатусСобытия, Пациент);	
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Функция - Выполнить запрос на проверку наличия событий между датами
//
Функция ВыполнитьЗапросНаПроверкуНаличияСобытийЗаУказаныйПериод(
	Знач НачалоПериода,
	Знач КонецПериода,
	Знач СтруктурнаяЕдиница,
	Знач Сотрудник,
	Знач Помещение,
	ИсключаемоеСобытие,
	СтатусСобытия,
	Пациент)
	
	Запрос = Новый Запрос(	
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	 |	Услуги.Ссылка КАК Событие
	 |ПОМЕСТИТЬ ВТСобытий
	 |ИЗ
	 |	Документ.Событие.Услуги КАК Услуги
	 |ГДЕ
	 |	Услуги.Ссылка.Проведен
	 |	И Услуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И (Услуги.ДатаНачала > &ДатаНачала
	 |				И Услуги.ДатаНачала < &ДатаОкончания
	 |			ИЛИ Услуги.ДатаОкончания > &ДатаНачала
	 |				И Услуги.ДатаОкончания < &ДатаОкончания
	 |			ИЛИ Услуги.ДатаНачала <= &ДатаНачала
	 |				И Услуги.ДатаОкончания >= &ДатаОкончания)
	 |	И &УсловиеСотрудник
	 |	И &УсловиеПомещение
	 |	И &УсловиеИсключаемоеСобытие
	 |	И &УсловиеСтатусСобытия
	 |	И &УсловиеПациентСобытия
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	СобытиеУслуги.Ссылка КАК Событие,
	 |	МИНИМУМ(СобытиеУслуги.ДатаНачала) КАК ДатаНачала,
	 |	МАКСИМУМ(СобытиеУслуги.ДатаОкончания) КАК ДатаОкончания,
	 |	СУММА(РАЗНОСТЬДАТ(СобытиеУслуги.ДатаНачала, СобытиеУслуги.ДатаОкончания, МИНУТА)) КАК Длительность,
	 |	СобытиеУслуги.Ссылка.Врач КАК Сотрудник
	 |ИЗ
	 |	ВТСобытий КАК ВТСобытий
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие.Услуги КАК СобытиеУслуги
	 |		ПО ВТСобытий.Событие = СобытиеУслуги.Ссылка
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	СобытиеУслуги.Ссылка,
	 |	СобытиеУслуги.Ссылка.Врач
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ДатаНачала");

	Запрос.УстановитьПараметр("ДатаНачала"				, НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания"			, КонецПериода);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудники"				, Сотрудник);
	Запрос.УстановитьПараметр("Помещение"				, Помещение);
	Запрос.УстановитьПараметр("ИсключаемоеСобытие"		, ИсключаемоеСобытие);
	Запрос.УстановитьПараметр("СтатусСобытия"			, СтатусСобытия);
	Запрос.УстановитьПараметр("Пациент"					, Пациент);
	
	УсловиеСотрудник			= ?(ЗначениеЗаполнено(Сотрудник), "И Услуги.Сотрудник В (&Сотрудники)", "");
	Запрос.Текст 				= СтрЗаменить(Запрос.Текст, "И &УсловиеСотрудник", УсловиеСотрудник);
	
	УсловиеПомещение			= ?(ЗначениеЗаполнено(Помещение), "И Услуги.Помещение В (&Помещение)", "");
	Запрос.Текст				= СтрЗаменить(Запрос.Текст, "И &УсловиеПомещение", УсловиеПомещение);
	
	УсловиеИсключаемоеСобытие	= ?(ЗначениеЗаполнено(ИсключаемоеСобытие), "И НЕ Услуги.Ссылка = &ИсключаемоеСобытие", "");
	Запрос.Текст				= СтрЗаменить(Запрос.Текст, "И &УсловиеИсключаемоеСобытие", УсловиеИсключаемоеСобытие);
	
	УсловиеСтатусСобытия		= ?(ЗначениеЗаполнено(СтатусСобытия), "И Услуги.Ссылка.Статус = &СтатусСобытия", "И НЕ Услуги.Ссылка.Статус.Ссылка = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)");
	Запрос.Текст				= СтрЗаменить(Запрос.Текст, "И &УсловиеСтатусСобытия", УсловиеСтатусСобытия);
	
	УсловиеПациентСобытия		= ?(ЗначениеЗаполнено(Пациент), "И Услуги.Ссылка.Контрагент = &Пациент", "");
	Запрос.Текст				= СтрЗаменить(Запрос.Текст, "И &УсловиеПациентСобытия", УсловиеПациентСобытия);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция, формирует массив элементов.
// 
Функция ПереданныйПараметрВМассивЭлементов(Знач ЭлементСегмент, ТипЭлемента, ТипСегмента) Экспорт
		
	МассивЭлементов = Неопределено;
	
	Если ЗначениеЗаполнено(ЭлементСегмент) Тогда
		
		// Это элемент
		Если ТипЗнч(ЭлементСегмент) = ТипЭлемента Тогда
			МассивЭлементов = Новый Массив;
			МассивЭлементов.Добавить(ЭлементСегмент);
		// Это сегмент	
		ИначеЕсли ТипЗнч(ЭлементСегмент) = ТипСегмента Тогда
			МассивЭлементов = РегистрыСведений.СоставСегментов.СоставСегмента(ЭлементСегмент);
		// Это массив	
		ИначеЕсли ТипЗнч(ЭлементСегмент) = Тип("Массив") Тогда
			
			МассивЭлементов = Новый Массив;
			
			Для Каждого ЭлементМ ИЗ ЭлементСегмент Цикл
				
				Если ТипЗнч(ЭлементМ) = ТипЭлемента Тогда
					МассивЭлементов.Добавить(ЭлементМ);
				ИначеЕсли ТипЗнч(ЭлементМ) = ТипСегмента Тогда
					ВременныйМассив  = РегистрыСведений.СоставСегментов.СоставСегмента(ЭлементМ);
					МассивЭлементов  = ОбщегоНазначенияСтоматология.ДобавитьВМассив(МассивЭлементов, ВременныйМассив); 
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат МассивЭлементов;

КонецФункции

// Функция - вернет разрешение создания визита в указанное время.
// 
// Параметры:
//  Период				 - 	 -
//  ОснованиеОплаты		 - 	 -
//  Номенклатура		 - 	 -
//  ВремяНачала			 - 	 -
//  ВремяОкончания		 - 	 -
//  ОписаниеОграничения	 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция РазрешеноСозданиеВизитаПредварительнаяЗапись(	
	Знач СтруктурнаяЕдиница,
	Знач ВремяНачала,
	Знач ВремяОкончания,
	Знач Сотрудник,
	// Знач Помещение,
	Знач Статус,	
	ИсключаемыйВизит             = Неопределено,
	КонтрольРабВремениСотрудника = Истина,
	ОписаниеОграничения          = Неопределено,
	КодОграничения               = Неопределено) Экспорт
	
	Если ИсключаемыйВизит = Неопределено Тогда
		ИсключаемыйВизит = Документы.Событие.ПустаяСсылка()
	КонецЕсли;
	
	// Проверка времени работы структурной единицы.
	ВремяРаботыСтруктурнойЕдиницы = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(ВремяНачала, СтруктурнаяЕдиница,, Ложь);
	
	Если ВремяРаботыСтруктурнойЕдиницы = Неопределено Тогда
		
		ОписаниеОграничения = "" + "Клиника "+"""" + СтруктурнаяЕдиница + """"+" не работает в выбранное время!";
		Возврат Ложь;
		
	КонецЕсли;
	
	// Проверяем возможность создания визита по занятости сотрудника.
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		РазрешеноСозданиеВизитаЗанятостьСотрудника = ВизитПредварительнаяЗаписьПроверкаЗанятостиСотрудника(
			ВремяНачала,
			ВремяОкончания,
			ИсключаемыйВизит,
			КодОграничения,
			КонтрольРабВремениСотрудника,
			ОписаниеОграничения,
			Сотрудник,
			СтруктурнаяЕдиница
		);
		
		Если Не РазрешеноСозданиеВизитаЗанятостьСотрудника Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// КонтрольЗанятостиПомещения = Константы.ИспользоватьРесурсы.Получить() И ЗначениеЗаполнено(Помещение) И Не Помещение.НеКонтролироватьЗанятость;
	//
	//// Проврека занятости помещения.
	// Если КонтрольЗанятостиПомещения = Истина Тогда
	//	
	//	Если ВизитПредварительнаяЗаписьПроверкаЗанятостиПомещения(ВремяНачала, ВремяОкончания, Помещение, ИсключаемыйВизит, ОписаниеОграничения) = Истина Тогда
	//		Возврат Ложь;
	//	КонецЕсли;
	// КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция, проверяет занятость сотрудника визита.
// 
Функция ВизитПредварительнаяЗаписьПроверкаЗанятостиСотрудника(	
	ВремяНачала,
	ВремяОкончания,
	ИсключаемыйВизит,
	КодОграничения,
	КонтрольРабВремениСотрудника,
	ОписаниеОграничения,
	Сотрудник,
	СтруктурнаяЕдиница)
	
	// Проверяем возможность работы сотрудника в данной структурной единице.
	СотрудникРаботаетВСтруктурнойЕдинице = ПроверитьВозможностьРаботыСотрудникаВСтруктурнойЕдинице(
		Сотрудник,
		СтруктурнаяЕдиница,
		НачалоДня(ВремяНачала),
		ОписаниеОграничения
	);

	ПредставлениеСотрудника = Справочники.Сотрудники.ПредставлениеФИОСотрудника(Сотрудник);
	
	Если Не СотрудникРаботаетВСтруктурнойЕдинице Тогда
		ОписаниеОграничения = "Сотрудник " + ПредставлениеСотрудника + " не работает в " + СтруктурнаяЕдиница;
		Возврат Ложь;
	КонецЕсли; 
	
	// Проверяем рабочее время сотрудника.
	Если КонтрольРабВремениСотрудника = Истина Тогда		
		
		ВозможностьЗаписи = РегистрыСведений.ВремяРаботыСотрудниковПлан.ПроверитьВозможностьЗаписиРабочегоВремени(ВремяНачала,ВремяОкончания,Сотрудник,СтруктурнаяЕдиница,Описаниеограничения);
		Если Не ВозможностьЗаписи Тогда		
			Возврат Ложь;		
		КонецЕсли;
		
		Работает = РегистрыСведений.ВремяРаботыСотрудниковПлан.ПроверитьВхождениеИнтервалаВРабочееВремя(Сотрудник, ВремяНачала, ВремяОкончания, СтруктурнаяЕдиница);
		Если Не Работает Тогда
			КодОграничения      = 403;
			ОписаниеОграничения = "Выбранный интервал с " + Формат(ВремяНачала,"ДФ=HH:mm") + " по " + Формат(ВремяОкончания,"ДФ=HH:mm") + " является для сотрудника нерабочим. Продолжить?" ;
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
	ВизитыДляТекущегоСотрудника = СобытияЗаУказанныйПериод(ВремяНачала, ВремяОкончания,, ,,Сотрудник,,, ИсключаемыйВизит);

	ИнтервалЗанятости = "";
	
	// Проверяем занятость сотрудника в других визитах.
	Для Каждого СтрокаТ ИЗ ВизитыДляТекущегоСотрудника Цикл
		ИнтервалЗанятости = ?(ЗначениеЗаполнено(ИнтервалЗанятости), ИнтервалЗанятости + ", с " + Формат(СтрокаТ.ДатаВремяНачала, "ДФ=HH:mm") + " по " + Формат(СтрокаТ.ДатаВремяОкончания, "ДФ=HH:mm"), "с " + Формат(СтрокаТ.ДатаВремяНачала, "ДФ=HH:mm") + " по " + Формат(СтрокаТ.ДатаВремяОкончания, "ДФ=HH:mm"));
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИнтервалЗанятости) Тогда
		ОписаниеОграничения = "Сотрудник " + ПредставлениеСотрудника + " занят в выбранном интервале " + ИнтервалЗанятости + ". Продолжить?";
		КодОграничения 		= 406;
		Возврат Ложь;
	КонецЕсли;  
		
	Возврат Истина;
	
КонецФункции

// Функция - Проверить возможность работы сотрудника в структурной единице. 
//
Функция ПроверитьВозможностьРаботыСотрудникаВСтруктурнойЕдинице(ОтборСотрудник, ОтборСтруктурнаяЕдиница, ОтборНаДату, ОписаниеОграничения) Экспорт 
	
	// Проверяем возможность работы сотрудника в данной структурной единице.
	НастройкиПользователейДатаУвольнения = РегистрыСведений.НастройкиСотрудников.ПолучитьДатуУвольненияСотрудника(ОтборСотрудник, ОтборСтруктурнаяЕдиница); 
		
	Если ЗначениеЗаполнено(НастройкиПользователейДатаУвольнения) 
		И НастройкиПользователейДатаУвольнения <= НачалоДня(ОтборНаДату) Тогда 		
		
		ОписаниеОграничения = "Сотрудник: " + Справочники.Сотрудники.ПредставлениеФИОСотрудника(ОтборСотрудник) + " уволен с " 
								+ Формат(НастройкиПользователейДатаУвольнения, "ДЛФ=ДД") + " из : " + ОтборСтруктурнаяЕдиница.Наименование;
		Возврат Ложь;
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции
	
// Процедура - Создать предварительную записи.
//
Процедура СоздатьПредварительнуюЗаписи(ДанныеЗаполнения, СделатьПроверкуЗаполнения = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
		
	СобытиеОбъект = Документы.Событие.СоздатьДокумент();
	// СобытиеОбъект.Заполнить(ДанныеЗаполнения);	
	
	ДанныеЗаполнения.Свойство("ДатаНачала"			, СобытиеОбъект.Дата);		
	ДанныеЗаполнения.Свойство("Резерв"				, СобытиеОбъект.Резерв); 	
	ДанныеЗаполнения.Свойство("Контрагент"			, СобытиеОбъект.Контрагент);
	ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница"	, СобытиеОбъект.СтруктурнаяЕдиница);
	ДанныеЗаполнения.Свойство("Сотрудник"			, СобытиеОбъект.Врач);
	ДанныеЗаполнения.Свойство("АвторДокумента"		, СобытиеОбъект.АвторДокумента);
	
	СобытиеОбъект.АвторДокумента = ?(ЗначениеЗаполнено(СобытиеОбъект.АвторДокумента), СобытиеОбъект.АвторДокумента, ПараметрыСеанса.ТекущийПользователь);	
	СобытиеОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	СобытиеОбъект.Статус = Перечисления.СтатусыСобытия.НеПодтверждена;
	СобытиеОбъект.ИсточникЗаписи = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиЗаписей.Администратор");
	СобытиеОбъект.ТипСобытия = Перечисления.ТипыСобытий.ПредварительнаяЗапись;
	ВидЦенРеализации = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СобытиеОбъект.СтруктурнаяЕдиница, "ВидЦенРеализации"); 
	СобытиеОбъект.ВидЦен = ?(ЗначениеЗаполнено(ВидЦенРеализации), ВидЦенРеализации, Справочники.ВидыЦен.Розничная);
	ПричинаЗаписи = ?(ЗначениеЗаполнено(ДанныеЗаполнения.ПричинаЗаписи), ДанныеЗаполнения.ПричинаЗаписи, Неопределено);
	
	// НормаВремени = ?(ЗначениеЗаполнено(ПричинаЗаписи), ПричинаЗаписи.НормаВремени, 15);
	// НормаВремени = ?(ЗначениеЗаполнено(НормаВремени), НормаВремени, 15);	
	// НоваяДатаОкончания = ДанныеЗаполнения.ДатаНачала + НормаВремени * 60;
				
	Если ДанныеЗаполнения.Свойство("ДатаНачала") И ДанныеЗаполнения.Свойство("ДатаОкончания") Тогда 		
		НоваяСтрокаОбъектУслуги = СобытиеОбъект.Услуги.Добавить();			
		НоваяСтрокаОбъектУслуги.ДатаНачала		= ДанныеЗаполнения.ДатаНачала;
		НоваяСтрокаОбъектУслуги.ДатаОкончания	= ДанныеЗаполнения.ДатаОкончания;		
		НоваяСтрокаОбъектУслуги.Сотрудник		= СобытиеОбъект.Врач;
		НоваяСтрокаОбъектУслуги.Помещение		= ?(ЗначениеЗаполнено(ДанныеЗаполнения.Помещение), ДанныеЗаполнения.Помещение, РегистрыСведений.СвязкаПомещениеСотрудник.ПолучитьПомещениеСотрудникаПоУмолчанию(ДанныеЗаполнения.Сотрудник, СобытиеОбъект.СтруктурнаяЕдиница));
		НоваяСтрокаОбъектУслуги.НормаВремени	= (НоваяСтрокаОбъектУслуги.ДатаОкончания - НоваяСтрокаОбъектУслуги.ДатаНачала) / 60;
		НоваяСтрокаОбъектУслуги.ПричинаЗаписи	= ПричинаЗаписи;
	КонецЕсли;

	ЗаписьРазрешена = ?(СделатьПроверкуЗаполнения = Истина, СобытиеОбъект.ПроверитьЗаполнение(), Истина);
	
	Если ЗаписьРазрешена = Истина Тогда
		Если НЕ СобытиеОбъект.Резерв Тогда
			ИнициализироватьПредопределеннуюСделку(СобытиеОбъект, СобытиеОбъект.Врач, Истина);
		КонецЕсли;	
		
		Попытка
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			ВызватьИсключение;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(СобытиеОбъект.Ссылка) Тогда			
			// Установка меток
			РегистрыСведений.МеткиКлиентов.ПолучитьИЗаписатьМеткиКонтрагентаВПредварительнойЗаписи(СобытиеОбъект.Контрагент, СобытиеОбъект.Ссылка,, Ложь);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Вставить скопированную или вырезанную предварительную запись.
//
Процедура ВставитьСкопированнуюИлиВырезаннуюПредварительнуюЗапись(КопируемоеСобытие, Перенести = Ложь, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КопируемоеСобытие) Тогда
		Возврат;
	КонецЕсли;
	
	Старт = Дата(1,1,1);
	СтартДельта = Дата(1,1,1);	
	Длительность = 0;
	ДатаОкончания = Дата(1,1,1);
	
	Сотрудник = Неопределено;
	Помещение = Неопределено; 
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ЗначениеЗаполнено(ДопПараметры) Тогда
		
		ДопПараметры.Свойство("ДатаНачала"		, Старт);
		ДопПараметры.Свойство("СтартДельта"		, СтартДельта);
		ДопПараметры.Свойство("Сотрудник"		, Сотрудник);
		ДопПараметры.Свойство("Помещение"		, Помещение);
		ДопПараметры.Свойство("Длительность"	, Длительность);
		ДопПараметры.Свойство("ДатаОкончания"	, ДатаОкончания);
		
	КонецЕсли;		
	
	Если НЕ ЗначениеЗаполнено(Старт) ИЛИ НЕ ЗначениеЗаполнено(СтартДельта) Тогда
		Возврат;
	КонецЕсли;
		
	Если Перенести Тогда
		СобытиеОбъект = КопируемоеСобытие.ПолучитьОбъект();
	Иначе
		СобытиеОбъект = КопируемоеСобытие.ПолучитьОбъект().Скопировать();
		СобытиеОбъект.Дата = Старт; // ТекущаяДатаСервера()
		СобытиеОбъект.Сделка = Неопределено;
		СобытиеОбъект.ДополнительныеСвойства.Вставить("НеВыводитьСообщение", Истина); 
	КонецЕсли;
	
	ПересчетВремениОказанияУслуг(СобытиеОбъект.Услуги, Длительность, Старт, Сотрудник, Помещение);	
	СобытиеОбъект.АвторДокумента = КопируемоеСобытие.АвторДокумента;
	
	Если НЕ СобытиеОбъект.Резерв И НЕ ЗначениеЗаполнено(СобытиеОбъект.Сделка) Тогда
		ИнициализироватьПредопределеннуюСделку(СобытиеОбъект, ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, СобытиеОбъект.Врач), НЕ ЗначениеЗаполнено(СобытиеОбъект.Ссылка));
	КонецЕсли;	
	
	Попытка
		СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	// Установка рабочего времени у сотрудника.
	Если СобытиеОбъект.Услуги.Количество() > 0 И ЗначениеЗаполнено(СобытиеОбъект.Услуги[0].Сотрудник) Тогда
		ВремяРабочее = РегистрыСведений.ВремяРаботыСотрудниковПлан.ПроверитьРаботаетЛиСотрудникВпериодВремя(Старт, Старт, ДатаОкончания,
																											СобытиеОбъект.Услуги[0].Сотрудник, 
																											СобытиеОбъект.СтруктурнаяЕдиница);
		Если НЕ ВремяРабочее Тогда	
			РегистрыСведений.ВремяРаботыСотрудниковПлан.УстановкаРабочегоВремениСотрудника(СобытиеОбъект.СтруктурнаяЕдиница, СобытиеОбъект.Услуги[0].Сотрудник,
																						Истина, Старт, ДатаОкончания);
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СобытиеОбъект.Ссылка) И НЕ Перенести Тогда			
		// Установка меток 
		РегистрыСведений.МеткиКлиентов.СкопироватьМеткиОбъекта(КопируемоеСобытие, СобытиеОбъект.Ссылка);
	КонецЕсли;
		
КонецПроцедуры

// Процедура - Пересчет времени оказания услуг.
//
// Параметры:
//  ТаблицаУслуги		 - 	 ТЧ с услугами 
//  НоваяДлительность	 - 	 Новая длительность события В МИНУТАХ! 
//  НоваяДатаНачала		 - 	 Новая дата начала события 
//  НовыйВрач			 - 	 Новый врач, если необходимо его поменять 
//
Процедура ПересчетВремениОказанияУслуг(ТаблицаУслуги, НоваяДлительность, НоваяДатаНачала, НовыйВрач = Неопределено, Помещение = Неопределено)
		
	ПоследняяДлительность = 0;
	ЕстьОстаток = Ложь;	
	КоличествоУслуг = ТаблицаУслуги.Количество() - 1;
	КоличествоУслуг = ?(КоличествоУслуг = 0, 1, КоличествоУслуг);
	КоличествоСтрок = ТаблицаУслуги.Количество();
	
	СреднееВремяДлительностиОднойУслуги = Цел(НоваяДлительность / КоличествоУслуг);
	Если НЕ (НоваяДлительность % КоличествоУслуг) = 0 Тогда
		ПоследняяДлительность = СреднееВремяДлительностиОднойУслуги + (НоваяДлительность % КоличествоУслуг);
		ЕстьОстаток = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из ТаблицаУслуги Цикл
					
		ЭтоПоследняяСтрока = СтрокаТЗ.НомерСтроки = КоличествоСтрок;
		
		СтрокаТЗ.Сотрудник = ?(ЗначениеЗаполнено(НовыйВрач), НовыйВрач, СтрокаТЗ.Сотрудник);
		СтрокаТЗ.Помещение = ?(ЗначениеЗаполнено(Помещение), Помещение, СтрокаТЗ.Помещение);
		
		Если КоличествоСтрок = 1 Тогда 
			
			СтрокаТЗ.НормаВремени = СреднееВремяДлительностиОднойУслуги;
			СтрокаТЗ.ДатаНачала = НоваяДатаНачала;
			СтрокаТЗ.ДатаОкончания = СтрокаТЗ.ДатаНачала + (СтрокаТЗ.НормаВремени * 60);
  			
		Иначе // ЗначениеЗаполнено(СтрокаТЗ.Номенклатура)	
			
			СтрокаТЗ.НормаВремени = ?(ЭтоПоследняяСтрока, 0, ?(ЕстьОстаток, ПоследняяДлительность, СреднееВремяДлительностиОднойУслуги));  // Вместо 0 - СтрокаТЗ.НормаВремени
			СтрокаТЗ.ДатаНачала = ?(СтрокаТЗ.НомерСтроки = 1, НоваяДатаНачала, ТаблицаУслуги[СтрокаТЗ.НомерСтроки-2].ДатаОкончания);
			СтрокаТЗ.ДатаОкончания = ?(ЭтоПоследняяСтрока, СтрокаТЗ.ДатаНачала, СтрокаТЗ.ДатаНачала + (СтрокаТЗ.НормаВремени * 60));
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// Процедура - Перенести предварительную запись.
//
// Параметры:
//  Событие						 - 	 Переносимое событие 
//  Сотрудник					 - 	 Новый сотрудник события 
//  Помещение					 - 	 Новое помещение события 
//  ДатаНачала					 - 	 Новая дата начала 
//  ДатаОкончания				 - 	 Новая дата окончания 
//  СделатьПроверкуЗаполнения	 - 	 Булево - Истина, если надо сделать проверку через ОбработкаПроверкиЗаполнения() 
//
Процедура ПеренестиПредварительнуюЗапись(Событие, Сотрудник = Неопределено, Помещение = Неопределено, ДатаНачала, ДатаОкончания, СделатьПроверкуЗаполнения = Ложь, ВыполненоУспешно = Ложь, ОписаниеОшибки = Неопределено, АвторЗаписи = Неопределено) Экспорт
	                                      	
	Если НЕ ЗначениеЗаполнено(Событие) ИЛИ НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат
	КонецЕсли;
		
	ОбъектСобытие = Событие.ПолучитьОбъект();
	ОбъектСобытие.Дата = ДатаНачала;
	КоличествоУслуг = ОбъектСобытие.Услуги.Количество();
	Если КоличествоУслуг > 0 Тогда
		НоваяДлительностьПриема = (ДатаОкончания - ДатаНачала);
		
		// Это сокращение приема
		Если НЕ НоваяДлительностьПриема = (ОбъектСобытие.Услуги[КоличествоУслуг-1].ДатаОкончания - ОбъектСобытие.Услуги[0].ДатаНачала) Тогда
			ПересчетВремениОказанияУслуг(ОбъектСобытие.Услуги, НоваяДлительностьПриема / 60, ДатаНачала, Сотрудник, Помещение);		
		Иначе
			ВремяСмещенияНачала = ДатаНачала - ОбъектСобытие.Услуги[0].ДатаНачала;
			ВремяСмещенияОкончания = ДатаОкончания - ОбъектСобытие.Услуги[КоличествоУслуг-1].ДатаОкончания;
			
			// Смещение события
			Если ЗначениеЗаполнено(ВремяСмещенияНачала) ИЛИ НЕ Сотрудник = ОбъектСобытие.Услуги[0].Сотрудник ИЛИ НЕ Помещение = ОбъектСобытие.Услуги[0].Помещение Тогда 
				Для каждого СтрокаУслуг Из ОбъектСобытие.Услуги Цикл
					
					СтрокаУслуг.ДатаНачала = СтрокаУслуг.ДатаНачала + ВремяСмещенияНачала;	 
					СтрокаУслуг.ДатаОкончания = СтрокаУслуг.ДатаОкончания + ВремяСмещенияНачала;
					СтрокаУслуг.Сотрудник = ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, СтрокаУслуг.Сотрудник); 
					СтрокаУслуг.Помещение = ?(ЗначениеЗаполнено(Помещение), Помещение, СтрокаУслуг.Помещение);
					
				КонецЦикла;
			КонецЕсли;
			// Изменение размера события
			// Если ЗначениеЗаполнено(ВремяСмещенияОкончания)
			//	И ВремяСмещенияОкончания <> ВремяСмещенияНачала Тогда
			//	
			//	НайденнаяСтрока = ОбъектСобытие.Услуги[КоличествоУслуг-1];
			//	НайденнаяСтрока.ДатаОкончания = НайденнаяСтрока.ДатаОкончания + ВремяСмещенияОкончания;
			//	НайденнаяСтрока.НормаВремени  = НайденнаяСтрока.НормаВремени + Окр(ВремяСмещенияОкончания / 60);	
			//	
			// КонецЕсли;
		КонецЕсли;
		
		ОбъектСобытие.Врач = ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, ОбъектСобытие.Врач);
	КонецЕсли;
			
	ЗаписьРазрешена = ?(СделатьПроверкуЗаполнения = Истина, ОбъектСобытие.ПроверитьЗаполнение(), Истина);	
	
	Если ЗаписьРазрешена = Истина Тогда
		Если НЕ ОбъектСобытие.Резерв И НЕ ЗначениеЗаполнено(ОбъектСобытие.Сделка) Тогда
			ИнициализироватьПредопределеннуюСделку(ОбъектСобытие, ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, ОбъектСобытие.Врач));
		КонецЕсли;	
		
		Попытка   	
			ОбъектСобытие.ДополнительныеСвойства.Вставить("АвторЗаписи", АвторЗаписи);
			ОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
			ВыполненоУспешно = Истина;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			ЗаписьРазрешена = Ложь;		
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Изменить статус предварительных записей в планировщике.
//
// Параметры:
//  МассивСобытий		- 	 Массив из событий или ссылка на предварительную запись 
//  СтатусСобытия		- 	 Новый статус предварительной записи 
//
Процедура ИзменитьСтатусПредварительныхЗаписейВПланировщике(Знач МассивСобытий, СтатусСобытия) Экспорт
	
	Если НЕ ЗначениеЗаполнено(МассивСобытий) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(МассивСобытий) = Тип("Массив") Тогда
		ЭлементМассива = МассивСобытий;
		МассивСобытий = Новый Массив;
		МассивСобытий.Добавить(ЭлементМассива);
	КонецЕсли;
	
	Для Каждого Событие Из МассивСобытий Цикл
		
		ОбъектСобытие = Событие.ПолучитьОбъект();
		
		СобытиеЗакрыто = 	Событие.Статус = Перечисления.СтатусыСобытия.ПриемОкончен
		ИЛИ Событие.Статус = Перечисления.СтатусыСобытия.ПриемОтменен 
		ИЛИ Событие.Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся;
		
		Если НЕ СтатусСобытия = Неопределено Тогда
			
			Если СобытиеЗакрыто
				И НЕ (СтатусСобытия = Перечисления.СтатусыСобытия.НеПодтверждена
				ИЛИ СтатусСобытия = Перечисления.СтатусыСобытия.Подтверждена) Тогда
				
				ОбъектСобытие.Статус = СтатусСобытия;
			ИначеЕсли НЕ СобытиеЗакрыто Тогда
				ОбъектСобытие.Статус = СтатусСобытия;
			КонецЕсли;
			
		КонецЕсли; 	
		
		Если СтатусСобытия = Перечисления.СтатусыСобытия.НеПодтверждена Тогда 
			ОбъектСобытие.ТелефонныйЗвонок = Ложь;
		ИначеЕсли СтатусСобытия = Перечисления.СтатусыСобытия.Подтверждена  Тогда
			ОбъектСобытие.ТелефонныйЗвонок = Истина;
		КонецЕсли;
		
		ОбъектСобытие.ДополнительныеСвойства.Вставить("НеОповещатьВСистемеВзаимодействия", Истина);
		
		Попытка
			ОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);	
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

// Процедура - Процедура изменяет ряд реквизитов у нового объекта скопированного документа.
//
Процедура ЗаполнитьНовоеСобытиеПриКопировании(ОбъектФормы, ДанныеЗаполнения) Экспорт
		
	Если ОбъектФормы = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
		
	ОбъектФормы.Дата 				= ДанныеЗаполнения.ДатаНачала;
	ОбъектФормы.СтруктурнаяЕдиница 	= ?(ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница"), ДанныеЗаполнения.СтруктурнаяЕдиница, ОбъектФормы.СтруктурнаяЕдиница);	
	
	НовыйСотрудник = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Сотрудник), ДанныеЗаполнения.Сотрудник, Неопределено);
	НовоеПомещение = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Помещение), ДанныеЗаполнения.Помещение, Неопределено);
	
	ОбъектФормы.Врач = ?(НЕ НовыйСотрудник = Неопределено, НовыйСотрудник, ОбъектФормы.Врач);
	
	Если ОбъектФормы.Услуги.Количество() > 0 Тогда
		СтартДельта = ОбъектФормы.Услуги[0].ДатаНачала;
		
		Для Каждого СтрокаТаблицыУслуги Из ОбъектФормы.Услуги Цикл
			СтрокаТаблицыУслуги.ДатаНачала            = ДанныеЗаполнения.ДатаНачала + (СтрокаТаблицыУслуги.ДатаНачала - СтартДельта);
			СтрокаТаблицыУслуги.ДатаОкончания         = ДанныеЗаполнения.ДатаНачала + (СтрокаТаблицыУслуги.ДатаОкончания - СтартДельта);
			СтрокаТаблицыУслуги.Сотрудник             = ?(НЕ НовыйСотрудник = Неопределено, НовыйСотрудник, СтрокаТаблицыУслуги.Сотрудник);
			СтрокаТаблицыУслуги.Помещение             = ?(НЕ НовоеПомещение = Неопределено, НовоеПомещение, СтрокаТаблицыУслуги.Помещение);
		КонецЦикла;			
	КонецЕсли;
	
	Если НЕ ОбъектФормы.Резерв И НЕ ЗначениеЗаполнено(ОбъектФормы.Сделка) Тогда
		ОбъектСобытие = ДанныеФормыВЗначение(ОбъектФормы, Тип("ДокументОбъект.Событие"));		
		ИнициализироватьПредопределеннуюСделку(ОбъектСобытие, ?(ЗначениеЗаполнено(НовыйСотрудник), НовыйСотрудник, ОбъектСобытие.Врач), Истина);
		ЗначениеВДанныеФормы(ОбъектСобытие, ОбъектФормы);		
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Установить статус предварительной записи
//
// Параметры:
//  Статус					 - 	 - 
//  ПредварительнаяЗапись	 - 	 - 
//  Сделка					 - 	 - 
//
Процедура УстановитьСтатусПредварительнойЗаписи(Статус
												, ПредварительнаяЗапись = Неопределено
												, Сделка = Неопределено) Экспорт
												
	СтатусТекущий = Неопределено;
	Если НЕ ЗначениеЗаполнено(ПредварительнаяЗапись) Тогда 
		Если ЗначениеЗаполнено(Сделка) Тогда
			ПредварительнаяЗапись = ПолучитьПредварительнуюЗаписьПоСделке(Сделка, СтатусТекущий);
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ПредварительнаяЗапись) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусТекущий) И СтатусТекущий = Статус Тогда
		Возврат;
	ИначеЕсли ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПредварительнаяЗапись, "Статус") = Статус Тогда 
		Возврат;
	КонецЕсли;	
		
	Объект_ПЗ        		= ПредварительнаяЗапись.ПолучитьОбъект();
	Объект_ПЗ.Статус 		= Статус;
	Попытка
		Объект_ПЗ.Записать();			
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - Получить предварительную запись по сделке
//
// Параметры:
//  Сделка	 - 	 - 
//  Статус	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредварительнуюЗаписьПоСделке(Сделка, Статус = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Событие.Ссылка КАК Ссылка,
	|	Событие.Дата КАК Дата,
	|	Событие.Статус КАК Статус,
	|	1 КАК Приоритет
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Проведен = ИСТИНА
	|	И Событие.Резерв = ЛОЖЬ
	|	И Событие.Сделка = &Сделка
	|	И Событие.Статус = &Статус
	|	И Событие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Событие.Ссылка,
	|	Событие.Дата,
	|	Событие.Статус,
	|	2
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Резерв = ЛОЖЬ
	|	И Событие.Сделка = &Сделка
	|	И Событие.Статус = &Статус
	|	И Событие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	Дата УБЫВ";
	
	Если ЗначениеЗаполнено(Статус) Тогда 
		Запрос.УстановитьПараметр("Статус", Статус);			
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Событие.Статус = &Статус", "ИСТИНА");
	КонецЕсли;
	
	ВыборкаПредварительнойЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаПредварительнойЗаписи.Следующий() Тогда
		Статус = ВыборкаПредварительнойЗаписи.Статус;
		Возврат ВыборкаПредварительнойЗаписи.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

// Функция - Получить записи по которым прием не состоялся
//
// Параметры:
//  НачалоПериода		 - 	 - 
//  КонецПериода		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗаписиПоКоторымПриемНеСостоялся(НачалоПериода
												, КонецПериода
												, СтруктурнаяЕдиница = Неопределено) Экспорт
												
	Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда 
		НачалоПериода = НачалоДня(ТекущаяДатаСеанса()) - 86400;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда 
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	МассивСтруктурныхЕдиниц = Новый Массив;
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда 
			МассивСтруктурныхЕдиниц.Добавить(СтруктурнаяЕдиница);
		ИначеЕсли ТипЗнч(СтруктурнаяЕдиница) = Тип("Массив") Тогда 
			МассивСтруктурныхЕдиниц = СтруктурнаяЕдиница;
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериодаПроверки"	, НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериодаПроверки"	, КонецПериода);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена) КАК СтатусПредварительнойЗаписи
	|ПОМЕСТИТЬ СтатусыПредварительнойЗаписи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатусПредварительнойЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументСобытие.Ссылка КАК ПредварительнаяЗапись,
	|	ДокументСобытие.Дата КАК ДатаНачалаПриема,
	|	ДокументСобытие.Резерв КАК Резерв,
	|	ДокументСобытие.СсылкаНаПрием КАК СсылкаНаПрием,
	|	ДокументСобытие.Статус КАК Статус,
	|	ДокументСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДокументСобытие.ТипСобытия КАК ТипСобытия
	|ПОМЕСТИТЬ ТаблицаЗаписейПоДате
	|ИЗ
	|	Документ.Событие КАК ДокументСобытие
	|ГДЕ
	|	ДокументСобытие.Проведен
	|	И ДокументСобытие.Дата > &НачалоПериодаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаписейПоДате.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
	|	ТаблицаЗаписейПоДате.ДатаНачалаПриема КАК ДатаНачалаПриема,
	|	ТаблицаЗаписейПоДате.СсылкаНаПрием КАК СсылкаНаПрием,
	|	ТаблицаЗаписейПоДате.Статус КАК Статус,
	|	ТаблицаЗаписейПоДате.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	ТаблицаЗаписейПоДате КАК ТаблицаЗаписейПоДате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатусыПредварительнойЗаписи КАК СтатусыПредварительнойЗаписи
	|		ПО ТаблицаЗаписейПоДате.Статус = СтатусыПредварительнойЗаписи.СтатусПредварительнойЗаписи
	|ГДЕ
	|	ТаблицаЗаписейПоДате.ДатаНачалаПриема <= &КонецПериодаПроверки
	|	И ТаблицаЗаписейПоДате.Резерв = ЛОЖЬ
	|	И ТаблицаЗаписейПоДате.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|	И &УсловиеСтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачалаПриема";
	
	Если ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) Тогда
		Если МассивСтруктурныхЕдиниц.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ТаблицаЗаписейПоДате.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", МассивСтруктурныхЕдиниц[0]);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ТаблицаЗаписейПоДате.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)");
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", МассивСтруктурныхЕдиниц);
		КонецЕсли;	
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтруктурнаяЕдиница", "ИСТИНА");
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура - Инициализировать предопределенную сделку
//
// Параметры:
//  СобытиеОбъект	 - 	 - 
//  Сотрудник		 - 	 - 
//
Процедура ИнициализироватьПредопределеннуюСделку(СобытиеОбъект, Сотрудник = Неопределено, НоваяЗапись = Ложь)
	
	СобытиеОбъект.Сделка = Справочники.Сделки.ИнициализироватьПредопределеннуюСделку(СобытиеОбъект.Контрагент
																					, СобытиеОбъект.СтруктурнаяЕдиница
																					, Сотрудник
																					, 
																					, 
																					, НЕ НоваяЗапись);
															
	Если ЗначениеЗаполнено(СобытиеОбъект.Сделка) Тогда 
		Возврат;
	КонецЕсли;

	ДобавляемыеДопСвойства = ПодготовитьДанныеДляНовойСделкиПациента(СобытиеОбъект.Контрагент, Сотрудник, СобытиеОбъект.СтруктурнаяЕдиница);
			
	Если ЗначениеЗаполнено(ДобавляемыеДопСвойства) Тогда
		Для Каждого ДопСвойство Из ДобавляемыеДопСвойства Цикл
			СобытиеОбъект.ДополнительныеСвойства.Вставить(ДопСвойство.Ключ, ДопСвойство.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Подготовить данные для новой сделки пациента.
//
Функция ПодготовитьДанныеДляНовойСделкиПациента(Пациент, Врач, СтруктурнаяЕдиница = Неопределено) 
	
	ДопСвойства = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(Пациент) ИЛИ НЕ ЗначениеЗаполнено(Врач) Тогда
		Возврат ДопСвойства;
	Иначе 	
		СтатусКлиента = РегистрыСведений.СтатусыКонтрагентов.ПолучитьСтатусКлиента(Пациент);		
		Если СтатусКлиента = Перечисления.СтатусыКонтрагентов.НеВернувшийся Тогда
			Возврат ДопСвойства;
		КонецЕсли;
	КонецЕсли;

	ТаблицаДоступныхВидовСделок = Справочники.ВидыСделок.ПолучитьДоступныеДляГенерацииВидыСделок(СтруктурнаяЕдиница, Пациент, , Врач, Истина, , , Истина);
	
	Если ТаблицаДоступныхВидовСделок.Количество() > 0 Тогда
		
		ВыбранВидыСделок = ТаблицаДоступныхВидовСделок.НайтиСтроки(Новый Структура("Выбран", Истина));				
		ВыбраннаяСтрокаДляГенерации = ?(ВыбранВидыСделок.Количество() = 0, ТаблицаДоступныхВидовСделок[0], ВыбранВидыСделок[0]);
				
		Если ЗначениеЗаполнено(ВыбраннаяСтрокаДляГенерации.ВидСделки) Тогда 			
			
			ДопСвойства.Вставить("ВидСделкиГенерации", ВыбраннаяСтрокаДляГенерации.ВидСделки);
			
			АктуальныйЭтап = Справочники.Сделки.ПолучитьАктуальныйЭтапВоронки(, ВыбраннаяСтрокаДляГенерации.ВидСделки);						
			СтруктураПоиска = ?(ЗначениеЗаполнено(АктуальныйЭтап), Новый Структура("Этап", АктуальныйЭтап), Новый Структура("Выбран", Истина));			
			МассивВыбранныхЭтапов = ВыбраннаяСтрокаДляГенерации.ТаблицаЭтапов.НайтиСтроки(СтруктураПоиска);
			
			Если МассивВыбранныхЭтапов.Количество() > 0 Тогда 
				Если ЗначениеЗаполнено(МассивВыбранныхЭтапов[0].Этап) Тогда 
					ДопСвойства.Вставить("ЭтапСделкиГенерации", МассивВыбранныхЭтапов[0].Этап);
				КонецЕсли;
			ИначеЕсли ВыбраннаяСтрокаДляГенерации.ТаблицаЭтапов.Количество() > 0 Тогда 
				ДопСвойства.Вставить("ЭтапСделкиГенерации", ВыбраннаяСтрокаДляГенерации.ТаблицаЭтапов[0].Этап);
			Иначе 	
				ДопСвойства.Вставить("ЭтапСделкиГенерации", Неопределено);
			КонецЕсли;	
			
			ДопСвойства.Вставить("ОбновитьВиджетСделки", Истина);
			
		КонецЕсли;
			
	КонецЕсли;

	Возврат ДопСвойства;
		
КонецФункции

// Функция - Получить ближайшую запись на сегодня
//
// Параметры:
//  ДатаВремяПриема		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Контрагент			 - 	 - 
//  Врач				 - 	 - 
//  ПриоритетПрошлых	 - 			 - 
//  ТолькоСсылка		 - 			 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьБлижайшуюЗаписьНаСегодня(ЗНАЧ ДатаВремяПриема
										, СтруктурнаяЕдиница = Неопределено
										, Контрагент
										, Врач
										, ПриоритетПрошлых = Истина
										, ТолькоСсылка = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) ИЛИ НЕ ЗначениеЗаполнено(Врач) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаВремяПриема) Тогда 
		ДатаВремяПриема = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата"			, ДатаВремяПриема);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Контрагент"			, Контрагент);			
	Запрос.УстановитьПараметр("Врач"				, Врач);
	Запрос.УстановитьПараметр("ПриоритетПрошлых"	, ПриоритетПрошлых);		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Событие.Ссылка КАК ЗаписьНаПрием,
	|	Событие.ПометкаУдаления КАК ПометкаУдаления,
	|	Событие.Дата КАК Дата,
	|	Событие.Проведен КАК Проведен,
	|	Событие.Врач КАК Врач,
	|	Событие.Контрагент КАК Контрагент,
	|	Событие.Резерв КАК Резерв,
	|	Событие.Сделка КАК Сделка,
	|	Событие.Статус КАК Статус,
	|	Событие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Событие.ТипСобытия КАК ТипСобытия
	|ПОМЕСТИТЬ ТаблицаЗаписейНаСегодня
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Событие.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаЗаписейНаСегодня.ЗаписьНаПрием КАК ЗаписьНаПрием,
	|	ТаблицаЗаписейНаСегодня.ПометкаУдаления КАК ПометкаУдаления,
	|	ТаблицаЗаписейНаСегодня.Дата КАК Дата,
	|	ТаблицаЗаписейНаСегодня.Проведен КАК Проведен,
	|	ТаблицаЗаписейНаСегодня.Сделка КАК Сделка,
	|	ТаблицаЗаписейНаСегодня.Статус КАК Статус,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ТаблицаЗаписейНаСегодня.Дата, МИНУТА) <= НАЧАЛОПЕРИОДА(&ТекущаяДата, МИНУТА)
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ТаблицаЗаписейНаСегодня.Дата, ЧАС), НАЧАЛОПЕРИОДА(&ТекущаяДата, ЧАС), ЧАС) * 10
	|		ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ЧАС), НАЧАЛОПЕРИОДА(ТаблицаЗаписейНаСегодня.Дата, ЧАС), ЧАС) * 10 + ВЫБОР
	|				КОГДА &ПриоритетПрошлых
	|					ТОГДА 5.5 * 10
	|				ИНАЧЕ 0.5 * 10
	|			КОНЕЦ
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаЗаписейНаСегодня.Проведен
	|			ТОГДА 0
	|		ИНАЧЕ 0.5 * 10
	|	КОНЕЦ КАК ПриоритетПоВремени,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаписейНаСегодня.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетПоСтатусу
	|ИЗ
	|	ТаблицаЗаписейНаСегодня КАК ТаблицаЗаписейНаСегодня
	|ГДЕ
	|	ТаблицаЗаписейНаСегодня.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаЗаписейНаСегодня.Врач = &Врач
	|	И ТаблицаЗаписейНаСегодня.Контрагент = &Контрагент
	|	И НЕ ТаблицаЗаписейНаСегодня.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И ТаблицаЗаписейНаСегодня.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ТаблицаЗаписейНаСегодня.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|	И ТаблицаЗаписейНаСегодня.Резерв = ЛОЖЬ
	|	И НЕ ТаблицаЗаписейНаСегодня.Сделка = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетПоСтатусу,
	|	ПриоритетПоВремени";
	
	
	ВыборкаПредварительнойЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаПредварительнойЗаписи.Следующий() Тогда
		Если ТолькоСсылка Тогда 
			Возврат ВыборкаПредварительнойЗаписи.ЗаписьНаПрием;
		Иначе 
			ДанныеЗаписи = Новый Структура;
			ДанныеЗаписи.Вставить("ЗаписьНаПрием"	, ВыборкаПредварительнойЗаписи.ЗаписьНаПрием);
			ДанныеЗаписи.Вставить("Дата"			, ВыборкаПредварительнойЗаписи.Дата);
			ДанныеЗаписи.Вставить("Сделка"			, ВыборкаПредварительнойЗаписи.Сделка);
			ДанныеЗаписи.Вставить("Статус"			, ВыборкаПредварительнойЗаписи.Статус);
			Возврат ДанныеЗаписи;
		КонецЕсли;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция, возвращает сотрудников из визитов.
// 
Функция ПолучитьСотрудниковИзСобытий(
	НачалоПериода,
	ОкончаниеПериода, 
	СтатусСобытия      = Неопределено,
	СтруктурнаяЕдиница = Неопределено,
	РольПользователя   = Неопределено,
	Должность          = Неопределено) Экспорт		
	
		
	// Если передана СЕ, то отключаем ограничения по РЛС.
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СобытиеУслуги.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ПредвыборкаСотрудников
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.ДатаНачала <= &ДатаВремяОкончания
	|	И СобытиеУслуги.ДатаНачала >= &ДатаВремяНачала
	|	И &УсловиеСтруктурнаяЕдиница
	|	И СобытиеУслуги.Ссылка.Проведен
	|	И &УсловиеСтатусСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредвыборкаСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	ПредвыборкаСотрудников КАК ПредвыборкаСотрудников
	|ГДЕ
	|	ИСТИНА
	|	И &УсловиеДолжность
	|	И &УсловиеРольПользователя
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПредвыборкаСотрудников.Сотрудник.Наименование");

 	Запрос.УстановитьПараметр("ДатаВремяНачала"   , НачалоПериода);
	Запрос.УстановитьПараметр("ДатаВремяОкончания", ОкончаниеПериода);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("СтатусСобытия"     , СтатусСобытия);
	Запрос.УстановитьПараметр("Должность"         , Должность);
	Запрос.УстановитьПараметр("РольПользователя"  , РольПользователя);

	УсловиеСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), "И СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);

	УсловиеСтатусВизита       = ?(ЗначениеЗаполнено(СтатусСобытия), "И СобытиеУслуги.Ссылка.Статус В (&СтатусСобытия)", "И СобытиеУслуги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеСтатусСобытия", УсловиеСтатусВизита);

	УсловиеДолжность          = ?(ЗначениеЗаполнено(Должность), "И ПредвыборкаСотрудников.Сотрудник.Должность В(&Должность)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеДолжность", УсловиеДолжность);

	УсловиеРольПользователя   = ?(ЗначениеЗаполнено(РольПользователя), "И ПредвыборкаСотрудников.Сотрудник.Роль В(&РольПользователя)", "");
	Запрос.Текст              = СтрЗаменить(Запрос.Текст, "И &УсловиеРольПользователя", УсловиеРольПользователя);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");	
		
КонецФункции

// Процедура - Добавить сообщение в систему взаимодействия.
//
Процедура ДобавитьСообщениеВСистемуВзаимодействия(Параметры, ДополнительныеПараемтры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СобытиеСсылка	= Параметры.Событие;
	
	// Возможно ссылка еще не записалась, начинаем проверку каждую секунду, до 5 ти раз.
	Если ОбщегоНазначения.ПроверитьСсылкаБитаяСервер(СобытиеСсылка) Тогда    
		
		Если Не Параметры.Свойство("КоличествоИтераций") Тогда
			Параметры.Вставить("КоличествоИтераций", 1);
		КонецЕсли;
		
		Если Параметры.КоличествоИтераций > 5 Тогда
			Возврат;
		КонецЕсли;
		
		Параметры.КоличествоИтераций = Параметры.КоличествоИтераций + 1;
		ЗагрузкаПроведениеДокументов.ПаузаБСП(1);
		
		ДобавитьСообщениеВСистемуВзаимодействия(Параметры);	
	КонецЕсли;
	
	ДополнительныеСвойства 	= Параметры.ДополнительныеСвойства;
			
	ОповещатьОКлиентахВЛистеОжидания = Ложь;
	
	ДанныеСобытия = ЗначенияРеквизитов(СобытиеСсылка, "Статус, Дата, СтруктурнаяЕдиница, Врач, ДатаОкончания");    
	
	Если ДанныеСобытия.Статус = Перечисления.СтатусыСобытия.ПриемОтменен
		И ДополнительныеСвойства.Свойство("ИзмененСтатусЗаписи")
		И ДополнительныеСвойства.ИзмененСтатусЗаписи = Истина
		И ДанныеСобытия.Дата > ТекущаяДатаСеанса()
		И ЗначениеЗаполнено(ДанныеСобытия.Врач) И ЗначениеЗаполнено(ДанныеСобытия.СтруктурнаяЕдиница) Тогда
		
		//ДанныеСобытия.ДатаОкончания > ТекущаяДатаСеанса()
		
		МассивАктивныхСотрудниковРегистратуры = Справочники.Сотрудники.ПолучитьМассивСотрудниковПоРолямИзСеансаИБ(Новый_Массив(Перечисления.РольПользователя.Регистратура), Истина);
		
		Если ЗначениеЗаполнено(МассивАктивныхСотрудниковРегистратуры) Тогда
			
			КоличествоПациентовВЛистеОжидания = РегистрыСведений.ИнтервалыЛистаОжидания.ПолучитьКоличествоПациентовИзЛистаОжиданияПоСотрудникуНаДату(
			ДанныеСобытия.СтруктурнаяЕдиница,
			ДанныеСобытия.Врач,
			ДанныеСобытия.Дата,
			РегистрыСведений.ИнтервалыЛистаОжидания.ПолучитьМассивАктуальныхПериодовДняПоДате());	
			
			ОповещатьОКлиентахВЛистеОжидания = КоличествоПациентовВЛистеОжидания > 0;
			
			Если ОповещатьОКлиентахВЛистеОжидания Тогда
				
				ДанныеСотрудника = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ДанныеСобытия.Врач, "НаименованиеСокращенное, Фамилия, Имя, Отчество, Наименование");
				
				ПредставлениеСотрудника = ДанныеСотрудника.НаименованиеСокращенное;
				Если НЕ ЗначениеЗаполнено(ПредставлениеСотрудника) Тогда
					ПредставлениеСотрудника = Справочники.Сотрудники.ПредставлениеФИОСотрудникаПоСтруктуреДанных(ДанныеСотрудника);
				КонецЕсли;
				
				ДатаНачалаСлота = Формат(ДанныеСобытия.Дата, "ДФ=ЧЧ:мм");
				ДатаОкончанияСлота = Формат(ДанныеСобытия.ДатаОкончания, "ДФ=ЧЧ:мм");
				
				ЗаголовокОповещения = "Запишите пациента из листа ожидания.";
				СообщениеСотруднику = СтрШаблон("У сотрудника %1 освободилось время с %2 до %3", ПредставлениеСотрудника, ДатаНачалаСлота, ДатаОкончанияСлота);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
	Если ИспользоватьСистемуВзаимодействия = Истина 
		И ДополнительныеСвойства.Свойство("НеОповещатьВСистемеВзаимодействия") = Ложь Тогда
		
		ПользователиОповещения = ОбсужденияСистемыВзаимодействия.ПолучитьАктивныхПользователейДляОповещения(ДанныеСобытия.СтруктурнаяЕдиница);
		
		Если ЗначениеЗаполнено(ПользователиОповещения) Тогда 
			
			Если ДополнительныеСвойства.Свойство("ДобавленаОнлайнЗапись") Тогда
				
				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("Ключ"				 , "ДобавленаОнлайнЗапись");
				ДанныеСообщения.Вставить("СтруктурнаяЕдиница", ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(ДанныеСобытия.СтруктурнаяЕдиница));
				ДанныеСообщения.Вставить("Событие"			 , ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(ДанныеСобытия));
				ДанныеСообщения.Вставить("ДатаСобытия"		 , ДанныеСобытия.Дата);  
				ДанныеСообщения.Вставить("Сообщение"		 , Строка(ДанныеСобытия));
				
				ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, ПользователиОповещения); 
				
			Иначе
				
				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("Ключ"			     , "ОбновлениеРабочегоСтола");
				ДанныеСообщения.Вставить("СтруктурнаяЕдиница", ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(ДанныеСобытия.СтруктурнаяЕдиница));
				ДанныеСообщения.Вставить("Событие"			 , ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(ДанныеСобытия));
				ДанныеСообщения.Вставить("ДатаСобытия"		 , ДанныеСобытия.Дата);  
				
				ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, ПользователиОповещения); 
	
			КонецЕсли;
					
		КонецЕсли;
		
		Если ОповещатьОКлиентахВЛистеОжидания Тогда
			
			ДанныеСообщения = Новый Структура;
			ДанныеСообщения.Вставить("Ключ"			     	, "ПредварительнаяЗаписьОтменена");
			ДанныеСообщения.Вставить("СтруктурнаяЕдиница"	, ДанныеСобытия.СтруктурнаяЕдиница);
			ДанныеСообщения.Вставить("Сотрудник"			, ДанныеСобытия.Врач);
			ДанныеСообщения.Вставить("ДатаСобытия"			, ДанныеСобытия.Дата);  
			ДанныеСообщения.Вставить("Сообщение"		 	, СообщениеСотруднику);
			ДанныеСообщения.Вставить("ЗаголовокОповещения"	, ЗаголовокОповещения);
			
			ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, МассивАктивныхСотрудниковРегистратуры);	
			
		КонецЕсли;
			
	ИначеЕсли ИспользоватьСистемуВзаимодействия = Ложь Тогда
		
		ТекущиеСеансы = ПолучитьСеансыИнформационнойБазы();
		НомерСеанса   = НомерСеансаИнформационнойБазы();
					
		Для Каждого ТекущийСеанс Из ТекущиеСеансы Цикл
			
			Если НомерСеанса <> ТекущийСеанс.НомерСеанса
				И (ТекущийСеанс.ИмяПриложения = "1CV8C"
				ИЛИ ТекущийСеанс.ИмяПриложения = "WebClient") Тогда
				
				РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(ТекущийСеанс.НомерСеанса, 
																					   ДанныеСобытия.СтруктурнаяЕдиница,
																					   "ОбновлениеРабочегоСтола", 
																					   ТекущаяДатаСеанса(),
																					   60);	
																					   
				Если ДополнительныеСвойства.Свойство("ДобавленаОнлайнЗапись") Тогда																	   
					МассивПараметров = Новый Массив;
					МассивПараметров.Добавить(ДанныеСобытия);	
																						   
					РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(ТекущийСеанс.Пользователь, 
																						   ДанныеСобытия.СтруктурнаяЕдиница, 
																						   "ДобавленаОнлайнЗапись",
																						   ТекущаяДатаСеанса(),
																						   60,,, 
																						   МассивПараметров);
				КонецЕсли;				
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОповещатьОКлиентахВЛистеОжидания Тогда
			
			МассивПараметров = Новый_Массив(ДанныеСобытия.Врач, ДанныеСобытия.Дата);
			
			Для Каждого СотрудникРегистратуры Из МассивАктивныхСотрудниковРегистратуры Цикл
				
				РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(СотрудникРегистратуры, 
				ДанныеСобытия.СтруктурнаяЕдиница, 
				"ПредварительнаяЗаписьОтменена",
				ТекущаяДатаСеанса(),
				60,
				ЗаголовокОповещения,
				СообщениеСотруднику, 
				МассивПараметров);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;       
	
	Если ДополнительныеСвойства.Свойство("ВнутреннийНомерСотрудника") Тогда
		
		СписокАктивныхПользователей = IPТелефония.ПолучитьСписокАктивныхПользователей(ДополнительныеСвойства.ВнутреннийНомерСотрудника);
		
		Если ИспользоватьСистемуВзаимодействия = Истина Тогда
			
			Сотрудники 	 = Новый Массив;
			
			Для каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
				Сотрудники.Добавить(АктивныйСеансПользователя.Пользователь);
			КонецЦикла;
			
			Если Сотрудники.Количество() > 0 Тогда
				
				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("Ключ"				, "ЗакрытьФормуЗвонкаПациенту");
				ДанныеСообщения.Вставить("IDЗвонка"       	, ДополнительныеСвойства.IDЗвонка);
				Если ДополнительныеСвойства.Свойство("ДобавитьТелефонСуществующемуПациенту") Тогда
					ДанныеСообщения.Вставить("Телефон"       	, ДополнительныеСвойства.ДобавитьТелефонСуществующемуПациенту); 
				КонецЕсли;
				ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, Сотрудники); 
				
			КонецЕсли;
			
			
		Иначе
			
			// Оповещение через регистр сведений.
			Для Каждого АктивныйСеансПользователя Из СписокАктивныхПользователей Цикл
				
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(ДополнительныеСвойства.IDЗвонка);
				Если ДополнительныеСвойства.Свойство("ДобавитьТелефонСуществующемуПациенту") Тогда
					МассивПараметров.Добавить(ДополнительныеСвойства.ДобавитьТелефонСуществующемуПациенту);
				КонецЕсли;
				
				РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(АктивныйСеансПользователя.РабочееМесто,
				Неопределено, 
				"ЗакрытьФормуЗвонкаПациенту",
				ТекущаяДатаСеанса(),
				60,,,
				МассивПараметров);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;	
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли





















 
