////////////////////////////////////////////////////////////////////////////////
// Открытие вспомогательных форм
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Инструкция
Процедура ОткрытьИнструкциюПоИспользованиюСервиса(СтандартнаяОбработка = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.ИнструкцияПоИспользованиюПроверкиКонтрагента.Форма.ИнструкцияПоПроверкеКонтрагентов", , , "Инструкция");
	
КонецПроцедуры

// Настройки
Процедура ОткрытьНастройкиСервиса() Экспорт
	
	ОткрытьФорму("ОбщаяФорма.НастройкиПроверкиКонтрагентов");

КонецПроцедуры

#КонецОбласти
