
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантОтображения") Тогда
		
		Если Параметры.ВариантОтображения = "Период" Тогда
			
			ЭтаФорма.Заголовок = "Выбор периода работы";
			ИнтервалыВремени   = Справочники.ПериодыРаботы.ПолучитьМассивПериодовРаботы(Параметры.СтруктурнаяЕдиница); 
			
			Для Каждого Интервал Из ИнтервалыВремени Цикл
				
				ЗначениеПериода      = Новый Структура("НачалоРаботы, ОкончаниеРаботы", Интервал.НачалоСмены, Интервал.ОкончаниеСмены);
				ПредставлениеПериода = ОбщегоНазначенияКлиентСерверСтоматология.ПолучитьПредставлениеИнтервала(ЗначениеПериода);
				
				СписокВложение = Новый СписокЗначений;
				СписокВложение.Добавить(ЗначениеПериода, ПредставлениеПериода); 
				
				СписокПериодов.Добавить(СписокВложение, ПредставлениеПериода);	
				
			КонецЦикла;
			
			СписокПериодов.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
			
			Если ИнтервалыВремени.Количество() = 0 Тогда
				СписокПериодов.Добавить("Смены: ");
			КонецЕсли;
			
			СписокПериодов.Добавить("Отпуск");
			СписокПериодов.Добавить("Больничный");
			
		ИначеЕсли Параметры.ВариантОтображения = "НачалоПериода" Тогда
			
			ЭтаФорма.Заголовок = "Выбор начала периода";
			Таблица = Неопределено;
			Параметры.Свойство("Таблица", Таблица);
			СписокПериодов = Таблица;
			
		ИНачеЕсли Параметры.ВариантОтображения = "КонецПериода" Тогда 
			
			ЭтаФорма.Заголовок = "Выбор окончания периода";
			Таблица = Неопределено;
			Параметры.Свойство("Таблица", Таблица);
			СписокПериодов = Таблица;
			
		КонецЕсли;
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно параметров!");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Список периодов выбор
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбраннаяСтрока		 - 	 - 
//  Поле				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СписокПериодовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбора(СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Список периодов выбор значения
//
// Параметры:
//  Элемент				 - 	 - 
//  Значение			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СписокПериодовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработкаВыбора(СтандартнаяОбработка); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Обработка выбора
//
// Параметры:
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаВыбора(СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.СписокПериодов.ТекущиеДанные;
	ЭтаФорма.Закрыть(Новый Структура("Значение", ТекДанные.Значение));
	
КонецПроцедуры

#КонецОбласти