
#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью набора записей.
//
&НаСервере
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка              = Новый БлокировкаДанных;
	ЭлементБлокировки       = Блокировка.Добавить("РегистрНакопления.ПартииТоваров.НаборЗаписей");
	#Если НЕ МобильноеПриложениеСервер Тогда
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	#КонецЕсли
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияПартииТоваровИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияПартииТоваровИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияПартииТоваровИзменение Тогда
		
		// Если временная таблица "ДвиженияПартииТоваровИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияПартииТоваровПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.

		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииТоваров.НомерСтроки КАК НомерСтроки,
		|	ПартииТоваров.ДокументПоступления КАК ДокументПоступления,
		|	ПартииТоваров.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПартииТоваров.Номенклатура КАК Номенклатура,
		|	ПартииТоваров.Склад КАК Склад,
		|	ВЫБОР
		|		КОГДА ПартииТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ПартииТоваров.Стоимость
		|		ИНАЧЕ -ПартииТоваров.Стоимость
		|	КОНЕЦ КАК СтоимостьПередЗаписью,
		|	ВЫБОР
		|		КОГДА ПартииТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ПартииТоваров.Количество
		|		ИНАЧЕ -ПартииТоваров.Количество
		|	КОНЕЦ КАК КоличествоПередЗаписью
		|ПОМЕСТИТЬ ДвиженияПартииТоваровПередЗаписью
		|ИЗ
		|	РегистрНакопления.ПартииТоваров КАК ПартииТоваров
		|ГДЕ
		|	ПартииТоваров.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();

	Иначе 
			
		// Если временная таблица "ДвиженияПартииТоваровИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются
		// во временную таблцу "ДвиженияПартииТоваровПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	ДвиженияПартииТоваровИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияПартииТоваровИзменение.ДокументПоступления КАК ДокументПоступления,
		|	ДвиженияПартииТоваровИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДвиженияПартииТоваровИзменение.Номенклатура КАК Номенклатура,
		|	ДвиженияПартииТоваровИзменение.Склад КАК Склад,
		|	ДвиженияПартииТоваровИзменение.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
		|	ДвиженияПартииТоваровИзменение.СтоимостьПередЗаписью КАК СтоимостьПередЗаписью
		|ПОМЕСТИТЬ ДвиженияПартииТоваровПередЗаписью
		|ИЗ
		|	ДвиженияПартииТоваровИзменение КАК ДвиженияПартииТоваровИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПартииТоваров.НомерСтроки,
		|	ПартииТоваров.ДокументПоступления,
		|	ПартииТоваров.СтруктурнаяЕдиница,
		|	ПартииТоваров.Номенклатура,
		|	ПартииТоваров.Склад,
		|	ВЫБОР
		|		КОГДА ПартииТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ПартииТоваров.Стоимость
		|		ИНАЧЕ -ПартииТоваров.Стоимость
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПартииТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ПартииТоваров.Количество
		|		ИНАЧЕ -ПартииТоваров.Количество
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ПартииТоваров КАК ПартииТоваров
		|ГДЕ
		|	ПартииТоваров.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияПартииТоваровИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияПартииТоваровИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияПартииТоваровИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияПартииТоваровИзменение");
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияПартииТоваровИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ДвиженияПартииТоваровИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияПартииТоваровИзменение.ДокументПоступления КАК ДокументПоступления,
	|	ДвиженияПартииТоваровИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияПартииТоваровИзменение.Номенклатура КАК Номенклатура,
	|	ДвиженияПартииТоваровИзменение.Склад КАК Склад,
	|	СУММА(ДвиженияПартииТоваровИзменение.КоличествоПередЗаписью) КАК КоличествоПередЗаписью,
	|	СУММА(ДвиженияПартииТоваровИзменение.КоличествоИзменение) КАК КоличествоИзменение,
	|	СУММА(ДвиженияПартииТоваровИзменение.КоличествоПриЗаписи) КАК КоличествоПриЗаписи,
	|	СУММА(ДвиженияПартииТоваровИзменение.СтоимостьПередЗаписью) КАК СтоимостьПередЗаписью,
	|	СУММА(ДвиженияПартииТоваровИзменение.СтоимостьИзменение) КАК СтоимостьИзменение,
	|	СУММА(ДвиженияПартииТоваровИзменение.СтоимостьПриЗаписи) КАК СтоимостьПриЗаписи
	|ПОМЕСТИТЬ ДвиженияПартииТоваровИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияПартииТоваровПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияПартииТоваровПередЗаписью.ДокументПоступления КАК ДокументПоступления,
	|		ДвиженияПартииТоваровПередЗаписью.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ДвиженияПартииТоваровПередЗаписью.Номенклатура КАК Номенклатура,
	|		ДвиженияПартииТоваровПередЗаписью.Склад КАК Склад,
	|		ДвиженияПартииТоваровПередЗаписью.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
	|		ДвиженияПартииТоваровПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение,
	|		0 КАК КоличествоПриЗаписи,
	|		ДвиженияПартииТоваровПередЗаписью.СтоимостьПередЗаписью КАК СтоимостьПередЗаписью,
	|		ДвиженияПартииТоваровПередЗаписью.СтоимостьПередЗаписью КАК СтоимостьИзменение,
	|		0 КАК СтоимостьПриЗаписи
	|	ИЗ
	|		ДвиженияПартииТоваровПередЗаписью КАК ДвиженияПартииТоваровПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияПартииТоваровПриЗаписи.НомерСтроки,
	|		ДвиженияПартииТоваровПриЗаписи.ДокументПоступления,
	|		ДвиженияПартииТоваровПриЗаписи.СтруктурнаяЕдиница,
	|		ДвиженияПартииТоваровПриЗаписи.Номенклатура,
	|		ДвиженияПартииТоваровПриЗаписи.Склад,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияПартииТоваровПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияПартииТоваровПриЗаписи.Количество
	|			ИНАЧЕ ДвиженияПартииТоваровПриЗаписи.Количество
	|		КОНЕЦ,
	|		ДвиженияПартииТоваровПриЗаписи.Количество,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияПартииТоваровПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияПартииТоваровПриЗаписи.Стоимость
	|			ИНАЧЕ ДвиженияПартииТоваровПриЗаписи.Стоимость
	|		КОНЕЦ,
	|		ДвиженияПартииТоваровПриЗаписи.Стоимость
	|	ИЗ
	|		РегистрНакопления.ПартииТоваров КАК ДвиженияПартииТоваровПриЗаписи
	|	ГДЕ
	|		ДвиженияПартииТоваровПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияПартииТоваровИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияПартииТоваровИзменение.ДокументПоступления,
	|	ДвиженияПартииТоваровИзменение.СтруктурнаяЕдиница,
	|	ДвиженияПартииТоваровИзменение.Номенклатура,
	|	ДвиженияПартииТоваровИзменение.Склад
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвиженияПартииТоваровИзменение.КоличествоИзменение) <> 0
	|		ИЛИ СУММА(ДвиженияПартииТоваровИзменение.СтоимостьИзменение) <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления,
	|	СтруктурнаяЕдиница,
	|	Номенклатура,
	|	Склад");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияПартииТоваровИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияПартииТоваровИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияВзаиморасчетыСКонтрагентамиПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияПартииТоваровПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	
КонецПроцедуры

#КонецОбласти