
#Область ОбработчикиКомандФормы    

&НаКлиенте
Процедура Записать(Команда)
	
	Оповестить("НастройкиИзменены", Новый Структура("НастройкиОтчета", СтруктураОтчета));
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НастройкиОтчета") Тогда
		
		ТаблицаНастройки = Параметры.НастройкиОтчета.Выгрузить();
		Для Каждого СтрокаНастройки ИЗ ТаблицаНастройки Цикл
		
			НС = СтруктураОтчета.Добавить();
			НС.Настройка = СтрокаНастройки.Настройка;
			НС.Значение = СтрокаНастройки.Значение;
			
		КонецЦикла;	
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
