
#Область СлужебныеПроцедурыИФункции

// Процедура, удаляет запись.
//
Процедура УдалитьЗапись(ВнешняяСистема, ИдКонтакта, Пользователь) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.ИдКонтакта.Установить(ИдКонтакта);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Процедура, добавляет записи для каждого активного пользователя.
//
Процедура ДобавитьЗаписиПоНовомуСообщению(ВнешняяСистема, ИдКонтакта) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктивныеПользователиМессенджер.Пользователь КАК Пользователь,
	|	&ИдКонтакта КАК ИдКонтакта,
	|	&ВнешняяСистема КАК ВнешняяСистема
	|ИЗ
	|	РегистрСведений.АктивныеПользователиМессенджер КАК АктивныеПользователиМессенджер
	|ГДЕ
	|	АктивныеПользователиМессенджер.Дата > &ПериодУстаревания");
	
	Запрос.УстановитьПараметр("ИдКонтакта"			, ИдКонтакта);
	Запрос.УстановитьПараметр("ВнешняяСистема"		, ВнешняяСистема);
	Запрос.УстановитьПараметр("ПериодУстаревания"	, ТекущаяДатаСеанса() - 3600 * 24 * 31);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	НаборЗаписей.Отбор.ИдКонтакта.Установить(ИдКонтакта);
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
