
#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды ЗаписатьИЗакрыть
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Суффикс <> "" Тогда
		
		ПараметрыОборудования = Новый Структура();
		ПараметрыОборудования.Вставить("Порт"             , Порт);
		ПараметрыОборудования.Вставить("Скорость"         , Скорость);
		ПараметрыОборудования.Вставить("БитДанных"        , БитДанных);
		ПараметрыОборудования.Вставить("СтопБит"          , СтопБит);
		ПараметрыОборудования.Вставить("Четность"         , Четность);
		ПараметрыОборудования.Вставить("Чувствительность" , Чувствительность);
		ПараметрыОборудования.Вставить("Префикс"          , Префикс);
		ПараметрыОборудования.Вставить("Суффикс"          , Суффикс);
		ПараметрыОборудования.Вставить("Модель"           , Модель);

		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("Идентификатор", Идентификатор);
		ПараметрыЗакрытия.Вставить("ПараметрыОборудования", ПараметрыОборудования);
		
		ОчиститьСообщения(); 
		Закрыть(ПараметрыЗакрытия);
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Не указан суффикс сканера штрихкода.
		|Для идентификации штрихкода суффикс должен быть указан'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Суффикс");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды УстановитьДрайвер
//
Процедура УстановитьДрайвер(Команда)
	
	МенеджерОборудованияКлиент.УстановитьДрайвер(Идентификатор);

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура обновляет информацию о драйвере ТО
//
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"            , Порт);
	времПараметрыУстройства.Вставить("Скорость"        , Скорость);
	времПараметрыУстройства.Вставить("БитДанных"       , БитДанных);
	времПараметрыУстройства.Вставить("СтопБит"         , СтопБит);
	времПараметрыУстройства.Вставить("Четность"        , Четность);
	времПараметрыУстройства.Вставить("Чувствительность", Чувствительность);
	времПараметрыУстройства.Вставить("Префикс"         , Префикс);
	времПараметрыУстройства.Вставить("Суффикс"         , Суффикс);
	времПараметрыУстройства.Вставить("Модель"          , Модель);

	Если МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства) Тогда
		Драйвер = ВыходныеПараметры[0];
		Версия  = ВыходныеПараметры[1];
	Иначе
		Если ВыходныеПараметры <> Неопределено Тогда
			Драйвер = ВыходныеПараметры[2];
		КонецЕсли;
		Версия  = НСтр("ru='Не определена'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриИзменении
//
Процедура ПортПриИзменении1(Элемент)
	
	ПортПриИзменении();
	
КонецПроцедуры

&НаКлиенте
// Процедура обновляет данные при изменении порта
//
Процедура ПортПриИзменении()

	Элементы.Скорость.Доступность  = Порт <> 100;
	Элементы.БитДанных.Доступность = Порт <> 100;
	Элементы.СтопБит.Доступность   = Порт <> 100;
	Элементы.Четность.Доступность  = Порт <> 100;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ОбработкаВыбора
//
Процедура ПрефиксОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ВыбранноеЗначение <> Неопределено Тогда
		Префикс =  Префикс + ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ОбработкаВыбора
//
Процедура СуффиксОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ВыбранноеЗначение <> Неопределено Тогда
		Суффикс = Суффикс + ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='СШК'") + " """ + Строка(Идентификатор) + """";
	
	
	
	СпПорт = Элементы.Порт.СписокВыбора;
	Для Индекс = 1 По 32 Цикл
		СпПорт.Добавить(Индекс, "COM" + Строка(Индекс));
	КонецЦикла;
	СпПорт.Добавить(100, НСтр("ru='Клавиатура'"));

	СпСкорость = Элементы.Скорость.СписокВыбора;
	СпСкорость.Добавить(1,  "300");
	СпСкорость.Добавить(2,  "600");
	СпСкорость.Добавить(3,  "1200");
	СпСкорость.Добавить(4,  "2400");
	СпСкорость.Добавить(5,  "4800");
	СпСкорость.Добавить(7,  "9600");
	СпСкорость.Добавить(9,  "14400");
	СпСкорость.Добавить(10, "19200");
	СпСкорость.Добавить(12, "38400");

	СпБитДанных = Элементы.БитДанных.СписокВыбора;
	СпБитДанных.Добавить(3, "7");
	СпБитДанных.Добавить(4, "8");

	СпСтопБит = Элементы.СтопБит.СписокВыбора;
	СпСтопБит.Добавить(0, 1);
	СпСтопБит.Добавить(2, 2);

	СпЧетность = Элементы.Четность.СписокВыбора;
	СпЧетность.Добавить(0, НСтр("ru='Нет'"));
	СпЧетность.Добавить(1, НСтр("ru='Нечетность'"));
	СпЧетность.Добавить(2, НСтр("ru='Четность'"));
	СпЧетность.Добавить(3, НСтр("ru='Установлен'"));
	СпЧетность.Добавить(4, НСтр("ru='Сброшен'"));

	УстановитьПараметрыШК(Элементы.Префикс);
	УстановитьПараметрыШК(Элементы.Суффикс);
	
	ПараметрыОборудования = Параметры.ПараметрыОборудования;
	
	Если ТипЗнч(ПараметрыОборудования) = Тип("Структура") Тогда
		
		времПорт = 			   ?(ПараметрыОборудования.Свойство("Порт")				, ПараметрыОборудования.Порт			, Неопределено); 
		времСкорость = 		   ?(ПараметрыОборудования.Свойство("Скорость")			, ПараметрыОборудования.Скорость 		, Неопределено);
		времБитДанных = 	   ?(ПараметрыОборудования.Свойство("БитДанных")		, ПараметрыОборудования.БитДанных		, Неопределено);
		времСтопБит = 		   ?(ПараметрыОборудования.Свойство("СтопБит")			, ПараметрыОборудования.СтопБит			, Неопределено);
		времЧетность = 		   ?(ПараметрыОборудования.Свойство("Четность")			, ПараметрыОборудования.Четность		, Неопределено);
		времЧувствительность = ?(ПараметрыОборудования.Свойство("Чувствительность")	, ПараметрыОборудования.Чувствительность, Неопределено);
		времПрефикс = 		   ?(ПараметрыОборудования.Свойство("Префикс")			, ПараметрыОборудования.Префикс			, Неопределено);
		времСуффикс = 		   ?(ПараметрыОборудования.Свойство("Суффикс")			, ПараметрыОборудования.Суффикс			, Неопределено);
		времМодель = 		   ?(ПараметрыОборудования.Свойство("Модель")			, ПараметрыОборудования.Модель			, Неопределено);
		
	Иначе 	
		
		времПорт             = Неопределено;
		времСкорость         = Неопределено;
		времБитДанных        = Неопределено;
		времСтопБит          = Неопределено;
		времЧетность         = Неопределено;
		времЧувствительность = Неопределено;
		времПрефикс          = Неопределено;
		времСуффикс          = Неопределено;
		времМодель           = Неопределено;
		
	КонецЕсли;

	Порт             = ?(времПорт             = Неопределено,     1, времПорт);
	Скорость         = ?(времСкорость         = Неопределено,     7, времСкорость);
	БитДанных        = ?(времБитДанных        = Неопределено,     3, времБитДанных);
	СтопБит          = ?(времСтопБит          = Неопределено,     0, времСтопБит);
	Четность         = ?(времЧетность         = Неопределено,     0, времЧетность);
	Чувствительность = ?(времЧувствительность = Неопределено,    30, времЧувствительность);
	Префикс          = ?(времПрефикс          = Неопределено,    "", времПрефикс);
	Суффикс          = ?(времСуффикс          = Неопределено, "#13", времСуффикс);

	Модель = ?(времМодель = Неопределено, Элементы.Модель.СписокВыбора[0], времМодель);

	Элементы.УстановитьДрайвер.Видимость = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);  
КонецПроцедуры


&НаСервере
// Процедура устанавливает параметры ШК
//
Процедура УстановитьПараметрыШК(Элемент)

	Если (Элемент.Имя = "Префикс"
	 Или Элемент.Имя = "Суффикс")
	   И Элемент.СписокВыбора.Количество() = 0 Тогда
		СпПараметрыДорожек = Элемент.СписокВыбора;

		Для КодЭлемента = 0 По 127 Цикл
			СимволДорожки = "";
			Если КодЭлемента > 32 Тогда
				СимволДорожки = " ( " + Символ(КодЭлемента) + " )";
			ИначеЕсли КодЭлемента = 8 Тогда
				СимволДорожки = " (BACKSPACE)";
			ИначеЕсли КодЭлемента = 9 Тогда
				СимволДорожки = " (TAB)";
			ИначеЕсли КодЭлемента = 10 Тогда
				СимволДорожки = " (LF)";
			ИначеЕсли КодЭлемента = 13 Тогда
				СимволДорожки = " (CR)";
			ИначеЕсли КодЭлемента = 16 Тогда
				СимволДорожки = " (SHIFT)";
			ИначеЕсли КодЭлемента = 17 Тогда
				СимволДорожки = " (CONTROL)";
			ИначеЕсли КодЭлемента = 18 Тогда
				СимволДорожки = " (ALT)";
			ИначеЕсли КодЭлемента = 27 Тогда
				СимволДорожки = " (ESCAPE)";
			ИначеЕсли КодЭлемента = 32 Тогда
				СимволДорожки = " (SPACE)";
			КонецЕсли;
			СпПараметрыДорожек.Добавить("#" + СокрЛП(КодЭлемента), "#" + СокрЛП(КодЭлемента) + СимволДорожки);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриОткрытии
//
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИнформациюОДрайвере();

	ПортПриИзменении();
	
КонецПроцедуры

#КонецОбласти
