
#Область ОбработчикиСобытийФормы  

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборПоСтруктурнойЕдинице", Параметры.РежимВыбора);	
	Если НЕ Параметры.РежимВыбора Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборПоСтруктурнойЕдинице", НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ВидыСделок));	
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти