 
#Область СлужебныеПроцедурыИФункции

// Процедура создает значения по умолчанию справочника "ПричиныЗаписи"
//
Процедура СоздатьЗначенияПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка 
		МассивПричин = Новый Массив;
		МассивПричин.Добавить("Острая боль");
		МассивПричин.Добавить("Лечение");
		МассивПричин.Добавить("Протезирование");
		МассивПричин.Добавить("Имплантация");
		МассивПричин.Добавить("Консультация");
		МассивПричин.Добавить("Удаление");
		МассивПричин.Добавить("Профосмотр");
		
		Для Каждого ЭлементМассива Из МассивПричин Цикл 
			НайденнаяСсылка = Справочники.ПричиныЗаписи.НайтиПоНаименованию(ЭлементМассива);
			Если НайденнаяСсылка = Неопределено ИЛИ НайденнаяСсылка = Справочники.ПричиныЗаписи.ПустаяСсылка() Тогда 
				НовыйОбъект = Справочники.ПричиныЗаписи.СоздатьЭлемент();
				НовыйОбъект.Наименование = ЭлементМассива;
				НовыйОбъект.Записать();
			КонецЕсли;
		КонецЦикла;	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Функция - Найти причины записей по строке
//
Функция НайтиПричиныЗаписейПоСтроке(Текст) Экспорт

	СписокВыбора = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныЗаписи.Ссылка КАК Ссылка,
		|	ПричиныЗаписи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ПричиныЗаписи КАК ПричиныЗаписи
		|ГДЕ
		|	ПричиныЗаписи.Наименование ПОДОБНО &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", "%" + Текст + "%");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование); 
		КонецЦикла; 
		
	КонецЕсли;

	Возврат СписокВыбора;
		
КонецФункции

#КонецОбласти