 
#Область ________________________________ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ___________________________________

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СценарийЧатБота", СценарийЧатБота);
	Если Параметры.Свойство("МассивРазрешенныхТриггерныхСобытий") Тогда 
		СписокРазрешенныхТриггерныхСобытий.ЗагрузитьЗначения(Параметры.МассивРазрешенныхТриггерныхСобытий);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СценарийЧатБота) И НЕ ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(СценарийЧатБота) Тогда 
		АктуализироватьДеревоВариантовТриггерныхСобытий();
	//КонецЕсли;
	
	//ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ________________________________ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ____________________________________

&НаКлиенте
// Процедура - Установить флажки
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьФлажки(Команда)

	ИзменитьВыборВсехВариантов(ЭтотОбъект.ДеревоТриггерныхСобытий.ПолучитьЭлементы(), 1);

КонецПроцедуры

&НаКлиенте
// Процедура - Снять флажки
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СнятьФлажки(Команда)
	
	ИзменитьВыборВсехВариантов(ЭтотОбъект.ДеревоТриггерныхСобытий.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
// Процедура - Сохранить и закрыть
//
Процедура СохранитьИЗакрыть(Команда)
	
	МассивВыбранныхСобытий = Новый Массив;
	ЗаполнитьМассивВыбранныхСобытий(ЭтотОбъект.ДеревоТриггерныхСобытий.ПолучитьЭлементы(), МассивВыбранныхСобытий);
	ЭтаФорма.Закрыть(МассивВыбранныхСобытий);
	
КонецПроцедуры

#КонецОбласти

#Область ____________________________ОБРАБОТКА_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ_______________________________

&НаКлиенте
// Процедура - Дерево триггерных событий используется при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДеревоТриггерныхСобытийИспользуетсяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТриггерныхСобытий.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		ТекущиеДанные.Используется = ?(ТекущиеДанные.Используется = 2, 0, ТекущиеДанные.Используется);
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ТриггерноеСобытие) Тогда
			Для Каждого СтрокаДерева Из ТекущиеДанные.ПолучитьЭлементы() Цикл
				СтрокаДерева.Используется = ТекущиеДанные.Используется;
			КонецЦикла;
		Иначе
			ГруппаОбластьСобытий = ТекущиеДанные.ПолучитьРодителя();
			Если ГруппаОбластьСобытий <> Неопределено Тогда
				КоличествоСобытий = ГруппаОбластьСобытий.ПолучитьЭлементы().Количество();
				МассивВыбранныхСобытий = Новый Массив;
				ЗаполнитьМассивВыбранныхСобытий(ГруппаОбластьСобытий.ПолучитьЭлементы(), МассивВыбранныхСобытий);
				Если МассивВыбранныхСобытий.Количество() = КоличествоСобытий Тогда
					ГруппаОбластьСобытий.Используется = 1;
				ИначеЕсли МассивВыбранныхСобытий.Количество() > 0 Тогда
					ГруппаОбластьСобытий.Используется = 2;
				Иначе
					ГруппаОбластьСобытий.Используется = 0;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры



#КонецОбласти

#Область ______________________________СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ_________________________________

&НаСервере
// Процедура - Актуализировать дерево вариантов триггерных событий
//
Процедура АктуализироватьДеревоВариантовТриггерныхСобытий()
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ТаблицаВсехВариантовУсловийТриггерныхСобытий 	= ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
	ТаблицаРазрешенныхВариантов 					= ТаблицаВсехВариантовУсловийТриггерныхСобытий.Скопировать(Новый Структура("РазрешенаРаботаСЧатБотом", Истина), "ВариантыУсловийТриггерныхСобытий, ВиртуальнаяГруппаСобытий, ПредставлениеВиртуальнойГруппыСобытий, ПорядковыйНомерВиртуальнойГруппыСобытий");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаРазрешенныхВариантов, "ТаблицаВсехВариантовТриггерныхСобытий");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВсехВариантовТриггерныхСобытий.ВиртуальнаяГруппаСобытий КАК ВиртуальнаяГруппаСобытий,
	|	ТаблицаВсехВариантовТриггерныхСобытий.ПредставлениеВиртуальнойГруппыСобытий КАК ПредставлениеВиртуальнойГруппыСобытий,
	|	ТаблицаВсехВариантовТриггерныхСобытий.ПорядковыйНомерВиртуальнойГруппыСобытий КАК ПорядковыйНомерВиртуальнойГруппыСобытий,
	|	ТаблицаВсехВариантовТриггерныхСобытий.ВариантыУсловийТриггерныхСобытий КАК ВариантыУсловийТриггерныхСобытий
	|ПОМЕСТИТЬ ТаблицаДоступныхТриггерныхСобытий
	|ИЗ
	|	ТаблицаВсехВариантовТриггерныхСобытий КАК ТаблицаВсехВариантовТриггерныхСобытий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыУсловийТриггерныхСобытий.Ссылка КАК ТриггерноеСобытие
	|ПОМЕСТИТЬ ТаблицаРазрешенныхТриггерныхСобытий
	|ИЗ
	|	Перечисление.ВариантыУсловийТриггерныхСобытий КАК ВариантыУсловийТриггерныхСобытий
	|ГДЕ
	|	ВариантыУсловийТриггерныхСобытий.Ссылка В(&МассивРазрешенныхТриггерныхСобытий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДоступныхТриггерныхСобытий.ВиртуальнаяГруппаСобытий КАК ОбластьТриггерныхСобытий,
	|	ТаблицаДоступныхТриггерныхСобытий.ПредставлениеВиртуальнойГруппыСобытий КАК ПредставлениеОбластиТриггерныхСобытий,
	|	ТаблицаДоступныхТриггерныхСобытий.ПорядковыйНомерВиртуальнойГруппыСобытий КАК ПорядковыйНомерВиртуальнойГруппыСобытий,
	|	ТаблицаДоступныхТриггерныхСобытий.ВариантыУсловийТриггерныхСобытий КАК ТриггерноеСобытие,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаДоступныхТриггерныхСобытий.ВариантыУсловийТриггерныхСобытий) КАК ПредставлениеТриггерногоСобытия,
	|	ВЫБОР
	|		КОГДА ТаблицаРазрешенныхТриггерныхСобытий.ТриггерноеСобытие ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Используется
	|ИЗ
	|	ТаблицаДоступныхТриггерныхСобытий КАК ТаблицаДоступныхТриггерныхСобытий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазрешенныхТриггерныхСобытий КАК ТаблицаРазрешенныхТриггерныхСобытий
	|		ПО ТаблицаДоступныхТриггерныхСобытий.ВариантыУсловийТриггерныхСобытий = ТаблицаРазрешенныхТриггерныхСобытий.ТриггерноеСобытие
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомерВиртуальнойГруппыСобытий,
	|	ТриггерноеСобытие";
	
	Запрос.УстановитьПараметр("МассивРазрешенныхТриггерныхСобытий", СписокРазрешенныхТриггерныхСобытий.ВыгрузитьЗначения());
	
	ТаблицаРазрешенныхВариантов = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
    // Формируем дерево
	ДеревоЗначение = РеквизитФормыВЗначение("ДеревоТриггерныхСобытий");
	
	ТаблицаРодителейВариантов = ТаблицаРазрешенныхВариантов.Скопировать(, "ОбластьТриггерныхСобытий, ПредставлениеОбластиТриггерныхСобытий");
	ТаблицаРодителейВариантов.Свернуть("ОбластьТриггерныхСобытий, ПредставлениеОбластиТриггерныхСобытий");
	
	Для Каждого СтрокаРодитель Из ТаблицаРодителейВариантов Цикл 
		РодительСтрок = ДобавитьСтрокуВДеревоЗначений(ДеревоЗначение
													, СтрокаРодитель.ОбластьТриггерныхСобытий
													, СтрокаРодитель.ПредставлениеОбластиТриггерныхСобытий
													, 
													, СтрокаРодитель.ПредставлениеОбластиТриггерныхСобытий
													, 
													, 0);
		КоллекцияВариантов = ТаблицаРазрешенныхВариантов.НайтиСтроки(Новый Структура("ПредставлениеОбластиТриггерныхСобытий", СтрокаРодитель.ПредставлениеОбластиТриггерныхСобытий));
		КоличествоВыбранныхСобытий = 0;
		Для Каждого ЭлементКоллекции Из КоллекцияВариантов Цикл 
			ДобавитьСтрокуВДеревоЗначений(РодительСтрок
										, ЭлементКоллекции.ОбластьТриггерныхСобытий
										, ЭлементКоллекции.ПредставлениеОбластиТриггерныхСобытий
										, ЭлементКоллекции.ТриггерноеСобытие
										, ЭлементКоллекции.ПредставлениеТриггерногоСобытия
										, ЭлементКоллекции.Используется
										, 2);
			КоличествоВыбранныхСобытий = КоличествоВыбранныхСобытий + ЭлементКоллекции.Используется;										
		КонецЦикла;
		Если КоличествоВыбранныхСобытий = 0 Тогда 
			РодительСтрок.Используется = 0;
		ИначеЕсли КоличествоВыбранныхСобытий <> КоллекцияВариантов.Количество() Тогда 
			РодительСтрок.Используется = 2;
		Иначе 
			РодительСтрок.Используется = 1;
		КонецЕсли;	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначение, "ДеревоТриггерныхСобытий");	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Добавить строку в дерево значений
//
// Параметры:
//  РодительСтроки							 - 	 - 
//  ОбластьТриггерныхСобытий				 - 	 - 
//  ПредставлениеОбластиТриггерныхСобытий	 - 	 - 
//  ТриггерноеСобытие						 - 	 - 
//  ПредставлениеТриггерногоСобытия			 - 	 - 
//  Используется							 - 	 - 
//  КартинкаСтроки							 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьСтрокуВДеревоЗначений(РодительСтроки
										, ОбластьТриггерныхСобытий
										, ПредставлениеОбластиТриггерныхСобытий
										, ТриггерноеСобытие = Неопределено
										, ПредставлениеТриггерногоСобытия
										, Используется = 0
										, КартинкаСтроки = Неопределено)
	
	НоваяСтрока 										= РодительСтроки.Строки.Добавить();
	НоваяСтрока.ОбластьТриггерныхСобытий				= ОбластьТриггерныхСобытий;
	НоваяСтрока.ПредставлениеОбластиТриггерныхСобытий 	= ПредставлениеОбластиТриггерныхСобытий;
	НоваяСтрока.ТриггерноеСобытие 						= ТриггерноеСобытие;
	НоваяСтрока.ПредставлениеТриггерногоСобытия			= ПредставлениеТриггерногоСобытия;	
	НоваяСтрока.Используется 							= Используется;
	НоваяСтрока.Картинка   								= КартинкаСтроки;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
// Процедура - Изменить выбор всех вариантов
//
// Параметры:
//  УстановитьФлаг	 - 	 - 
//
Процедура ИзменитьВыборВсехВариантов(ДанныеДерева, УстановитьФлаг = 0)
	
	Для Каждого УровеньДерева ИЗ ДанныеДерева Цикл
		УровеньДерева.Используется = УстановитьФлаг;
		Если НЕ ЗначениеЗаполнено(УровеньДерева.ТриггерноеСобытие) Тогда 
			ИзменитьВыборВсехВариантов(УровеньДерева.ПолучитьЭлементы(), УстановитьФлаг);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить массив выбранных событий
//
// Параметры:
//  ДанныеДерева			 - 	 - 
//  МассивВыбранныхСобытий	 - 	 - 
// 
//
Процедура ЗаполнитьМассивВыбранныхСобытий(ДанныеДерева, МассивВыбранныхСобытий)
	
	Для Каждого УровеньДерева ИЗ ДанныеДерева Цикл
		Если НЕ ЗначениеЗаполнено(УровеньДерева.ТриггерноеСобытие) Тогда 
			ЗаполнитьМассивВыбранныхСобытий(УровеньДерева.ПолучитьЭлементы(), МассивВыбранныхСобытий);
		КонецЕсли;
		Если ЗначениеЗаполнено(УровеньДерева.ТриггерноеСобытие) И УровеньДерева.Используется Тогда
			МассивВыбранныхСобытий.Добавить(УровеньДерева.ТриггерноеСобытие);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры




#КонецОбласти
