#Область СлужебныеПроцедурыИФункции 
// Процедуры пометки удаления добавлены в свя с тем, что при установке и снятии пометок
// необходим вывод сообщений пользователю. Отловить установку пометки удаления для формы списка справочника невозможно.

// Процедура - Удалить промокод на сервере
//
процедура УдалитьПромокодНаСервере(Промокод) Экспорт	
	 
	НаборЗаписей = РегистрыСведений.Промокоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Вид.Установить(Промокод);
	Попытка
		НаборЗаписей.Записать();  
		ПромокодОбъект = Промокод.ПолучитьОбъект();
		ПромокодОбъект.ДополнительныеСвойства.Вставить("ПромокодУдален");
		ПромокодОбъект.ПометкаУдаления = Истина;		
		ПромокодОбъект.Записать();
		
	Исключение    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При удалении промокодов произошла ошибка.");					
	КонецПопытки; 
		
КонецПроцедуры

// Процедура Записать промокод.
//
Процедура ЗаписатьПромокодНаСервере(Промокод, Пометка) Экспорт
	
	ПромокодОбъект = Промокод.ПолучитьОбъект();	
	
	Если Пометка = Истина Тогда
		ПромокодОбъект.ДополнительныеСвойства.Вставить("ПромокодВосстановлен");  
	Иначе                                                                
		ПромокодОбъект.ДополнительныеСвойства.Вставить("ПромокодУдален");		
	КонецЕсли;
	
	ПромокодОбъект.ПометкаУдаления = НЕ Пометка;		
	
	Попытка
		ПромокодОбъект.Записать();
	Исключение
	КонецПопытки;

КонецПроцедуры 

#КонецОбласти
