
#Область ОбработчикиСобытий
						  
// Процедура При записи.
//
Процедура ПриЗаписи(Отказ)
	
	Если Реферальный = Истина И ПометкаУдаления = Истина И НЕ ДополнительныеСвойства.Свойство("ПромокодУдален") Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пометка на удаление осуществляется через командную панель!");					
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;                                          
	
	Если Реферальный = Истина И ПометкаУдаления = Ложь Тогда
		ЗаписатьРеферальныеКоды();		
	КонецЕсли;
	
КонецПроцедуры     

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

// Процедура, записывает в регистр сведений "Промокоды" записи по каждому контрагенту/сотруднику.
//
Процедура ЗаписатьРеферальныеКоды()
	
	МассивВладельцев = ПолучитьМассивРаспространителей(ЭтотОбъект.Владельцы, ЭтотОбъект.Сегмент);
	РегистрыСведений.Промокоды.СгенерироватьИЗаписатьПромокоды(ЭтотОбъект.ДлинаПромокода, ЭтотОбъект.Ссылка, МассивВладельцев);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Промокоды были сгенерированы заново.");					
	
КонецПроцедуры

// Функция Получить массив распространителей.
//
Функция ПолучитьМассивРаспространителей(Владельцы, Сегмент)
	
	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(Сегмент) Тогда
		
		Если Владельцы Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
							|	СотрудникиСегмента.Сотрудник КАК Ссылка
							|ИЗ
							|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
							|ГДЕ
							|	СотрудникиСегмента.Сегмент = &Сегмент
							|	И НЕ СотрудникиСегмента.Сотрудник.ПометкаУдаления
							|	И НЕ СотрудникиСегмента.Сотрудник.ЭтоГруппа"
							
		Иначе 
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	КонтрагентыСегмента.Контрагент КАК Ссылка
			               |ИЗ
			               |	РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			               |ГДЕ
			               |	КонтрагентыСегмента.Сегмент = &Сегмент
			               |	И НЕ КонтрагентыСегмента.Контрагент.ПометкаУдаления
			               |	И НЕ КонтрагентыСегмента.Контрагент.ЭтоГруппа"
						   
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Сегмент", Сегмент);
		
	ИначеЕсли Владельцы Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.ЭтоГруппа";

	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыКонтрагентов.Контрагент.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		|ГДЕ
		|	НЕ СтатусыКонтрагентов.Контрагент.ПометкаУдаления
		|	И (СтатусыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный))";
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
     
#КонецОбласти


	

