
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Если Параметры.Свойство("Владелец") Тогда
		Если ТипЗнч(Параметры.Владелец) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Владелец", Параметры.Владелец.Организация, ЗначениеЗаполнено(Параметры.Владелец.Организация));		
		Иначе
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Владелец", Параметры.Владелец, ЗначениеЗаполнено(Параметры.Владелец));
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

