
#Область СлужебныйПрограммныйИнтерфейс

#Область v1

// Функция является основной точкой входа методов GET
//
Функция v1GET(Запрос)

	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеСЗаголовками = ПолучитьСоответствиеЗаголовков(Запрос);
	
	Метод      = НРег(Запрос.ПараметрыURL["metod"]);
	УИДКлиники = Запрос.ПараметрыURL["clinic_id"];     
	ApiKey     = СоответствиеСЗаголовками.Получить("apikey");
	UserToken  = СоответствиеСЗаголовками.Получить("usertoken");

	ВнешняяСистема     = Неопределено;
	СообщениеОбОшибке  = ПроверитьКлючПриложения(ApiKey, ВнешняяСистема);	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда		
		Возврат ПолучитьHTTPОтвет(СообщениеОбОшибке);
	КонецЕсли;
	
	СтруктурнаяЕдиница = ПолучитьСсылкуПоИдентификатору(УИДКлиники, СообщениеОбОшибке,, "СтруктурныеЕдиницы", 1055, Истина);
	Если СтруктурнаяЕдиница = Неопределено Тогда
		СтруктурнаяЕдиница = ПолучитьСтруктурнуюЕдиницуПоУИДКлиники(УИДКлиники, СообщениеОбОшибке);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда		
		Возврат ПолучитьHTTPОтвет(СообщениеОбОшибке);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(UserToken) Тогда
		ТекущийКлиент = РегистрыСведений.КлючиВнешнихСистем.ПолучитьКлиентаПоКлючу(UserToken);
	КонецЕсли;

	ПараметрыЗапроса = Запрос.ПараметрыЗапроса;
	
	repeater   = ПараметрыЗапроса.Получить("repeater");
	БазовыйURL = ?(repeater = Неопределено, Запрос.БазовыйURL, repeater);
	
	datetime    = ПараметрыЗапроса.Получить("datetime");
	start_date  = ПараметрыЗапроса.Получить("start_date");
	end_date    = ПараметрыЗапроса.Получить("end_date");
	service_id  = ПараметрыЗапроса.Получить("service_id");
	service_ids = ПолучитьМассив_service_ids(ПараметрыЗапроса);
	staff_id   	= ПараметрыЗапроса.Получить("staff_id");
	
	Если Метод = "book_services" Тогда
		Ответ1с = api_v1.book_services(СтруктурнаяЕдиница, datetime, staff_id);
	ИначеЕсли Метод = "book_staff" Тогда
		Ответ1с = api_v1.book_staff(СтруктурнаяЕдиница, datetime, service_ids, service_id, БазовыйURL, ApiKey,, ВнешняяСистема);
	ИначеЕсли Метод = "book_dates" Тогда
		Ответ1с = api_v1.book_dates(СтруктурнаяЕдиница, start_date, end_date, service_ids, service_id, staff_id, ВнешняяСистема);
	ИначеЕсли Метод = "book_times" Тогда
		Ответ1с = api_v1.book_times(СтруктурнаяЕдиница, datetime, service_ids, service_id, staff_id);
	ИначеЕсли Метод = "client" Тогда
		Ответ1с = api_v1.client(ТекущийКлиент);
	ИначеЕсли Метод = "auth_types" Тогда		
		Ответ1с = api_v1.auth_types(СтруктурнаяЕдиница)
	Иначе
		Ответ1с = ПолучитьСтруктуруВозвратаОшибки(1040);
	КонецЕсли;                                                            
	
	Попытка
		Возврат ПолучитьHTTPОтвет(Ответ1с);
	Исключение		
		СистемнаяОшибка = ОписаниеОшибки();	
		ЗаписьЖурналаРегистрации("API," + Метод, УровеньЖурналаРегистрации.Ошибка, , , СистемнаяОшибка);				
		Возврат ПолучитьHTTPОтвет(ПолучитьСтруктуруВозвратаОшибки(1000, СистемнаяОшибка));				
	КонецПопытки;
	
	
КонецФункции

// Функция является основной точкой входа методов POST
//
Функция v1POST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеСЗаголовками = ПолучитьСоответствиеЗаголовков(Запрос);
	
	Метод      = НРег(Запрос.ПараметрыURL["metod"]);
	УИДКлиники = Запрос.ПараметрыURL["clinic_id"];
	ApiKey     = СоответствиеСЗаголовками.Получить("apikey");
	UserToken  = СоответствиеСЗаголовками.Получить("usertoken");
	
	Если Метод = "test_connect" Тогда
		КодПроверки = ЛичныйКабинет.ПолучитьКодПроверкиРубликации();
		Возврат ПолучитьHTTPОтвет(Новый Структура("Result, CheckCode", Истина, КодПроверки));
		
	КонецЕсли;
	СообщениеОбОшибке = "";
	СтруктурнаяЕдиница = ПолучитьСсылкуОбъектаПоУИД(УИДКлиники, "Справочники", "СтруктурныеЕдиницы");
	Если СтруктурнаяЕдиница = Неопределено Тогда 
		СтруктурнаяЕдиница = ПолучитьСтруктурнуюЕдиницуПоУИДКлиники(УИДКлиники, СообщениеОбОшибке, Ложь); 
	КонецЕсли;
	
	Если Метод <> "auth" И СтруктурнаяЕдиница = Неопределено Тогда 
		Возврат ПолучитьHTTPОтвет(ПолучитьСтруктуруВозвратаОшибки(1055));  
	КонецЕсли;
	
	ВнешняяСистема 	  = Неопределено;
	СообщениеОбОшибке = ПроверитьКлючПриложения(ApiKey, ВнешняяСистема);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат ПолучитьHTTPОтвет(СообщениеОбОшибке);
	КонецЕсли;
	
	ТекущийКлиент = Неопределено;
	НомерТелефона = Неопределено;
	Пароль		  = Неопределено;
	Если Метод <> "auth" Тогда
		
		СообщениеОбОшибке = ПроверитьКлючКлиента(UserToken, ТекущийКлиент, НомерТелефона, Пароль);
		Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
			Возврат ПолучитьHTTPОтвет(СообщениеОбОшибке);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыJSON = ПолучитьПараметрыJSON(Запрос);

	last_name			= ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "last_name");
	name			  	= ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "name");
	second_name 		= ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "second_name");
	phone   			= ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "phone");
	email			  	= ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "email");
	birthday   			= ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "birthday");
	sex   				= ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "sex");
	comment 			= ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "comment");
	
	Если Метод = "book_record" Тогда
		fullname	  = ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "fullname");
		commercial 	  = ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "commercial");
		record_array  = ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "record_array");
		comment 	  = ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "comment");
		notify_by_sms = ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "notify_by_sms");
		
		Ответ1с       = api_v1.book_record(СтруктурнаяЕдиница, record_array, ТекущийКлиент, fullname,
						commercial, comment, ВнешняяСистема, НомерТелефона, notify_by_sms,, email, birthday);
	
	ИначеЕсли Метод = "auth" Тогда
		login 	 		  = ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "login");
		confirmation_code = ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "confirmation_code");
		auth_type		  = ПолучитьЗначениеИзСтруктуры(ПараметрыJSON, "auth_type");
		
		Ответ1с           = api_v1.auth(ApiKey, login, confirmation_code, name, last_name, second_name, birthday, email, СтруктурнаяЕдиница, auth_type);	
		
	Иначе                               
		Ответ1с = ПолучитьСтруктуруВозвратаОшибки(1040);
	КонецЕсли;
	
	Попытка
		Возврат ПолучитьHTTPОтвет(Ответ1с);
	Исключение		
		СистемнаяОшибка = ОписаниеОшибки();	
		ЗаписьЖурналаРегистрации("API," + Метод, УровеньЖурналаРегистрации.Ошибка, , , СистемнаяОшибка);				
		Возврат ПолучитьHTTPОтвет(ПолучитьСтруктуруВозвратаОшибки(1000, СистемнаяОшибка));				
	КонецПопытки;
		
КонецФункции

#Область МетодыПроверкиПередаваемыхПараметров

// Функция проводит аутентификацию приложения
// 
Функция ПроверитьКлючПриложения(ApiKey, ВнешняяСистема = Неопределено, ТипВнешнейСистемы = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ApiKey) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1062);
	КонецЕсли;
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey, ТипВнешнейСистемы);
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1063);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция проводит аутентификацию клиента
// 
Функция ПроверитьКлючКлиента(UserToken, Клиент, НомерТелефона = Неопределено, Пароль = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(UserToken) Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1066);
	КонецЕсли;
	
	СтруктураДанных = РегистрыСведений.КлючиВнешнихСистем.ПолучитьДанныеКлючаВнешнейСистемы(UserToken);
	
	Если СтруктураДанных = Неопределено Тогда
		Возврат ПолучитьСтруктуруВозвратаОшибки(1067);
	Иначе		
		Клиент 			= СтруктураДанных.Клиент;
		НомерТелефона	= СтруктураДанных.НомерТелефона;
		Пароль			= СтруктураДанных.Пароль;		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Получить структурную единицу по УИДКлиники
//
// Параметры:
//  УидКлиники			 - 	 - 
//  СообщениеОбОшибке	 - 	 - 
//  КодОшибки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктурнуюЕдиницуПоУИДКлиники(УидКлиники, СообщениеОбОшибке, ОбязательныйПараметр = Истина)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	|	И СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ
	|	И СтруктурныеЕдиницы.УникальныйИдентификаторСтруктурнойЕдиницы = &УникальныйИдентификаторСтруктурнойЕдиницы");
	Запрос.УстановитьПараметр("УникальныйИдентификаторСтруктурнойЕдиницы", УидКлиники); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Ссылка = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	Если Ссылка = Неопределено И ОбязательныйПараметр = Истина Тогда
		СообщениеОбОшибке = ПолучитьСтруктуруВозвратаОшибки(1055);
	Иначе 
		СообщениеОбОшибке = Неопределено;	
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Files

// Функция возвращает файл в двоичных данных.
// 
Функция FilesGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяФайла 			= Запрос.ПараметрыURL["ИмяФайла"];
	ДвоичныеДанныеФайла = Неопределено;
	Отказ 				= Ложь;
	
	Если ИмяФайла = "get_default" Тогда
		ДвоичныеДанныеФайла = БиблиотекаКартинок.ФотоПоУмолчанию.ПолучитьДвоичныеДанные();
		
	ИначеЕсли ИмяФайла = "get_icon" Тогда
		ДвоичныеДанныеФайла = БиблиотекаКартинок.СменаКлиники.ПолучитьДвоичныеДанные();
	Иначе
		
		
		Попытка
						
			ИдентификаторСсылки = Новый УникальныйИдентификатор(Сред(ИмяФайла, 1, 36));
			Сотрудник = ПолучитьСсылкуОбъектаПоУИД(ИдентификаторСсылки, "Справочники", "Сотрудники");
			
			Если Сотрудник = Неопределено Тогда
				ФайлКартинки = ПолучитьСсылкуОбъектаПоУИД(ИдентификаторСсылки, "Справочники", "Файлы");
				Если ФайлКартинки = Неопределено Тогда
					Отказ = Истина;
				КонецЕсли;	
			Иначе
				ФайлКартинки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник, "ФайлКартинки");
			КонецЕсли;
			
			Если Не Отказ Тогда
				ДвоичныеДанныеФайла = ПолучитьФайлКартинки(ФайлКартинки);
				Если ДвоичныеДанныеФайла = Неопределено Тогда
					Отказ = Истина; 
				КонецЕсли;
			КонецЕсли;
			
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;	
		
	Ответ = Новый HTTPСервисОтвет(?(Отказ, 404, 200));
	Если Не Отказ Тогда
		Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанныеФайла);
		Ответ.Заголовки["Content-Type"] = "image";
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область wallet

Функция walletPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеСЗаголовками = ПолучитьСоответствиеЗаголовков(Запрос);
	
	api_key = СоответствиеСЗаголовками.Получить("apikey");
	
	ВнешняяСистема    = Неопределено;
	СообщениеОбОшибке = ПроверитьКлючПриложения(api_key, ВнешняяСистема); 
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда		
		Возврат ПолучитьHTTPОтвет(СообщениеОбОшибке);
	КонецЕсли;
	
	Метод 		  = НРег(Запрос.ПараметрыURL["method"]);
	ПараметрыJSON = ПолучитьПараметрыJSON(Запрос);
	
	Если Метод = "webhook" Тогда		
		Ответ1с = Справочники.Карты.ОбработатьВебХук(ВнешняяСистема, ПараметрыJSON);		
	Иначе	
		Ответ1с = ПолучитьСтруктуруВозвратаОшибки(1040);		
	КонецЕсли;
	
	Возврат ПолучитьHTTPОтвет(Ответ1с);

КонецФункции

#КонецОбласти

#Область sbp

// Функция - Sbp POST
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция sbpPOST(Запрос)
		
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.УстановитьТелоИзСтроки("OK");
	HTTPОтвет.Заголовки["Content-Type"] = "text"; 
	Возврат HTTPОтвет;
	
КонецФункции

// Функция - Sbp GET
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция sbpGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	api_key = Запрос.ПараметрыURL["apikey"];
	
	ВнешняяСистема    = Неопределено;
	СообщениеОбОшибке = ПроверитьКлючПриложения(api_key, ВнешняяСистема); 
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда		
		Возврат ПолучитьHTTPОтвет(СообщениеОбОшибке);
	КонецЕсли;
	
	ПараметрыЗапроса = Запрос.ПараметрыЗапроса;
	
	method			= ПараметрыЗапроса.Получить("method");
  	acquiring_id	= ПараметрыЗапроса.Получить("acquiring_id");
			
	Если method = "redirect_sbp" Тогда
		
		Ответ1с = api_v1.redirect_sbp(acquiring_id);
		
		HTTPОтвет = Новый HTTPСервисОтвет(200);
		HTTPОтвет.УстановитьТелоИзСтроки(Ответ1с);
		HTTPОтвет.Заголовки["Content-Type"] = "text/html";
		
		Возврат HTTPОтвет; 
		
	КонецЕсли;
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.УстановитьТелоИзСтроки("OK");
	HTTPОтвет.Заголовки["Content-Type"] = "text"; 
	Возврат HTTPОтвет;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция, возвращает структуру с заголовками запроса в нижнем регистре.
//
Функция ПолучитьСоответствиеЗаголовков(Запрос)
	
	СоответствиеСЗаголовками = Новый Соответствие;
	
	Для Каждого Заголовок Из Запрос.Заголовки Цикл
		
		Если НРег(Заголовок.Ключ) = "connection" ИЛИ НРег(Заголовок.Ключ) = "host" ИЛИ НРег(Заголовок.Ключ) = "content-length" Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеСЗаголовками.Вставить(НРег(Заголовок.Ключ), Заголовок.Значение);
		
	КонецЦикла;
	
	Возврат СоответствиеСЗаголовками;
	
КонецФункции

// Функция, возвращает ссылку по УИД.
//
Функция ПолучитьСсылкуОбъектаПоУИД(УИД, ВидОбъекта, ИмяОбъекта)
	
	Попытка
		Выполнить("ВидОбъекта = " + ВидОбъекта);
		Ссылка = ВидОбъекта[ИмяОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			Ссылка = Неопределено;
		КонецЕсли;
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Возврат Ссылка;
	
КонецФункции

// Функция, возвращает HTTPОтвет. 
//
Функция ПолучитьHTTPОтвет(Ответ1с, КодОтвета = Неопределено)
	
	КодОтвета = ?(КодОтвета = Неопределено, 200, КодОтвета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, Ответ1С);
	мОтвет = ЗаписьJSON.Закрыть();
	HTTPОтвет = Новый HTTPСервисОтвет(КодОтвета);
	HTTPОтвет.УстановитьТелоИзСтроки(мОтвет);
	HTTPОтвет.Заголовки["Content-Type"] = "application/json";
	
	Возврат HTTPОтвет;
	
КонецФункции

// Функция, возвращает структуру возврата ошибки. 
//
Функция ПолучитьСтруктуруВозвратаОшибки(КодОшибки = Неопределено, ОписаниеОшибки = "", ВернутьПустуюСтруктуру = Ложь)
	
	Если ВернутьПустуюСтруктуру Тогда
		Возврат Новый Структура("code, message", 0, "");
	КонецЕсли;
	
	СтруктураОшибки = Новый Структура("code, message", КодОшибки, api_v1.ПолучитьОписаниеОшибки(КодОшибки, ОписаниеОшибки));
	Возврат Новый Структура("Parameters, Errors",, СтруктураОшибки);
	
КонецФункции

// Функция, возвращает массив service_ids из параметров запроса.
// 
Функция ПолучитьМассив_service_ids(ПараметрыЗапроса)
	
	ТекстJSON = ПараметрыЗапроса.Получить("service_ids");
	
	Если ЗначениеЗаполнено(ТекстJSON) Тогда
		
		Попытка
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстJSON);
			ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
			
			Возврат ПараметрыJSON.services_array;
			
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

// Функция, проверяет переданное занятие.
//
Функция ПолучитьСсылкуПоИдентификатору(Идентификатор, СтруктураОшибки, ЭтоСправочник = Истина, ИмяОбъекта, КодОшибки, ОбязательныйПараметр = Ложь)
	
	Ссылка = Неопределено;
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		
		Ссылка = ПолучитьСсылкуОбъектаПоУИД(Идентификатор, ?(ЭтоСправочник, "Справочники", "Документы"), ИмяОбъекта);
		Если Ссылка = Неопределено Тогда
			СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(КодОшибки);
		КонецЕсли;
		
	ИначеЕсли ОбязательныйПараметр Тогда
		СтруктураОшибки = ПолучитьСтруктуруВозвратаОшибки(КодОшибки);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

// Функция, возвращает значение из структуры по ключу.
//
Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Если ТипЗнч(Структура) = Тип("Структура") Тогда
		Возврат ?(Структура.Свойство(Ключ), Структура[Ключ], ЗначениеПоУмолчанию);
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

// Функция, возвращает параметры JSON из тела запроса.
//
Функция ПолучитьПараметрыJSON(Запрос)
	
	ТекстJSON  = Запрос.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

// Функция, возвращает двоичные данные фото.
// 
Функция ПолучитьФайлКартинки(ВерсияСсылка)
	
	Возврат РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(ВерсияСсылка).ДвоичныеДанные;
	
КонецФункции

#КонецОбласти



