
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		
	Если ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.СестраХозяйка Тогда		
		ЭтаФорма.Заголовок = "Отчеты по запасам";
	Иначе
		Отказ = Истина;
	КонецЕсли;   	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация1Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ВедомостьПоПартиям");
	ОткрытьФорму("Отчет.ВедомостьПоПартиям.Форма", ПараметрыОтчета);
		
КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация2Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ОстаткиПоПартиям");
	ОткрытьФорму("Отчет.ВедомостьПоПартиям.Форма", ПараметрыОтчета);	
	
КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация3Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ОстаткиИОборотыСГруппировкойПоСкладам");
	ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма", ПараметрыОтчета);		

КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация4Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ОстаткиНаСкладах");
	ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма", ПараметрыОтчета);		

КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация5Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "НеобходимоОбеспечить");
	ОткрытьФорму("Отчет.КритическиеОстатки.Форма", ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация6Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "НормыСписанияМатериалов");
	ОткрытьФорму("Отчет.НормыСписанияМатериалов.Форма", ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация7Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ВедомостьПоМатериалам");
	ОткрытьФорму("Отчет.МатериалыВРаботеУСотрудников.Форма", ПараметрыОтчета);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация8Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ОстаткиМатериалов");
	ОткрытьФорму("Отчет.МатериалыВРаботеУСотрудников.Форма", ПараметрыОтчета);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация9Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ОстаткиМатериаловССебестоимостью");
	ОткрытьФорму("Отчет.МатериалыВРаботеУСотрудников.Форма", ПараметрыОтчета);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация10Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ВедомостьМатериаловСебестоимость");
	ОткрытьФорму("Отчет.МатериалыВРаботеУСотрудников.Форма", ПараметрыОтчета);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие"
//
Процедура СДекорация11Нажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура("КлючВарианта", "ВедомостьМатериаловСебестоимость");
	ОткрытьФорму("Отчет.ВедомостьПоСертификатам.Форма", ПараметрыОтчета);

КонецПроцедуры 

#КонецОбласти
