
#Область СлужебныйПрограммныйИнтерфейс

#Область МеткиОтборов

// Процедура, прикрепить метку отбора.
// 
// Параметры:
//  Форма				 - 	 - 
//  ИмяПоляОтбора		 - 	 - 
//  ИмяГруппыРодителя	 - 	 - 
//  Метка				 - 	 - 
//  НаименованиеМетки	 - 	 - 
//  ИмяСписка			 - 	 - 
//  ИмяПараметраЗапроса	 - 	 - 
// 
Процедура ПрикрепитьМеткуОтбора(Форма, ИмяПоляОтбора, ИмяГруппыРодителя, Метка, НаименованиеМетки, ИмяСписка = "", ИмяПараметраЗапроса="", ВывестиМеткуНаФорму = Истина) Экспорт
	
	СоздатьЭлементыМеток(Форма, ИмяПоляОтбора, ИмяГруппыРодителя, Метка, НаименованиеМетки, ИмяСписка, ИмяПараметраЗапроса);
	
	Если ВывестиМеткуНаФорму Тогда
		ОбновитьЭлементыМеток(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, прикрепить метки отбора из массива.
// 
// Параметры:
// Форма				 - 	 - 
// ИмяПоляОтбора		 - 	 - 
// ИмяГруппыРодителя	 - 	 - 
// МассивМеток			 - 	 - 
// 
Процедура ПрикрепитьМеткиОтбораИзМассива(Форма, ИмяПоляОтбора, ИмяГруппыРодителя, МассивМеток) Экспорт
	
	Для Каждого значениеМетки Из МассивМеток Цикл
		РаботаСОтборами.СоздатьЭлементыМеток(Форма, ИмяПоляОтбора, ИмяГруппыРодителя, значениеМетки, Строка(значениеМетки));
	КонецЦикла;
	
КонецПроцедуры

// Процедура, создать элементы меток.
// 
// Параметры:
// Форма				 - 	 - 
// ИмяПоляОтбора		 - 	 - 
// ИмяГруппыРодителя	 - 	 - 
// Метка				 - 	 - 
// НаименованиеМетки	 - 	 - 
// ИмяСписка			 - 	 - 
// ИмяПараметраЗапроса	 - 	 - 
// 
Процедура СоздатьЭлементыМеток(Форма, ИмяПоляОтбора, ИмяГруппыРодителя, Метка, НаименованиеМетки, ИмяСписка = "", ИмяПараметраЗапроса="") Экспорт
	
	Элементы = Форма.Элементы;
	ДанныеМеток = Форма.ДанныеМеток;
	
	Если ДанныеМеток.Количество() > 0 Тогда
		Если ИмяСписка <> "" И ДанныеМеток[0].Свойство("ИмяСписка") Тогда
			СтруктураПоискаЗначенияОтбора = Новый Структура("Метка, ИмяСписка, ИмяПоляОтбора", Метка, ИмяСписка, ИмяПоляОтбора);
		Иначе
			СтруктураПоискаЗначенияОтбора = Новый Структура("Метка, ИмяПоляОтбора", Метка, ИмяПоляОтбора);
		КонецЕсли;
		Если ДанныеМеток.НайтиСтроки(СтруктураПоискаЗначенияОтбора).Количество() > 0 Тогда
			// добавляется значение отбора, по которому уже есть отбор
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Метка)=Тип("Массив") Тогда
		СписокМеток = Новый СписокЗначений;
		СписокМеток.ЗагрузитьЗначения(Метка);
		Метка = СписокМеток;
	КонецЕсли; 
	
	СтрокаМеток = ДанныеМеток.Добавить();
	НавигационнаяСсылкаФС = "Метка_" + СтрокаМеток.ПолучитьИдентификатор();
	
	СтрокаМеток.Метка = Метка;
	СтрокаМеток.ИмяПоляОтбора		= ИмяПоляОтбора;
	СтрокаМеток.ИмяГруппыРодителя	= ИмяГруппыРодителя;
	
	ПредставлениеМетки = НаименованиеМетки;
	СтрокаМеток.ПредставлениеМетки = ПредставлениеМетки;
	Если СтрокаМеток.Свойство("ИмяСписка") Тогда
		СтрокаМеток.ИмяСписка = ИмяСписка;
	КонецЕсли;
	Если СтрокаМеток.Свойство("ИмяПараметраЗапроса") Тогда
		СтрокаМеток.ИмяПараметраЗапроса= ИмяПараметраЗапроса;
	КонецЕсли;
	
КонецПроцедуры

// Процедура. установить отбор списка.
// 
// Параметры:
// Форма				 - 	 - 
// СписокОтбора		 - 	 - 
// ИмяПоляОтбора		 - 	 - 
// ИмяСписка			 - 	 - 
// ИспользованиеОтбора	 - 	 - 
// 
Процедура УстановитьОтборСписка(Форма, СписокОтбора, ИмяПоляОтбора, ИмяСписка = "", ИспользованиеОтбора=Неопределено) Экспорт
	
	МассивОтбора = Новый Массив;
	Для каждого стр Из Форма.ДанныеМеток Цикл
		Если стр.ИмяПоляОтбора = ИмяПоляОтбора И (ИмяСписка = "" ИЛИ (стр.Свойство("ИмяСписка") И ИмяСписка = стр.ИмяСписка)) Тогда
			Если ТипЗнч(стр.Метка)=Тип("СписокЗначений") Тогда
				Для каждого значениеСписка Из стр.Метка Цикл
				    МассивОтбора.Добавить(значениеСписка.Значение);
				КонецЦикла; 
			Иначе	
				МассивОтбора.Добавить(стр.Метка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ИспользованиеОтбора=Неопределено Тогда
		ИспользованиеОтбора = ЗначениеЗаполнено(МассивОтбора);
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(СписокОтбора, ИмяПоляОтбора, МассивОтбора,
		ВидСравненияКомпоновкиДанных.ВСписке, , ИспользованиеОтбора);
	              
КонецПроцедуры

// Процедура, установить параметр запроса списка.
// 
// Параметры:
// Форма				 - 	 - 
// СписокОтбора		 - 	 - 
// ИмяПоляОтбора		 - 	 - 
// ИмяПараметраЗапроса	 - 	 - 
// 
Процедура УстановитьПараметрЗапросаСписка(Форма, СписокОтбора, ИмяПоляОтбора, ИмяПараметраЗапроса) Экспорт
	
	МассивОтбора = Новый Массив;
	СтрокиЗначенийОтбора = Форма.ДанныеМеток.НайтиСтроки(Новый Структура("ИмяПоляОтбора", ИмяПоляОтбора));
	Для каждого строкаОтборов Из СтрокиЗначенийОтбора Цикл
		Если ТипЗнч(строкаОтборов.Метка)=Тип("СписокЗначений") Тогда
			Для каждого значениеСписка Из строкаОтборов.Метка Цикл
				МассивОтбора.Добавить(значениеСписка.Значение);
			КонецЦикла;
		Иначе	
			МассивОтбора.Добавить(строкаОтборов.Метка);
		КонецЕсли;
	КонецЦикла;
	НаименованиеИспользоватьПараметр = "Использовать" + ИмяПараметраЗапроса; 
    СписокОтбора.Параметры.УстановитьЗначениеПараметра(НаименованиеИспользоватьПараметр, ЗначениеЗаполнено(МассивОтбора));
    СписокОтбора.Параметры.УстановитьЗначениеПараметра(ИмяПараметраЗапроса, МассивОтбора);
     
КонецПроцедуры

// Процедура, обновить элементы меток.
// 
// Параметры:
// Форма											 - 	 - 
// СписокГруппФормыДляУдаленияДобавленныхЭлементов	 - 	 - 
// 
Процедура ОбновитьЭлементыМеток(Форма, СписокГруппФормыДляУдаленияДобавленныхЭлементов=Неопределено) Экспорт
	
		Элементы = Форма.Элементы;
	ДанныеМеток = Форма.ДанныеМеток;
	
	Если СписокГруппФормыДляУдаленияДобавленныхЭлементов=Неопределено Тогда
		СписокГруппФормыДляУдаленияДобавленныхЭлементов = ПолучитьСписокИмяГруппыРодителя(ДанныеМеток);
	КонецЕсли;
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для каждого группаФормы Из СписокГруппФормыДляУдаленияДобавленныхЭлементов Цикл
		ДобавитьМеткиДляУдаления(Форма.Элементы[группаФормы], УдаляемыеЭлементы);
	КонецЦикла;
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Попытка 
		Элементы.Удалить(УдаляемыйЭлемент);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	НомерМетки = 0;
	Для Каждого ДанныеМетки Из ДанныеМеток Цикл
		
		Если ДанныеМетки.ИмяПоляОтбора = "Уволен" Или ДанныеМетки.ИмяПоляОтбора = "ДоступКСистеме" Тогда
			Продолжить;	
		КонецЕсли;
		
		ГруппаРодитель = Форма.Элементы[ДанныеМетки.ИмяГруппыРодителя];
		
		ГруппаМетки = Элементы.Добавить(ГруппаРодитель.Имя + "_" + Строка(НомерМетки), Тип("ГруппаФормы"), ГруппаРодитель);
		ГруппаМетки.Вид 														= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаМетки.Заголовок 													= ГруппаМетки.Имя;
		ГруппаМетки.Отображение 												= ОтображениеОбычнойГруппы.Нет;
		ГруппаМетки.Группировка 												= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаМетки.ОтображатьЗаголовок 										= Ложь;		
		// ГруппаМетки.ГоризонтальныйИнтервал 										= ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаМетки.ВертикальноеПоложениеВГруппе 								= ВертикальноеПоложениеЭлемента.Центр;
		ГруппаМетки.ВертикальноеПоложениеПодчиненных							= ВертикальноеПоложениеЭлемента.Центр;
		ГруппаМетки.ЦветФона 													= ЦветаСтиля.ЦветФонаНеТребуетВниманияМДЛП;
		
		// ГруппаМеткиДляДекорацииМетки = Элементы.Добавить(ГруппаМетки.Имя + "_Декорация", Тип("ГруппаФормы"), ГруппаМетки);
		// ГруппаМеткиДляДекорацииМетки.Вид 										= ВидГруппыФормы.ОбычнаяГруппа;
		// ГруппаМеткиДляДекорацииМетки.Заголовок 									= ГруппаМеткиДляДекорацииМетки.Имя;
		// ГруппаМеткиДляДекорацииМетки.Отображение 								= ОтображениеОбычнойГруппы.Нет;
		// ГруппаМеткиДляДекорацииМетки.Группировка 								= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		// ГруппаМеткиДляДекорацииМетки.ОтображатьЗаголовок 						= Ложь;		
		// ГруппаМеткиДляДекорацииМетки.ЦветФона 									= ЦветаСтиля.ЦветФонаЗадач;
		// ГруппаМеткиДляДекорацииМетки.ВертикальноеПоложениеВГруппе 								= ВертикальноеПоложениеЭлемента.Центр;
		// ГруппаМеткиДляДекорацииМетки.ВертикальноеПоложениеПодчиненных							= ВертикальноеПоложениеЭлемента.Центр;
				
		Декорация_Метки_Наименование = Элементы.Добавить("Декорация_Метки_" + Строка(НомерМетки), Тип("ДекорацияФормы"), ГруппаМетки);
		Декорация_Метки_Наименование.Вид 										= ВидДекорацииФормы.Надпись;
		Декорация_Метки_Наименование.Заголовок 									= Строка(ДанныеМетки.ПредставлениеМетки);
		Декорация_Метки_Наименование.Высота 									= 1;
		Декорация_Метки_Наименование.ГоризонтальноеПоложение   					= ГоризонтальноеПоложениеЭлемента.Лево;
		Декорация_Метки_Наименование.РастягиватьПоГоризонтали  					= Истина;
		Декорация_Метки_Наименование.ЦветТекста									= ЦветаСтиля.ТекстВторостепеннойНадписи;
		Декорация_Метки_Наименование.Шрифт 										= Новый Шрифт("Arial", 10);
		
		// ГруппаМеткиДляДекорацииКартинкиМетки = Элементы.Добавить(ГруппаМетки.Имя + "_Декорация_Картинка", Тип("ГруппаФормы"), ГруппаМетки);
		// ГруппаМеткиДляДекорацииКартинкиМетки.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
		// ГруппаМеткиДляДекорацииКартинкиМетки.Заголовок 							= ГруппаМеткиДляДекорацииКартинкиМетки.Имя;
		// ГруппаМеткиДляДекорацииКартинкиМетки.Отображение 						= ОтображениеОбычнойГруппы.Нет;
		// ГруппаМеткиДляДекорацииКартинкиМетки.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		// ГруппаМеткиДляДекорацииКартинкиМетки.ОтображатьЗаголовок 				= Ложь;		
		// ГруппаМеткиДляДекорацииКартинкиМетки.ЦветФона 							= ЦветаСтиля.ЦветФонаЗадач;
		// ГруппаМеткиДляДекорацииКартинкиМетки.ВертикальноеПоложениеВГруппе 								= ВертикальноеПоложениеЭлемента.Центр;
		// ГруппаМеткиДляДекорацииКартинкиМетки.ВертикальноеПоложениеПодчиненных							= ВертикальноеПоложениеЭлемента.Центр;
		
		Декорация_Метки_Картинка = Форма.Элементы.Добавить("Декорация_Картинка_Метки_" + Строка(НомерМетки), Тип("ДекорацияФормы"), ГруппаМетки);
		Декорация_Метки_Картинка.Вид											= ВидДекорацииФормы.Картинка;
		Декорация_Метки_Картинка.Картинка										= БиблиотекаКартинок.УдалениеДанных16;
		Декорация_Метки_Картинка.АвтоМаксимальнаяВысота 						= Ложь;
		Декорация_Метки_Картинка.МаксимальнаяВысота 							= 1;
		Декорация_Метки_Картинка.РастягиватьПоВертикали 						= Истина;
		Декорация_Метки_Картинка.РазмерКартинки 								= РазмерКартинки.РеальныйРазмер;
		Декорация_Метки_Картинка.Ширина					 						= 2;
		// Декорация_Метки_Картинка.Высота					 						= 1;
		Декорация_Метки_Картинка.Гиперссылка 									= Истина;
		
		Декорация_Метки_Картинка.УстановитьДействие("Нажатие", "Подключаемый_МеткаОбработкаНавигационнойСсылки");
		
		// ПолеМетки = Элементы.Добавить("Метка_" + НомерМетки, Тип("ПолеФормы"), ГруппаРодитель);
		// ПолеМетки.Вид = ВидПоляФормы.ПолеНадписи;
		// ПолеМетки.ПутьКДанным = "ДанныеМеток[" + НомерМетки + "].ПредставлениеМетки";
		// ПолеМетки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		// ПолеМетки.РастягиватьПоГоризонтали = Истина;
		// ПолеМетки.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_МеткаОбработкаНавигационнойСсылки");
		// ПолеМетки.Подсказка = ДанныеМетки.Метка;
		// // Обход ошибки платформы для тонкого клиента и интерфейсов, которые не "Такси".
		// Если ТекущийВариантИнтерфейсаКлиентскогоПриложения() <> ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		// 	Шрифт = Новый Шрифт(ПолеМетки.Шрифт,, 10);
		// 	ПолеМетки.Шрифт = Шрифт;
		// КонецЕсли;
		
		НомерМетки = НомерМетки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, свернуть развернуть отборы на сервере.
// 
// Параметры:
// Форма					 - 	 - 
// Видимость				 - 	 - 
// СтруктураИменЭлементов	 - 	 - 
// 
Процедура СвернутьРазвернутьОтборыНаСервере(Форма, Видимость, СтруктураИменЭлементов = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИнтерфейсТакси = (ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси);
	Если СтруктураИменЭлементов = Неопределено Тогда
		Если Элементы.Найти("ГруппаПанельУправления")=Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Элементы.ФильтрыНастройкиИДопИнфо.Видимость	= Видимость;
		Элементы.ГруппаПанельУправления.Видимость	= НЕ Видимость;
		Элементы.ПраваяПанель.Ширина = ?(Видимость, ?(ИнтерфейсТакси, 25, 24), 0);
	Иначе
		Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо].Видимость	= Видимость;
		Элементы[СтруктураИменЭлементов.ГруппаПанельУправления].Видимость = НЕ Видимость;
		Элементы[СтруктураИменЭлементов.ПраваяПанель].Ширина = ?(Видимость, ?(ИнтерфейсТакси, 25, 24), 0);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, удалить метку отбора сервер.
// 
// Параметры:
// Форма			 - 	 - 
// СписокОтбора	 - 	 - 
// МеткаИД			 - 	 - 
// ИмяСписка		 - 	 - 
// УстановитьОтбор	 - 	 - 
// 
Процедура УдалитьМеткуОтбораСервер(Форма, СписокОтбора, МеткаИД, ИмяСписка = "", УстановитьОтбор = Истина) Экспорт
	
	Элементы = Форма.Элементы;
	ДанныеМеток = Форма.ДанныеМеток;
	
	СтрокаМеток = ДанныеМеток[Число(МеткаИД)];
	ИмяПоляОтбора = СтрокаМеток.ИмяПоляОтбора;
	ИмяПараметраЗапроса = ?(СтрокаМеток.Свойство("ИмяПараметраЗапроса"), СтрокаМеток.ИмяПараметраЗапроса,"");
	
	СписокГруппФормыДляУдаленияДобавленныхЭлементов = ПолучитьСписокИмяГруппыРодителя(ДанныеМеток);
	
	ДанныеМеток.Удалить(СтрокаМеток);
	
	ОбновитьЭлементыМеток(Форма, СписокГруппФормыДляУдаленияДобавленныхЭлементов);
	
	Если УстановитьОтбор = Истина Тогда
		Если ИмяПараметраЗапроса = "" Тогда
			УстановитьОтборСписка(Форма, СписокОтбора, ИмяПоляОтбора, ИмяСписка);
		Иначе 
			УстановитьПараметрЗапросаСписка(Форма, СписокОтбора, ИмяПоляОтбора, ИмяПараметраЗапроса);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура, удалить метки отбора сервер.
// 
// Параметры:
// Форма		 - 	 - 
// СписокОтбора - 	 - 
// Метки		 - 	 - 
// ИмяСписка	 - 	 - 
// 
Процедура УдалитьМеткиОтбораСервер(Форма, СписокОтбора, Метки, ИмяСписка = "") Экспорт
	
	Элементы = Форма.Элементы;
	ДанныеМеток = Форма.ДанныеМеток;
	
	Метки.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	СписокГруппФормыДляУдаленияДобавленныхЭлементов = ПолучитьСписокИмяГруппыРодителя(ДанныеМеток);
	
	Для каждого МеткаИД Из Метки Цикл
		
		СтрокаМеток = ДанныеМеток[Число(МеткаИД.Значение)];
		ИмяПоляОтбора = СтрокаМеток.ИмяПоляОтбора;
		ИмяПараметраЗапроса = ?(СтрокаМеток.Свойство("ИмяПараметраЗапроса"), СтрокаМеток.ИмяПараметраЗапроса,"");
		
		ДанныеМеток.Удалить(СтрокаМеток);
		
		Если ИмяПараметраЗапроса="" Тогда
			УстановитьОтборСписка(Форма, СписокОтбора, ИмяПоляОтбора, ИмяСписка);
		Иначе
			УстановитьПараметрЗапросаСписка(Форма, СписокОтбора, ИмяПоляОтбора, ИмяПараметраЗапроса);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьЭлементыМеток(Форма, СписокГруппФормыДляУдаленияДобавленныхЭлементов);
	
КонецПроцедуры

// Функция, получить список имя группы родителя.
// 
// Параметры:
// ДанныеМеток	 - 	 - 
// 
// Возвращаемое значение:
//  - 
// 
Функция ПолучитьСписокИмяГруппыРодителя(ДанныеМеток)
	
	СписокГруппФормыДляУдаленияДобавленныхЭлементов = ДанныеМеток.Выгрузить();
	СписокГруппФормыДляУдаленияДобавленныхЭлементов.Свернуть("ИмяГруппыРодителя","");
	
	Возврат СписокГруппФормыДляУдаленияДобавленныхЭлементов.ВыгрузитьКолонку("ИмяГруппыРодителя");
	
КонецФункции

// Процедура, сохранить настройки отборов.
// 
// Параметры:
// Форма					 - 	 - 
// ИмяСписка				 - 	 - 
// СтруктураИменЭлементов	 - 	 - 
// ВариантОтборовФормы		 - 	 - 
// 
Процедура СохранитьНастройкиОтборов(Знач Форма, ИмяСписка = "", СтруктураИменЭлементов = Неопределено, ВариантОтборовФормы="") Экспорт
	
	ИмяКлючаОбъекта = СтрЗаменить(Форма.ИмяФормы,".","")+ВариантОтборовФормы;
	
	Если ИмяСписка = "" Тогда
		ДанныеМеток = Форма.ДанныеМеток.Выгрузить();
	Иначе
		ДанныеМеток = Форма.ДанныеМеток.Выгрузить();
		ПараметрыОтбора = Новый Структура("ИмяСписка", ИмяСписка);
		ДанныеМеток.НайтиСтроки(ПараметрыОтбора);
	КонецЕсли;
	
	Если СтруктураИменЭлементов = Неопределено Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ДанныеМеток", ДанныеМеток);
// 		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ОтборПоПериоду", Форма.ОтборПериод);
// 		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ВидимостьПанелиОтборов", Форма.Элементы.ФильтрыНастройкиИДопИнфо.Видимость);
	Иначе
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ДанныеМеток", ДанныеМеток);
	// 	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ОтборПоПериоду", Форма[СтруктураИменЭлементов.ОтборПериод]);
	// 	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ВидимостьПанелиОтборов", Форма.Элементы[СтруктураИменЭлементов.ФильтрыНастройкиИДопИнфо].Видимость);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, восстановить настройки отборов.
// 
// Параметры:
// Форма						 - 	 - 
// СписокОтбора				 - 	 - 
// ИмяСписка					 - 	 - 
// СтруктураИменЭлементов		 - 	 - 
// СтруктураИменПолейОтборов	 - 	 - 
// ВариантОтборовФормы			 - 	 - 
// Проверять					 - 	 - 
// 
Процедура ВосстановитьНастройкиОтборов(Форма, СписокОтбора, ИмяСписка = "", 
	СтруктураИменЭлементов = Неопределено, СтруктураИменПолейОтборов = Неопределено,
	ВариантОтборовФормы="", Проверять = Истина) Экспорт
	
	ИмяКлючаОбъекта = СтрЗаменить(Форма.ИмяФормы,".","")+ВариантОтборовФормы;
	// Отбор по полям правой панели
	СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ДанныеМеток");
	ЕстьОтборТекущегоСписка = Ложь;
	
	Если ЗначениеЗаполнено(СохраненноеЗначение) Тогда
		
		// Если параметры или текст запроса были изменены или удалены, то могут возникать косяки при загрузке сохраненных значений.
		// Ищем и удаляем такие параметры.
		УдаляемыеСтроки = Новый Массив;
		
		Если Проверять = Истина Тогда
			Для Каждого СтрокаОтбора Из СохраненноеЗначение Цикл
				
				ПараметрНеНайден 	= ЗначениеЗаполнено(СтрокаОтбора.ИмяПараметраЗапроса) И СписокОтбора.Параметры.Элементы.Найти(Новый ПараметрКомпоновкиДанных(СтрокаОтбора.ИмяПараметраЗапроса)) = Неопределено;
				ПолеОтбораНеНайдено = ЗначениеЗаполнено(СтрокаОтбора.ИмяПоляОтбора) И СписокОтбора.Отбор.ДоступныеПоляОтбора.Элементы.Найти(Новый ПараметрКомпоновкиДанных(СтрокаОтбора.ИмяПоляОтбора)) = Неопределено;
				
				Если ПараметрНеНайден И ПолеОтбораНеНайдено Тогда
					УдаляемыеСтроки.Добавить(СтрокаОтбора);
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого СтрокаОтбора Из УдаляемыеСтроки Цикл
				СохраненноеЗначение.Удалить(СтрокаОтбора);
			КонецЦикла;
			
		КонецЕсли;

		Форма.ДанныеМеток.Загрузить(СохраненноеЗначение);
		
		// Установить отборы списка по данным в таблице ДанныеМеток
		ЕстьИмяСписка = Ложь; // для форм с несколькими динамическими списками
		ЕстьИмяПараметраЗапроса = Ложь; // для форм, где отбор устанавливается через параметр запроса динамического списка
		
		СтрокаПолейТаблицыДляСвертки = "ИмяПоляОтбора";
		Если СохраненноеЗначение.Колонки.Найти("ИмяСписка")<>Неопределено Тогда
			СтрокаПолейТаблицыДляСвертки = СтрокаПолейТаблицыДляСвертки + ",ИмяСписка";
			ЕстьИмяСписка = Истина;
		КонецЕсли;
		Если СохраненноеЗначение.Колонки.Найти("ИмяПараметраЗапроса")<>Неопределено  Тогда
			СтрокаПолейТаблицыДляСвертки = СтрокаПолейТаблицыДляСвертки + ",ИмяПараметраЗапроса";
			ЕстьИмяПараметраЗапроса = Истина;
		КонецЕсли;
		ТаблицаИменПолейОтборов = СохраненноеЗначение.Скопировать(,СтрокаПолейТаблицыДляСвертки);
		ТаблицаИменПолейОтборов.Свернуть(СтрокаПолейТаблицыДляСвертки, "");
		Если Проверять = Истина Тогда
			Для каждого строкаПолейОтборов Из ТаблицаИменПолейОтборов Цикл // цикл по именам полей отбора
				
				// Если нет колонки "ИмяСписка", отбор через компоновку
				// Если есть имя списка, нужно проверить, что поле отбора принадлежит этому списку
				ПолеОтбораПринадлежитСписку = НЕ ЕстьИмяСписка ИЛИ (ЕстьИмяСписка И строкаПолейОтборов.ИмяСписка = ИмяСписка);
				
				Если (ЕстьИмяПараметраЗапроса И строкаПолейОтборов.ИмяПараметраЗапроса<>""
					И ПолеОтбораПринадлежитСписку) Тогда
					// отбор через установку параметров запроса списка
					УстановитьПараметрЗапросаСписка(Форма, СписокОтбора, строкаПолейОтборов.ИмяПоляОтбора, строкаПолейОтборов.ИмяПараметраЗапроса);
					ЕстьОтборТекущегоСписка = Истина;
				ИначеЕсли ПолеОтбораПринадлежитСписку Тогда
					// отбор через компоновку
					УстановитьОтборСписка(Форма, СписокОтбора, строкаПолейОтборов.ИмяПоляОтбора,,Истина);
					ЕстьОтборТекущегоСписка = Истина;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаСпискаКлиенты" Тогда
			Для Каждого СтрокаТаблицыФормы Из Форма.ДанныеМеток.НайтиСтроки(Новый Структура("ИмяПоляОтбора", "ОтборМобильноеПриложение")) Цикл
				Форма.ДанныеМеток.Удалить(СтрокаТаблицыФормы);	
			КонецЦикла;
		КонецЕсли;
		
		ОбновитьЭлементыМеток(Форма);
		
	КонецЕсли;
	
	// // Отбор по периоду
	// Если СтруктураИменЭлементов = Неопределено Тогда
	// 	Форма.ОтборПериод = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ОтборПоПериоду");
	// 	Форма.ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Форма.ОтборПериод);
	// 	Если СтруктураИменПолейОтборов<> Неопределено И СтруктураИменПолейОтборов.Свойство("ОтборПериод") Тогда
	// 		ИмяПоляОтборПериод = СтруктураИменПолейОтборов.ОтборПериод;
	// 	Иначе
	// 		ИмяПоляОтборПериод = "Дата";
	// 	КонецЕсли;
	// 	
	// 	РаботаСОтборамиКлиентСервер.УстановитьОтборПоПериоду(СписокОтбора.КомпоновщикНастроек.Настройки.Отбор, Форма.ОтборПериод.ДатаНачала, Форма.ОтборПериод.ДатаОкончания, ИмяПоляОтборПериод);
	// Иначе
	// 	Форма[СтруктураИменЭлементов.ОтборПериод] = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ОтборПоПериоду");
	// 	Форма[СтруктураИменЭлементов.ПредставлениеПериода] = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Форма[СтруктураИменЭлементов.ОтборПериод]);
	// 	РаботаСОтборамиКлиентСервер.УстановитьОтборПоПериоду(СписокОтбора.КомпоновщикНастроек.Настройки.Отбор, 
	// 		Форма[СтруктураИменЭлементов.ОтборПериод].ДатаНачала, 
	// 		Форма[СтруктураИменЭлементов.ОтборПериод].ДатаОкончания);
	// КонецЕсли;
	
	// Видимость панели отборов
	// Если Не ЕстьОтборТекущегоСписка И НЕ ЗначениеЗаполнено(Форма.ОтборПериод) Тогда
	// 	СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+ИмяСписка+"_ВидимостьПанелиОтборов", Истина);
	// 	Если ЗначениеЗаполнено(СохраненноеЗначение) Тогда
	// 		СвернутьРазвернутьОтборыНаСервере(Форма, СохраненноеЗначение, СтруктураИменЭлементов);
	// 	КонецЕсли;
	// КонецЕсли;
	
КонецПроцедуры

// Процедура,добавить метки для удаления.
// 
// Параметры:
// ЭлементГруппа		 - 	 - 
// УдаляемыеЭлементы	 - 	 - 
// 
Процедура ДобавитьМеткиДляУдаления(ЭлементГруппа, УдаляемыеЭлементы)
	
	Для Каждого СтрокаМеток Из ЭлементГруппа.ПодчиненныеЭлементы Цикл
		Если СтрокаМеток.Вид=ВидПоляФормы.ПолеВвода Тогда
			Продолжить;
		КонецЕсли;
		УдаляемыеЭлементы.Добавить(СтрокаМеток);
	КонецЦикла;
	
КонецПроцедуры

// Функция, обновить представление периода.
// 
// Параметры:
// Период	 - 	 - 
// Тип		 - 	 - 
// 
// Возвращаемое значение:
//  - 
// 
Функция ОбновитьПредставлениеПериода(Период, Тип) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Период) ИЛИ (НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(Период.ДатаОкончания)) Тогда
		ПредставлениеПериода = Тип + НСтр("ru = 'за все время'");
	Иначе
		ДатаОкончанияПериода = ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), Период.ДатаОкончания);
		Если ДатаОкончанияПериода < Период.ДатаНачала Тогда
			#Если Клиент Тогда
			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выбрана дата окончания периода, которая меньше даты начала!'"));
			#КонецЕсли
			Тип = ?(Тип = "Период: ", "", Тип); 
			ПредставлениеПериода = Тип + НСтр("ru = 'с '") + Формат(Период.ДатаНачала,"ДФ=dd.MM.yyyy");
		Иначе
			Тип = ?(Тип = "Период: ", "", Тип);
			ПредставлениеПериода = Тип + НСтр("ru = 'за '") + НРег(ПредставлениеПериода(Период.ДатаНачала, ДатаОкончанияПериода));
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ПредставлениеПериода;
	
КонецФункции

// Процедура - Устанавливает отбор по периоду в форме списка документов
//
// Параметры:
//  СписокОтбор		 - ОтборКомпоновкиДанных - Отбор элемента формы - списка
//  ДатаНачала		 - Дата					 - Дата начала периода отображения
//  ДатаОкончания	 - Дата					 - Дата окончания периода отображения
//  ИмяПоляОтбора	 - Строка				 - Имя поля отбора периода в панели отборов 
//
Процедура УстановитьОтборПоПериоду(СписокОтбор, ДатаНачала, ДатаОкончания, ИмяПоляОтбора = "Дата") Экспорт
	
	// Отбор на список по периоду
	ГруппаОтборПоПериоду = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		СписокОтбор.Элементы,
		"Период",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
	ГруппаОтборПоПериоду.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтборПоПериоду,
		ИмяПоляОтбора,
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ДатаНачала,
		"ДатаНачала",
		ЗначениеЗаполнено(ДатаНачала));
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтборПоПериоду,
		ИмяПоляОтбора,
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
		ДатаОкончания,
		"ДатаОкончания",
		ЗначениеЗаполнено(ДатаОкончания));
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти