 
 #Область ОбработчикиСобытийФормы
 
 &НаСервере
 // Процедура, обработчик события формы "ПриСозданииНаСервере".
 //
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	 
	 ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	 
	 Параметры.Свойство("КлючСтроки", 		ЭтотОбъект.КлючСтроки);
	 Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КлючСтроки) Тогда
		 ЭтотОбъект.КлючСтроки = Новый УникальныйИдентификатор();		
	 КонецЕсли;
	 Параметры.Свойство("КоличествоЗубов",	ЭтотОбъект.КоличествоЗубов); 
	 Параметры.Свойство("КоличествоВПриеме",	ЭтотОбъект.КоличествоВПриеме); 
	 Параметры.Свойство("НаименованиеОграничения", ЭтотОбъект.НаименованиеОграничения);
	 Параметры.Свойство("Согласование", ЭтотОбъект.Согласование);
	 
 КонецПроцедуры
 
 #КонецОбласти
    
#Область ОбработчикиКомандФормы

 &НаКлиенте
 // Процедура, обработчик команды формы "КомандаДобавитьОграничениеЗубов".
 //
 Процедура КомандаДобавитьОграничениеЗубов(Команда)
	 
	 СтруктураВозврата = Новый Структура();
	 СтруктураВозврата.Вставить("НаименованиеОграничения", ЭтотОбъект.НаименованиеОграничения);
	 СтруктураВозврата.Вставить("КлючСтроки", 		ЭтотОбъект.КлючСтроки);
	 СтруктураВозврата.Вставить("КоличествоЗубов", 	ЭтотОбъект.КоличествоЗубов);
	 СтруктураВозврата.Вставить("КоличествоВПриеме", ЭтотОбъект.КоличествоВПриеме);
	 СтруктураВозврата.Вставить("Согласование", 		ЭтотОбъект.Согласование);
	 
	 ЭтаФорма.Закрыть(СтруктураВозврата);
	 
 КонецПроцедуры
 
 #КонецОбласти