
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// ПодключаемоеОборудование
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		мПараметры = Новый Структура;
		мПараметры.Вставить("ИспользоватьПодключаемоеОборудование", Истина);
		мПараметры.Вставить("ПоддерживаемыеТипыПодключаемогоОборудования", "");
		мПараметры.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);		
		
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, мПараметры, "СчитывательМагнитныхКарт");	
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
	   И ВводДоступен() Тогда
		Если ИмяСобытия = "TracksData" Тогда
			                  
			// Открываем совпадающие шаблоны
			ОчиститьСообщения();
			Если Параметр[1][3] = Неопределено
				ИЛИ Параметр[1][3].Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось прочитать поля. "
"Возможно, шаблон настроен неверно.';en='Not succeeded read fields. Perhaps the template is configured wrong.'"));
			Иначе
				НайденШаблон = Ложь;
				Для каждого текШаблон Из Параметр[1][3] Цикл
					НайденШаблон = Истина;
					ОткрытьФорму("Справочник.ШаблоныМагнитныхКарт.ФормаОбъекта", Новый Структура("Ключ", текШаблон.Шаблон));
				КонецЦикла;
				Если НЕ НайденШаблон Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Код не соответствует данному шаблону. "
"Возможно, шаблон настроен неверно.';en='Code does not match this pattern. Perhaps the template is configured wrong.'"));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

#КонецОбласти
