
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
		
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипВнешнейСистемы				 = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи;
		Объект.КлючПриложения					 = Строка(Новый УникальныйИдентификатор);
		СформироватьНаименование(); 
		Элементы.ГруппаУдалить.Видимость 		 = Ложь; 
		
	КонецЕсли;
	
	Элементы.СоздатьКлюч.Доступность = Объект.Ссылка.Пустая();  
	
	УидСессии = ЛичныйКабинет.УидТекущейСессии();
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	
	ЗаполнитьСоответствиеСтруктурныхЕдиниц();
	
КонецПроцедуры

&НаСервере
// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Используется 	  	 = Ложь;
	ИспользуемыеСалоны 	 = Новый Массив;
	НеИспользуемыеСалоны = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТаблицаСтруктурныхЕдиниц Цикл
		Если СтрокаТЗ.Использовать Тогда
			Используется = Истина;
			ИспользуемыеСалоны.Добавить(СтрокаТЗ.СтруктурнаяЕдиница);
		Иначе
			НеИспользуемыеСалоны.Добавить(СтрокаТЗ.СтруктурнаяЕдиница);
		КонецЕсли;
	КонецЦикла;
	
	СоздатьВнешнююСистему 	   = ТекущийОбъект.Синхронизирована = Ложь;
	ВнешняяСистемаИспользуется = СоздатьВнешнююСистему ИЛИ Используется;
	
	РезультатЗапроса = ОбновитьВнешнююСистемуВ_CRM(ТекущийОбъект.Ссылка, ВнешняяСистемаИспользуется, ЭтотОбъект.УидСессии);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗапроса.ОписаниеОшибки); 
		Возврат;
	КонецЕсли;
	
	Справочники.ВнешниеСистемы.ПодключитьВнешнююСистему(РеквизитФормыВЗначение("Объект"), Ложь, УИДСессии);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
	СтруктураОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	Оповестить("ЗаписанаВнешняяСистема", СтруктураОповещения);  
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЭтоОблако Тогда
		
		РезультатПроверки = ПроверитьПубликациюИнформационнойБазы();
		
		Если Не РезультатПроверки Тогда 
			
			ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаНастройкиВнешнейПубликации",,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);    
			
			ПоказатьОповещениеПользователя(,,"Необходимо настроить внешнюю публикацию", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УидСессии) Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОРегистрацииВЛК", ЭтотОбъект), Нстр("ru='Необходимо авторизоваться в личном кабинете. Открыть личный кабинет?';en='Is necessary to log in to your account. Open private cabinet?'"), РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ИспользуемыеСалоны 	 = Новый Массив;
	НеИспользуемыеСалоны = Новый Массив;

	Для Каждого СтрокаТЗ Из ТаблицаСтруктурныхЕдиниц Цикл
		Если СтрокаТЗ.Использовать Тогда
			Используется = Истина;
			ИспользуемыеСалоны.Добавить(СтрокаТЗ.СтруктурнаяЕдиница);
		Иначе
			НеИспользуемыеСалоны.Добавить(СтрокаТЗ.СтруктурнаяЕдиница);
		КонецЕсли;
	КонецЦикла;
	
	Если ИспользуемыеСалоны.Количество() > 0 Тогда
		
		РезультатЗапроса = ЗарегистироватьВиджет(ТекущийОбъект.КлючПриложения, ИспользуемыеСалоны);
		
		Если Не РезультатЗапроса.ВыполненоУспешно Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗапроса.ОписаниеОшибки); 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НеИспользуемыеСалоны.Количество() > 0 Тогда
		
		Если Используется Тогда
			РезультатЗапроса = ЛичныйКабинет.УдалитьРегистрациюСтруктурныхЕдиницВиджета(НеИспользуемыеСалоны);
		Иначе
			РезультатЗапроса = УдалитьРегистрациюВиджета(НеИспользуемыеСалоны);
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ТекущийОбъект.Ссылка, Используется, Истина);
		КонецЕсли;
		
		ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
		
		Если ПараметрыВнешнейСистемы = Неопределено Тогда
			ПараметрыВнешнейСистемы = Новый Структура;
		КонецЕсли;
		
		ПараметрыВнешнейСистемы.Вставить("ИспользуемыеСтруктурныеЕдиницы", ИспользуемыеСалоны);
		
		ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗапроса.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
//
Процедура УдалитьИЗакрыть(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
	
	ПоказатьВопрос(
	Оповещение,
	"Вы точнохотите пометить на удаление данный элемент справочника?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0, 
	КодВозвратаДиалога.Да
	);    
	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлючШифрования".
//
Процедура СоздатьКлючШифрования(Команда)
	
	Объект.КлючШифрования = СгенерироватьКодПодтверждения() + СгенерироватьКодПодтверждения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();
	
	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	МассивСтруктурныхЕдиниц = Новый Массив();
	Для Каждого СтрокаТЧ Из ЭтотОбъект.ТаблицаСтруктурныхЕдиниц Цикл     
		
		СтруктураСЕ = Новый Структура();
		СтруктураСЕ.Вставить("СтруктурнаяЕдиница", СтрокаТЧ.СтруктурнаяЕдиница);
		СтруктураСЕ.Вставить("Использовать"		 , СтрокаТЧ.Использовать);
		
		МассивСтруктурныхЕдиниц.Добавить(СтруктураСЕ); 		
		
	КонецЦикла;	
	
	ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы = Неопределено Тогда
		ПараметрыВнешнейСистемы = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыВнешнейСистемы.Свойство("ИспользуемыеСтруктурныеЕдиницы") Тогда
		ПараметрыВнешнейСистемы.МассивСтруктурныхЕдиниц = МассивСтруктурныхЕдиниц;
	Иначе
		ПараметрыВнешнейСистемы.Вставить("ИспользуемыеСтруктурныеЕдиницы", МассивСтруктурныхЕдиниц);
	КонецЕсли;
	
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПометитьНаУдаление();
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ВнешняяСистема"	 , Объект.Ссылка);
		ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		
		Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление()
	
	ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
	ВнешняяСистемаОбъект.Используется    = Ложь;
	
	Попытка
		ВнешняяСистемаОбъект.Записать();
	Исключение 
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// Процедура, получает адрес для отправки запросов.
//
Процедура ПолучитьАдресАпиДляОтправкиЗапросов()
	
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	Если ЭтоОблако = Истина Тогда
		АдресПубликации = "https://cloud.stoma1c.ru/app/" + Формат(ПараметрыСеанса.ОбластьДанныхЗначение, "ЧГ=");
	Иначе
		АдресПубликации = Константы.ВнешняяПубликацияАдрес.Получить();	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(АдресПубликации) Тогда
		ЭтотОбъект.АдресAPI = АдресПубликации + "/hs/api/v1";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить соответствие структурных единиц
//
Процедура ЗаполнитьСоответствиеСтруктурныхЕдиниц()
	
	МассивСтруктурныхЕдиниц 	   = ВернутьМассивСтруктурныхЕдиниц();
	ПараметрыВнешнейСистемы 	   = Объект.Ссылка.Параметры.Получить();
	ИспользуемыеСтруктурныеЕдиницы = Новый Массив;
	
	Если ПараметрыВнешнейСистемы <> Неопределено И ПараметрыВнешнейСистемы.Свойство("ИспользуемыеСтруктурныеЕдиницы") Тогда
		ИспользуемыеСтруктурныеЕдиницы = ПараметрыВнешнейСистемы.ИспользуемыеСтруктурныеЕдиницы;
	КонецЕсли;
	
	Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
		
		НоваяСтрока = ЭтотОбъект.ТаблицаСтруктурныхЕдиниц.Добавить();
		НоваяСтрока.Использовать	   = ИспользуемыеСтруктурныеЕдиницы.Найти(СтруктурнаяЕдиница) <> Неопределено;
		НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;   
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Обновить внешнюю систему в CRM
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  Используется	 - 	 - 
//  УидСессии		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется = Истина, УидСессии)
	
	Возврат ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется, УидСессии);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Зарегистировать виджет
//
// Параметры:
//  ApiKeyВн			 - 	 - 
//  СтруктурныеЕдиницы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗарегистироватьВиджет(ApiKeyВн, СтруктурныеЕдиницы)
	
	Возврат ЛичныйКабинет.ЗарегистироватьВиджет(ПолучитьОрганизациюСалона(), ApiKeyВн, СтруктурныеЕдиницы);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Удалить регистрацию виджета
//
// Параметры:
//  СтруктурныеЕдиницы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция УдалитьРегистрациюВиджета(СтруктурныеЕдиницы)

	Возврат ЛичныйКабинет.УдалитьРегистрациюВиджета(ПолучитьОрганизациюСалона(), СтруктурныеЕдиницы);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить организацию салона
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьОрганизациюСалона()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И НЕ Организации.ЭтоГруппа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает массив структурных единиц.
// 
Функция ВернутьМассивСтруктурныхЕдиниц()
	
	Возврат Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц()
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает значение из структуры по ключу.
//
Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

&НаСервере
// Функция генерирует случайное число от 1000 до 9999
// 
Функция СгенерироватьКодПодтверждения()
	
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Возврат Формат(ГенераторСлучайныхЧисел.СлучайноеЧисло(10000, 99999), "ЧГ=0");
	
КонецФункции

&НаСервереБезКонтекста
// Функция, проверяет публикацию информационной базы.
//
Функция ПроверитьПубликациюИнформационнойБазы()
	
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(Константы.ВнешняяПубликацияАдрес.Получить());
	
	Если РезультатПроверки.ВыполненоУспешно Тогда
		Возврат РезультатПроверки.ПубликацияВерна;  
	КонецЕсли;  
	
	Если НЕ (РезультатПроверки.ВыполненоУспешно И РезультатПроверки.ПубликацияВерна = Истина) Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При проверке публикации возникла ошибка: ';en='With checking publications originated mistake:'") + РезультатПроверки.ОписаниеОшибки);
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, устанавливает служебного пользователя.
//
Процедура УстановитьСлужебногоПользователя()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
