
#Область СлужебныеПроцедурыИФункции

#Область MobileApp_v1 

#Область GET_v1

// Функция - Get date server
// 
// Возвращаемое значение:
//   - 
//
Функция get_date_server() Экспорт
	Возврат ПолучитьСтруктуруОтвета(ТекущаяДатаСеанса());	
КонецФункции

// Функция - Получить версию конфигурации
// 
// Возвращаемое значение:
//   - 
//
Функция get_version_software() Экспорт
	
	ВерсияКонфигурации = Метаданные.Версия;
	ВерсияКонфигурации = ВерсияКонфигурации + "00";
	
	Возврат ПолучитьСтруктуруОтвета(ВерсияКонфигурации);
	
КонецФункции

// Функция, возвращает список структурных единиц.
// 
// Возвращаемое значение:
//   - 
// 
Функция GetClinics(Сотрудник) Экспорт
	
	МассивСтруктурныхЕдиниц  = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиСотрудников.ДатаУвольнения КАК Значение,
	|	НастройкиСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ТаблицаДатыУвольнения
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник = &Сотрудник
	|	И НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НастройкиСотрудников.ДатаУвольнения <= &ТекущаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники.ДоступныеСтруктурныеЕдиницы КАК СотрудникиДоступныеСтруктурныеЕдиницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДатыУвольнения КАК ТаблицаДатыУвольнения
	|		ПО СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница = ТаблицаДатыУвольнения.СтруктурнаяЕдиница
	|ГДЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = &Сотрудник
	|	И СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ
	|	И СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ЭтоГруппа = ЛОЖЬ
	|	И ТаблицаДатыУвольнения.СтруктурнаяЕдиница ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПользователиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.Наименование");

	
	Запрос.УстановитьПараметр("Сотрудник"  , Сотрудник);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого МестоРаботы Из Результат Цикл
		
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("Uid" , УникальныйИдентификатор(МестоРаботы.СтруктурнаяЕдиница));
		СтруктураОтвета.Вставить("Name", МестоРаботы.Представление);
		
		МассивСтруктурныхЕдиниц.Добавить(СтруктураОтвета);
		
	КонецЦикла;
	
	Возврат ПолучитьСтруктуруОтвета(МассивСтруктурныхЕдиниц);
	
КонецФункции

// Функция - Get schedule structural
// 
// Возвращаемое значение:
//   - 
//
Функция get_schedule_structural(СтруктурнаяЕдиница) Экспорт	
	Возврат РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница);	
КонецФункции

#Область get_doctors

// Функция возвращает данные мастера Клиники.
// 
Функция get_doctors(Сотрудник, СтруктурнаяЕдиница, ДатаНачала, ДатаОкончания) Экспорт
	
	МассивСотрудников = Новый Массив;	
	МассивСсылокСотрудников = Новый Массив;
	Настройки = Новый Структура();
	ЗагрузитьНастройкиОтображениеСотрудников(СтруктурнаяЕдиница, Настройки);
	
	Если Сотрудник.Роль = Перечисления.РольПользователя.Регистратура ИЛИ Сотрудник.Роль =  Перечисления.РольПользователя.Руководитель Тогда
		ТаблицаСотрудников = ПолучитьПодчиненныхСотрудников(Сотрудник, СтруктурнаяЕдиница);
		МассивСсылокСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	ИначеЕсли Сотрудник.Роль = Перечисления.РольПользователя.Врач ИЛИ Сотрудник.Роль = Перечисления.РольПользователя.ГлавныйВрач Тогда
		МассивСсылокСотрудников.Добавить(Сотрудник);
	КонецЕсли;
	
	ТаблицаСотрудниковПредставление = ПолучитьРасширенноеПредставлениеСотрудников(МассивСсылокСотрудников, Настройки);
	ГрафикРаботыСотрудников		    = РегистрыСведений.ВремяРаботыСотрудниковПлан.ПолучитьПлановоеВремяРаботыСотрудника(ДатаНачала, ДатаОкончания, МассивСсылокСотрудников, СтруктурнаяЕдиница);
	
	Для Каждого СтрокаТЧ из ТаблицаСотрудниковПредставление Цикл
		
		Представление = Справочники.Сотрудники.ПолучитьПредставлениеСотрудникаПоНастройкеОтображения(СтрокаТЧ, Настройки.ОтображениеСотрудника);
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(Представление);
		Если Настройки.ОтображениеДолжности = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантОтображать И ЗначениеЗаполнено(СтрокаТЧ.Должность) Тогда
			МассивСтрок.Добавить(СтрокаТЧ.Должность);
		КонецЕсли;
		
		СтруктураДобавления = Новый Структура;
		СтруктураДобавления.Вставить("УИД"			   , УникальныйИдентификатор(СтрокаТЧ.Сотрудник));
		СтруктураДобавления.Вставить("Значение"		   , СокрЛП(Строка(СтрокаТЧ.Сотрудник)));
		СтруктураДобавления.Вставить("Представление"   , МассивСтрок);
		СтруктураДобавления.Вставить("РольПользователя", Строка(СтрокаТЧ.Роль));
		СтруктураДобавления.Вставить("Должность"	   , ?(ЗначениеЗаполнено(СтрокаТЧ.Должность), СокрЛП(СтрокаТЧ.Должность), "Без должности"));
		
		НайденныеСтроки = ГрафикРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
		
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			ГрафикРаботыСотрудника = Новый Массив;
			Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл		
				ГрафикРаботыСотрудника.Добавить(Новый Структура("ДатаНачала, ДатаОкончания", СтрокаТЗ.ДатаВремяНачала, СтрокаТЗ.ДатаВремяОкончания));
			КонецЦикла;
			СтруктураДобавления.Вставить("ГрафикРаботыСотрудника", ГрафикРаботыСотрудника);	
		Иначе
			СтруктураДобавления.Вставить("ГрафикРаботыСотрудника", Неопределено);
		КонецЕсли;
		
		МассивСотрудников.Добавить(СтруктураДобавления);
		
	КонецЦикла;
	
	Возврат ПолучитьСтруктуруОтвета(Новый Структура("МассивСотрудников", МассивСотрудников));
	
КонецФункции

// Процедура, загрузить настройки интерфейса рецепции.
// 
Процедура ЗагрузитьНастройкиОтображениеСотрудников(СтруктурнаяЕдиница, Настройки, ПолучитьВсеНастройки = Ложь)
	
	Настройки       = Новый Структура();
	ТаблицаНастроек = РегистрыСведений.НастройкиИнтерфейсов.ПолучитьНастройкиИнтерфейсаЖурналаЗаписи(СтруктурнаяЕдиница);
	
	Для Каждого СтрокаТЧ Из ТаблицаНастроек Цикл
		
		Если СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеСотрудника Тогда
			Настройки.Вставить("ОтображениеСотрудника", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеДолжности Тогда
			Настройки.Вставить("ОтображениеДолжности", СтрокаТЧ.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция, возвращает таблицу подчиненых сотрудников.
// 
Функция ПолучитьПодчиненныхСотрудников(Сотрудник, СтруктурнаяЕдиница)
	
	// Получаем из регистра НастройкиПользователей дату увольнения (если указан пользователь, то берем его сотрудника)
	// Сотрудников берем из регистра НастройкиСотрудников, т.к. там всегда есть записи по сотруднику
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.ДатаУвольнения КАК Значение
	|ПОМЕСТИТЬ втЗначениеДатыУвольнения
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗначениеДатыУвольнения КАК втЗначениеДатыУвольнения
	|		ПО Сотрудники.Сотрудник = втЗначениеДатыУвольнения.Сотрудник
	|ГДЕ
	|	Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сотрудники.Сотрудник.Роль <> ЗНАЧЕНИЕ(Перечисление.РольПользователя.Руководитель)
	|	И НЕ Сотрудники.Сотрудник.ПометкаУдаления
	|	И (втЗначениеДатыУвольнения.Значение ЕСТЬ NULL
	|			ИЛИ втЗначениеДатыУвольнения.Значение = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ втЗначениеДатыУвольнения.Значение > &ТекущаяДата)
	|	И Сотрудники.Сотрудник <> &Сотрудник");
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

// Функция - Сортировать элементы справочника.
// 
// Параметры:
//  МассивСотрудников	 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ПолучитьРасширенноеПредставлениеСотрудников(МассивСотрудников, Настройки)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Должность.Наименование КАК Должность,
	|	Сотрудники.Наименование КАК Наименование,
	|	Сотрудники.Фамилия КАК Фамилия,
	|	Сотрудники.Имя КАК Имя,
	|	Сотрудники.Отчество КАК Отчество,
	|	Сотрудники.ПредставлениеДляОнлайнЗаписи КАК ПредставлениеДляОнлайнЗаписи,
	|	&ПриОтображенииДолжностейПоля
	|   Сотрудники.Роль КАК Роль 
	|   
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивСотрудников)
	|
	|УПОРЯДОЧИТЬ ПО
	|   &ПриОтображенииДолжностейУпорядочивание
	|	Сотрудники.Ссылка.Наименование");
	
	ОтображатьДолжности = Настройки.Свойство("ОтображениеДолжности") И Настройки.ОтображениеДолжности = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантОтображать; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПриОтображенииДолжностейПоля",           ?(ОтображатьДолжности,"ВЫБОР
	|		КОГДА Сотрудники.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|КОНЕЦ КАК ИндексСортировки,",""));	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПриОтображенииДолжностейУпорядочивание", ?(ОтображатьДолжности,"ИндексСортировки УБЫВ,
	|Должность,",""));	
	Запрос.УстановитьПараметр("МассивСотрудников",МассивСотрудников);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	// Наличие пустого сотрудника.
	Если МассивСотрудников.Найти(Справочники.Сотрудники.ПустаяСсылка()) <> Неопределено Тогда
		
		НоваяСтрока = РезультатЗапроса.Добавить();
		НоваяСтрока.Ссылка = Справочники.Сотрудники.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

// Функция - Получить данные помещений
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  ДатаНачала			 - 	 - 
//  ДатаОкончания		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция get_rooms(СтруктурнаяЕдиница, ДатаНачала, ДатаОкончания) Экспорт
	
	МассивПомещений = Справочники.Помещения.ОтборПомещений(СтруктурнаяЕдиница);
	
	РезультирующийМассив = Новый Массив;
	Для Каждого ЭлементМ ИЗ МассивПомещений Цикл
		Если ЗначениеЗаполнено(ЭлементМ) Тогда 
			РезультирующийМассив.Добавить(Новый Структура("Значение, УИД", СокрЛП(Строка(ЭлементМ)), УникальныйИдентификатор(ЭлементМ)));
		КонецЕсли;	
	КонецЦикла;
	
	РезультирующийМассив.Добавить(Новый Структура("Значение, УИД", "Без помещения", "00000000-0000-0000-0000-000000000000"));	
	Возврат ПолучитьСтруктуруОтвета(Новый Структура("МассивПомещений", РезультирующийМассив));
	
КонецФункции

// Функция - Получить настройки визитов
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция get_settings_visit(СтруктурнаяЕдиница, Сотрудник) Экспорт
	
	ТаблицаНастроек = РегистрыСведений.НастройкиИнтерфейсов.ПолучитьНастройкиИнтерфейсаЖурналаЗаписи(СтруктурнаяЕдиница, Сотрудник);
	
	ИнтервалЗаписи = 0;
	НастройкиЦветов = Новый Структура;	
	Для Каждого СтрокаТЧ Из ТаблицаНастроек Цикл		
		Если СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНеСостоялся Тогда
			НастройкиЦветов.Вставить("ПриемНеСостоялся", ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение)));			
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПациентОжидает Тогда
			НастройкиЦветов.Вставить("ПациентОжидает", ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение)));			
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНачат Тогда
			НастройкиЦветов.Вставить("ПриемНачат", ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение)));			
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОкончен Тогда
			НастройкиЦветов.Вставить("ПриемОкончен", ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение)));			
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПодтверждена Тогда
			НастройкиЦветов.Вставить("Подтверждена", ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение)));			
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветНеПодтверждена Тогда
			НастройкиЦветов.Вставить("НеПодтверждена", ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение)));			
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОтменен Тогда
			НастройкиЦветов.Вставить("ПриемОтменен", ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение)));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ИнтервалЗаписи Тогда
			ИнтервалЗаписи = СтрокаТЧ.Значение;
		КонецЕсли;			
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Наименование КАК Наименование,
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НЕ Склады.ПометкаУдаления
	|	И НЕ Склады.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивСкладов = Новый Массив;
	Для Каждого СтрокаТ Из Результат Цикл
		СтруктураСклада = Новый Структура;
		СтруктураСклада.Вставить("НаименованиеСклада", СтрокаТ.Наименование);
		СтруктураСклада.Вставить("УИДСклада"         , УникальныйИдентификатор(СтрокаТ.Ссылка)); 
		СтруктураСклада.Вставить("Основной"          , ?(СтруктурнаяЕдиница.ОсновнойСклад = СтрокаТ.Ссылка, Истина, Ложь));
		МассивСкладов.Добавить(СтруктураСклада);
	КонецЦикла;
	
	НастройкиМобильногоПриложенияСтоматологии = Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();
	Если НастройкиМобильногоПриложенияСтоматологии = Неопределено Тогда
		ОбновитьКонстантуНастройкиМобильногоПриложенияСтоматологии();
		НастройкиМобильногоПриложенияСтоматологии = Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();
	КонецЕсли;
	
	СтруктураНастроек = Новый Структура;
	Для Каждого НастройкаМП Из НастройкиМобильногоПриложенияСтоматологии Цикл
		СтруктураНастроек.Вставить(НастройкаМП.Ключ, НастройкаМП.Значение);	
	КонецЦикла;	
		
	Настройки = Новый Структура;
	Настройки.Вставить("НастройкиЦветов"							, НастройкиЦветов);
	Настройки.Вставить("МассивСкладов"								, МассивСкладов);	
	Настройки.Вставить("НеКонтролироватьОстатки"					, Константы.НеКонтроллироватьОстатки.Получить());	
	Настройки.Вставить("РольПользователя"							, ПолучитьРольПользователя(ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник,"Роль")));
	Настройки.Вставить("ВалютаУчета"								, СокрЛП(ОбщегоНазначенияСтоматология.ПолучитьСимвольноеПредставлениеВалюты()));		
	Настройки.Вставить("НастройкиМобильногоПриложенияСтоматологии"	, СтруктураНастроек);	
	Настройки.Вставить("ИнтервалЗаписи"								, ОпределениеИнтервалаВремени(ИнтервалЗаписи));
	Настройки.Вставить("ВерсияКонфигурации"							, Метаданные.Версия + "00");
	Настройки.Вставить("ТекущаяДатаСеанса"							, ТекущаяДатаСеанса());
	Настройки.Вставить("УИДСотрудника"								, Строка(Сотрудник.УникальныйИдентификатор()));
	Настройки.Вставить("РазрешитьЗаписьКДругомуВрачу"				, Пользователи.ПолучитьЗначениеПраваПользователя("РазрешитьЗаписьКДругомуВрачу", Справочники.Пользователи.ПолучитьПользователя(Сотрудник)));
		
	Возврат ПолучитьСтруктуруОтвета(Настройки);
	
КонецФункции

#Область find_client_by_line

// Функция - Найти клиентов по номеру телефона
//
// Параметры:
//  Телефон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция find_client_by_line(СтрокаПоиска, Сотрудник) Экспорт 
	
	РазмерПорции = 20;
	ВыборкаКлиентов = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(СтрокаПоиска, РазмерПорции, Истина, Истина,,,,,, Истина);	
	ПараметрыНастроек = Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();
	ВыводитьТелефонКлиентаВрачу = ПараметрыНастроек <> Неопределено И ПараметрыНастроек.Свойство("ВыводитьТелефонКлиентаВрачу") И ПараметрыНастроек.ВыводитьТелефонКлиентаВрачу;
	
	МассивКлиентов = Новый Массив;	
	Если ВыборкаКлиентов.Количество() > РазмерПорции Тогда
		ИнфоКлиента = Новый Структура();
		ИнфоКлиента.Вставить("УИД"			, Неопределено);
		ИнфоКлиента.Вставить("ФИО"			, "НайденоБольше20");
		ИнфоКлиента.Вставить("Представление", "Найдено более " + РазмерПорции + " пациентов, уточните поиск.");
		ИнфоКлиента.Вставить("Телефон"		, СтрокаПоиска);
		МассивКлиентов.Добавить(ИнфоКлиента);		
	ИначеЕсли ВыборкаКлиентов.Количество() = 0 Тогда
		ИнфоКлиента = Новый Структура();
		ИнфоКлиента.Вставить("УИД"			, Неопределено);
		ИнфоКлиента.Вставить("ФИО"			, "КлиентНеНайден");
		ИнфоКлиента.Вставить("Представление", "Пациент не найден. Создать нового клиента.");
		ИнфоКлиента.Вставить("Телефон"		, СтрокаПоиска);
		МассивКлиентов.Добавить(ИнфоКлиента);		
	Иначе
		
		Пока ВыборкаКлиентов.Следующий() Цикл
			
			ТелефонКлиента = ?(ЗначениеЗаполнено(ВыборкаКлиентов.Телефон) И ВыводитьТелефонКлиентаВрачу = Ложь И РольПользователяУрезана(Сотрудник), ЗаменитьНомерТелефонаДляВрача(ВыборкаКлиентов.Телефон), ВыборкаКлиентов.Телефон); 
			
			Представление = "" + ВыборкаКлиентов.Ссылка + 
			?(ЗначениеЗаполнено(ВыборкаКлиентов.ДатаРождения), ", " + Формат(ВыборкаКлиентов.ДатаРождения, "ДФ=dd.MM.yyyy"), "") + 
			?(ЗначениеЗаполнено(ТелефонКлиента), ", " + ТелефонКлиента, "") +
			?(ЗначениеЗаполнено(ВыборкаКлиентов.ТекущаяМедицинскаяКартаКод), ", № " + ВыборкаКлиентов.ТекущаяМедицинскаяКартаКод, "");
			
			ИнфоКлиента = Новый Структура;
			ИнфоКлиента.Вставить("УИД"			, УникальныйИдентификатор(ВыборкаКлиентов.Ссылка));
			ИнфоКлиента.Вставить("ФИО"			, Строка(ВыборкаКлиентов.Ссылка));	
			ИнфоКлиента.Вставить("Представление", Представление);
			ИнфоКлиента.Вставить("Телефон"		, ТелефонКлиента);      
			МассивКлиентов.Добавить(ИнфоКлиента);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПолучитьСтруктуруОтвета(МассивКлиентов);
	
КонецФункции
	
#КонецОбласти

#Область get_appointment_data

// Функция - Получить данные визита
//
// Параметры:
//  Сотрудник	 - 	 - 
//  Визит		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция get_appointment_data(Событие, Сотрудник) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Событие.Дата КАК Дата,
	|	Событие.ДатаОкончания КАК ДатаОкончания,
	|	Событие.Комментарий КАК Комментарий,
	|	Событие.Контрагент КАК Контрагент,
	|	Событие.ПолисМедСтрахования КАК ПолисМедСтрахования,
	|	Событие.ПричинаОтмены КАК ПричинаОтмены,
	|	Событие.Статус КАК Статус,
	|	Событие.Контрагент.Представление КАК КонтрагентПредставление,
	|	Событие.ПричинаОтмены.Представление КАК ПричинаОтменыПредставление,
	|	Событие.ПолисМедСтрахования.Представление КАК ПолисМедСтрахованияПредставление,
	|	Событие.Услуги.(
	|		ПричинаЗаписи КАК ПричинаЗаписи,
	|		ПричинаЗаписи.Представление КАК ПричинаЗаписиПредставление
	|	) КАК Услуги,
	|	Событие.Представление КАК Представление,
	|	Событие.Контрагент.Телефон КАК КонтрагентТелефон,
	|	Событие.ОснованиеРезерва КАК ОснованиеРезерва,
	|	Событие.Врач КАК Врач,
	|	Событие.Врач.Наименование КАК ВрачНаименование
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Ссылка = &Ссылка");
		
	Запрос.УстановитьПараметр("Ссылка"		, Событие);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДатаСеанса());
	
	ВыборкаСобытия = Запрос.Выполнить().Выбрать();
	
	СтруктураВозврата = Новый Структура;
	Если ВыборкаСобытия.Следующий() Тогда
		СтруктураВозврата.Вставить("Дата", ВыборкаСобытия.Дата);
		СтруктураВозврата.Вставить("ДатаОкончания", ВыборкаСобытия.ДатаОкончания);
		СтруктураВозврата.Вставить("Комментарий", ВыборкаСобытия.Комментарий);
		СтруктураВозврата.Вставить("Контрагент", УникальныйИдентификатор(ВыборкаСобытия.Контрагент));
		СтруктураВозврата.Вставить("КонтрагентПредставление", ВыборкаСобытия.КонтрагентПредставление);
		СтруктураВозврата.Вставить("ПричинаОтмены", УникальныйИдентификатор(ВыборкаСобытия.ПричинаОтмены));
		СтруктураВозврата.Вставить("ПричинаОтменыПредставление", ВыборкаСобытия.ПричинаОтменыПредставление);
		СтруктураВозврата.Вставить("Статус", ПолучитьСтатусСобытия(ВыборкаСобытия.Статус));
		СтруктураВозврата.Вставить("ПолисМедСтрахования", УникальныйИдентификатор(ВыборкаСобытия.ПолисМедСтрахования));
		СтруктураВозврата.Вставить("ПолисМедСтрахованияПредставление", ВыборкаСобытия.ПолисМедСтрахованияПредставление); 
		СтруктураВозврата.Вставить("Представление", ВыборкаСобытия.Представление);
		СтруктураВозврата.Вставить("КонтрагентТелефон", ВыборкаСобытия.КонтрагентТелефон);
		СтруктураВозврата.Вставить("ОснованиеРезерва", ВыборкаСобытия.ОснованиеРезерва);
		СтруктураВозврата.Вставить("ВрачПредставление", ВыборкаСобытия.ВрачНаименование);
		СтруктураВозврата.Вставить("Врач", УникальныйИдентификатор(ВыборкаСобытия.Врач));
		
		ТаблицаУслуг = ВыборкаСобытия.Услуги.Выгрузить();
		СтрокаУслуги = ?(ТаблицаУслуг.Количество() > 0, ТаблицаУслуг[0], Неопределено); 
		
		Если СтрокаУслуги <> Неопределено Тогда
			СтруктураВозврата.Вставить("ПричинаЗаписи", УникальныйИдентификатор(СтрокаУслуги.ПричинаЗаписи));
			СтруктураВозврата.Вставить("ПричинаЗаписиПредставление", СтрокаУслуги.ПричинаЗаписиПредставление);			
		КонецЕсли;		
	КонецЕсли;
	
	СтруктураВозврата.Вставить("МассивМеток", ПолучитьМассивМеток(Событие));
		
	Возврат ПолучитьСтруктуруОтвета(ВалидацияJSON(СтруктураВозврата));
	
КонецФункции

#КонецОбласти

#Область get_lables

// Функция - Get lables
//
// Параметры:
//  Событие	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция get_lables(Событие) Экспорт
	
	Событие = ?(Не ЗначениеЗаполнено(Событие), Документы.Событие.ПустаяСсылка(), Событие); 
	
	Возврат ПолучитьСтруктуруОтвета(ПолучитьМассивМеток(Событие));
	
КонецФункции

// Функция - Получить массив меток
//
// Параметры:
//  Событие	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивМеток(Событие)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Метки.Ссылка КАК Метка,
	|	Метки.ЦветМетки КАК ЦветМетки,
	|	НЕ КлиентскиеМеткиСрезПоследних.Клиент ЕСТЬ NULL КАК ВыбраннаяМетка,
	|	Метки.Наименование КАК МеткаПредставление
	|ПОМЕСТИТЬ ВТМетки
	|ИЗ
	|	Справочник.Метки КАК Метки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МеткиКлиентов.СрезПоследних(
	|				&ТекущаяДата,
	|				Клиент = &Событие
	|					И Активна = ИСТИНА) КАК КлиентскиеМеткиСрезПоследних
	|		ПО Метки.Ссылка = КлиентскиеМеткиСрезПоследних.Метка
	|ГДЕ
	|	НЕ Метки.ПометкаУдаления
	|	И Метки.ИспользоватьДляПредварительнойЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	Метки.Ссылка,
	|	НЕ КлиентскиеМеткиСрезПоследних.Клиент ЕСТЬ NULL,
	|	Метки.ЦветМетки,
	|	Метки.Наименование
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	МеткиКлиентов.Метка.Ссылка,
	|	МеткиКлиентов.Метка.ЦветМетки,
	|	ИСТИНА,
	|	МеткиКлиентов.Метка.Наименование
	|ИЗ
	|	РегистрСведений.МеткиКлиентов.СрезПоследних(
	|			&ТекущаяДата,
	|			Клиент В
	|					(ВЫБРАТЬ
	|						Событие.Контрагент
	|					ИЗ
	|						Документ.Событие КАК Событие
	|					ГДЕ
	|						Событие.Ссылка = &Событие)
	|				И Активна = ИСТИНА) КАК МеткиКлиентов
	|ГДЕ
	|	НЕ МеткиКлиентов.Метка.ПометкаУдаления
	|	И МеткиКлиентов.Метка.ИспользоватьДляПациентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТМетки.Метка КАК Метка,
	|	ВТМетки.ЦветМетки КАК ЦветМетки,
	|	МАКСИМУМ(ВТМетки.ВыбраннаяМетка) КАК ВыбраннаяМетка,
	|	ВТМетки.МеткаПредставление КАК МеткаПредставление
	|ИЗ
	|	ВТМетки КАК ВТМетки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТМетки.МеткаПредставление,
	|	ВТМетки.ЦветМетки,
	|	ВТМетки.Метка
	|
	|УПОРЯДОЧИТЬ ПО
	|	МеткаПредставление");
	
	Запрос.УстановитьПараметр("Событие"		, Событие);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивМеток = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		СтруктураМетки = Новый Структура();
		СтруктураМетки.Вставить("УИДМетки"			, УникальныйИдентификатор(Выборка.Метка));
		СтруктураМетки.Вставить("МеткаПредставление", Выборка.МеткаПредставление);
		СтруктураМетки.Вставить("ВыбраннаяМетка"	, Выборка.ВыбраннаяМетка);
		СтруктураМетки.Вставить("ЦветМетки"			, ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(Выборка.ЦветМетки),,, Истина));
		
		МассивМеток.Добавить(СтруктураМетки);
		
	КонецЦикла;
	
	Возврат МассивМеток;
	
КонецФункции

#КонецОбласти

#Область get_user_role

// Функция - Get user role
// 
// Возвращаемое значение:
//   - 
//
Функция get_user_role(Сотрудник) Экспорт
	Возврат ПолучитьСтруктуруОтвета(Новый Структура("Роль", ПолучитьРольПользователя((ПолучитьРольСотрудника(Сотрудник)))));	
КонецФункции

#КонецОбласти

#Область find_insurance_by_client

// Функция - Find card by client
//
// Параметры:
//  ОтборВладелецКарты	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция find_insurance_by_client(ОтборВладелецКарты) Экспорт
	
	РезультатЗапроса = Справочники.ПолисыМедицинскогоСтрахования.ПолучитьАктивныеПолисыКонтрагента(ОтборВладелецКарты, ТекущаяДатаСеанса(),, Ложь, Истина);
	
	МассивВозврата = Новый Массив;
	Для Каждого Полис Из РезультатЗапроса Цикл
		МассивВозврата.Добавить(Новый Структура("Полис, УИДПолиса", Полис.Представление, УникальныйИдентификатор(Полис.Ссылка)));		
	КонецЦикла;
	
	Возврат ПолучитьСтруктуруОтвета(МассивВозврата);
		
КонецФункции

#КонецОбласти

#Область list_reasons_canceling

// Функция - Get list reasons of canceling
// 
// Возвращаемое значение:
//   - 
//
Функция list_reasons_canceling() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПричиныОтменыЗаписи.Ссылка КАК Ссылка,
	|	ПричиныОтменыЗаписи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПричиныОтменыЗаписи КАК ПричиныОтменыЗаписи
	|ГДЕ
	|	НЕ ПричиныОтменыЗаписи.ПометкаУдаления");
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивПричинОтменыВизита = Новый Массив;
	Для Каждого ПричинаОтмены Из РезультатЗапроса Цикл
		
		СтруктураПричинаОтмены = Новый Структура;
		СтруктураПричинаОтмены.Вставить("УИД"		  , УникальныйИдентификатор(ПричинаОтмены.Ссылка));
		СтруктураПричинаОтмены.Вставить("Наименование", ПричинаОтмены.Наименование);
		МассивПричинОтменыВизита.Добавить(СтруктураПричинаОтмены);
		
	КонецЦикла;
	
	Возврат ПолучитьСтруктуруОтвета(МассивПричинОтменыВизита);
	
КонецФункции

#КонецОбласти

#Область list_appointment

// Функция - List appointment
//
// Параметры:
//  ОтборКлиент			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция list_appointment(ОтборКлиент, СтруктурнаяЕдиница, Сотрудник) Экспорт
	
	РольСотрудника		= ПолучитьРольСотрудника(Сотрудник);
	ЭтоВрач				= РольСотрудника = Перечисления.РольПользователя.Врач ИЛИ РольСотрудника = Перечисления.РольПользователя.ГлавныйВрач;
	ПараметрыНастроек	= Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();
	
	Если ЭтоВрач И ПараметрыНастроек <> Неопределено И ПараметрыНастроек.Свойство("НеВыводитьИсториюПриемовПоКлиенту") И ПараметрыНастроек.НеВыводитьИсториюПриемовПоКлиенту = Истина Тогда
		Возврат ПолучитьСтруктуруОтвета(,,,Ложь);	
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Прием.Ссылка КАК Ссылка,
	|	Прием.Номер КАК Номер,
	|	Прием.КурсЛечения КАК КурсЛечения,
	|	Прием.Дата КАК Дата,
	|	Прием.ВремяНачалаПриема КАК ВремяНачалаПриема,
	|	Прием.РезультатПриема КАК РезультатПриема,
	|	Прием.ЛечениеВрача.Сотрудник КАК ЛечениеВрачаСотрудник,
	|	Прием.ЛечениеВрача.ДатаНачала КАК ЛечениеДатаНачала,
	|	Прием.ЛечениеВрача.ДатаОкончания КАК ЛечениеДатаОкончания,
	|	Прием.ЛечениеВрача.Сотрудник.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	Прием.ЛечениеВрача.Сотрудник.Наименование КАК Наименование,
	|	Прием.ПолисМедСтрахования.Наименование КАК ПолисМедСтрахования
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	НЕ Прием.ПометкаУдаления
	|	И Прием.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ ПО
	|	КурсЛечения,
	|	Прием.ЛечениеВрача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтрагентыСведенияДляСписка.ДатаПервогоПриема КАК ДатаПервогоПриема,
	|	КонтрагентыСведенияДляСписка.ДатаПоследнегоПриема КАК ДатаПоследнегоПриема,
	|	КонтрагентыСведенияДляСписка.КоличествоПриемов КАК КоличествоПриемов,
	|	КонтрагентыСведенияДляСписка.Контрагент.Комментарий КАК КонтрагентКомментарий,
	|	КонтрагентыСведенияДляСписка.Контрагент.ДатаРегистрации КАК КонтрагентДатаРегистрации
	|ИЗ
	|	РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|ГДЕ
	|	КонтрагентыСведенияДляСписка.Контрагент = &Контрагент");
	
	Запрос.УстановитьПараметр("Контрагент"        , ОтборКлиент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	МассивРезультатов		= Запрос.ВыполнитьПакет();
	ВыборкаКурсовЛечения	= МассивРезультатов[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	МассивПриемовПациента	= Новый Массив;	
	
	Пока ВыборкаКурсовЛечения.Следующий() Цикл 			
		
		Если ЗначениеЗаполнено(ВыборкаКурсовЛечения.КурсЛечения) Тогда		
			
			ВыборкаЛечения = ВыборкаКурсовЛечения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаЛечения.Следующий() Цикл 				
				
				Если ЗначениеЗаполнено(ВыборкаЛечения.ЛечениеВрачаСотрудник) Тогда
					ПредставлениеСотрудника = ?(ЗначениеЗаполнено(ВыборкаЛечения.НаименованиеСокращенное), ВыборкаЛечения.НаименованиеСокращенное, ВыборкаЛечения.Наименование); 
				Иначе
					ПредставлениеСотрудника = "";
				КонецЕсли;
				
				ПредставлениеЛечения = "Лечение" + ?(ЗначениеЗаполнено(ПредставлениеСотрудника), " у " + ПредставлениеСотрудника, "");
				ПериодЛечения = ?(ЗначениеЗаполнено(ВыборкаЛечения.ЛечениеДатаНачала), "с " + Формат(ВыборкаЛечения.ЛечениеДатаНачала, "ДФ=dd.MM.yyyy"), "") 
				+ ?(ЗначениеЗаполнено(ВыборкаЛечения.ЛечениеДатаОкончания), " по " + Формат(ВыборкаЛечения.ЛечениеДатаОкончания, "ДФ=dd.MM.yyyy"), "");			
				
				ДетальныеЗаписи = ВыборкаЛечения.Выбрать();
				
				МассивДетальныхЗаписей = Новый Массив;
				Пока ДетальныеЗаписи.Следующий() Цикл 
					
					ПредставлениеПриема = Формат(ДетальныеЗаписи.Дата, "ДФ='dd MMMM yyyy'") 
					+ Формат(ДетальныеЗаписи.ВремяНачалаПриема, "ДФ=''' в'' ЧЧ:мм'") 
					+ ?(ДетальныеЗаписи.РезультатПриема <> 0, ", Прием окончен", ", Прием начат");
					
					СтруктураПриема = Новый Структура;
					СтруктураПриема.Вставить("УИДПриема"			, УникальныйИдентификатор(ДетальныеЗаписи.Ссылка));
					СтруктураПриема.Вставить("ПредставлениеВерхнее"	, ПредставлениеПриема);	
					СтруктураПриема.Вставить("ПредставлениеНижнее"	, ДетальныеЗаписи.ПолисМедСтрахования);
					МассивДетальныхЗаписей.Добавить(СтруктураПриема);
					
				КонецЦикла;
				
				ЛечениеПациента = Новый Структура;
				ЛечениеПациента.Вставить("ПредставлениеВерхнее"		, ПредставлениеЛечения);
				ЛечениеПациента.Вставить("МассивДетальныхЗаписей"	, МассивДетальныхЗаписей);				
				ЛечениеПациента.Вставить("ПредставлениеНижнее"		, ПериодЛечения);
				МассивПриемовПациента.Добавить(ЛечениеПациента);
				
			КонецЦикла;
			
		Иначе 
			
			ВыборкаЛечения = ВыборкаКурсовЛечения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			
			Пока ВыборкаЛечения.Следующий() Цикл
				
				ДетальныеЗаписи = ВыборкаЛечения.Выбрать();
				
				МассивДетальныхЗаписей = Новый Массив;
				Пока ДетальныеЗаписи.Следующий() Цикл
					
					ПредставлениеПриема = Формат(ДетальныеЗаписи.Дата, "ДФ='dd MMMM yyyy'") 
					+ Формат(ДетальныеЗаписи.ВремяНачалаПриема, "ДФ=''' в'' ЧЧ:мм'") 
					+ ?(ДетальныеЗаписи.РезультатПриема <> 0, ", Прием окончен", ", Прием начат");
					
					СтруктураПриема = Новый Структура;
					СтруктураПриема.Вставить("УИДПриема"			, УникальныйИдентификатор(ДетальныеЗаписи.Ссылка));
					СтруктураПриема.Вставить("ПредставлениеВерхнее"	, ПредставлениеПриема);
					СтруктураПриема.Вставить("ПредставлениеНижнее"	, ДетальныеЗаписи.ПолисМедСтрахования);
					МассивДетальныхЗаписей.Добавить(СтруктураПриема);
					
				КонецЦикла;
				
				ЛечениеПациента = Новый Структура;
				ЛечениеПациента.Вставить("ПредставлениеВерхнее"		, Неопределено);
				ЛечениеПациента.Вставить("МассивДетальныхЗаписей"	, МассивДетальныхЗаписей);
				ЛечениеПациента.Вставить("ПредставлениеНижнее"		, Неопределено);
				МассивПриемовПациента.Добавить(ЛечениеПациента);
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивВизитовКлиента", МассивПриемовПациента);
	
	Выборка = МассивРезультатов[1].Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Вставить("ДатаПервогоВизита"			, Выборка.ДатаПервогоПриема);
		СтруктураВозврата.Вставить("ДатаПоследнегоВизита"		, Выборка.ДатаПоследнегоПриема);
		СтруктураВозврата.Вставить("КоличествоВизитов"			, Выборка.КоличествоПриемов);
		СтруктураВозврата.Вставить("Комментарий"				, Выборка.КонтрагентКомментарий);
		СтруктураВозврата.Вставить("КонтрагентДатаРегистрации"	, Выборка.КонтрагентДатаРегистрации);
	КонецЕсли;
	
	Возврат ПолучитьСтруктуруОтвета(ВалидацияJSON(СтруктураВозврата));
	
КонецФункции

#КонецОбласти

#Область employee_working_days

// Функция - Get employee working days
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
//  ДатаНачала			 - 	 - 
//  ДатаОкончания		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция employee_working_days(СтруктурнаяЕдиница, Сотрудник, ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Событие.Дата, ДЕНЬ) КАК ДеньИнтервала
	|ПОМЕСТИТЬ ТаблицаЗанятыхДней
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Врач = &Сотрудник
	|	И Событие.Проведен
	|	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Событие.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СвободныеИнтервалыСотрудников.ДеньИнтервала КАК ДеньИнтервала,
	|	""РабочийДень"" КАК ТипДня
	|ИЗ
	|	РегистрСведений.СвободныеИнтервалыСотрудников КАК СвободныеИнтервалыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗанятыхДней КАК ТаблицаЗанятыхДней
	|		ПО СвободныеИнтервалыСотрудников.ДеньИнтервала = ТаблицаЗанятыхДней.ДеньИнтервала
	|ГДЕ
	|	СвободныеИнтервалыСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И СвободныеИнтервалыСотрудников.Сотрудник = &Сотрудник
	|	И СвободныеИнтервалыСотрудников.ДеньИнтервала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТаблицаЗанятыхДней.ДеньИнтервала ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗанятыхДней.ДеньИнтервала,
	|	""РабочийЗанятыйДень""
	|ИЗ
	|	ТаблицаЗанятыхДней КАК ТаблицаЗанятыхДней");
	
	Запрос.УстановитьПараметр("Сотрудник"			, Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачала"			, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"		, ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивВозврата = Новый Массив;
	
	Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл
		МассивВозврата.Добавить(Новый Структура("ДеньИнтервала, ТипДня", СтрокаТЗ.ДеньИнтервала, СтрокаТЗ.ТипДня));	
	КонецЦикла;
	
	Возврат ПолучитьСтруктуруОтвета(МассивВозврата);	
	
КонецФункции

#КонецОбласти

#Область reason_appointment

// Функция - Reason appointment
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция reason_appointment(СтруктурнаяЕдиница, Сотрудник) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПричиныЗаписи.Ссылка КАК Ссылка,
	|	ПричиныЗаписи.Представление КАК Представление,
	|	ПричиныЗаписи.НормаВремени КАК НормаВремени
	|ИЗ
	|	Справочник.ПричиныЗаписи КАК ПричиныЗаписи
	|ГДЕ
	|	ПричиныЗаписи.ПометкаУдаления = ЛОЖЬ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивПричинЗаписи = Новый Массив;
	Пока Выборка.Следующий() Цикл     
		СтруктураПричины = Новый Структура("УИДПричины, Представление, Длительность", УникальныйИдентификатор(Выборка.Ссылка), Выборка.Представление, Выборка.НормаВремени);
		МассивПричинЗаписи.Добавить(СтруктураПричины);
	КонецЦикла;
	
	Возврат ПолучитьСтруктуруОтвета(МассивПричинЗаписи);
	
КонецФункции

#КонецОбласти

#Область get_appointment_prescription

// Функция - Get appointment prescription
//
// Параметры:
//  Прием	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция get_appointment_prescription(Прием) Экспорт
	
	СтруктураДанныхПриема = Документы.Прием.ПолучитьИнформациюИзТекущегоПриема(Прием);
	МассивУслуг = ?(СтруктураДанныхПриема.Свойство("МассивУслуг"), СтруктураДанныхПриема.МассивУслуг, Новый Массив); 
	ДанныеПриема = ПолучитьДополнительныеданныеПриема(Прием);
	
	МассивУслугВозвр = Новый Массив;
	Для Каждого СтрокаМ Из МассивУслуг Цикл
		
		СтруктураУслуги = Новый Структура;
		СтруктураУслуги.Вставить("НоменклатураНаименование"	, СтрокаМ.НоменклатураНаименование);
		СтруктураУслуги.Вставить("УИДНоменклатуры"			, УникальныйИдентификатор(СтрокаМ.Номенклатура));
		СтруктураУслуги.Вставить("Количество"				, СтрокаМ.Количество);
		СтруктураУслуги.Вставить("КодУслуги"				, СтрокаМ.КодУслуги);
		СтруктураУслуги.Вставить("Зуб"						, ПолучитьИмяЗначенияПеречисления(СтрокаМ.Зуб));
		
		МассивУслугВозвр.Добавить(СтруктураУслуги);
		
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;			
	СтруктураВозврата.Вставить("МассивОбследований"	, ?(СтруктураДанныхПриема.Свойство("МассивОбследований"), СтруктураДанныхПриема.МассивОбследований, Новый Массив));	
	СтруктураВозврата.Вставить("МассивУслуг"		, МассивУслугВозвр);
	СтруктураВозврата.Вставить("ДанныеПриема"		, ДанныеПриема);
	
	Возврат ПолучитьСтруктуруОтвета(ВалидацияJSON(СтруктураВозврата));
	
КонецФункции

Функция ПолучитьДополнительныеданныеПриема(Прием)
	
	СтруктураВозврата = Новый Структура("Номер, Контрагент, Полис, Врач, Ассистент");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Прием.Номер КАК Номер,
	|	Прием.ПолисМедСтрахования.Наименование КАК Полис,
	|	Прием.Контрагент.Наименование КАК Контрагент,
	|	Прием.Сотрудник.Наименование КАК Врач,
	|	Прием.Ассистент.Наименование КАК Ассистент
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Прием);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);	
	КонецЕсли;
		
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область doctor_schedule

// Функция - Doctor schedule
//
// Параметры:
//  Сотрудник			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  ДатаНачала			 - 	 - 
//  ДатаОкончания		 - 	 - 
//  МассивИдСотрудников	 - 	 - 
//  МассивИдПомещений	 - 	 - 
//  Режим				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция doctor_schedule(Сотрудник, СтруктурнаяЕдиница, ДатаНачала, ДатаОкончания, МассивИдСотрудников, МассивИдПомещений, Режим) Экспорт
	
	СтруктураВозврата = Новый Структура("ГрафикКлиники, МассивСотрудников, МассивЗаписей");
	СтруктураВозврата.ГрафикКлиники = ?(Режим = "РасписаниеКлиникВрачейПриемов", РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница), Неопределено);
	
	Настройки = Новый Структура();
	ЗагрузитьНастройкиЖурналаЗаписи(СтруктурнаяЕдиница, Настройки, Сотрудник);
	РольСотрудника = ПолучитьРольСотрудника(Сотрудник);
	
	Если Режим <> "РасписаниеПриемов" Тогда
		
		Если ВерсияПОСерверАктуальна(Метаданные.Версия, "2.1.2.1") = Ложь Тогда 
			МассивСсылокСотрудников = Новый Массив;		
			Если РольСотрудника = Перечисления.РольПользователя.Регистратура ИЛИ РольСотрудника =  Перечисления.РольПользователя.Руководитель Тогда
				ТаблицаСотрудников = ПолучитьПодчиненныхСотрудников(Сотрудник, СтруктурнаяЕдиница);
				МассивСсылокСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
			ИначеЕсли РольПользователяУрезана(Сотрудник, РольСотрудника) Тогда
				МассивСсылокСотрудников.Добавить(Сотрудник);
			КонецЕсли;
		Иначе 
			МассивСсылокСотрудников = Справочники.Сотрудники.ПолучитьСотрудниковДляЖурналаЗаписи(СтруктурнаяЕдиница, Настройки,,, НачалоДня(ДатаНачала));
		КонецЕсли;
	
		ТаблицаСотрудниковПредставление = ПолучитьРасширенноеПредставлениеСотрудников(МассивСсылокСотрудников, Настройки);
		
		СтрокаТЗ = ТаблицаСотрудниковПредставление.Найти(Сотрудник, "Сотрудник");
		Если СтрокаТЗ <> Неопределено Тогда
			ИндексСтроки = ТаблицаСотрудниковПредставление.Индекс(СтрокаТЗ);
			ТаблицаСотрудниковПредставление.Сдвинуть(ИндексСтроки, -ИндексСтроки);
		КонецЕсли;
	
		ГрафикРаботыСотрудников = РегистрыСведений.ВремяРаботыСотрудниковПлан.ПолучитьПлановоеВремяРаботыСотрудника(ДатаНачала, ДатаОкончания, МассивСсылокСотрудников, СтруктурнаяЕдиница);
		
		МассивВрачей = Новый Массив;
		Для Каждого СтрокаТЧ из ТаблицаСотрудниковПредставление Цикл
			
			Представление = Справочники.Сотрудники.ПолучитьПредставлениеСотрудникаПоНастройкеОтображения(СтрокаТЧ, Настройки.ОтображениеСотрудника);
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(Представление);
			Если Настройки.ОтображениеДолжности = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантОтображать И ЗначениеЗаполнено(СтрокаТЧ.Должность) Тогда
				МассивСтрок.Добавить(СтрокаТЧ.Должность);
			КонецЕсли;
			
			СтруктураДобавления = Новый Структура;
			СтруктураДобавления.Вставить("УИД"			   , УникальныйИдентификатор(СтрокаТЧ.Сотрудник));
			СтруктураДобавления.Вставить("Значение"		   , СтрокаТЧ.Наименование);
			СтруктураДобавления.Вставить("Представление"   , МассивСтрок);
			СтруктураДобавления.Вставить("РольПользователя", ПолучитьРольПользователя(СтрокаТЧ.Роль));
			СтруктураДобавления.Вставить("Должность"	   , ?(ЗначениеЗаполнено(СтрокаТЧ.Должность), СокрЛП(СтрокаТЧ.Должность), "Без должности"));
			
			НайденныеСтроки = ГрафикРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
			
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				ГрафикРаботыСотрудника = Новый Массив;
				Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл		
					ГрафикРаботыСотрудника.Добавить(Новый Структура("ДатаНачала, ДатаОкончания", СтрокаТЗ.ДатаВремяНачала, СтрокаТЗ.ДатаВремяОкончания));
				КонецЦикла;
				СтруктураДобавления.Вставить("ГрафикРаботыСотрудника", ГрафикРаботыСотрудника);	
			Иначе
				СтруктураДобавления.Вставить("ГрафикРаботыСотрудника", Неопределено);
			КонецЕсли;
			
			МассивВрачей.Добавить(СтруктураДобавления);
			
		КонецЦикла;
		
		СтруктураВозврата.МассивСотрудников = МассивВрачей;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивИдПомещений) Тогда
		
		МассивПомещений = Новый Массив;		
		Для Каждого ИдПомещения Из МассивИдПомещений Цикл
			Если ИдПомещения <> "00000000-0000-0000-0000-000000000000" Тогда
				Ресурс = ПолучитьСсылкуОбъектаПоУИД(ИдПомещения, "Справочники", "Помещения");		
				Если Не ЗначениеЗаполнено(Ресурс) Тогда 
					Возврат ПолучитьСтруктуруОтвета(, 2004,, Ложь);
				КонецЕсли;
				МассивПомещений.Добавить(Ресурс);
			Иначе
				МассивПомещений.Добавить(Справочники.Помещения.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;
		
		ОтборПоИзмерению = "Ресурс";
		
	Иначе
		
		//Если ЗначениеЗаполнено(МассивИдСотрудников) Тогда
		//	
		//	МассивСотрудников = Новый Массив;		
		//	Для Каждого ИдСотрудника Из МассивИдСотрудников Цикл			
		//		Мастер = ПолучитьСсылкуОбъектаПоУИД(ИдСотрудника, "Справочники", "Сотрудники");		
		//		Если Не ЗначениеЗаполнено(Мастер) Тогда 
		//			Возврат ПолучитьСтруктуруОтвета(, 2003,, Ложь);
		//		КонецЕсли;
		//		МассивСотрудников.Добавить(Мастер);			
		//	КонецЦикла;
		//	
		//	Если РольСотрудника <> Перечисления.РольПользователя.Руководитель И МассивСотрудников.Найти(Сотрудник) = Неопределено Тогда
		//		МассивСотрудников.Добавить(Сотрудник);
		//	КонецЕсли;		
		//	
		//Иначе
		//	МассивСотрудников = ТаблицаСотрудниковПредставление.ВыгрузитьКолонку("Сотрудник");	
		//КонецЕсли;
		
	КонецЕсли;
	
	//МассивДанныхЗаполнения = РасширениеПланировщикаСервер.ДанныеЗаполненияПланировщикаВизитами(ДатаНачала, ДатаОкончания,,, МассивСотрудников, МассивПомещений, СтруктурнаяЕдиница, ОтборПоИзмерению,,, Настройки);
	МассивДанныхЗаполнения = РасширениеПланировщикаСервер.ДанныеЗаполненияПланировщикаВизитами(ДатаНачала, ДатаОкончания,,, МассивСсылокСотрудников, МассивПомещений, СтруктурнаяЕдиница, ОтборПоИзмерению,,, Настройки);	
	
	Если РольПользователяУрезана(Сотрудник, РольСотрудника) Тогда
		
		НастройкиМобильногоПриложенияСтоматологии = Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();	
		
		ВыводитьКомментарий = НастройкиМобильногоПриложенияСтоматологии <> Неопределено 
		И НастройкиМобильногоПриложенияСтоматологии.Свойство("ВыводитьВрачуКомментарий") 
		И НастройкиМобильногоПриложенияСтоматологии.ВыводитьВрачуКомментарий;
		
	Иначе
		ВыводитьКомментарий = Истина;
	КонецЕсли;
	
	МассивЗаписей = Новый Массив;
	Для Каждого СтрокаМ Из МассивДанныхЗаполнения Цикл                  
		
		СтрокаДанных = Новый Структура();
		СтрокаДанных.Вставить("УИДПриема"			, УникальныйИдентификатор(СтрокаМ.Событие));
		СтрокаДанных.Вставить("ДанныеКонтрагента"	, ВалидацияJSON(СтрокаМ.ДанныеКонтрагента));	
		СтрокаДанных.Вставить("ДатаВремяНачала"		, СтрокаМ.ДатаНачала); 
		СтрокаДанных.Вставить("ДатаВремяОкончания"	, СтрокаМ.ДатаОкончания);
		СтрокаДанных.Вставить("Сотрудник"           , УникальныйИдентификатор(СтрокаМ.Сотрудник));
		СтрокаДанных.Вставить("Помещение"           , УникальныйИдентификатор(СтрокаМ.Помещение));
		СтрокаДанных.Вставить("СтатусВизита"        , ПолучитьСтатусСобытия(СтрокаМ.Статус));
		СтрокаДанных.Вставить("Комментарий"         , ?(ВыводитьКомментарий, СтрЗаменить(СтрокаМ.Комментарий, Символы.ПС, " "), Неопределено));
		СтрокаДанных.Вставить("РазрешеноИзменение"  , СтрокаМ.РазрешеноИзменение);
		СтрокаДанных.Вставить("ПризнакЗаблокировано", СтрокаМ.ПризнакЗаблокировано);
		СтрокаДанных.Вставить("Текст"    			, СтрЗаменить(ПолучитьПредставлениеСобытия(Настройки, СтрокаМ, РольСотрудника, ВыводитьКомментарий), Символы.ПС, " "));			
		СтрокаДанных.Вставить("ЦветФона"            , ?(СтрокаМ.Резерв, ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаМ.ЦветФонаРезерва),,, Истина), СтрокаМ.ЦветФона));
		СтрокаДанных.Вставить("ЦветТекста"          , СтрокаМ.ЦветТекста);
		СтрокаДанных.Вставить("ПредставлениеУслугТекст"	, "");
		СтрокаДанных.Вставить("ВсегоПоВизиту"			, 0);
		СтрокаДанных.Вставить("Резерв"					, СтрокаМ.Резерв);
		СтрокаДанных.Вставить("СсылкаНаПрием"			, УникальныйИдентификатор(СтрокаМ.СсылкаНаПрием));		
		МассивЗаписей.Добавить(СтрокаДанных);
		
	КонецЦикла;
	
	СтруктураВозврата.Вставить("МассивЗаписей", МассивЗаписей);
	Возврат ПолучитьСтруктуруОтвета(СтруктураВозврата);
	
КонецФункции

// Процедура - Загрузить настройки журнала записи
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Настройки			 - 	 - 
//  ТекущийСотрудник	 - 	 - 
//
Процедура ЗагрузитьНастройкиЖурналаЗаписи(СтруктурнаяЕдиница, Настройки, ТекущийСотрудник)
	
	Настройки       = Новый Структура();
	ТаблицаНастроек = РегистрыСведений.НастройкиИнтерфейсов.ПолучитьНастройкиИнтерфейсаЖурналаЗаписи(СтруктурнаяЕдиница, ТекущийСотрудник);

	Для Каждого СтрокаТЧ Из ТаблицаНастроек Цикл
		
		Если СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеВремени Тогда
			Настройки.Вставить("ОтображениеВремени", Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантНеОтображать);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеСотрудника Тогда
			Настройки.Вставить("ОтображениеСотрудника", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеКлиента Тогда
			Настройки.Вставить("ОтображениеКлиента", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеТелефона Тогда
			Настройки.Вставить("ОтображениеТелефона", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеУслуги Тогда
			Настройки.Вставить("ОтображениеУслуги", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеРесурса Тогда
			Настройки.Вставить("ОтображениеРесурса", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеКомментария Тогда
			Настройки.Вставить("ОтображениеКомментария", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеДолжности Тогда
			Настройки.Вставить("ОтображениеДолжности", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеВозраста Тогда
			Настройки.Вставить("ОтображениеВозраста", СтрокаТЧ.Значение);	
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветНеПодтверждена Тогда
			Настройки.Вставить("ЦветНеПодтверждена"      , ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение),,,Истина));
			Настройки.Вставить("ЦветТекстаНеПодтверждена", ПолучитьЦветТекстаПоЦветуФона(Настройки.ЦветНеПодтверждена));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПодтверждена Тогда
			Настройки.Вставить("ЦветПодтверждена"      , ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение),,,Истина));
			Настройки.Вставить("ЦветТекстаПодтверждена", ПолучитьЦветТекстаПоЦветуФона(Настройки.ЦветПодтверждена));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНачат Тогда
			Настройки.Вставить("ЦветПриемНачат"      , ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение),,,Истина));
			Настройки.Вставить("ЦветТекстаПриемНачат", ПолучитьЦветТекстаПоЦветуФона(Настройки.ЦветПриемНачат));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОкончен Тогда
			Настройки.Вставить("ЦветПриемОкончен"      , ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение),,,Истина));
			Настройки.Вставить("ЦветТекстаПриемОкончен", ПолучитьЦветТекстаПоЦветуФона(Настройки.ЦветПриемОкончен));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемОтменен Тогда
			Настройки.Вставить("ЦветПриемОтменен"      , ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение),,,Истина));
			Настройки.Вставить("ЦветТекстаПриемОтменен", ПолучитьЦветТекстаПоЦветуФона(Настройки.ЦветПриемОтменен));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПриемНеСостоялся Тогда
			Настройки.Вставить("ЦветПриемНеСостоялся"  , ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение),,,Истина));
			Настройки.Вставить("ЦветТекстаПриемНеСостоялся", ПолучитьЦветТекстаПоЦветуФона(Настройки.ЦветПриемНеСостоялся));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ЦветПациентОжидает Тогда
			Настройки.Вставить("ЦветПациентОжидает"  	 , ПолучитьRGBЦвет(ЗначениеИзСтрокиВнутр(СтрокаТЧ.Значение),,,Истина));
			Настройки.Вставить("ЦветТекстаПациентОжидает", ПолучитьЦветТекстаПоЦветуФона(Настройки.ЦветПациентОжидает));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеТекущегоДня Тогда
			Настройки.Вставить("ОтображениеТекущегоДня", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеФильтров Тогда
			Настройки.Вставить("ОтображениеФильтров", ?(ЗначениеЗаполнено(СтрокаТЧ.Значение), СтрокаТЧ.Значение, Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеФильтровВариант1));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.РазмерШрифта Тогда
			Настройки.Вставить("РазмерШрифта", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеКоличестваСотрудников Тогда
			Настройки.Вставить("ОтображениеКоличестваСотрудников", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ИнтервалЗаписи Тогда
			Настройки.Вставить("ИнтервалЗаписи", СтрокаТЧ.Значение);
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеМедКарты Тогда
			Настройки.Вставить("ОтображениеМедКарты", СтрокаТЧ.Значение); 
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеЗагруженностиСотрудников Тогда
			Настройки.Вставить("ОтображениеЗагруженностиСотрудников", СтрокаТЧ.Значение);  
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеСортировка Тогда
			Настройки.Вставить("ОтображениеСортировка", ?(ЗначениеЗаполнено(СтрокаТЧ.Значение), СтрокаТЧ.Значение, Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеСортировкаВариант2));
		ИначеЕсли СтрокаТЧ.Настройка = ПланыВидовХарактеристик.НастройкиИнтерфейсов.ОтображениеФотографийСотрудников Тогда
			Настройки.Вставить("ОтображениеФотографийСотрудников", СтрокаТЧ.Значение); 	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить представление события
//
// Параметры:
//  Настройки		 - 	 - 
//  СтрокаТЗСобытий	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеСобытия(Настройки, Знач СтрокаТЗСобытий, Роль, ВыводитьКомментарий)
	
	ПредставлениеСобытия = "";
	ПредставлениеКонтрагента = "";
	ВариантНастройкиНеОтображать = Перечисления.ОтображенияЭлементовВЖурналеЗаписи.ОтображениеВариантНеОтображать;
	Если Настройки.ОтображениеКлиента <> ВариантНастройкиНеОтображать Тогда
		Документы.Событие.ПолучитьПредставлениеКлиентаВизита(СтрокаТЗСобытий.ДанныеКонтрагента, Настройки.ОтображениеКлиента, ПредставлениеКонтрагента);
		Если ПредставлениеКонтрагента <> "" Тогда
			ПредставлениеСобытия = ПредставлениеКонтрагента;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТЗСобытий.ДанныеКонтрагента.НомерМедКарты) 
		И Настройки.ОтображениеМедКарты <> ВариантНастройкиНеОтображать Тогда  
		ПредставлениеСобытия = ПредставлениеСобытия + " №" + СтрокаТЗСобытий.ДанныеКонтрагента.НомерМедКарты;
	КонецЕсли;
	
	Если Настройки.ОтображениеВозраста <> ВариантНастройкиНеОтображать
		И ЗначениеЗаполнено(СтрокаТЗСобытий.ДанныеКонтрагента.ДатаРождения) Тогда
		
		ПредставлениеВозраста = Формат(СтрокаТЗСобытий.ДанныеКонтрагента.ДатаРождения, "ДФ=dd.MM.yyyy") + 
								 " (" + ОбщегоНазначенияСтоматология.ВозвратитьВозрастСтрокой(СтрокаТЗСобытий.ДанныеКонтрагента.ДатаРождения) + ")";
		ПредставлениеСобытия = ПредставлениеСобытия + ?(ЗначениеЗаполнено(ПредставлениеСобытия) И ЗначениеЗаполнено(ПредставлениеВозраста), ", ", "") + ПредставлениеВозраста;  
		
	КонецЕсли;
	
	ПредставлениеТелефон = СтрокаТЗСобытий.ДанныеКонтрагента.Телефон;
	
	Если ЗначениеЗаполнено(ПредставлениеТелефон) И Настройки.ОтображениеТелефона <> ВариантНастройкиНеОтображать И РольПользователяУрезана(Неопределено, Роль) = Ложь Тогда 
		
		МассивТелефонов = СтрРазделить(ПредставлениеТелефон, ",", Ложь);
		
		Для каждого Телефон Из МассивТелефонов Цикл
			ПредставлениеСобытия = ПредставлениеСобытия + Символы.ПС + " " + Телефон;	
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТЗСобытий.Комментарий) И Настройки.ОтображениеКомментария <> ВариантНастройкиНеОтображать И ВыводитьКомментарий Тогда
		ПредставлениеСобытия = ПредставлениеСобытия + ", комментарий: " + СтрокаТЗСобытий.Комментарий; 	
	КонецЕсли;
	
	ПредставлениеСобытия = ПредставлениеСобытия + ?(ЗначениеЗаполнено(ПредставлениеСобытия), Символы.ПС, "");
	
	Возврат СокрЛП(СтрСоединить(СтрРазделить(ПредставлениеСобытия, Символы.ВК))) + ?(Не ЗначениеЗаполнено(ПредставлениеСобытия), СтрокаТЗСобытий.Текст, "");

КонецФункции

#КонецОбласти

#КонецОбласти

#Область POST_v1

#Область PostAuth 

// Функция - Auth
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  Телефон			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция PostAuth(ВнешняяСистема, Телефон, КодПодтверждения, ТипАвторизации, ЭлПочта) Экспорт
	
	// ШаблонСообщения = Справочники.ШаблоныСообщений.КодПодтверждения.Содержание;
	ШаблонСообщения = "";
	Если ШаблонСообщения = "" Тогда
		Сообщение 	= "Ваш код подтверждения: " + КодПодтверждения;
	ИначеЕсли СтрНайти(ШаблонСообщения, "{Код подтверждения}") = 0 Тогда
		Сообщение 	= ШаблонСообщения + " " + КодПодтверждения;
	ИначеЕсли СтрНайти(ШаблонСообщения, "{Код подтверждения}") <> 0 Тогда		
		Сообщение	= СтрЗаменить(ШаблонСообщения, "{Код подтверждения}", Строка(КодПодтверждения));
	КонецЕсли;
	
	Телефон = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(Телефон);
	
	РезультатОтправки = СоздатьРассылкуСообщенийИОтправитьКодПодтверждения(ТипАвторизации, Телефон, Неопределено, Сообщение, ЭлПочта);
	
	Если РезультатОтправки <> Неопределено Тогда
		Возврат РезультатОтправки;
	Иначе
		Возврат ПолучитьСтруктуруОтвета(Новый Структура("Result", Истина)); 
	КонецЕсли;
	
КонецФункции

// Функция возвращает запись из регистра по номеру телефона клиента
//
Функция ПолучитьСотрудникаПоНомеруТелефона(НомерТелефона)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиВнешнихСистем.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.КлючиВнешнихСистем КАК КлючиВнешнихСистем
	|ГДЕ
	|	КлючиВнешнихСистем.НомерТелефона ПОДОБНО &НомерТелефона
	|	И КлючиВнешнихСистем.Использовать
	|	И КлючиВнешнихСистем.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.МобильноеПриложениеУправляющего)");
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Результат.Следующий(), Результат.Клиент, Неопределено);
	
КонецФункции

// Функция - Создать рассылку сообщений и отправить код подтверждения
//
// Параметры:
//  ТипАвторизации		 - 	 - 
//  Контрагент			 - 	 - 
//  НомерТелефона		 - 	 - 
//  Фамилия				 - 	 - 
//  Имя					 - 	 - 
//  Отчество			 - 	 - 
//  email				 - 	 - 
//  ДатаРождения		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Сообщение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьРассылкуСообщенийИОтправитьКодПодтверждения(ТипАвторизации, НомерТелефона, СтруктурнаяЕдиница, Сообщение, ЭлПочта)
	
	ОписаниеОшибки = "";
	Сотрудник	   = ПолучитьСотрудникаПоНомеруТелефона(?(СтрДлина(НомерТелефона) > 10, Сред(НомерТелефона, СтрДлина(НомерТелефона) - 9, 10), НомерТелефона));
	
	ТипАвторизацииМессенджер = ТипАвторизации <> Неопределено И НРег(ТипАвторизации) = "whats_app";
	ТипАвторизацииПочта      = ТипАвторизации <> Неопределено И НРег(ТипАвторизации) = "email"; 
	
	Если ТипАвторизацииМессенджер Тогда
		
		Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
			Возврат ПолучитьСтруктуруОтвета(, 2003, ОписаниеОшибки, Ложь);
		КонецЕсли;
		
		РезультатОтправки = ОтправитьСообщениеВМессенджер(Сотрудник, НомерТелефона, Сообщение, СтруктурнаяЕдиница, ОписаниеОшибки);
		
		Если НЕ РезультатОтправки Тогда
			Возврат ПолучитьСтруктуруОтвета(, 2060, ОписаниеОшибки, Ложь);
		КонецЕсли;
		
	ИначеЕсли ТипАвторизацииПочта Тогда
		
		Если Не ЗначениеЗаполнено(ЭлПочта) Тогда // Не УправлениеЭлектроннойПочтой.ЭлектроннаяПочтаВведенаВерно(ЭлПочта)
			Возврат ПолучитьСтруктуруОтвета(, 2061, "Не передана электронная почта", Ложь);	
		КонецЕсли;
		
		УчетнаяЗаписьЭлПочты = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		
		Если УчетнаяЗаписьЭлПочты.ИспользоватьДляОтправки = Ложь Тогда
			Возврат ПолучитьСтруктуруОтвета(, 2061, "Не заполнена учетная запись", Ложь);	
		КонецЕсли;
		
		РезультатОтправки = ОтправитьПисьмоНаПочту(Сотрудник, ЭлПочта, Сообщение, СтруктурнаяЕдиница, УчетнаяЗаписьЭлПочты, ОписаниеОшибки);
		
		Если НЕ РезультатОтправки Тогда
			Возврат ПолучитьСтруктуруОтвета(, 2061, ?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, ""), Ложь);
		КонецЕсли;
		
	Иначе				
		
		Если Не ЗначениеЗаполнено(Константы.СервисSMSРассылкиПоУмолчанию.Получить()) Тогда		
			Возврат ПолучитьСтруктуруОтвета(, 1043,, Ложь);		
		КонецЕсли;
		
		ОписаниеОшибки = ОтправитьSMSСообщение(НомерТелефона, Сообщение, Сотрудник);
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			Возврат ПолучитьСтруктуруОтвета(1042, ОписаниеОшибки);
		КонецЕсли;			
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция отправляет SMS-сообщение 
// 
Функция ОтправитьSMSСообщение(Телефон, Содержание, Сотрудник)
	
	// ПОПЫТКА
	//	
	//	SMSОтправка = Документы.СообщениеИсходящее.СоздатьДокумент();
	//	SMSОтправка.Дата 			 	= ТекущаяДатаСеанса();
	//	SMSОтправка.ВидОперации 		= Перечисления.ВидыОперацийОтправки.ОтправкаПолучателю;
	//	SMSОтправка.СервисSMSРассылки 	= Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	//	SMSОтправка.ОтправитьНемедленно = Истина;
	//	SMSОтправка.Содержание 			= Содержание;
	//	SMSОтправка.СтруктурнаяЕдиница  = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	//	SMSОтправка.АвторДокумента		= ПараметрыСеанса.ТекущийПользователь;
	//	SMSОтправка.Тип                 = Перечисления.ТипыСобытий.SMS;
	//	
	//	НоваяСтрока 			  = SMSОтправка.ПолучателиSMS.Добавить();
	//	НоваяСтрока.НомерТелефона = Телефон;
	//	НоваяСтрока.Получатель 	  = Сотрудник;
	//	SMSОтправка.Записать(РежимЗаписиДокумента.Проведение);
	//	
	// ИСКЛЮЧЕНИЕ
	//	
	//	SMSОтправка.Записать(РежимЗаписиДокумента.Запись);		
	//	ОписаниеОшибки = ОписаниеОшибки();
	//	
	//	Возврат ОписаниеОшибки;
	//	
	// КОНЕЦПОПЫТКИ;
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Отправить сообщение в мессенджер
//
// Параметры:
//  Контрагент		 - 	 - 
//  НомерТелефона	 - 	 - 
//  Сообщение		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтправитьСообщениеВМессенджер(Контрагент, НомерТелефона, Содержание, СтруктурнаяЕдиница, ОписаниеОшибки)
		
	ВнешняяСистемаМессенджера = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.GreenApi,, СтруктурнаяЕдиница);
	
	Если Не ЗначениеЗаполнено(ВнешняяСистемаМессенджера) Тогда
		ОписаниеОшибки = "Не найдена внешняя система";
		Возврат Ложь;
	КонецЕсли;
		
	ПолучателиСообщения = Новый Массив();
	ПолучателиСообщения.Добавить(Новый Структура("Получатель, НомерТелефона", Контрагент, НомерТелефона));
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"          , ПолучателиСообщения);
	ПараметрыРассылки.Вставить("Содержание"          , Содержание);
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница"  , СтруктурнаяЕдиница); 
	ПараметрыРассылки.Вставить("ВнешняяСистема"      , ВнешняяСистемаМессенджера);
	ПараметрыРассылки.Вставить("ОтправкаMessenger"	 , Истина);
	ПараметрыРассылки.Вставить("ИнициироватьОтправку", Истина);	
	ПараметрыРассылки.Вставить("ОтправитьНемедленно" , Истина);
		
	Возврат Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
КонецФункции

// Функция - Отправить письмо на почту
//
// Параметры:
//  Контрагент			 - 	 - 
//  email				 - 	 - 
//  Сообщение			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  ОписаниеОшибки		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтправитьПисьмоНаПочту(Контрагент, email, Сообщение, СтруктурнаяЕдиница, УчетнаяЗапись, ОписаниеОшибки)
	
	 СтруктураДокумента = Новый Структура();
	 СтруктураДокумента.Вставить("Дата"						, ТекущаяДатаСеанса());
	 СтруктураДокумента.Вставить("УчетнаяЗапись"			, УчетнаяЗапись);
	 СтруктураДокумента.Вставить("ОтправительПредставление"	, УчетнаяЗапись.АдресЭлектроннойПочты);
	 СтруктураДокумента.Вставить("Тема"						, "Ваш код подтверждения");
	 СтруктураДокумента.Вставить("НазначениеЗадачи"			, "ОтправкаКодаПодтверждения");
	 СтруктураДокумента.Вставить("Контрагент"				, Контрагент);
	 СтруктураДокумента.Вставить("ТекстHTML"				, Сообщение);
	 СтруктураДокумента.Вставить("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
	 СтруктураДокумента.Вставить("ТипТекста"				, Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	 СтруктураДокумента.Вставить("Важность"					, Перечисления.ВариантыВажностиЗадачи.Обычная);
	 СтруктураДокумента.Вставить("ЕстьВложения"				, Ложь);
	 СтруктураДокумента.Вставить("АвторДокумента"			, ПараметрыСеанса.ТекущийПользователь);
	
	 СообщениеИсходящееОбъект	= Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	 ЗаполнитьЗначенияСвойств(СообщениеИсходящееОбъект, СтруктураДокумента);
	
	 НовыйПолучатель				= СообщениеИсходящееОбъект.ПолучателиПисьма.Добавить();
	 НовыйПолучатель.Контакт    	= Контрагент;
	 НовыйПолучатель.Адрес		    = email;
	 НовыйПолучатель.Представление	= ?(ЗначениеЗаполнено(Контрагент), Строка(Контрагент), Неопределено);
	
	 Результат = Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(СообщениеИсходящееОбъект, ОписаниеОшибки);	
	
	Возврат Результат; // Результат;
	
КонецФункции

#КонецОбласти

#Область appointment

// Функция - Создать визит
//
// Параметры:
//  Сотрудник			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  ДатаНачала			 - 	 - 
//  ДатаОкончания		 - 	 - 
//  ПараметрыJSON		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция appointment(ПараметрыJSON, СтруктурнаяЕдиница, Автор, ВнешняяСистема) Экспорт
	
	Статус			= ?(ПараметрыJSON.Свойство("Статус"), Перечисления.СтатусыСобытия[ПараметрыJSON.Статус], Неопределено);
	УИДПриема		= ?(ПараметрыJSON.Свойство("УИДПриема"), ПараметрыJSON.УИДПриема, Неопределено);
	ДокументСобытие	= ?(ЗначениеЗаполнено(УИДПриема), Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДПриема)), Неопределено);
	ПереданПрием	= ЗначениеЗаполнено(ДокументСобытие);
	УИДВрача		= ?(ПараметрыJSON.Свойство("УИДВрача"), ПараметрыJSON.УИДВрача, Неопределено);
	Сотрудник		= ?(ЗначениеЗаполнено(УИДВрача), Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДВрача)), Автор);
	
	#Область ОтменитьВизит
	
	Если ПереданПрием И Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда
		
		Если Не ДокументСобытие.Проведен 
			ИЛИ НачалоДня(ДокументСобытие.Дата) <> НачалоДня(ТекущаяДатаСеанса()) 
			ИЛИ ДокументСобытие.Статус = Перечисления.СтатусыСобытия.ПриемОкончен
			ИЛИ ДокументСобытие.Статус = Перечисления.СтатусыСобытия.ПриемНачат Тогда			
			
			Возврат ПолучитьСтруктуруОтвета(, 2038,, Ложь);			
			
		КонецЕсли;
		
		ОбъектСобытие		= ДокументСобытие.ПолучитьОбъект();
		ОбъектСобытие.Статус	= Статус;
		
		Если ПараметрыJSON.Свойство("ПричинаОтменыУИД") Тогда
			ПричинаОтменыЗаписи = Справочники.ПричиныОтменыЗаписи.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыJSON.ПричинаОтменыУИД));
		Иначе
			ПричинаОтменыЗаписи = Справочники.ПричиныОтменыЗаписи.НайтиПоНаименованию("Отмена с мобильного приложения клиники");
		КонецЕсли;
		
		ОбъектСобытие.ПричинаОтмены = ?(ЗначениеЗаполнено(ПричинаОтменыЗаписи), ПричинаОтменыЗаписи, СоздатьПричинуОтменыЗаписи());
		
		//Если Автор = Сотрудник Тогда
		//	ОбъектСобытие.ДополнительныеСвойства.Вставить("НеОтправлятьПушУведомление", Истина);
		//КонецЕсли;
		ОбъектСобытие.ДополнительныеСвойства.Вставить("АвторЗаписи", Автор);
		
		Попытка
			ОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Возврат ПолучитьСтруктуруОтвета(, 2036, ОписаниеОшибки(), Ложь);
		КонецПопытки;
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Статус", ПолучитьСтатусСобытия(ОбъектСобытие.Статус));
		
		Возврат ПолучитьСтруктуруОтвета(СтруктураВозврата);
		
	КонецЕсли;
	
	#КонецОбласти
		
	ДатаНачала			=  ?(ПараметрыJSON.Свойство("ДатаНачала"), ПараметрыJSON.ДатаНачала, Неопределено);
	Комментарий			= ?(ПараметрыJSON.Свойство("Комментарий"), ПараметрыJSON.Комментарий, Неопределено);
	УИДПациента			= ?(ПараметрыJSON.Свойство("УИДПациента"), ПараметрыJSON.УИДПациента, Неопределено); 
	Длительность		= ?(ПараметрыJSON.Свойство("Длительность"), ПараметрыJSON.Длительность, Неопределено);
	ПричинаЗаписиУИД	= ?(ПараметрыJSON.Свойство("ПричинаЗаписиУИД"), ПараметрыJSON.ПричинаЗаписиУИД, Неопределено);
	УИДПолиса			= ?(ПараметрыJSON.Свойство("УИДПолиса"), ПараметрыJSON.УИДПолиса, Неопределено);
	ИмяПациента			= ?(ПараметрыJSON.Свойство("ИмяПациента"), ПараметрыJSON.ИмяПациента, Неопределено);
	ТелефонПациента		= ?(ПараметрыJSON.Свойство("ТелефонПациента"), ПараметрыJSON.ТелефонПациента, Неопределено);
	МассивМеток			= ?(ПараметрыJSON.Свойство("МассивМеток"), ПараметрыJSON.МассивМеток,  Неопределено);
	
	Пациент				= ?(ЗначениеЗаполнено(УИДПациента), Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДПациента)), Неопределено);	
	ПричинаЗаписи		= ?(ЗначениеЗаполнено(ПричинаЗаписиУИД), Справочники.ПричиныЗаписи.ПолучитьСсылку(Новый УникальныйИдентификатор(ПричинаЗаписиУИД)), Неопределено);
	ПолисМедСтрахования	= ?(ЗначениеЗаполнено(УИДПолиса), Справочники.ПолисыМедицинскогоСтрахования.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДПолиса)), Неопределено);

	Если Документы.Событие.НаличиеСобытийЗаУказаныйПериод(ДатаНачала, ДатаНачала+Длительность*60, СтруктурнаяЕдиница, Сотрудник,, ДокументСобытие) = Истина Тогда 
		Возврат ПолучитьСтруктуруОтвета(, 1046,, Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяПациента) И ЗначениеЗаполнено(ТелефонПациента) И Не ЗначениеЗаполнено(Пациент) Тогда
		
		НовыйКонтрагент = СоздатьНовогоКлиента(ИмяПациента, ТелефонПациента, Сотрудник);
		
		Попытка
			НовыйКонтрагент.Записать();
			Пациент = НовыйКонтрагент.Ссылка;
		Исключение
			СистемнаяОшибка = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("Http-сервисы.MobileApp.CreateUpdateVisit", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при записи клиента: " + СистемнаяОшибка);
			Возврат ПолучитьСтруктуруОтвета(, 2040, СистемнаяОшибка, Ложь);
		КонецПопытки;
		
	КонецЕсли;
	
	Если Пациент.Теги.НайтиСтроки(Новый Структура("Тег", Справочники.Теги.ЗапретитьОбслуживание)).Количество() > 0 Тогда // Клиент.Теги.НайтиСтроки(Новый Структура("Тег", Справочники.Теги.ЗапретитьОнлайнЗапись)).Количество() > 0 ИЛИ 	
		Возврат ПолучитьСтруктуруОтвета(, 2029,, Ложь);
	КонецЕсли;
		
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата", ДатаНачала);
	ПараметрыЗаполнения.Вставить("Контрагент", Пациент);
	ПараметрыЗаполнения.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	ПараметрыЗаполнения.Вставить("ДатаОкончания", ДатаНачала+Длительность*60);
	ПараметрыЗаполнения.Вставить("Врач", Сотрудник);
		
	Если ЗначениеЗаполнено(Статус) Тогда
		ПараметрыЗаполнения.Вставить("Статус", Статус);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолисМедСтрахования) Тогда
		ПараметрыЗаполнения.Вставить("ПолисМедСтрахования", ПолисМедСтрахования);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ПараметрыЗаполнения.Вставить("Комментарий", Комментарий);
	КонецЕсли; 
	
	Если Не ПереданПрием Тогда
		
		ПараметрыЗаполнения.Вставить("ДатаСоздания", ТекущаяДатаСеанса());
		ПараметрыЗаполнения.Вставить("АвторДокумента", Сотрудник);
		ПараметрыЗаполнения.Вставить("ТипСобытия", Перечисления.ТипыСобытий.ПредварительнаяЗапись);
		ПараметрыЗаполнения.Вставить("ИсточникЗаписи", api_v1.ПолучитьИсточникЗаписи(ВнешняяСистема)); 		
		ВидЦенСотрудника = РегистрыСведений.НастройкиСотрудников.ПолучитьВидЦенСотрудника(СтруктурнаяЕдиница, Сотрудник);
		ВидЦенСотрудника = ?(ЗначениеЗаполнено(ВидЦенСотрудника), ВидЦенСотрудника, Справочники.ВидыЦен.Розничная);		
		ПараметрыЗаполнения.Вставить("ВидЦен", ВидЦенСотрудника);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ПараметрыЗаполнения.Вставить("Комментарий", Комментарий);
	КонецЕсли; 
		
	ТаблицаУслуг = Новый ТаблицаЗначений;
	ТаблицаУслуг.Колонки.Добавить("ДатаНачала");
	ТаблицаУслуг.Колонки.Добавить("ДатаОкончания");
	ТаблицаУслуг.Колонки.Добавить("Номенклатура");
	ТаблицаУслуг.Колонки.Добавить("НормаВремени");
	ТаблицаУслуг.Колонки.Добавить("ПризнакЗаблокированно");
	ТаблицаУслуг.Колонки.Добавить("ПричинаЗаписи");
	ТаблицаУслуг.Колонки.Добавить("Сотрудник");
	ТаблицаУслуг.Колонки.Добавить("Цена");
	
	НоваяСтрока = ТаблицаУслуг.Добавить();
	НоваяСтрока.ДатаНачала = ДатаНачала;
	НоваяСтрока.ДатаОкончания = ДатаНачала+Длительность*60;
	НоваяСтрока.НормаВремени = Длительность;
	НоваяСтрока.ПричинаЗаписи = ПричинаЗаписи;
	НоваяСтрока.Сотрудник = Сотрудник;
	
	ПараметрыЗаполнения.Вставить("Услуги", ТаблицаУслуг);	
		
	ОбъектСобытие = СформироватьИЛИОбновитьВизит(ДокументСобытие, ПараметрыЗаполнения);
	
	Попытка
		
		ОбъектСобытие.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		
		 //Если Автор = Сотрудник Тогда
		 //   ОбъектСобытие.ДополнительныеСвойства.Вставить("НеОтправлятьПушУведомление", Истина);
		 //КонецЕсли; 
		 
		ОбъектСобытие.ДополнительныеСвойства.Вставить("АвторЗаписи", Автор);
		ОбъектСобытие.ДополнительныеСвойства.Вставить("Пользователь", Сотрудник);		
		ПроверкаПройдена = ОбъектСобытие.ПроверитьЗаполнение();			
		ОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
		ДокументСобытие = ОбъектСобытие.Ссылка;                                                                                                                                                                              
		
		РегистрыСведений.ВремяРаботыСотрудниковПлан.УстановкаРабочегоВремениСотрудника(СтруктурнаяЕдиница, Сотрудник, Истина, ДокументСобытие.Дата, ДокументСобытие.ДатаОкончания, Перечисления.ТипыРабочегоВремени.Рабочее);	
		
		Если ЗначениеЗаполнено(МассивМеток) Тогда
			
			НаборЗаписей = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Клиент.Установить(ДокументСобытие);
			
			Для Каждого Метка ИЗ МассивМеток Цикл			
				НоваяМетка				= НаборЗаписей.Добавить();
				НоваяМетка.Период       = ТекущаяДатаСеанса();
				НоваяМетка.Клиент       = ДокументСобытие;
				НоваяМетка.Метка        = Справочники.Метки.ПолучитьСсылку(Новый УникальныйИдентификатор(Метка));
				НоваяМетка.Автор        = Сотрудник;
				НоваяМетка.Активна      = Истина;			
			КонецЦикла;
			
			Попытка
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ТекстОшибки = ИзвлечьОписаниеОшибки(ТекстОшибки);		
		Возврат ПолучитьСтруктуруОтвета(, 2036, ТекстОшибки, Ложь);		
	КонецПопытки;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("УИДПриема", УникальныйИдентификатор(ДокументСобытие));
	СтруктураВозврата.Вставить("Статус"	  , ПолучитьСтатусСобытия(ДокументСобытие.Статус));
	
	Возврат ПолучитьСтруктуруОтвета(СтруктураВозврата);
	
Конецфункции

// Функция - Сформировать визит
//
// Параметры:
//  Клиент							 - 	 - 
//  ТаблицаЗначенийЗаписи			 - 	 - 
//  СтруктурнаяЕдиница				 - 	 - 
//  ТребуетсяПредоплата				 - 	 - 
//  ВнешняяСистема					 - 	 - 
//  ЗаКакоеВремяНапоминатьОЗаписи	 - 	 - 
//  РекламныйИсточник				 - 	 - 
//  КомментарийЗаписи				 - 	 - 
//  ИсточникИнформации				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьИЛИОбновитьВизит(ДокументСобытие, ПараметрыЗаполнения)
	
	 Если ЗначениеЗаполнено(ДокументСобытие) Тогда
		ОбъектСобытие = ДокументСобытие.ПолучитьОбъект();
		ОбъектСобытие.Услуги.Очистить();
	 Иначе
	 	ОбъектСобытие = Документы.Событие.СоздатьДокумент();	
	 КонецЕсли;
	
	 ЗаполнитьЗначенияСвойств(ОбъектСобытие, ПараметрыЗаполнения);
	
	 ОбъектСобытие.Услуги.Загрузить(ПараметрыЗаполнения.Услуги);
		
	Возврат ОбъектСобытие;
	
КонецФункции

#КонецОбласти

#Область sync_appointment

// Функция - Sync document visit
//
// Параметры:
//  Параметры			 - 	 - 
//  Визит				 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция sync_appointment(ПараметрыJSON, СтруктурнаяЕдиница, Автор) Экспорт
	
	УидСобытия = ПараметрыJSON.УИДСобытия;	
	Событие = ?(ЗначениеЗаполнено(УидСобытия), Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор(УидСобытия)), Неопределено);			
	
	Если Не ЗначениеЗаполнено(Событие) Тогда
		Возврат ПолучитьСтруктуруОтвета(, 2037,, Ложь);		
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("РазрешенаЗапись, ОписаниеЗапрета", Ложь, Неопределено);
	ДатаНачала		= ПараметрыJSON.ДатаНачала;
	ДатаОкончания	= ПараметрыJSON.ДатаОкончания; 
	Сотрудник		= ?(ЗначениеЗаполнено(ПараметрыJSON.Сотрудник), Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыJSON.Сотрудник)), Неопределено);
	Помещение		= ?(ЗначениеЗаполнено(ПараметрыJSON.Помещение), Справочники.Помещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыJSON.Помещение)), Неопределено);
		
	Если Документы.Событие.НаличиеСобытийЗаУказаныйПериод(ДатаНачала, ДатаОкончания, СтруктурнаяЕдиница, Сотрудник, Помещение, Событие) = Ложь Тогда 
		
		УслугиНЕДоступныДляСотрудника = ПроверитьДоступностьУслугСотрудникомПоСобытию(Сотрудник, СтруктурнаяЕдиница, Событие);
		
		Если УслугиНЕДоступныДляСотрудника.Количество() = 0 Тогда		
			ВыполненоУспешно = Ложь;
			ОписаниеОшибки = "";
			Документы.Событие.ПеренестиПредварительнуюЗапись(Событие, Сотрудник, Помещение, ДатаНачала, ДатаОкончания, Истина, СтруктураВозврата.РазрешенаЗапись, СтруктураВозврата.ОписаниеЗапрета, Автор);
			
			Если СтруктураВозврата.РазрешенаЗапись ТОгда 
				РегистрыСведений.ВремяРаботыСотрудниковПлан.УстановкаРабочегоВремениСотрудника(СтруктурнаяЕдиница, Сотрудник, Истина, ДатаНачала, ДатаОкончания, Перечисления.ТипыРабочегоВремени.Рабочее);
			КонецЕсли;	
			
		Иначе
			СтруктураВозврата.ОписаниеЗапрета = "Одна или несколько услуг недоступна для сотрудника";	
		КонецЕсли;
		
	Иначе
		СтруктураВозврата.ОписаниеЗапрета = "Выбранный интервал уже занят";
	КонецЕсли;
	
	Возврат ПолучитьСтруктуруОтвета(СтруктураВозврата);
	
КонецФункции

// Функция - Проверить доступные услуги сотрудника
//
Функция ПроверитьДоступностьУслугСотрудникомПоСобытию(Сотрудник, СтруктурнаяЕдиница, Событие)
	
	МассивНедоступныхУслуг = Новый Массив;
	
	Для Каждого Элемент Из Событие.Услуги Цикл
		ДоступнаяУслуга = РегистрыСведений.УслугиСотрудника.УслугаДоступнаДляСотрудника(Элемент.Номенклатура, Сотрудник, СтруктурнаяЕдиница);
		Если НЕ ДоступнаяУслуга И ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
			МассивНедоступныхУслуг.Добавить(Элемент.Номенклатура.Наименование);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивНедоступныхУслуг;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область DELETE_v1
#КонецОбласти

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

// Функция, возвращает структуру возврата ошибки. 
//
Функция ПолучитьСтруктуруОтвета(СтруктураПараметров = Неопределено, КодОшибки = Неопределено, СистемноеОписаниеОшибки = "", ПолучатьHTTPОтвет = Неопределено) Экспорт
	
	Если ПолучатьHTTPОтвет = Неопределено Тогда 
		ПолучатьHTTPОтвет = СтруктураПараметров = Неопределено;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура("Parameters, Error, ErrorMessage", СтруктураПараметров, КодОшибки, ПолучитьОписаниеОшибки(КодОшибки, СистемноеОписаниеОшибки));
	
	Если ПолучатьHTTPОтвет Тогда
		Возврат ПолучитьHTTPОтвет(СтруктураОтвета);	
	Иначе		
		Возврат СтруктураОтвета; 
	КонецЕсли;
	
КонецФункции

// Функция, возвращает параметр из строки JSON.
// 
Функция ПолучитьПараметрИзСтрокиJSON(ПараметрыЗапроса, НаименованиеПараметра) Экспорт
	
	ТекстJSON = ПараметрыЗапроса.Получить(НаименованиеПараметра);
	
	Если ЗначениеЗаполнено(ТекстJSON) Тогда
		
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстJSON);
			ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
			Возврат ПараметрыJSON; 
		Исключение
			Возврат Неопределено; 
		КонецПопытки;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить роль сотрудника
//
// Параметры:
//  Сотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРольСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Роль КАК Роль
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Роль, Неопределено);
	
КонецФункции

// Функция - Получить места работы сотрудника
//
// Параметры:
//  Сотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   Массив - 
//
Функция ПолучитьМестаРаботыСотрудника(Сотрудник) Экспорт
	
	Возврат РегистрыСведений.НастройкиСотрудников.ПолучитьМестаРаботыСотрудника(Сотрудник,"Массив",,Истина);
	
КонецФункции

// Функция - Получить дату
// 
// Параметры:
//  СтроковаяДата	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьДату(СтроковаяДата) Экспорт
	
	Если Не ЗначениеЗаполнено(СтроковаяДата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		СтроковаяДата = СтрЗаменить(СтроковаяДата , "-","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата , "T","");
		Возврат Дата(СтроковаяДата);
	Исключение
		Возврат Неопределено
	КонецПопытки;
	
КонецФункции

// Функция, возвращает HTTPОтвет. 
//
Функция ПолучитьHTTPОтвет(Ответ1С, КодОтвета = Неопределено) Экспорт
	
	Если КодОтвета = Неопределено Тогда
		КодОтвета = 200;
		Если ТипЗнч(Ответ1С) = Тип("Структура") И Ответ1С.Свойство("Error") И ТипЗнч(Ответ1С.Error) = Тип("Число") И Ответ1С.Error > 0 Тогда
			КодОтвета = 400;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);		
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);	
	ЗаписатьJSON(ЗаписьJSON, Ответ1С);        	
	
	мОтвет = ЗаписьJSON.Закрыть(); 		
	HTTPОтвет = Новый HTTPСервисОтвет(КодОтвета);
	HTTPОтвет.УстановитьТелоИзСтроки(мОтвет);
	HTTPОтвет.Заголовки["Content-Type"] = "application/json";	
	
	Возврат HTTPОтвет; 
	
КонецФункции

// Функция, возвращает описание ошибки по коду.
// 
// Параметры:
//  КодОшибки				 - 	 - 
//  ДополнительноеОписание	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьОписаниеОшибки(КодОшибки, СистемноеОписаниеОшибки = "")
	
	Если КодОшибки = 2000 Тогда
		Возврат "Ошибка получения клиники";
	ИначеЕсли КодОшибки = 2001 Тогда
		Возврат "Не указан ключ авторизации внешнего приложения";
	ИначеЕсли КодОшибки = 2002 Тогда
		Возврат "Неверный ключ авторизации внешнего приложения";
	ИначеЕсли КодОшибки = 2003 Тогда
		Возврат "Не найден сотрудник с указанными параметрами";
	ИначеЕсли КодОшибки = 2004 Тогда
		Возврат "Неизвестный метод";
	ИначеЕсли КодОшибки = 2005 Тогда
		Возврат "Дата начала не может быть больше даты окончания";
	ИначеЕсли КодОшибки = 2017 Тогда
		Возврат "Ошибка преобразования даты/времени в тип ДатаВремя 1С:Медицина";
	ИначеЕсли КодОшибки = 2018 Тогда
		Возврат "Ошибка преобразования в булево";
	ИначеЕсли КодОшибки = 2019 Тогда
		Возврат "Не указана дата";
	ИначеЕсли КодОшибки = 2020 Тогда
		Возврат "Не установлена периодичность для диаграммы";
	ИначеЕсли КодОшибки = 2021 Тогда
		Возврат "Неверный формат параметра master_ids";
	ИначеЕсли КодОшибки = 2022 Тогда
		Возврат "Неверный формат параметра room_ids";                                                 	
	ИначеЕсли КодОшибки = 2023 Тогда
		Возврат "Ошибка получения строки поиска";
	ИначеЕсли КодОшибки = 2024 Тогда
		Возврат "Не указан ключ приема";
	ИначеЕсли КодОшибки = 2025 Тогда
		Возврат "Не найдена услуга";
	ИначеЕсли КодОшибки = 2026 Тогда
		Возврат "Роль сотрудника не соотвествует требуемой";
	ИначеЕсли КодОшибки = 2027 Тогда
		Возврат "Неверное время настройки напоминания о приеме";
	ИначеЕсли КодОшибки = 2028 Тогда
		Возврат "Не задан массив записи";	
	ИначеЕсли КодОшибки = 2029 Тогда
		Возврат "Для клиента установлен запрет онлайн-записи";
	ИначеЕсли КодОшибки = 2030 Тогда
		Возврат "Услуга недоступна для онлайн-записи";//"Услуга " + ДопОписание + " недоступна для онлайн-записи";
	ИначеЕсли КодОшибки = 2031 Тогда
		Возврат "К сожалению, запись невозможна, так как выбраны услуги, которые не могут быть оказаны одновременно"; //Совпадает время услуг в переданном массиве
	ИначеЕсли КодОшибки = 2032 Тогда
		Возврат "Нет сотрудников, способных оказать услугу";//"Нет сотрудников, способных оказать услугу " + ДопОписание;
	ИначеЕсли КодОшибки = 2033 Тогда
		Возврат "Один из сотрудников не оказывает выбранную услугу";
	ИначеЕсли КодОшибки = 2034 Тогда
		Возврат "Один из сотрудников не может оказать услугу в выбранное время";
	ИначеЕсли КодОшибки = 2035 Тогда
		Возврат "Не найдено свободных ресурсов для оказания услуг";
	ИначеЕсли КодОшибки = 2036 Тогда
		Возврат "Ошибка в момент проведения документа. " + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 2037 Тогда
		Возврат "Не найден прием";
	ИначеЕсли КодОшибки = 2038 Тогда
		Возврат "Прием недоступен для отмены";
	ИначеЕсли КодОшибки = 2039 Тогда
		Возврат "Ошибка получения имени пациента";
	ИначеЕсли КодОшибки = 2040 Тогда
		Возврат "Не удалось записать нового пациента";
	ИначеЕсли КодОшибки = 2041 Тогда
		Возврат "Нет данных для записи";
	ИначеЕсли КодОшибки = 2042 Тогда
		Возврат "Не удалось записать данные. Нельзя очистить график на " + СистемноеОписаниеОшибки + ", так как есть запланированные приемы у сотрудника!";
	ИначеЕсли КодОшибки = 2043 Тогда
		Возврат "Не найден склад";
	ИначеЕсли КодОшибки = 2044 Тогда
		Возврат "Не найден контрагент";
	ИначеЕсли КодОшибки = 2045 Тогда
		Возврат "Прием не является долговым";
	ИначеЕсли КодОшибки = 2046 Тогда
		Возврат "Ошибка в момент записи документа оплаты: " + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 2047 Тогда
		Возврат "Ошибка отправки документа в LifePay: " + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 2048 Тогда
		Возврат "Клиент не найден";
	ИначеЕсли КодОшибки = 2049 Тогда
		Возврат "Код карты не найден";
	ИначеЕсли КодОшибки = 2050 Тогда
		Возврат "Карта не найдена";
	ИначеЕсли КодОшибки = 2051 Тогда
		Возврат "Ошибка при установке статуса ""Окончен""" + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 2052 Тогда
		Возврат "Ошибка получения номенклатуры";
	ИначеЕсли КодОшибки = 2053 Тогда
		Возврат "Ошибка получения вида цены";
	ИначеЕсли КодОшибки = 2054 Тогда
		Возврат "Материал не найден";
	ИначеЕсли КодОшибки = 2055 Тогда
		Возврат "Переключатель не найден";
	ИначеЕсли КодОшибки = 2056 Тогда
		Возврат "Штрихкод не найден";
	ИначеЕсли КодОшибки = 2057 Тогда
		Возврат "Ошибка отправки документа в Эвотор: " + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 2058 Тогда
		Возврат "Не найден документ инвентаризации";
	ИначеЕсли КодОшибки = 2059 Тогда
		Возврат "Массив ключей не передан";
	ИначеЕсли КодОшибки = 2060 Тогда
		Возврат "Не удалось отправить сообщение в мессенджер с кодом подтверждения по причине: " + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 2061 Тогда
		Возврат "Не удалось отправить письмо на почту с кодом подтверждения по причине: " + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 1041 Тогда
		Возврат "Внутренняя ошибка сервиса: " + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 1042 Тогда
		Возврат "Ошибка при отправке SMS с кодом подтверждения: " + СистемноеОписаниеОшибки;
	ИначеЕсли КодОшибки = 1043 Тогда
		Возврат "Константа СМС рассылки не заполнена";
	ИначеЕсли КодОшибки = 1044 Тогда
		Возврат "Не удалось записать данные. Нельзя добавить график на " + СистемноеОписаниеОшибки + ", так как сотрудник уже работает в другой клинике.";
	ИначеЕсли КодОшибки = 1045 Тогда
		Возврат "Не удалось записать данные. Нельзя добавить график на " + СистемноеОписаниеОшибки + ", так как есть запланированные приемы не входящие в выбранные смены.";
	ИначеЕсли КодОшибки = 1046 Тогда
		Возврат "Выбранный интервал уже занят.";			
	КонецЕсли;
	
КонецФункции

// Функция - Извлечь код ошибки нижнего уровня
//
// Параметры:
//  ТекстОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИзвлечьОписаниеОшибки(знач ТекстОшибки) 
	
	КодОшибкиИзОбъекта = Неопределено;
	
	Если СтрНайти(ТекстОшибки, "[2036]") > 0 Тогда
		
		Начало = СтрНайти(ТекстОшибки, "[2036]");
		Конец  = СтрДлина(ТекстОшибки);
		
		Если Начало > 0 И Конец > 0 Тогда				
			ТекстОшибки = Сред(ТекстОшибки, Начало + 6, Конец);				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Функция, возвращает ссылку по УИД.
// 
Функция ПолучитьСсылкуОбъектаПоУИД(УИД, ВидОбъекта, ИмяОбъекта)
	
	Попытка
		
		ИмяТаблицы = ВидОбъекта;
		Выполнить("ВидОбъекта = " + ВидОбъекта);
		Ссылка = ВидОбъекта[ИмяОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТекущиеДанные.Ссылка КАК Ссылка
		|ИЗ
		|	[ИмяТаблицы] КАК ТекущиеДанные
		|ГДЕ
		|	ТекущиеДанные.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ИмяТаблицы = Сред(ИмяТаблицы, 1, СтрДлина(ИмяТаблицы) - 1);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[ИмяТаблицы]", ИмяТаблицы + "." + ИмяОбъекта);
		
		Если Запрос.Выполнить().Пустой() Тогда
			Ссылка = Неопределено;
		КонецЕсли;		
		
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Возврат Ссылка;
	
КонецФункции

// Функция - возвращает цвет текста для указанного цвета фона.
// 
// Параметры:
//  ЦветФона - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьЦветТекстаПоЦветуФона(ЦветФонаСтруктурой)
	
	RGBЦвет = Новый Цвет(Число(ЦветФонаСтруктурой.Красный), Число(ЦветФонаСтруктурой.Зеленый), Число(ЦветФонаСтруктурой.Синий));
	
	Если RGBЦвет <> Неопределено Тогда
		
		// Если цвет белый.
		Если RGBЦвет.Красный = 255
			И RGBЦвет.Зеленый = 255
			И RGBЦвет.Синий = 255 Тогда
			
			ЦветТекста = Новый Цвет(128, 128, 128);
			
		ИначеЕсли (1 - (0.299 * RGBЦвет.Красный + 0.587 * RGBЦвет.Зеленый + 0.114 * RGBЦвет.Синий) / 255) > 0.5 Тогда
			
			ЦветТекста = Новый Цвет(250, 250, 250);
		Иначе
			ЦветТекста = Новый Цвет(64, 64, 64);
		КонецЕсли;
		
	Иначе
		ЦветТекста = Новый Цвет(64, 64, 64);
	КонецЕсли;
	
	Возврат Новый Структура("Красный, Зеленый, Синий", ЦветТекста.Красный, ЦветТекста.Зеленый, ЦветТекста.Синий)
	
КонецФункции

// Процедура - Обработка визитов
// 
// Параметры:
//  НайденныеСтроки	 - 	 - 
// 
Процедура ОбработкаСтрокСобытия(СтрокиСОбытия)
	
	Индекс = 0;
	Пока Индекс < СтрокиСОбытия.Количество() - 1 Цикл 
		
		СтрокаСобытия = СтрокиСОбытия[Индекс];
		
		Если СтрокаСобытия.ДатаВремяОкончания < СтрокиСОбытия[Индекс + 1].ДатаВремяНачала Тогда
			СтрокиСОбытия.Удалить(Индекс + 1);
			Продолжить;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Для Каждого СтрокаСобытия Из СтрокиСОбытия Цикл						
		СтрокаСобытия.Использован = Истина;		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Нумерация записей планировщика
// 
// Параметры:
//  МассивВизитов	 - 	 - 
// 
Процедура НумерацияЗаписейПланировщика(МассивВозврат)
	
	Для Индекс = 0 По МассивВозврат.Количество() - 1 Цикл
		
		КолЭлем = 1; 
		Для ИндексСтр = Индекс + 1 По МассивВозврат.Количество() - 1 Цикл
			
			Если МассивВозврат[ИндексСтр].Визит = МассивВозврат[Индекс].Визит Тогда
				
				КолЭлем = КолЭлем + 1;
				МассивВозврат[ИндексСтр].Текст = "[" + КолЭлем + "] " + МассивВозврат[ИндексСтр].Текст;  
				
			КонецЕсли;
		КонецЦикла;
		
		Если КолЭлем > 1 Тогда
			МассивВозврат[Индекс].Текст = "[1] " + МассивВозврат[Индекс].Текст;
			Индекс = Индекс + КолЭлем - 1;    	
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

// Функция, создает причину отмены записи.
// 
Функция СоздатьПричинуОтменыЗаписи()
	
	ПричинаОтмены = Справочники.ПричиныОтменыЗаписи.СоздатьЭлемент();
	ПричинаОтмены.Наименование = "Отмена с мобильного приложения клиники";
	
	ПричинаОтмены.Записать();
	
	Возврат ПричинаОтмены.Ссылка;
	
КонецФункции

// Процедура - Создать нового клиента
//
// Параметры:
//  ФИО		 - 	 - 
//  Телефон	 - 	 - 
//
Функция СоздатьНовогоКлиента(ИмяКонтрагента, ТелефонКонтрагента, Автор)
	
	НовыйКонтрагент 				= Справочники.Контрагенты.СоздатьЭлемент();
	
	НаименованиеКлиента             = СокрЛП(ИмяКонтрагента);
	ПозицияПервогоПробела           = Найти(НаименованиеКлиента, " "); 
	Если ПозицияПервогоПробела = 0 Тогда
		Имя      = НаименованиеКлиента;
		Фамилия  = "";
		Отчество = "";
	Иначе
		Фамилия                    = Сред(НаименованиеКлиента, 1, ПозицияПервогоПробела - 1);
		НаименованиеКлиента        = СокрЛП(Сред(НаименованиеКлиента, ПозицияПервогоПробела + 1, СтрДлина(НаименованиеКлиента) - ПозицияПервогоПробела));
		ПозицияВторогоПробела      = Найти(НаименованиеКлиента, " ");
		Если ПозицияВторогоПробела = 0 Тогда
			Имя                    = СокрЛП(НаименованиеКлиента);
			Отчество               = "";
		Иначе
			Имя                    = Сред(НаименованиеКлиента, 1, ПозицияВторогоПробела - 1); 
			Отчество               = СокрЛП(Прав(НаименованиеКлиента, СтрДлина(НаименованиеКлиента) - ПозицияВторогоПробела));   
		КонецЕсли;
	КонецЕсли;
	
	НовыйКонтрагент.Имя						= Имя;
	НовыйКонтрагент.Фамилия					= Фамилия;
	НовыйКонтрагент.Отчество				= Отчество;			
	НовыйКонтрагент.Наименование			= СокрЛП(ИмяКонтрагента);			
	НовыйКонтрагент.СотрудникРегистрации	= Автор;
	
	// Заполняем пол клиента
	ПолКлиента = ОбщегоНазначенияСтоматология.ОпределитьПолКлиента(Фамилия, Имя, Отчество);
	Если ПолКлиента = "Мужской" Тогда
		ПолКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");
	ИначеЕсли ПолКлиента = "Женский" Тогда
		ПолКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский");
	КонецЕсли;
	НовыйКонтрагент.ПолКлиента = ПолКлиента;
	
	НовыйКонтрагент.Заполнить(Новый Структура("ТипКонтрагента, ИмяКлиента", Перечисления.ТипыКонтрагентов.Клиенты, ИмяКонтрагента));
	НовыйКонтрагент.ДополнительныеСвойства.Вставить("Статус", Перечисления.СтатусыКонтрагентов.Потенциальный);
	
	Если ЗначениеЗаполнено(ТелефонКонтрагента) Тогда
		
		// Получим КИ в нужном виде для поиска и последующей записи
		Объект_XDTO_Телефон = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(ТелефонКонтрагента, Перечисления.ТипыКонтактнойИнформации.Телефон);
		Если НЕ Объект_XDTO_Телефон = Неопределено Тогда 
			Если ЗначениеЗаполнено(Объект_XDTO_Телефон.Состав.Номер) Тогда
				ТелефонКлиента = НовыйКонтрагент.КонтактнаяИнформация.Добавить();
				ТелефонКлиента.Тип 						= Перечисления.ТипыКонтактнойИнформации.Телефон;
				ТелефонКлиента.Вид 						= Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
				ТелефонКлиента.НомерТелефона 			= СокрЛП(Объект_XDTO_Телефон.Состав.КодСтраны) + СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(Объект_XDTO_Телефон.Состав.Номер);
				ТелефонКлиента.НомерТелефонаБезКодов 	= Объект_XDTO_Телефон.Состав.Номер;
				ТелефонКлиента.Представление		 	= Объект_XDTO_Телефон.Представление;
				ТелефонКлиента.ЗначенияПолей		 	= УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Телефон);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат НовыйКонтрагент;	
	
КонецФункции

// Функция возвращает структуру с заголовками запроса в нижнем регистре.
// 
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПривестиЗаголовкиВНижнийРегистр(Запрос) Экспорт
	
	СоответствиеСЗаголовками = Новый Соответствие;
	
	Для Каждого Заголовок Из Запрос.Заголовки Цикл
		СоответствиеСЗаголовками.Вставить(НРег(Заголовок.Ключ), Заголовок.Значение);
	КонецЦикла;
	
	Возврат СоответствиеСЗаголовками;
	
КонецФункции

// Функция - Валидация JSON
//
// Параметры:
//  ВходящийПараметр - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВалидацияJSON(ВходящийПараметр)
	
	Если ТипЗнч(ВходящийПараметр) = Тип("Структура") Тогда
		
		Для Каждого КлючЗначение Из ВходящийПараметр Цикл
			Если ТипЗнч(КлючЗначение.Значение) = Тип("Структура") ИЛИ ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
				ВходящийПараметр[КлючЗначение.Ключ] = ВалидацияJSON(КлючЗначение.Значение);			
			Иначе
				ВходящийПараметр[КлючЗначение.Ключ] = ?(Не ЗначениеЗаполнено(КлючЗначение.Значение) И ТипЗнч(КлючЗначение.Значение) <> Тип("Дата"), Неопределено, КлючЗначение.Значение); 
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВходящийПараметр) = Тип("Массив") Тогда
		
		Для Каждого СтрокаМ Из ВходящийПараметр Цикл
			
			Если ТипЗнч(СтрокаМ) = Тип("Структура") Тогда				
				СтрокаМ = ВалидацияJSON(СтрокаМ);
			Иначе				
				СтрокаМ = ?(Не ЗначениеЗаполнено(СтрокаМ) И ТипЗнч(СтрокаМ) <> Тип("Дата"), Неопределено, СтрокаМ);				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ВходящийПараметр; 
	
КонецФункции

// Процедура - Обновить константу настройки мобильного приложения стоматологии
//
Процедура ОбновитьКонстантуНастройкиМобильногоПриложенияСтоматологии() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыДанных = Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();
	
	ПараметрыДанных = ?(Не ЗначениеЗаполнено(ПараметрыДанных), Новый Структура(), ПараметрыДанных);
	
	Если НЕ ПараметрыДанных.Свойство("РазрешитьРедактированиеПриемовВрачом") Тогда
		ПараметрыДанных.Вставить("РазрешитьРедактированиеПриемовВрачом", Истина);
	КонецЕсли;
	
	Если НЕ ПараметрыДанных.Свойство("ВыводитьТелефонКлиентаВрачу") Тогда
		ПараметрыДанных.Вставить("ВыводитьТелефонКлиентаВрачу", Истина);
	КонецЕсли;
	
	Если НЕ ПараметрыДанных.Свойство("НеВыводитьИсториюПриемовПоКлиенту") Тогда
		ПараметрыДанных.Вставить("НеВыводитьИсториюПриемовПоКлиенту", Ложь);
	КонецЕсли;
	
	Если НЕ ПараметрыДанных.Свойство("ВыводитьВрачуКомментарий") Тогда
		ПараметрыДанных.Вставить("ВыводитьВрачуКомментарий", Истина);
	КонецЕсли;
	
	Если НЕ ПараметрыДанных.Свойство("УведомлятьВрачаОбИзмененииПриемов") Тогда
		ПараметрыДанных.Вставить("УведомлятьВрачаОбИзмененииПриемов", Истина);
	КонецЕсли;
			
	Константы.НастройкиМобильногоПриложенияСтоматологии.Установить(Новый ХранилищеЗначения(ПараметрыДанных));
	
КонецПроцедуры

// Функция - Получить статус события
//
// Параметры:
//  Статус	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтатусСобытия(Статус)
	
	Если Статус = Перечисления.СтатусыСобытия.НеПодтверждена Тогда
		Возврат "НеПодтверждена";
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда 
		Возврат "Подтверждена";
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПациентОжидает Тогда 
		Возврат "ПациентОжидает";
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемНачат Тогда 
		Возврат "ПриемНачат";
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемОкончен Тогда 
		Возврат "ПриемОкончен";
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда 
		Возврат "ПриемНеСостоялся";
	ИначеЕсли Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда 
		Возврат "ПриемОтменен";
	КонецЕсли;
	
КонецФункции

// Функция - Получить роль пользователя
//
// Параметры:
//  Роль - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРольПользователя(Роль)
	
	Если Роль = Перечисления.РольПользователя.Врач Тогда
		Возврат "Врач";
	ИначеЕсли Роль = Перечисления.РольПользователя.ГлавныйВрач Тогда 
		Возврат "ГлавныйВрач";
	ИначеЕсли Роль = Перечисления.РольПользователя.Регистратура Тогда 
		Возврат "Регистратура";
	ИначеЕсли Роль = Перечисления.РольПользователя.Руководитель Тогда 
		Возврат "Руководитель";
	ИначеЕсли Роль = Перечисления.РольПользователя.Управляющий Тогда 
		Возврат "Управляющий";
	КонецЕсли;
	
КонецФункции

// Функция - Определение интервала времени
//
// Параметры:
//  ИнтервалГрафика	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОпределениеИнтервалаВремени(ИнтервалГрафика)
	
	Если ИнтервалГрафика = 0 Тогда
		ИнтервалВремени = 15;
	ИначеЕсли ИнтервалГрафика = 1 Тогда
		ИнтервалВремени = 10; 
	ИначеЕсли ИнтервалГрафика = 2 Тогда
		ИнтервалВремени = 5;
	КонецЕсли;
	
	Возврат ИнтервалВремени;
	
КонецФункции

// Функция - Обработать пустое значение
//
// Параметры:
//  Значение - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция УникальныйИдентификатор(Ссылка)
	Возврат ?(ЗначениеЗаполнено(Ссылка), Строка(Ссылка.УникальныйИдентификатор()), Неопределено);	
КонецФункции

// Функция - Получить имя значения перечисления
//
// Параметры:
//  ЗначениеПеречисления - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьИмяЗначенияПеречисления(ЗначениеПеречисления)
	
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;	
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);	
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	
	Возврат ИмяЗначенияПеречисления
	
КонецФункции

// Функция - Получить число из строки
//
// Параметры:
//  СуммаСтрокой - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЧислоИзСтроки(ЧислоСтрокой) Экспорт
	
	Попытка
		ЧислоСтрокой = Число(ЧислоСтрокой);
	Исключение
		ЧислоСтрокой = 0;
	КонецПопытки;
	
	Возврат ЧислоСтрокой;
	
КонецФункции

// Функция - Получить тип булево
//
// Параметры:
//  ПараметрСтрокой	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТипБулево(ПараметрСтрокой) Экспорт
	
	Попытка
		
		Если СтрНачинаетсяС(ПараметрСтрокой, "0") ИЛИ СтрНачинаетсяС(ПараметрСтрокой, "1") Тогда
			ПараметрСтрокой = Число(ПараметрСтрокой);
		КонецЕсли;
		
		Возврат Булево(ПараметрСтрокой);
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Функция - Рабочие дни структурной единицы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницыРасписаниеРаботы.ДеньНедели КАК ДеньНедели,
	|	СтруктурныеЕдиницыРасписаниеРаботы.НачалоРаботы КАК НачалоРаботы,
	|	СтруктурныеЕдиницыРасписаниеРаботы.ОкончаниеРаботы КАК ОкончаниеРаботы,
	|	СтруктурныеЕдиницыРасписаниеРаботы.Активность КАК Активность
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК СтруктурныеЕдиницыРасписаниеРаботы
	|ГДЕ
	|	СтруктурныеЕдиницыРасписаниеРаботы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДеньНедели");
	
	Запрос.УстановитьПараметр("Ссылка", СтруктурнаяЕдиница);
	
	РасписаниеРаботы = Запрос.Выполнить().Выгрузить();
	
	РабочиеДни = Новый Массив;
	Для Каждого СтрокаТ ИЗ РасписаниеРаботы Цикл		
		Если СтрокаТ.Активность = Истина Тогда			
			ДатаОкончанияРаботы = СтрокаТ.ОкончаниеРаботы;
			Если НЕ ЗначениеЗаполнено(ДатаОкончанияРаботы) Тогда
				ДатаОкончанияРаботы = Дата('0001010123:59:59')
			КонецЕсли;			
			РабочиеДни.Добавить(Новый Структура("ДеньНедели,ДатаНачала,ДатаОкончания", Дата(2001, 01, ДеньНедели(СтрокаТ.ДеньНедели)), СтрокаТ.НачалоРаботы, ДатаОкончанияРаботы));			
		КонецЕсли;		
	КонецЦикла;	  
	
	Возврат РабочиеДни;
	
КонецФункции

// Функция - Версия ПОСервер актуальна
//
// Параметры:
//  ВерсияПОСервер		 - 	 - 
//  ЗначениеСравнения	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВерсияПОСерверАктуальна(Знач ВерсияПОСервер, Знач ЗначениеСравнения)
	
	Если СтрЗаканчиваетсяНа(ВерсияПОСервер, "00") Тогда
		ВерсияПОСервер = Сред(ВерсияПОСервер, 1, СтрДлина(ВерсияПОСервер) - 2);
	КонецЕсли;
	
	Строка1 = ?(ПустаяСтрока(ВерсияПОСервер), "0.0.0.0", ВерсияПОСервер);
	Строка2 = ?(ПустаяСтрока(ЗначениеСравнения), "0.0.0.0", ЗначениеСравнения);
	Версия1 = СтрРазделить(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		Возврат Ложь;
	КонецЕсли;
	Версия2 = СтрРазделить(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат >= 0;
	
КонецФункции

// Функция - Заменить номер телефона для врача
//
// Параметры:
//  НомерТелефона	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗаменитьНомерТелефонаДляВрача(НомерТелефона)
	
	ВремТелефон = "";
	
	Для Индекс = 1 По СтрДлина(НомерТелефона) Цикл
		Символ = Сред(НомерТелефона, Индекс, 1);
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда
			Символ = "*";
		КонецЕсли;
		ВремТелефон = ВремТелефон + Символ;
	КонецЦикла;
	
	Возврат ВремТелефон;
	
КонецФункции

// Функция - Роль пользователя урезана
//
// Параметры:
//  Сотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РольПользователяУрезана(Сотрудник, РольПользователя = Неопределено)
	
	Если РольПользователя = Неопределено Тогда
		РольПользователя = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник,"Роль");
	КонецЕсли;
	
	Возврат РольПользователя = Перечисления.РольПользователя.Врач 
		ИЛИ РольПользователя = Перечисления.РольПользователя.ГлавныйВрач 
		ИЛИ РольПользователя = Перечисления.РольПользователя.Ассистент;
	
КонецФункции

#КонецОбласти

#КонецОбласти