

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Подписка регистрация триггерных событий КОРП обработка проведения
//
// Параметры:
//  Источник		 - 	 - 
//  Отказ			 - 	 - 
//  РежимПроведения	 - 	 - 
//
Процедура Подписка_РегистрацияТриггерныхСобытий_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	// Возврат;
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка ИЛИ НЕ ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП() Тогда 
		Возврат;
	КонецЕсли;
	
	ОбъектСобытия 		= Источник;	
	ТаблицаТриггеров 	= ПолучитьАктуальныеТриггеры(ОбъектСобытия);
	Если ТаблицаТриггеров = Неопределено ИЛИ ТаблицаТриггеров.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаТриггер Из ТаблицаТриггеров Цикл
		ЗарегистрироватьСобытие(СтрокаТриггер, Истина, , ОбъектСобытия);
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Регистрация триггерных событий КОРП при записи при записи
//
// Параметры:
//  Источник - 	 - 
//  Отказ	 - 	 - 
//
Процедура Подписка_РегистрацияТриггерныхСобытий_ПриЗаписи(Источник, Отказ) Экспорт
	
	// Возврат;
	
	Если Отказ ИЛИ НЕ ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП() Тогда 
		Возврат;
	ИначеЕсли Источник.ОбменДанными.Загрузка
			И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства, "НеобходимоИнициироватьВыполнениеТриггерногоСобытия", Ложь) Тогда 
		Возврат;	
	КонецЕсли;
	
	ОбъектСобытия 			= Источник;
	ТаблицаДанныхТриггеров 	= ПолучитьАктуальныеТриггеры(ОбъектСобытия);
	
	Если ТаблицаДанныхТриггеров = Неопределено ИЛИ ТаблицаДанныхТриггеров.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаТриггер Из ТаблицаДанныхТриггеров Цикл
		ЗарегистрироватьСобытие(СтрокаТриггер, Истина, , ОбъектСобытия);
	КонецЦикла;	
	
КонецПроцедуры
	
// Процедура - Подписка регистрация триггерных событий КОРП при записи набора записей
//
// Параметры:
//  Источник	 - 	 - 
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура Подписка_РегистрацияТриггерныхСобытий_ПриЗаписиНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	// Возврат;
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка ИЛИ Источник.ДополнительныеСвойства.Свойство("ЭтоПроведениеЗагруженныхДанных") ИЛИ НЕ ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП() Тогда 
		Возврат;
	КонецЕсли;
	
	ОбъектСобытия 			= Источник;
	ТаблицаДанныхТриггеров 	= ПолучитьАктуальныеТриггеры(ОбъектСобытия);
	
	Если ТаблицаДанныхТриггеров = Неопределено ИЛИ ТаблицаДанныхТриггеров.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаТриггер Из ТаблицаДанныхТриггеров Цикл
		ЗарегистрироватьСобытие(СтрокаТриггер, Истина, , ОбъектСобытия);
	КонецЦикла;

КонецПроцедуры

// Процедура - Выполнить регистрацию триггерных событий
//
Процедура Регламент_ВыполнитьРегистрациюТриггерныхСобытий(МассивСтруктурныхЕдиниц = Неопределено) Экспорт
	
	// Возврат;
	
	Если МассивСтруктурныхЕдиниц = Неопределено Тогда 	
		Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
			И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
			Возврат;
		КонецЕсли;
		
		ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РегистрацияТриггерныхСобытий);
		
		ОтказВыполнения = Ложь;	
		// РегламентныеЗаданияСерверСтоматология.АктуализироватьЗаданиеОчереди(Метаданные.РегламентныеЗадания.РегистрацияТриггерныхСобытий, Истина, , ОтказВыполнения);	
		Если ОтказВыполнения Тогда
			ОбщегоНазначения.ПриОкончанииВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РегистрацияТриггерныхСобытий);			
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП() Тогда
		ОбщегоНазначения.ПриОкончанииВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РегистрацияТриггерныхСобытий);					
		Возврат;
	КонецЕсли;
	
	// Если МассивСтруктурныхЕдиниц = Неопределено Тогда 	
	//	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
	//		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Попытка
	//		ЧасовойПоясТекущегоСеанса = ЧасовойПоясСеанса();	
	//		ТаблицаЧасовыхПоясов = РегламентныеЗаданияСерверСтоматология.ПолучитьТаблицуЧасовыхПоясовСтруктурныхЕдиниц(ЧасовойПоясТекущегоСеанса);
	//		Для Каждого СтрокаЧасовойПояс Из ТаблицаЧасовыхПоясов Цикл 
	//			// Актуализируем часовой пояс исходя из структурной единицы
	//			Если ЧасовойПоясТекущегоСеанса <> СтрокаЧасовойПояс.ЧасовойПояс Тогда 
	//				УстановитьЧасовойПоясСеанса(СтрокаЧасовойПояс.ЧасовойПояс);
	//				ЧасовойПоясТекущегоСеанса = СтрокаЧасовойПояс.ЧасовойПояс;
	//			КонецЕсли;
	//			Регламент_ВыполнитьРегистрациюТриггерныхСобытий2(СтрокаЧасовойПояс.МассивСтруктурныхЕдиниц);
	//			Прервать; // Выполняем один раз для первого выбранного часового пояса, так как для триггеров пока не реализован функционал "Места активации".
	//		КонецЦикла;
	//		ОбщегоНазначения.ПриОкончанииВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РегистрацияТриггерныхСобытий);			
	//	Исключение
	//		ОписаниеОшибкиВыполнения = ОписаниеОшибки();
	//		ОбщегоНазначения.ПриОкончанииВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РегистрацияТриггерныхСобытий, ОписаниеОшибкиВыполнения);		
	//	КонецПопытки;		
	//	Возврат;
	// КонецЕсли;
	
	МассивИсключительноРегламентныхТриггеров 	= Справочники.ТриггерныеСобытия.ПолучитьМассивТриггеров(, Ложь);
	МассивГибридныхТриггеров 					= Справочники.ТриггерныеСобытия.ПолучитьМассивТриггеров(, Истина);
	
	Справочники.ТриггерныеСобытия.ИсключитьНеРегламентныеВариантыТриггерныхСобытий(МассивГибридныхТриггеров);
	
	// Получаем регламентные триггеры с учетом того, что они не отработали уже в текущие сутки
	// Также получаем запланированные триггеры
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие
	               |ПОМЕСТИТЬ ТаблицаОтработанныхТриггеров
	               |ИЗ
	               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ЖурналРегистрацииТриггерныхСобытий.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	               |	И ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.УсловиеСобытия <> ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе)
	               |	И ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.УсловиеСобытия <> ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана)
	               |	И ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.УсловиеСобытия <> ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияОчередьНаЗапись)
	               |	И ЖурналРегистрацииТриггерныхСобытий.РегистрацияПоПодписке = ЛОЖЬ
	               |	И ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	               |	И ВЫБОР
	               |			КОГДА ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)
	               |					И ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |					И ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	               |				ТОГДА ЖурналРегистрацииТриггерныхСобытий.Период >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ), СЕКУНДА, ЧАС(ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.ВремяСобытия) * 60 * 60 + МИНУТА(ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.ВремяСобытия) * 60 + СЕКУНДА(ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие.ВремяСобытия))
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТриггерныеСобытия.Ссылка КАК ТриггерноеСобытие
	               |ПОМЕСТИТЬ ТаблицаРегламентныхТриггеров
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	               |ГДЕ
	               |	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
	               |	И ТриггерныеСобытия.ПометкаУдаления = ЛОЖЬ
	               |	И ТриггерныеСобытия.Активно = ИСТИНА
	               |	И ТриггерныеСобытия.УсловиеСобытия В(&МассивИсключительноРегламентныхТриггеров)
	               |	И ВЫБОР
	               |			КОГДА ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе)
	               |					ИЛИ ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)
	               |				ТОГДА ТриггерныеСобытия.МоментСобытия <> ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия)
	               |						И ТриггерныеСобытия.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	               |			ИНАЧЕ ТриггерныеСобытия.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе)
	               |					ИЛИ ТриггерныеСобытия.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ЧАС(ТриггерныеСобытия.ВремяСобытия) = 0
	               |					И МИНУТА(ТриггерныеСобытия.ВремяСобытия) = 0
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ТриггерныеСобытия.ВремяСобытия <= &ТекущееВремяСеанса
	               |		КОНЕЦ
	               |	И ТриггерныеСобытия.Действия.Использование = ИСТИНА
	               |	И ТриггерныеСобытия.Действия.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	               |	И ТриггерныеСобытия.Действия.Удалено = ЛОЖЬ
	               |	И НЕ ТриггерныеСобытия.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	               |				ИЗ
	               |					ТаблицаОтработанныхТриггеров)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТриггерныеСобытия.Ссылка
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	               |ГДЕ
	               |	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
	               |	И ТриггерныеСобытия.ПометкаУдаления = ЛОЖЬ
	               |	И ТриггерныеСобытия.Активно = ИСТИНА
	               |	И ТриггерныеСобытия.УсловиеСобытия В(&МассивГибридныхТриггеров)
	               |	И ТриггерныеСобытия.МоментСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия), ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия))
	               |	И ТриггерныеСобытия.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	               |	И ВЫБОР
	               |			КОГДА ЧАС(ТриггерныеСобытия.ВремяСобытия) = 0
	               |					И МИНУТА(ТриггерныеСобытия.ВремяСобытия) = 0
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ТриггерныеСобытия.ВремяСобытия <= &ТекущееВремяСеанса
	               |		КОНЕЦ
	               |	И ТриггерныеСобытия.Действия.Использование = ИСТИНА
	               |	И ТриггерныеСобытия.Действия.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	               |	И ТриггерныеСобытия.Действия.Удалено = ЛОЖЬ
	               |	И НЕ ТриггерныеСобытия.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	               |				ИЗ
	               |					ТаблицаОтработанныхТриггеров)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТриггерныеСобытия.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.УсловиеСобытия КАК УсловиеСобытия,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ПараметрСобытия КАК ПараметрСобытия,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.МоментСобытия КАК МоментСобытия,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ПериодСобытияВид КАК ПериодСобытияВид,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ПериодСобытия КАК ПериодСобытия,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ВремяСобытия КАК ВремяСобытия,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.СегментКонтрагентов КАК СегментКонтрагентов,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.СегментУслуг КАК СегментУслуг,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ВидСделки КАК ВидСделки,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ВидБонусногоСчета КАК ВидБонусногоСчета,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ПереходСЭтапа КАК ПереходСЭтапа,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ПереходНаЭтап КАК ПереходНаЭтап,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ТипПолиса КАК ТипПолиса,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.СтатусПациентаПриема КАК СтатусПациентаПриема,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.РезультатПриема КАК РезультатПриема,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.СтатусЗаписи КАК СтатусЗаписи,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ИсточникЗаписи КАК ИсточникЗаписи,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.ПричинаОтмены КАК ПричинаОтмены,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.Наименование КАК Наименование,
	               |	ТриггерныеСобытия.ТриггерноеСобытие.КодСинхронизации КАК КодСинхронизации,
	               |	НЕОПРЕДЕЛЕНО КАК ПланДействийТриггерногоСобытия,
	               |	НЕОПРЕДЕЛЕНО КАК ТаблицаНекондиционныхДействий,
	               |	НЕОПРЕДЕЛЕНО КАК ПараметрыШаблона
	               |ИЗ
	               |	ТаблицаРегламентныхТриггеров КАК ТриггерныеСобытия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия,
	               |	ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия КАК ИсточникСобытия,
	               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ЖурналРегистрацииТриггерныхСобытий.РегистрацияПоПодписке КАК РегистрацияПоПодписке
	               |ПОМЕСТИТЬ ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов
	               |ИЗ
	               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	               |ГДЕ
	               |	ЖурналРегистрацииТриггерныхСобытий.Период <= &ТекущаяДатаСеанса
	               |	И ЖурналРегистрацииТриггерныхСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаАктуальныхТриггеров.Ссылка КАК ТриггерноеСобытие,
	               |	ТаблицаАктуальныхТриггеров.УсловиеСобытия КАК УсловиеСобытия,
	               |	ТаблицаАктуальныхТриггеров.ПараметрСобытия КАК ПараметрСобытия,
	               |	ТаблицаАктуальныхТриггеров.МоментСобытия КАК МоментСобытия,
	               |	ТаблицаАктуальныхТриггеров.ПериодСобытияВид КАК ПериодСобытияВид,
	               |	ТаблицаАктуальныхТриггеров.ПериодСобытия КАК ПериодСобытия,
	               |	ТаблицаАктуальныхТриггеров.ВремяСобытия КАК ВремяСобытия,
	               |	ТаблицаАктуальныхТриггеров.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ТаблицаАктуальныхТриггеров.СегментКонтрагентов КАК СегментКонтрагентов,
	               |	ТаблицаАктуальныхТриггеров.СегментУслуг КАК СегментУслуг,
	               |	ТаблицаАктуальныхТриггеров.ВидСделки КАК ВидСделки,
	               |	ТаблицаАктуальныхТриггеров.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
	               |	ТаблицаАктуальныхТриггеров.ВидБонусногоСчета КАК ВидБонусногоСчета,
	               |	ТаблицаАктуальныхТриггеров.ПереходСЭтапа КАК ПереходСЭтапа,
	               |	ТаблицаАктуальныхТриггеров.ПереходНаЭтап КАК ПереходНаЭтап,
	               |	ТаблицаАктуальныхТриггеров.ТипПолиса КАК ТипПолиса,
	               |	ТаблицаАктуальныхТриггеров.СтатусПациентаПриема КАК СтатусПациентаПриема,
	               |	ТаблицаАктуальныхТриггеров.РезультатПриема КАК РезультатПриема,
	               |	ТаблицаАктуальныхТриггеров.СтатусЗаписи КАК СтатусЗаписи,
	               |	ТаблицаАктуальныхТриггеров.ИсточникЗаписи КАК ИсточникЗаписи,
	               |	ТаблицаАктуальныхТриггеров.ПричинаОтмены КАК ПричинаОтмены,
	               |	ТаблицаАктуальныхТриггеров.Наименование КАК Наименование,
	               |	ТаблицаАктуальныхТриггеров.КодСинхронизации КАК КодСинхронизации,
	               |	НЕОПРЕДЕЛЕНО КАК ПланДействийТриггерногоСобытия,
	               |	НЕОПРЕДЕЛЕНО КАК ТаблицаНекондиционныхДействий,
	               |	НЕОПРЕДЕЛЕНО КАК ПараметрыШаблона,
	               |	НЕОПРЕДЕЛЕНО КАК МассивНеобработанныхКонтрагентов,
	               |	НЕОПРЕДЕЛЕНО КАК МассивНеОбработанныхЧПУ,
	               |	НЕОПРЕДЕЛЕНО КАК РеестрЗапланированных
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия КАК ТаблицаАктуальныхТриггеров
	               |ГДЕ
	               |	ТаблицаАктуальныхТриггеров.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие
	               |			ИЗ
	               |				ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов
	               |			СГРУППИРОВАТЬ ПО
	               |				ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.Период КАК Период,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСменыСтатуса,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.Контрагент КАК Контрагент,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ОбъектСобытия КАК ОбъектСобытия,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ИсточникСобытия КАК ИсточникСобытия,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
	               |	ЛОЖЬ КАК Подтверждено
	               |ИЗ
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов КАК ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов
	               |ГДЕ
	               |	НЕ ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.Период КАК Период,
	               |	ВЫБОР
	               |		КОГДА ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.Период, ЧАС, ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	               |						КОГДА ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |							ТОГДА 1
	               |						ИНАЧЕ -1
	               |					КОНЕЦ)
	               |		КОГДА ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.Период, МИНУТА, ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	               |						КОГДА ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |							ТОГДА 1
	               |						ИНАЧЕ -1
	               |					КОНЕЦ)
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаСменыСтатуса,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.Контрагент КАК Контрагент,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ОбъектСобытия КАК ОбъектСобытия,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ИсточникСобытия КАК ИсточникСобытия,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
	               |	ЛОЖЬ КАК Подтверждено
	               |ИЗ
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов КАК ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов
	               |ГДЕ
	               |	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса)";
				   
	
	Запрос.УстановитьПараметр("МассивГибридныхТриггеров"				, МассивГибридныхТриггеров);
	Запрос.УстановитьПараметр("МассивИсключительноРегламентныхТриггеров", МассивИсключительноРегламентныхТриггеров);	
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса"						, ТекущаяДатаСеанса());	
	Запрос.УстановитьПараметр("ТекущееВремяСеанса"						, Дата(1, 1, 1, Час(ТекущаяДатаСеанса()), Минута(ТекущаяДатаСеанса()), 0));
	
	ПакетРезультирующихТаблиц 							= Запрос.ВыполнитьПакет();
	
	ТаблицаРегламентныхТриггеров 						= ПакетРезультирующихТаблиц[2].Выгрузить();
	ТаблицаЗапланированныхТриггеров 					= ПакетРезультирующихТаблиц[4].Выгрузить();
	ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов = ПакетРезультирующихТаблиц[5].Выгрузить();
	ТаблицаЗапланированныхТриггеровСменыСтатусаКлиентов = ПакетРезультирующихТаблиц[6].Выгрузить();
	
	ТаблицаОбъектов = ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.Скопировать(, "ОбъектСобытия");
	ТаблицаОбъектов.Свернуть("ОбъектСобытия");
	МассивОбъектов = ТаблицаОбъектов.ВыгрузитьКолонку("ОбъектСобытия");
	ТаблицаОбъектов = ТаблицаЗапланированныхТриггеровСменыСтатусаКлиентов.Скопировать(, "ДатаСменыСтатуса, Контрагент");
	ТаблицаОбъектов.Свернуть("ДатаСменыСтатуса, Контрагент");
	
	// Регистрируем запланированные (все, кроме нижеописанных)
	Для Каждого ОбъектСобытия Из МассивОбъектов Цикл
		Для Каждого СтрокаЗапланированныйТриггер Из ТаблицаЗапланированныхТриггеров Цикл 
			Если СтрокаЗапланированныйТриггер.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса Тогда 
				Продолжить;
			КонецЕсли;			
			РеестрЗапланированных = ТаблицаЗапланированныхТриггеровВРазрезеКонтрагентов.Скопировать(Новый Структура("ОбъектСобытия, ТриггерноеСобытие", ОбъектСобытия, СтрокаЗапланированныйТриггер.ТриггерноеСобытие));
			Если ЗначениеЗаполнено(РеестрЗапланированных) Тогда
				СтрокаЗапланированныйТриггер.ПланДействийТриггерногоСобытия 	= Неопределено;
				СтрокаЗапланированныйТриггер.ТаблицаНекондиционныхДействий 		= Неопределено;
				СтрокаЗапланированныйТриггер.ПараметрыШаблона 					= Неопределено;
				СтрокаЗапланированныйТриггер.РеестрЗапланированных 				= РеестрЗапланированных;
				СтрокаЗапланированныйТриггер.МассивНеобработанныхКонтрагентов 	= РеестрЗапланированных.ВыгрузитьКолонку("Контрагент");
				ЗарегистрироватьСобытие(СтрокаЗапланированныйТриггер, , Истина, ОбъектСобытия, МассивИсключительноРегламентныхТриггеров);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;

	// Регистрируем запланированные (статусы клиента)
	Для Каждого СтрокаОбъектСобытия Из ТаблицаОбъектов Цикл
		Для Каждого СтрокаЗапланированныйТриггер Из ТаблицаЗапланированныхТриггеров Цикл 
			Если СтрокаЗапланированныйТриггер.УсловиеСобытия <> Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса Тогда 
				Продолжить;
			КонецЕсли;						
			РеестрЗапланированных = ТаблицаЗапланированныхТриггеровСменыСтатусаКлиентов.Скопировать(Новый Структура("ДатаСменыСтатуса, Контрагент, ТриггерноеСобытие", СтрокаОбъектСобытия.ДатаСменыСтатуса, СтрокаОбъектСобытия.Контрагент, СтрокаЗапланированныйТриггер.ТриггерноеСобытие));
			СтрокаЗапланированныйТриггер.РеестрЗапланированных 				= РеестрЗапланированных;
			СтрокаЗапланированныйТриггер.МассивНеобработанныхКонтрагентов 	= РеестрЗапланированных.ВыгрузитьКолонку("Контрагент");
			ПараметрыКлюча 			= Новый Структура("Период, Контрагент", СтрокаОбъектСобытия.ДатаСменыСтатуса, СтрокаОбъектСобытия.Контрагент);
			ПараметрыМассив = Новый Массив;
			ПараметрыМассив.Добавить(ПараметрыКлюча); 		
			КлючЗаписи 				= Новый("РегистрСведенийКлючЗаписи.СтатусыКонтрагентов", ПараметрыМассив);
			ЗарегистрироватьСобытие(СтрокаЗапланированныйТриггер, , Истина, КлючЗаписи, МассивИсключительноРегламентныхТриггеров);
		КонецЦикла;	
	КонецЦикла;
	
	// Регистрируем регламентные (один раз в день для каждого).
	// Если для регламентного триггера данных для регистрации нет - регистрируем пустую строчку в журнале,
	// с целью оптимизации общего механизма
	Для Каждого СтрокаТриггер Из ТаблицаРегламентныхТриггеров Цикл
		ЗарегистрироватьСобытие(СтрокаТриггер, , , , МассивИсключительноРегламентныхТриггеров);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Зарегистрировать событие
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  РегистрацияПоПодписке	 - 	 - 
//
Процедура ЗарегистрироватьСобытие(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено, МассивИсключительноРегламентныхТриггеров = Неопределено, РегистрацияВФоне = Ложь) Экспорт
	
	// 1. Инициализируем актуальный план действий триггерного события
	// 2. Регистрируем некондиционные действия триггерного события
	ДанныеТриггера.ПланДействийТриггерногоСобытия = ПолучитьТаблицуПланаДействийТриггерногоСобытия(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	
	// Если план действий пустой (не актуальный) - уходим
	Если ДанныеТриггера.ПланДействийТриггерногоСобытия.Количество() = 0 Тогда
		// Отклоняем некондиционные действия
		ЗарегистрироватьПланируемыеСобытия(ДанныеТриггера.ТаблицаНекондиционныхДействий, Истина);
		Возврат;
	КонецЕсли;
	
	// Получаем данные для регистрации события, фильтруем согласно отборов, установленных в триггерном событии
	ТаблицаДанныхОбъекта = ПолучитьДанныеДляРегистрацииСобытия(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	
	// Отклоняем некондиционные действия
	ЗарегистрироватьПланируемыеСобытия(ДанныеТриггера.ТаблицаНекондиционныхДействий, Истина);
	
	Если РегистрацияЗапланированных Тогда
		// Проверяем прошли ли запланированные строчки через систему фильтрации		
		АктуализироватьЗапланированныеСобытияПослеФильтрации(ДанныеТриггера, ОбъектСобытия, ТаблицаДанныхОбъекта);
		// Уходим, если по итогу событий для регистрации триггера не оказалось
		Если ТаблицаДанныхОбъекта = Неопределено ИЛИ ТаблицаДанныхОбъекта.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;	
	ИначеЕсли РегистрацияПоПодписке Тогда 
		
	Иначе
		Если НЕ ТаблицаДанныхОбъекта = Неопределено И НЕ ТаблицаДанныхОбъекта.Количество() = 0 Тогда 
			// Если это активация и события получили по регламенту как не запланированные, хотя они должны по условиям триггера планироваться в момент активации в пределах дня активции, тогда активация была будующей датой и она сейчас настала.
			// Необходимо запланировать с учетом смещения часов или минут и уйти. Регламент другим пакетом подхватит этот план в нужное время и зарегистрирует.
		Иначе
			// Если актуальные события не наступили - уходим, регистрируя пустую строчку с целью оптимизации общего механизма			
			Если НЕ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе И НЕ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана Тогда 
				Если НЕ МассивИсключительноРегламентныхТриггеров = Неопределено И ТипЗнч(МассивИсключительноРегламентныхТриггеров) = Тип("Массив") Тогда 
					Если НЕ МассивИсключительноРегламентныхТриггеров.Найти(ДанныеТриггера.УсловиеСобытия) = Неопределено Тогда 
						ЗарегистрироватьПланируемыеСобытия(Неопределено, , ДанныеТриггера.ПланДействийТриггерногоСобытия);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ТаблицаДанныхОбъекта = Неопределено ИЛИ ТаблицаДанныхОбъекта.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
		
	// Инициализируем параметры шаблона
	ПараметрыРегистрации = Новый Структура();
	ПараметрыРегистрации.Вставить("ДанныеТриггера"							, ПреобразоватьВСтруктуру(ДанныеТриггера));
	ПараметрыРегистрации.Вставить("РегистрацияПоПодписке"					, РегистрацияПоПодписке);
	ПараметрыРегистрации.Вставить("РегистрацияЗапланированных"				, РегистрацияЗапланированных);
	ПараметрыРегистрации.Вставить("ОбъектСобытия"							, ОбъектСобытия);
	ПараметрыРегистрации.Вставить("МассивИсключительноРегламентныхТриггеров", МассивИсключительноРегламентныхТриггеров);
	ПараметрыРегистрации.Вставить("РегистрацияВФоне"						, РегистрацияВФоне);
		
	ИнициализироватьПараметрыШаблона(ДанныеТриггера, ПараметрыРегистрации, ТаблицаДанныхОбъекта, РегистрацияВФоне);
	
	Если РегистрацияВФоне = Истина ИЛИ ДанныеТриггера.ПланДействийТриггерногоСобытия.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
		
	// Подготовим структуру контактных данных
	СтруктураКонтактнойИнформации = Новый Структура;
	// Структура может содержать следующие таблицы:
	// - ТаблицаКлиентовСНомерамиТелефонов
	// - ТаблицаКлиентовСУказаннымиEmail
	// - ТаблицаОсновныхМенеджеров
	// - ТаблицаСотрудниковСНомерамиТелефонов
	// - ТаблицаСотрудниковСУказаннымиEmail
	ИнициализироватьСтруктуруКонтактнойИнформации(ДанныеТриггера, ТаблицаДанныхОбъекта, СтруктураКонтактнойИнформации);
	
	// Подготовим таблицу с расписанием работы СЕ
	ТаблицаВремениРаботыСтруктурнойЕдиницы = ИнициализироватьТаблицуВремениРаботыСтруктурнойЕдиницы(ТаблицаДанныхОбъекта, ДанныеТриггера);
	
	// Генерируем действия, указанные в триггере
	НачатьГенерациюОбъектовИнформирования(ДанныеТриггера,
											ТаблицаДанныхОбъекта,
											СтруктураКонтактнойИнформации,
											ТаблицаВремениРаботыСтруктурнойЕдиницы,
											ПараметрыРегистрации);
	
КонецПроцедуры

// Функция - Получить таблицу плана действий триггерного события
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуПланаДействийТриггерногоСобытия(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия)
	
	Если НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия = Неопределено Тогда
		Возврат ДанныеТриггера.ПланДействийТриггерногоСобытия;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТриггерноеСобытие"										, ДанныеТриггера.ТриггерноеСобытие);
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"									, РегистрацияПоПодписке);
	УстановитьПараметрыСообщенийДляТриггерныхДействий(Запрос);
	
	Если РегистрацияЗапланированных Тогда                  
		
#Область _____________АКТУАЛИЗАЦИЯ_ПЛАНА_ДЕЙСТВИЯ_ДЛЯ_ЗАПЛАНИРОВАННЫХ_______________
		
		Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ДанныеТриггера.РеестрЗапланированных, "РеестрЗапланированных");
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеестрЗапланированных.Период КАК Период,
		               |	РеестрЗапланированных.ТриггерноеСобытие КАК ТриггерноеСобытие,
		               |	РеестрЗапланированных.ДатаСменыСтатуса КАК ДатаСменыСтатуса,
		               |	РеестрЗапланированных.Контрагент КАК Контрагент,
		               |	РеестрЗапланированных.ОбъектСобытия КАК ОбъектСобытия,
		               |	РеестрЗапланированных.ИсточникСобытия КАК ИсточникСобытия,
		               |	РеестрЗапланированных.ИдентификаторДействия КАК ИдентификаторДействия,
		               |	РеестрЗапланированных.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	РеестрЗапланированных.Подтверждено КАК Подтверждено
		               |ПОМЕСТИТЬ ТаблицаРеестрЗапланированных
		               |ИЗ
		               |	РеестрЗапланированных КАК РеестрЗапланированных
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ЖурналРегистрацииТриггерныхСобытий.Период,
		               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
		               |	РеестрЗапланированных.ДатаСменыСтатуса,
		               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия,
		               |	ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия,
		               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
		               |	ЖурналРегистрацииТриггерныхСобытий.РегистрацияПоПодписке,
		               |	ИСТИНА
		               |ИЗ
		               |	РеестрЗапланированных КАК РеестрЗапланированных
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |		ПО РеестрЗапланированных.ТриггерноеСобытие = ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие
		               |			И РеестрЗапланированных.Контрагент = ЖурналРегистрацииТриггерныхСобытий.Контрагент
		               |			И РеестрЗапланированных.ОбъектСобытия = ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		               |			И РеестрЗапланированных.ИсточникСобытия = ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия
		               |			И РеестрЗапланированных.ИдентификаторДействия <> ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия
		               |			И РеестрЗапланированных.РегистрацияПоПодписке = ЖурналРегистрацииТриггерныхСобытий.РегистрацияПоПодписке
		               |ГДЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТриггерныеСобытияДействия.Ссылка КАК ТриггерноеСобытие,
		               |	ЕСТЬNULL(ТаблицаРеестрЗапланированных.ДатаСменыСтатуса, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыСтатуса,
		               |	ЕСТЬNULL(ТаблицаРеестрЗапланированных.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
		               |	ЕСТЬNULL(ТаблицаРеестрЗапланированных.ОбъектСобытия, НЕОПРЕДЕЛЕНО) КАК ОбъектСобытия,
		               |	ЕСТЬNULL(ТаблицаРеестрЗапланированных.ИсточникСобытия, НЕОПРЕДЕЛЕНО) КАК ИсточникСобытия,
		               |	ЕСТЬNULL(ТаблицаРеестрЗапланированных.РегистрацияПоПодписке, ЛОЖЬ) КАК РегистрацияПоПодписке,
		               |	ЕСТЬNULL(ТаблицаРеестрЗапланированных.Подтверждено, ЛОЖЬ) КАК Подтверждено,
		               |	ТриггерныеСобытияДействия.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
		               |	ВЫБОР
		               |		КОГДА ТриггерныеСобытияДействия.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |				И ТриггерныеСобытияДействия.Ссылка.Активно = ИСТИНА
		               |				И ТриггерныеСобытияДействия.Использование = ИСТИНА
		               |				И ТриггерныеСобытияДействия.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
		               |				И ТриггерныеСобытияДействия.Удалено = ЛОЖЬ
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ДействиеАктуально,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрЗапланированных.ТриггерноеСобытие ЕСТЬ NULL
		               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
		               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		               |	КОНЕЦ КАК СтатусРегистрации,
		               |	ТриггерныеСобытияДействия.Ссылка.Активно КАК Активно,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрЗапланированных.ТриггерноеСобытие ЕСТЬ NULL
		               |			ТОГДА ТриггерныеСобытияДействия.ИдентификаторДействия
		               |		ИНАЧЕ ТаблицаРеестрЗапланированных.ИдентификаторДействия
		               |	КОНЕЦ КАК ИдентификаторДействия,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрЗапланированных.ТриггерноеСобытие ЕСТЬ NULL
		               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		               |		ИНАЧЕ ТаблицаРеестрЗапланированных.Период
		               |	КОНЕЦ КАК ПериодОтбора,
		               |	ТриггерныеСобытияДействия.Использование КАК Использование,
		               |	ТриггерныеСобытияДействия.ВидДействия КАК ВидДействия,
		               |	ТриггерныеСобытияДействия.ВидАдресата КАК ВидАдресата,
		               |	ТриггерныеСобытияДействия.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
		               |	ТриггерныеСобытияДействия.Адресат КАК Адресат,
		               |	ТриггерныеСобытияДействия.ОтправкаPush КАК ОтправкаPush,
		               |	ТриггерныеСобытияДействия.ОтправкаPushWallet КАК ОтправкаPushWallet,
		               |	ТриггерныеСобытияДействия.ОтправкаMessenger КАК ОтправкаMessenger,
		               |	ТриггерныеСобытияДействия.ОтправкаSMS КАК ОтправкаSMS,
		               |	ТриггерныеСобытияДействия.КаналСистемыСообщений КАК КаналСистемыСообщений,
		               |	ТриггерныеСобытияДействия.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
		               |	ТриггерныеСобытияДействия.АккаунтSMS КАК АккаунтSMS,
		               |	ТриггерныеСобытияДействия.АккаунтEmail КАК АккаунтEmail,
		               |	ТриггерныеСобытияДействия.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
		               |	ТриггерныеСобытияДействия.ВидСделки КАК ВидСделки,
		               |	ТриггерныеСобытияДействия.ЭтапСделки КАК ЭтапСделки,
		               |	ТриггерныеСобытияДействия.СоздаватьСделку КАК СоздаватьСделку,
		               |	ТриггерныеСобытияДействия.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
		               |	ТриггерныеСобытияДействия.СценарийЧатБота КАК СценарийЧатБота,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения КАК ШаблонСообщения,
		               |	ТриггерныеСобытияДействия.Описание КАК Описание,
		               |	ВЫБОР
		               |		КОГДА ТриггерныеСобытияДействия.Ссылка.ПометкаУдаления = ИСТИНА
		               |			ТОГДА &ПользовательПометилНаУдалениеТриггер
		               |		КОГДА ТриггерныеСобытияДействия.Ссылка.Активно = ЛОЖЬ
		               |			ТОГДА &ПользовательДеактивировалТриггер
		               |		КОГДА ТриггерныеСобытияДействия.Использование = ЛОЖЬ
		               |			ТОГДА &ПользовательДеактивировалДействие
		               |		КОГДА ТриггерныеСобытияДействия.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
		               |			ТОГДА &ПользовательНеУказалВидДействия
		               |		КОГДА ТриггерныеСобытияДействия.Удалено = ИСТИНА
		               |			ТОГДА &ПользовательУдалилДействие
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК Сообщение,
		               |	ТриггерныеСобытияДействия.Удалено КАК Удалено
		               |ПОМЕСТИТЬ ТаблицаРеестрАктуализацииЗапланированных
		               |ИЗ
		               |	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытияДействия
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРеестрЗапланированных КАК ТаблицаРеестрЗапланированных
		               |		ПО ТриггерныеСобытияДействия.Ссылка = ТаблицаРеестрЗапланированных.ТриггерноеСобытие
		               |			И ТриггерныеСобытияДействия.ИдентификаторДействия = ТаблицаРеестрЗапланированных.ИдентификаторДействия
		               |ГДЕ
		               |	ТриггерныеСобытияДействия.Ссылка = &ТриггерноеСобытие
		               |	И ЕСТЬNULL(ТаблицаРеестрЗапланированных.Подтверждено, ЛОЖЬ) = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаРеестрАктуализацииЗапланированных.ПериодОтбора КАК ПериодОтбора,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаЗапланированная,
		               |	ТаблицаРеестрАктуализацииЗапланированных.ТриггерноеСобытие КАК ТриггерноеСобытие,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
		               |				И ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ТОГДА ЕСТЬNULL(ТаблицаРеестрЗапланированных.Контрагент, ТаблицаРеестрАктуализацииЗапланированных.Контрагент)
		               |		ИНАЧЕ ТаблицаРеестрАктуализацииЗапланированных.Контрагент
		               |	КОНЕЦ КАК Контрагент,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
		               |				И ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ТОГДА ЕСТЬNULL(ТаблицаРеестрЗапланированных.ОбъектСобытия, ТаблицаРеестрАктуализацииЗапланированных.ОбъектСобытия)
		               |		ИНАЧЕ ТаблицаРеестрАктуализацииЗапланированных.ОбъектСобытия
		               |	КОНЕЦ КАК ОбъектСобытия,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
		               |				И ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ТОГДА ЕСТЬNULL(ТаблицаРеестрЗапланированных.ИсточникСобытия, ТаблицаРеестрАктуализацииЗапланированных.ИсточникСобытия)
		               |		ИНАЧЕ ТаблицаРеестрАктуализацииЗапланированных.ИсточникСобытия
		               |	КОНЕЦ КАК ИсточникСобытия,
		               |	ТаблицаРеестрАктуализацииЗапланированных.ИдентификаторДействия КАК ИдентификаторДействия,
		               |	ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально КАК ДействиеАктуально,
		               |	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено) КАК СтатусКДействию,
		               |	ТаблицаРеестрАктуализацииЗапланированных.Описание КАК Описание,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		               |				И НЕ ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ТОГДА ТаблицаРеестрАктуализацииЗапланированных.Сообщение
		               |		ИНАЧЕ &ПользовательДобавилДействиеВПланПослеМоментаПланирования
		               |	КОНЕЦ КАК Сообщение,
		               |	ТаблицаРеестрАктуализацииЗапланированных.РегистрацияПоПодписке КАК РегистрацияПоПодписке
		               |ИЗ
		               |	ТаблицаРеестрАктуализацииЗапланированных КАК ТаблицаРеестрАктуализацииЗапланированных
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРеестрЗапланированных КАК ТаблицаРеестрЗапланированных
		               |		ПО ТаблицаРеестрАктуализацииЗапланированных.ТриггерноеСобытие = ТаблицаРеестрЗапланированных.ТриггерноеСобытие
		               |			И ТаблицаРеестрАктуализацииЗапланированных.ИдентификаторДействия <> ТаблицаРеестрЗапланированных.ИдентификаторДействия
		               |			И (ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено))
		               |			И (ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально)
		               |			И (ТаблицаРеестрЗапланированных.Подтверждено = ЛОЖЬ)
		               |ГДЕ
		               |	(ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		               |				И НЕ ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ИЛИ ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
		               |				И ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаРеестрАктуализацииЗапланированных.ПериодОтбора,
		               |	ТаблицаРеестрАктуализацииЗапланированных.ТриггерноеСобытие,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
		               |				И ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ТОГДА ЕСТЬNULL(ТаблицаРеестрЗапланированных.Контрагент, ТаблицаРеестрАктуализацииЗапланированных.Контрагент)
		               |		ИНАЧЕ ТаблицаРеестрАктуализацииЗапланированных.Контрагент
		               |	КОНЕЦ,
		               |	ТаблицаРеестрАктуализацииЗапланированных.Описание,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		               |				И НЕ ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ТОГДА ТаблицаРеестрАктуализацииЗапланированных.Сообщение
		               |		ИНАЧЕ &ПользовательДобавилДействиеВПланПослеМоментаПланирования
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
		               |				И ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ТОГДА ЕСТЬNULL(ТаблицаРеестрЗапланированных.ОбъектСобытия, ТаблицаРеестрАктуализацииЗапланированных.ОбъектСобытия)
		               |		ИНАЧЕ ТаблицаРеестрАктуализацииЗапланированных.ОбъектСобытия
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ТаблицаРеестрАктуализацииЗапланированных.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
		               |				И ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально
		               |			ТОГДА ЕСТЬNULL(ТаблицаРеестрЗапланированных.ИсточникСобытия, ТаблицаРеестрАктуализацииЗапланированных.ИсточникСобытия)
		               |		ИНАЧЕ ТаблицаРеестрАктуализацииЗапланированных.ИсточникСобытия
		               |	КОНЕЦ,
		               |	ТаблицаРеестрАктуализацииЗапланированных.ИдентификаторДействия,
		               |	ТаблицаРеестрАктуализацииЗапланированных.ДействиеАктуально,
		               |	ТаблицаРеестрАктуализацииЗапланированных.РегистрацияПоПодписке
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТриггерныеСобытияДействия.ПериодОтбора КАК ПериодОтбора,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаЗапланированная,
		               |	ТриггерныеСобытияДействия.ТриггерноеСобытие КАК ТриггерноеСобытие,
		               |	ТриггерныеСобытияДействия.ДатаСменыСтатуса КАК ДатаСменыСтатуса,
		               |	ТриггерныеСобытияДействия.Контрагент КАК Контрагент,
		               |	ТриггерныеСобытияДействия.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТриггерныеСобытияДействия.ИсточникСобытия КАК ИсточникСобытия,
		               |	ТриггерныеСобытияДействия.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТриггерныеСобытияДействия.ИдентификаторДействия КАК ИдентификаторДействия,
		               |	ТриггерныеСобытияДействия.Использование КАК Использование,
		               |	ТриггерныеСобытияДействия.ВидДействия КАК ВидДействия,
		               |	ТриггерныеСобытияДействия.ВидАдресата КАК ВидАдресата,
		               |	ТриггерныеСобытияДействия.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
		               |	ТриггерныеСобытияДействия.Адресат КАК Адресат,
		               |	ТриггерныеСобытияДействия.ОтправкаPush КАК ОтправкаPush,
		               |	ТриггерныеСобытияДействия.ОтправкаPushWallet КАК ОтправкаPushWallet,
		               |	ТриггерныеСобытияДействия.ОтправкаMessenger КАК ОтправкаMessenger,
		               |	ТриггерныеСобытияДействия.ОтправкаSMS КАК ОтправкаSMS,
		               |	ТриггерныеСобытияДействия.КаналСистемыСообщений КАК КаналСистемыСообщений,
		               |	ТриггерныеСобытияДействия.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
		               |	ТриггерныеСобытияДействия.АккаунтSMS КАК АккаунтSMS,
		               |	ТриггерныеСобытияДействия.АккаунтEmail КАК АккаунтEmail,
		               |	ТриггерныеСобытияДействия.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
		               |	ТриггерныеСобытияДействия.ВидСделки КАК ВидСделки,
		               |	ТриггерныеСобытияДействия.ЭтапСделки КАК ЭтапСделки,
		               |	ТриггерныеСобытияДействия.СоздаватьСделку КАК СоздаватьСделку,
		               |	ТриггерныеСобытияДействия.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
		               |	ТриггерныеСобытияДействия.СценарийЧатБота КАК СценарийЧатБота,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения КАК ШаблонСообщения,
		               |	ТриггерныеСобытияДействия.Описание КАК Описание,
		               |	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено) КАК СтатусКДействию,
		               |	ВЫРАЗИТЬ("""" КАК СТРОКА(1024)) КАК Сообщение,
		               |	ТриггерныеСобытияДействия.Подтверждено КАК Подтверждено
		               |ПОМЕСТИТЬ ТаблицаПланДействий
		               |ИЗ
		               |	ТаблицаРеестрАктуализацииЗапланированных КАК ТриггерныеСобытияДействия
		               |ГДЕ
		               |	ТриггерныеСобытияДействия.СтатусРегистрации = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		               |	И ТриггерныеСобытияДействия.ДействиеАктуально
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТриггерныеСобытияДействия.СоздаватьСделку,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения,
		               |	ТриггерныеСобытияДействия.СценарийЧатБота,
		               |	ТриггерныеСобытияДействия.Описание,
		               |	ТриггерныеСобытияДействия.ТриггерноеСобытие,
		               |	ТриггерныеСобытияДействия.ДатаСменыСтатуса,
		               |	ТриггерныеСобытияДействия.ОбъектСобытия,
		               |	ТриггерныеСобытияДействия.ИсточникСобытия,
		               |	ТриггерныеСобытияДействия.РегистрацияПоПодписке,
		               |	ТриггерныеСобытияДействия.Адресат,
		               |	ТриггерныеСобытияДействия.ОтправкаPush,
		               |	ТриггерныеСобытияДействия.ОтправкаPushWallet,
		               |	ТриггерныеСобытияДействия.ОтправкаMessenger,
		               |	ТриггерныеСобытияДействия.ОтправкаSMS,
		               |	ТриггерныеСобытияДействия.АккаунтВнешнейСистемы,
		               |	ТриггерныеСобытияДействия.АккаунтSMS,
		               |	ТриггерныеСобытияДействия.АккаунтEmail,
		               |	ТриггерныеСобытияДействия.ЗадачаРежимНапоминания,
		               |	ТриггерныеСобытияДействия.ВидАдресата,
		               |	ТриггерныеСобытияДействия.ВидСделки,
		               |	ТриггерныеСобытияДействия.ЭтапСделки,
		               |	ТриггерныеСобытияДействия.ИдентификаторДействия,
		               |	ТриггерныеСобытияДействия.Контрагент,
		               |	ТриггерныеСобытияДействия.Использование,
		               |	ТриггерныеСобытияДействия.ВидДействия,
		               |	ТриггерныеСобытияДействия.ВидАдресатаРезервный,
		               |	ТриггерныеСобытияДействия.КаналСистемыСообщений,
		               |	ТриггерныеСобытияДействия.ПериодОтбора,
		               |	ТриггерныеСобытияДействия.КоличествоГенерацийСделок,
		               |	ТриггерныеСобытияДействия.Подтверждено
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПланДействий.ПериодОтбора КАК ПериодОтбора,
		               |	ТаблицаПланДействий.ДатаЗапланированная КАК ДатаЗапланированная,
		               |	ТаблицаПланДействий.ТриггерноеСобытие КАК ТриггерноеСобытие,
		               |	ТаблицаПланДействий.ДатаСменыСтатуса КАК ДатаСменыСтатуса,
		               |	ТаблицаПланДействий.Контрагент КАК Контрагент,
		               |	ТаблицаПланДействий.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаПланДействий.ИсточникСобытия КАК ИсточникСобытия,
		               |	ТаблицаПланДействий.ИдентификаторДействия КАК ИдентификаторДействия,
		               |	ТаблицаПланДействий.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТаблицаПланДействий.Использование КАК Использование,
		               |	ТаблицаПланДействий.ВидДействия КАК ВидДействия,
		               |	ТаблицаПланДействий.ВидАдресата КАК ВидАдресата,
		               |	ТаблицаПланДействий.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
		               |	ТаблицаПланДействий.Адресат КАК Адресат,
		               |	ТаблицаПланДействий.ОтправкаPush КАК ОтправкаPush,
		               |	ТаблицаПланДействий.ОтправкаPushWallet КАК ОтправкаPushWallet,
		               |	ТаблицаПланДействий.ОтправкаMessenger КАК ОтправкаMessenger,
		               |	ТаблицаПланДействий.ОтправкаSMS КАК ОтправкаSMS,
		               |	ТаблицаПланДействий.КаналСистемыСообщений КАК КаналСистемыСообщений,
		               |	ТаблицаПланДействий.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
		               |	ТаблицаПланДействий.АккаунтSMS КАК АккаунтSMS,
		               |	ТаблицаПланДействий.АккаунтEmail КАК АккаунтEmail,
		               |	ТаблицаПланДействий.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
		               |	ТаблицаПланДействий.ВидСделки КАК ВидСделки,
		               |	ТаблицаПланДействий.ЭтапСделки КАК ЭтапСделки,
		               |	ТаблицаПланДействий.СоздаватьСделку КАК СоздаватьСделку,
		               |	ТаблицаПланДействий.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
		               |	ТаблицаПланДействий.СценарийЧатБота КАК СценарийЧатБота,
		               |	ТаблицаПланДействий.ШаблонСообщения КАК ШаблонСообщения,
		               |	ТаблицаПланДействий.Описание КАК Описание,
		               |	ТаблицаПланДействий.СтатусКДействию КАК СтатусКДействию,
		               |	ЕСТЬNULL(ШаблоныСообщений.СодержаниеМессенджер, """") КАК ШаблонСообщенияСодержаниеМессенджер,
		               |	ЕСТЬNULL(ШаблоныСообщений.Содержание, """") КАК ШаблонСообщенияСодержание,
		               |	ЕСТЬNULL(ШаблоныСообщений.СодержаниеPush, """") КАК ШаблонСообщенияСодержаниеPush,
		               |	ЕСТЬNULL(ШаблоныСообщений.ТекстHTML, """") КАК ШаблонСообщенияТекстHTML,
		               |	ЕСТЬNULL(ШаблоныСообщений.ЗадачаОписание, """") КАК ШаблонСообщенияЗадачаОписание,
		               |	ТаблицаПланДействий.Сообщение КАК Сообщение,
		               |	ТаблицаПланДействий.Подтверждено КАК Подтверждено
		               |ИЗ
		               |	ТаблицаПланДействий КАК ТаблицаПланДействий
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		               |		ПО ТаблицаПланДействий.ШаблонСообщения = ШаблоныСообщений.Ссылка";
		
		
		ПакетныйРезультат 								= Запрос.ВыполнитьПакет();
		ТаблицаНекондиционныхЗапланированныхДействий 	= ПакетныйРезультат[2].Выгрузить();
		ТаблицаПланаДействий		 					= ПакетныйРезультат[4].Выгрузить();
		
		Запрос.МенеджерВременныхТаблиц.Закрыть();
		
		//// Отклоняем некондиционные действия (1 этап: только для запланированных)	
		// ЗарегистрироватьПланируемыеСобытия(ТаблицаНекондиционныхДействий, Истина);
		
#КонецОбласти
		
	ИначеЕсли РегистрацияПоПодписке Тогда 
		
#Область ___________АКТУАЛИЗАЦИЯ_ПЛАНА_ДЕЙСТВИЯ_ДЛЯ_ТЕКУЩИХ_ПО_ПОДПИСКЕ_____________
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	&ПериодОтбора КАК ПериодОтбора,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаЗапланированная,
		               |	ТриггерныеСобытияДействия.Ссылка КАК ТриггерноеСобытие,
		               |	НЕОПРЕДЕЛЕНО КАК Контрагент,
		               |	&ОбъектСобытия КАК ОбъектСобытия,
		               |	ТриггерныеСобытияДействия.ИдентификаторДействия КАК ИдентификаторДействия,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТриггерныеСобытияДействия.Использование КАК Использование,
		               |	ТриггерныеСобытияДействия.ВидДействия КАК ВидДействия,
		               |	ТриггерныеСобытияДействия.ВидАдресата КАК ВидАдресата,
		               |	ТриггерныеСобытияДействия.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
		               |	ТриггерныеСобытияДействия.Адресат КАК Адресат,
		               |	ТриггерныеСобытияДействия.ОтправкаPush КАК ОтправкаPush,
		               |	ТриггерныеСобытияДействия.ОтправкаPushWallet КАК ОтправкаPushWallet,
		               |	ТриггерныеСобытияДействия.ОтправкаMessenger КАК ОтправкаMessenger,
		               |	ТриггерныеСобытияДействия.ОтправкаSMS КАК ОтправкаSMS,
		               |	ТриггерныеСобытияДействия.КаналСистемыСообщений КАК КаналСистемыСообщений,
		               |	ТриггерныеСобытияДействия.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
		               |	ТриггерныеСобытияДействия.АккаунтSMS КАК АккаунтSMS,
		               |	ТриггерныеСобытияДействия.АккаунтEmail КАК АккаунтEmail,
		               |	ТриггерныеСобытияДействия.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
		               |	ТриггерныеСобытияДействия.ВидСделки КАК ВидСделки,
		               |	ТриггерныеСобытияДействия.ЭтапСделки КАК ЭтапСделки,
		               |	ТриггерныеСобытияДействия.СоздаватьСделку КАК СоздаватьСделку,
		               |	ТриггерныеСобытияДействия.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
		               |	ТриггерныеСобытияДействия.СценарийЧатБота КАК СценарийЧатБота,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения КАК ШаблонСообщения,
		               |	ТриггерныеСобытияДействия.Описание КАК Описание,
		               |	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено) КАК СтатусКДействию,
		               |	"""" КАК Сообщение
		               |ПОМЕСТИТЬ ТаблицаПланДействий
		               |ИЗ
		               |	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытияДействия
		               |ГДЕ
		               |	ТриггерныеСобытияДействия.Ссылка = &ТриггерноеСобытие
		               |	И ТриггерныеСобытияДействия.Использование = ИСТИНА
		               |	И ТриггерныеСобытияДействия.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
		               |	И ТриггерныеСобытияДействия.Удалено = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Контрагент
		               |ПОМЕСТИТЬ ТаблицаКонтрагентов
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка В(&МассивКонтрагентов)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПланДействий.ПериодОтбора КАК ПериодОтбора,
		               |	ТаблицаПланДействий.ДатаЗапланированная КАК ДатаЗапланированная,
		               |	ТаблицаПланДействий.ТриггерноеСобытие КАК ТриггерноеСобытие,
		               |	ВЫБОР
		               |		КОГДА ТаблицаКонтрагентов.Контрагент ЕСТЬ NULL
		               |				ИЛИ ТаблицаКонтрагентов.Контрагент = НЕОПРЕДЕЛЕНО
		               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |		ИНАЧЕ ТаблицаКонтрагентов.Контрагент
		               |	КОНЕЦ КАК Контрагент,
		               |	ТаблицаПланДействий.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаПланДействий.ИдентификаторДействия КАК ИдентификаторДействия,
		               |	ТаблицаПланДействий.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТаблицаПланДействий.Использование КАК Использование,
		               |	ТаблицаПланДействий.ВидДействия КАК ВидДействия,
		               |	ТаблицаПланДействий.ВидАдресата КАК ВидАдресата,
		               |	ТаблицаПланДействий.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
		               |	ТаблицаПланДействий.Адресат КАК Адресат,
		               |	ТаблицаПланДействий.ОтправкаPush КАК ОтправкаPush,
		               |	ТаблицаПланДействий.ОтправкаPushWallet КАК ОтправкаPushWallet,
		               |	ТаблицаПланДействий.ОтправкаMessenger КАК ОтправкаMessenger,
		               |	ТаблицаПланДействий.ОтправкаSMS КАК ОтправкаSMS,
		               |	ТаблицаПланДействий.КаналСистемыСообщений КАК КаналСистемыСообщений,
		               |	ТаблицаПланДействий.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
		               |	ТаблицаПланДействий.АккаунтSMS КАК АккаунтSMS,
		               |	ТаблицаПланДействий.АккаунтEmail КАК АккаунтEmail,
		               |	ТаблицаПланДействий.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
		               |	ТаблицаПланДействий.ВидСделки КАК ВидСделки,
		               |	ТаблицаПланДействий.ЭтапСделки КАК ЭтапСделки,
		               |	ТаблицаПланДействий.СоздаватьСделку КАК СоздаватьСделку,
		               |	ТаблицаПланДействий.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
		               |	ТаблицаПланДействий.СценарийЧатБота КАК СценарийЧатБота,
		               |	ТаблицаПланДействий.ШаблонСообщения КАК ШаблонСообщения,
		               |	ТаблицаПланДействий.Описание КАК Описание,
		               |	ТаблицаПланДействий.СтатусКДействию КАК СтатусКДействию,
		               |	ТаблицаПланДействий.Сообщение КАК Сообщение
		               |ПОМЕСТИТЬ ТаблицаПланДействийАктуальный
		               |ИЗ
		               |	ТаблицаПланДействий КАК ТаблицаПланДействий
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
		               |		ПО ТаблицаПланДействий.Контрагент <> ТаблицаКонтрагентов.Контрагент
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаПланДействий.Описание,
		               |	ТаблицаПланДействий.СтатусКДействию,
		               |	ТаблицаПланДействий.Сообщение,
		               |	ТаблицаПланДействий.ВидСделки,
		               |	ТаблицаПланДействий.ЭтапСделки,
		               |	ТаблицаПланДействий.СоздаватьСделку,
		               |	ТаблицаПланДействий.ВидАдресата,
		               |	ТаблицаПланДействий.ОбъектСобытия,
		               |	ТаблицаПланДействий.ШаблонСообщения,
		               |	ТаблицаПланДействий.СценарийЧатБота,
		               |	ТаблицаПланДействий.КаналСистемыСообщений,
		               |	ТаблицаПланДействий.АккаунтВнешнейСистемы,
		               |	ТаблицаПланДействий.ТриггерноеСобытие,
		               |	ТаблицаПланДействий.ДатаЗапланированная,
		               |	ТаблицаПланДействий.ИдентификаторДействия,
		               |	ТаблицаПланДействий.Использование,
		               |	ТаблицаПланДействий.Адресат,
		               |	ТаблицаПланДействий.ОтправкаPush,
		               |	ТаблицаПланДействий.ОтправкаPushWallet,
		               |	ТаблицаПланДействий.ОтправкаMessenger,
		               |	ТаблицаПланДействий.ОтправкаSMS,
		               |	ТаблицаПланДействий.ВидАдресатаРезервный,
		               |	ТаблицаПланДействий.АккаунтSMS,
		               |	ТаблицаПланДействий.ПериодОтбора,
		               |	ТаблицаПланДействий.АккаунтEmail,
		               |	ТаблицаПланДействий.ЗадачаРежимНапоминания,
		               |	ВЫБОР
		               |		КОГДА ТаблицаКонтрагентов.Контрагент ЕСТЬ NULL
		               |				ИЛИ ТаблицаКонтрагентов.Контрагент = НЕОПРЕДЕЛЕНО
		               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |		ИНАЧЕ ТаблицаКонтрагентов.Контрагент
		               |	КОНЕЦ,
		               |	ТаблицаПланДействий.ВидДействия,
		               |	ТаблицаПланДействий.РегистрацияПоПодписке,
		               |	ТаблицаПланДействий.КоличествоГенерацийСделок
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПланДействийАктуальный.ПериодОтбора КАК ПериодОтбора,
		               |	ТаблицаПланДействийАктуальный.ДатаЗапланированная КАК ДатаЗапланированная,
		               |	ТаблицаПланДействийАктуальный.ТриггерноеСобытие КАК ТриггерноеСобытие,
		               |	ТаблицаПланДействийАктуальный.Контрагент КАК Контрагент,
		               |	ТаблицаПланДействийАктуальный.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаПланДействийАктуальный.ИдентификаторДействия КАК ИдентификаторДействия,
		               |	ТаблицаПланДействийАктуальный.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТаблицаПланДействийАктуальный.Использование КАК Использование,
		               |	ТаблицаПланДействийАктуальный.ВидДействия КАК ВидДействия,
		               |	ТаблицаПланДействийАктуальный.ВидАдресата КАК ВидАдресата,
		               |	ТаблицаПланДействийАктуальный.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
		               |	ТаблицаПланДействийАктуальный.Адресат КАК Адресат,
		               |	ТаблицаПланДействийАктуальный.ОтправкаPush КАК ОтправкаPush,
		               |	ТаблицаПланДействийАктуальный.ОтправкаPushWallet КАК ОтправкаPushWallet,
		               |	ТаблицаПланДействийАктуальный.ОтправкаMessenger КАК ОтправкаMessenger,
		               |	ТаблицаПланДействийАктуальный.ОтправкаSMS КАК ОтправкаSMS,
		               |	ТаблицаПланДействийАктуальный.КаналСистемыСообщений КАК КаналСистемыСообщений,
		               |	ТаблицаПланДействийАктуальный.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
		               |	ТаблицаПланДействийАктуальный.АккаунтSMS КАК АккаунтSMS,
		               |	ТаблицаПланДействийАктуальный.АккаунтEmail КАК АккаунтEmail,
		               |	ТаблицаПланДействийАктуальный.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
		               |	ТаблицаПланДействийАктуальный.ВидСделки КАК ВидСделки,
		               |	ТаблицаПланДействийАктуальный.ЭтапСделки КАК ЭтапСделки,
		               |	ТаблицаПланДействийАктуальный.СоздаватьСделку КАК СоздаватьСделку,
		               |	ТаблицаПланДействийАктуальный.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
		               |	ТаблицаПланДействийАктуальный.СценарийЧатБота КАК СценарийЧатБота,
		               |	ТаблицаПланДействийАктуальный.ШаблонСообщения КАК ШаблонСообщения,
		               |	ТаблицаПланДействийАктуальный.Описание КАК Описание,
		               |	ТаблицаПланДействийАктуальный.СтатусКДействию КАК СтатусКДействию,
		               |	ЕСТЬNULL(ШаблоныСообщений.СодержаниеМессенджер, """") КАК ШаблонСообщенияСодержаниеМессенджер,
		               |	ЕСТЬNULL(ШаблоныСообщений.Содержание, """") КАК ШаблонСообщенияСодержание,
		               |	ЕСТЬNULL(ШаблоныСообщений.СодержаниеPush, """") КАК ШаблонСообщенияСодержаниеPush,
		               |	ЕСТЬNULL(ШаблоныСообщений.ТекстHTML, """") КАК ШаблонСообщенияТекстHTML,
		               |	ЕСТЬNULL(ШаблоныСообщений.ЗадачаОписание, """") КАК ШаблонСообщенияЗадачаОписание,
		               |	ВЫРАЗИТЬ(ТаблицаПланДействийАктуальный.Сообщение КАК СТРОКА(1024)) КАК Сообщение
		               |ИЗ
		               |	ТаблицаПланДействийАктуальный КАК ТаблицаПланДействийАктуальный
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		               |		ПО ТаблицаПланДействийАктуальный.ШаблонСообщения = ШаблоныСообщений.Ссылка";
		
		Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса Тогда
			МассивКонтрагентов = Новый Массив;
			МассивКонтрагентов.Добавить(ОбъектСобытия.Контрагент);			
			Запрос.УстановитьПараметр("ОбъектСобытия"		, ВернутьСтатусКлиента(ОбъектСобытия.Контрагент, ОбъектСобытия.Период));	
			Запрос.УстановитьПараметр("МассивКонтрагентов"	, МассивКонтрагентов);
			Запрос.УстановитьПараметр("ПериодОтбора"		, ОбъектСобытия.Период);
		Иначе
			МассивКонтрагентов = Новый Массив;
			Если ТипЗнч(ОбъектСобытия) = Тип("СправочникСсылка.Контрагенты") Тогда
				Контрагент = ОбъектСобытия;
			Иначе 	
				Попытка
					Контрагент = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ОбъектСобытия, "Контрагент").Контрагент;
					Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
						Контрагент = Неопределено;
					КонецЕсли;	
				Исключение
					Контрагент = Неопределено;
				КонецПопытки;
			КонецЕсли;
			Если ЗначениеЗаполнено(Контрагент) Тогда
				МассивКонтрагентов.Добавить(Контрагент);
			КонецЕсли;
			Запрос.УстановитьПараметр("ОбъектСобытия"		, ОбъектСобытия);				
			Запрос.УстановитьПараметр("МассивКонтрагентов"	, МассивКонтрагентов);
			Запрос.УстановитьПараметр("ПериодОтбора"		, Дата(1, 1, 1));
		КонецЕсли;	
		
		ТаблицаПланаДействий = Запрос.Выполнить().Выгрузить();
		
#КонецОбласти
		
	Иначе // регламент
		
#Область __________АКТУАЛИЗАЦИЯ_ПЛАНА_ДЕЙСТВИЯ_ДЛЯ_ТЕКУЩИХ_ПО_РЕГЛАМЕНТУ____________
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодОтбора,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаЗапланированная,
		               |	ТриггерныеСобытияДействия.Ссылка КАК ТриггерноеСобытие,
		               |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		               |	НЕОПРЕДЕЛЕНО КАК ОбъектСобытия,
		               |	ТриггерныеСобытияДействия.ИдентификаторДействия КАК ИдентификаторДействия,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТриггерныеСобытияДействия.Использование КАК Использование,
		               |	ТриггерныеСобытияДействия.ВидДействия КАК ВидДействия,
		               |	ТриггерныеСобытияДействия.ВидАдресата КАК ВидАдресата,
		               |	ТриггерныеСобытияДействия.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
		               |	ТриггерныеСобытияДействия.Адресат КАК Адресат,
		               |	ТриггерныеСобытияДействия.ОтправкаPush КАК ОтправкаPush,
		               |	ТриггерныеСобытияДействия.ОтправкаPushWallet КАК ОтправкаPushWallet,
		               |	ТриггерныеСобытияДействия.ОтправкаMessenger КАК ОтправкаMessenger,
		               |	ТриггерныеСобытияДействия.ОтправкаSMS КАК ОтправкаSMS,
		               |	ТриггерныеСобытияДействия.КаналСистемыСообщений КАК КаналСистемыСообщений,
		               |	ТриггерныеСобытияДействия.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
		               |	ТриггерныеСобытияДействия.АккаунтSMS КАК АккаунтSMS,
		               |	ТриггерныеСобытияДействия.АккаунтEmail КАК АккаунтEmail,
		               |	ТриггерныеСобытияДействия.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
		               |	ТриггерныеСобытияДействия.ВидСделки КАК ВидСделки,
		               |	ТриггерныеСобытияДействия.ЭтапСделки КАК ЭтапСделки,
		               |	ТриггерныеСобытияДействия.СоздаватьСделку КАК СоздаватьСделку,
		               |	ТриггерныеСобытияДействия.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
		               |	ТриггерныеСобытияДействия.СценарийЧатБота КАК СценарийЧатБота,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения КАК ШаблонСообщения,
		               |	ТриггерныеСобытияДействия.Описание КАК Описание,
		               |	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено) КАК СтатусКДействию,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения.СодержаниеМессенджер КАК ШаблонСообщенияСодержаниеМессенджер,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения.Содержание КАК ШаблонСообщенияСодержание,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения.СодержаниеPush КАК ШаблонСообщенияСодержаниеPush,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения.ТекстHTML КАК ШаблонСообщенияТекстHTML,
		               |	ТриггерныеСобытияДействия.ШаблонСообщения.ЗадачаОписание КАК ШаблонСообщенияЗадачаОписание,
		               |	ВЫРАЗИТЬ("""" КАК СТРОКА(1024)) КАК Сообщение
		               |ИЗ
		               |	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытияДействия
		               |ГДЕ
		               |	ТриггерныеСобытияДействия.Ссылка = &ТриггерноеСобытие
		               |	И ТриггерныеСобытияДействия.Использование = ИСТИНА
		               |	И ТриггерныеСобытияДействия.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
		               |	И ТриггерныеСобытияДействия.Удалено = ЛОЖЬ";
		
		ТаблицаПланаДействий = Запрос.Выполнить().Выгрузить();
		
#КонецОбласти
		
	КонецЕсли;

	МассивНекондиционныхДействий = Новый Массив;
	ТаблицаНекондиционныхДействий = ТаблицаПланаДействий.СкопироватьКолонки();

	ПараметрыЧатБота = ПолучитьПараметрыЧатБота(ТаблицаПланаДействий, ДанныеТриггера.УсловиеСобытия);
	
	// Анализируем и накапливаем некондиционные действия (2 этап: для всех триггеров)
	Для Каждого СтрокаДействия Из ТаблицаПланаДействий Цикл
		
		// Проверка для действия "Поставить задачу"		
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресата) Тогда
				СтрокаДействия.Сообщение = НСтр("ru='Не указан вид исполнителя!';en='The type of performer is not specified!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
				СтрокаДействия.Сообщение = НСтр("ru='Не указан исполнитель!';en='The performer is not specified!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);				
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.СегментыСотрудников")) Тогда
				СтрокаДействия.Сообщение = НСтр("ru='Не указан сегмент исполнителей!';en='Do not specify the segment of performers!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);				
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресатаРезервный) Тогда
					СтрокаДействия.Сообщение = НСтр("ru='Не указан резервный вид исполнителя!';en='The backup type of performer is not specified!'");
					ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					Продолжить;
				ИначеЕсли СтрокаДействия.ВидАдресатаРезервный = Перечисления.ВидыАдресатов.Сотрудник И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
					СтрокаДействия.Сообщение = НСтр("ru='Не указан резервный исполнитель!';en='A backup performer was not specified!'");
					ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					Продолжить;
				ИначеЕсли СтрокаДействия.ВидАдресатаРезервный = Перечисления.ВидыАдресатов.СегментСотрудников И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.СегментыСотрудников")) Тогда
					СтрокаДействия.Сообщение = НСтр("ru='Не указан резервный сегмент исполнителей!';en='Do not specify a reserve segment performers!'");
					ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка для действия "Отправить сообщение"
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидАдресата) Тогда
				СтрокаДействия.Сообщение = НСтр("ru='Не указан вид адресата!';en='The type of recipient is not specified!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);									
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			ИначеЕсли СтрокаДействия.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник И (НЕ ЗначениеЗаполнено(СтрокаДействия.Адресат) ИЛИ ТипЗнч(СтрокаДействия.Адресат) <> Тип("СправочникСсылка.Сотрудники")) Тогда
				СтрокаДействия.Сообщение = НСтр("ru='Не указан адресат!';en='The recipient is not specified!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			ИначеЕсли СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаДействия.АккаунтEmail) Тогда
					СтрокаДействия.Сообщение = НСтр("ru='Не указан аккаунт Email-рассылки!';en='The Email mailing account is not specified!'");												
					ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаДействия.АккаунтEmail) И ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДействия.АккаунтEmail, "ИспользоватьДляОтправки") = Ложь Тогда 
					СтрокаДействия.Сообщение = НСтр("ru= 'Выбранная учетная запись электронной почты не активна';en= 'The selected email account is not active'");												
					ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					Продолжить;
				КонецЕсли;
			ИначеЕсли СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда 
				Если СтрокаДействия.ОтправкаSMS И НЕ ЗначениеЗаполнено(СтрокаДействия.АккаунтSMS) Тогда
					СтрокаДействия.Сообщение = НСтр("ru='Не указан аккаунт SMS-рассылки!';en='The SMS mailing account is not specified!'");												
					ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					Продолжить;
				КонецЕсли;	
				Если СтрокаДействия.ОтправкаMessenger И НЕ ЗначениеЗаполнено(СтрокаДействия.АккаунтВнешнейСистемы) Тогда
					СтрокаДействия.Сообщение = НСтр("ru='Не указан аккаунт системы сообщений!';en='Message system account not specified!'");						
					ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					Продолжить;
				КонецЕсли;	
				Если СтрокаДействия.ОтправкаMessenger Тогда
					// ТипВнешнейСистемы = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДействия.АккаунтВнешнейСистемы, "ТипВнешнейСистемы");
					// Если (ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk И НЕ ЗначениеЗаполнено(СтрокаДействия.КаналСистемыСообщений) Тогда 
					//	СтрокаДействия.Сообщение = НСтр("ru='Не указан канал системы сообщений!';en='The message system channel is not specified!'");
					//	ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					//	МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					//	Продолжить;
					// ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Chat2Desk Тогда 
					//	МассивКаналов = Мессенджер_КОРП.ПолучитьКаналыChat2Desk(СтрокаДействия.АккаунтВнешнейСистемы);
					//	СписокКаналов = Новый СписокЗначений;
					//	Для Каждого ЭлементКанал Из МассивКаналов Цикл 
					//		СписокКаналов.Добавить(ЭлементКанал.Значение, ЭлементКанал.Имя + " (" + Строка(ЭлементКанал.Значение) + ")");
					//	КонецЦикла;
					//	ЭлементСпискаКанал = СписокКаналов.НайтиПоЗначению(СтрокаДействия.КаналСистемыСообщений);
					//	Если ЭлементСпискаКанал = Неопределено И (СтрокаДействия.ОтправкаPush = Ложь И СтрокаДействия.ОтправкаPushWallet = Ложь И СтрокаДействия.ОтправкаSMS = Ложь) Тогда
					//		СтрокаДействия.Сообщение = НСтр("ru='Канал системы сообщений деактивирован!';en='The message system channel is deactivated!'");
					//		ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);					
					//		МассивНекондиционныхДействий.Добавить(СтрокаДействия);
					//		Продолжить;
					//	КонецЕсли;
					// КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаДействия.ШаблонСообщения) Тогда
				Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
					Если НЕ ЗначениеЗаполнено(СокрЛП(СтрокаДействия.ШаблонСообщенияТекстHTML)) Тогда 
						СтрокаДействия.Сообщение = НСтр("ru='Необходимо заполнить содержание в шаблоне Email-рассылки!';en='You must fill in the content in the Email mailing template!'");
						ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);						
						МассивНекондиционныхДействий.Добавить(СтрокаДействия);
						Продолжить;
					КонецЕсли;
				Иначе 
					Если НЕ ЗначениеЗаполнено(СокрЛП(СтрокаДействия.ШаблонСообщенияСодержаниеPush)) И НЕ ЗначениеЗаполнено(СокрЛП(СтрокаДействия.ШаблонСообщенияСодержание)) И НЕ ЗначениеЗаполнено(СокрЛП(СтрокаДействия.ШаблонСообщенияСодержаниеМессенджер)) Тогда 
						СтрокаДействия.Сообщение = НСтр("ru='Необходимо заполнить содержание в шаблоне SMS-рассылки!';en='You must fill in the content in the SMS mailing template!'");
						ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);						
						МассивНекондиционныхДействий.Добавить(СтрокаДействия);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка для действия "Активировать чат-бота"
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота Тогда
			Если НЕ ПараметрыЧатБота.РазрешенаРаботаСЧатБотом Тогда 
				СтрокаДействия.Сообщение = НСтр("ru='Для триггерного события запрещена работа с чат-ботом!';en='For a trigger event, work with a chatbot is prohibited!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			ИначеЕсли НЕ ПараметрыЧатБота.ИспользуетсяРасширениеМессенджер Тогда 
				СтрокаДействия.Сообщение = НСтр("ru='Расширение для работы с чат-ботом не активно!';en='The extension for working with the chatbot is not active!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;	
			ИначеЕсли НЕ ПараметрыЧатБота.ИспользуетсяРасширениеМессенджер Тогда 
				СтрокаДействия.Сообщение = НСтр("ru='Расширение для работы с мессенджером не активно!';en='The extension for working with the messenger is not active!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;	
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДействия.СценарийЧатБота) Тогда
				СтрокаДействия.Сообщение = НСтр("ru='Не указан сценарий чат-бота!';en='No chatbot script specified!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			ИначеЕсли НЕ ПараметрыЧатБота.ТаблицаСценариев = Неопределено Тогда 
				СтрокаСценарий = ПараметрыЧатБота.ТаблицаСценариев.Найти(СтрокаДействия.СценарийЧатБота, "СценарииЧатБота");
				Если НЕ СтрокаСценарий = Неопределено Тогда 
					Если СтрокаСценарий.ПометкаУдаления Тогда 
						СтрокаДействия.Сообщение = НСтр("ru='Сценарий помечен на удаление!';en='The script is marked for deletion!'");
						ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
						МассивНекондиционныхДействий.Добавить(СтрокаДействия);
						Продолжить;
					ИначеЕсли НЕ СтрокаСценарий.Используется Тогда
						СтрокаДействия.Сообщение = НСтр("ru='Сценарий деактивирован!';en='Scenario deactivated!'");
						ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
						МассивНекондиционныхДействий.Добавить(СтрокаДействия);
						Продолжить; 
					ИначеЕсли НЕ СтрокаСценарий.Доступно Тогда 
						СтрокаДействия.Сообщение = НСтр("ru='Сценарий не доступен для данного триггерного события!';en='Scenario not available for this trigger event!'");
						ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
						МассивНекондиционныхДействий.Добавить(СтрокаДействия);
						Продолжить;
					ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСценарий.ИмяМакетаПредопределенногоСценария) Тогда 
						СтрокаДействия.Сообщение = НСтр("ru='Произвольные сценарии не доступны для данного триггерного события!';en='Custom scripts are not available for this trigger event!'");
						ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
						МассивНекондиционныхДействий.Добавить(СтрокаДействия);
						Продолжить; 						
				    КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
		// Проверка для действия "Повысить этап сделки"
		Если СтрокаДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаДействия.ВидСделки) Тогда
				СтрокаДействия.Сообщение = НСтр("ru='Не указан вид сделки!';en='The type of transaction is not specified!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДействия.ЭтапСделки) Тогда
				СтрокаДействия.Сообщение = НСтр("ru='Не указан этап сделки!';en='The transaction stage was omitted!'");
				ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаДействия);
				МассивНекондиционныхДействий.Добавить(СтрокаДействия);
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
	// Логируем и отсеиваем некондиционные действия (2 этап: для всех триггеров)
	Для Каждого СтрокаНеактуальноеДействие Из МассивНекондиционныхДействий Цикл 
		ТаблицаПланаДействий.Удалить(СтрокаНеактуальноеДействие);
	КонецЦикла;
	// Дополняем стек некондиционных
	Если РегистрацияЗапланированных Тогда
		Для Каждого СтрокаНеактуальноеДействие Из ТаблицаНекондиционныхЗапланированныхДействий Цикл 
			ЗаполнитьЗначенияСвойств(ТаблицаНекондиционныхДействий.Добавить(), СтрокаНеактуальноеДействие);
		КонецЦикла;
	КонецЕсли;
	ДанныеТриггера.ТаблицаНекондиционныхДействий = ТаблицаНекондиционныхДействий;
	// ЗарегистрироватьПланируемыеСобытия(ТаблицаНекондиционныхДействий, Истина);
	
	// Обновляем реестр запланированных
	Если РегистрацияЗапланированных Тогда
		РеестрЗапланированных = ДанныеТриггера.РеестрЗапланированных.СкопироватьКолонки();
		Для Каждого СтрокаДействия Из ТаблицаПланаДействий Цикл
			СтрокаЗапланированных = РеестрЗапланированных.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗапланированных, СтрокаДействия);
			СтрокаЗапланированных.Период 			= СтрокаДействия.ПериодОтбора;
			СтрокаЗапланированных.ТриггерноеСобытие = СтрокаДействия.ТриггерноеСобытие;
		КонецЦикла;
		ДанныеТриггера.РеестрЗапланированных 			= РеестрЗапланированных;
		ДанныеТриггера.МассивНеобработанныхКонтрагентов = РеестрЗапланированных.ВыгрузитьКолонку("Контрагент");		
	КонецЕсли;	
	
	ТаблицаПланаДействий.Свернуть("ТриггерноеСобытие, ИдентификаторДействия, Использование, ВидДействия, ВидАдресата, ВидАдресатаРезервный, Адресат, ОтправкаPush, ОтправкаPushWallet, ОтправкаMessenger, ОтправкаSMS, КаналСистемыСообщений, АккаунтВнешнейСистемы, АккаунтSMS, АккаунтEmail, ЗадачаРежимНапоминания, ВидСделки, ЭтапСделки, СоздаватьСделку, КоличествоГенерацийСделок, СценарийЧатБота, ШаблонСообщения, Описание");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаПланаДействий, "ТаблицаПланаДействий");
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПланаДействий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаПланаДействий.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаПланаДействий.Использование КАК Использование,
	               |	ТаблицаПланаДействий.ВидДействия КАК ВидДействия,
	               |	ТаблицаПланаДействий.ВидАдресата КАК ВидАдресата,
	               |	ТаблицаПланаДействий.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
	               |	ТаблицаПланаДействий.Адресат КАК Адресат,
	               |	ТаблицаПланаДействий.ОтправкаPush КАК ОтправкаPush,
	               |	ТаблицаПланаДействий.ОтправкаPushWallet КАК ОтправкаPushWallet,
	               |	ТаблицаПланаДействий.ОтправкаMessenger КАК ОтправкаMessenger,
	               |	ТаблицаПланаДействий.ОтправкаSMS КАК ОтправкаSMS,
	               |	ТаблицаПланаДействий.КаналСистемыСообщений КАК КаналСистемыСообщений,
	               |	ТаблицаПланаДействий.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
	               |	ТаблицаПланаДействий.АккаунтSMS КАК АккаунтSMS,
	               |	ТаблицаПланаДействий.АккаунтEmail КАК АккаунтEmail,
	               |	ТаблицаПланаДействий.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
	               |	ТаблицаПланаДействий.ВидСделки КАК ВидСделки,
	               |	ТаблицаПланаДействий.ЭтапСделки КАК ЭтапСделки,
	               |	ТаблицаПланаДействий.СоздаватьСделку КАК СоздаватьСделку,
	               |	ТаблицаПланаДействий.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
	               |	ТаблицаПланаДействий.СценарийЧатБота КАК СценарийЧатБота,
	               |	ВЫБОР
	               |		КОГДА ТаблицаПланаДействий.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки)
	               |				ИЛИ ТаблицаПланаДействий.ШаблонСообщения = ЗНАЧЕНИЕ(Справочник.ШаблоныСообщений.ПустаяСсылка)
	               |				ИЛИ ТаблицаПланаДействий.ШаблонСообщения = НЕОПРЕДЕЛЕНО
	               |			ТОГДА НЕОПРЕДЕЛЕНО
	               |		ИНАЧЕ ТаблицаПланаДействий.ШаблонСообщения
	               |	КОНЕЦ КАК ШаблонСообщения,
	               |	ТаблицаПланаДействий.Описание КАК Описание
	               |ПОМЕСТИТЬ ТаблицаАктуальногоПланаДействий
	               |ИЗ
	               |	ТаблицаПланаДействий КАК ТаблицаПланаДействий
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаАктуальногоПланаДействий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаАктуальногоПланаДействий.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаАктуальногоПланаДействий.Использование КАК Использование,
	               |	ТаблицаАктуальногоПланаДействий.ВидДействия КАК ВидДействия,
	               |	ТаблицаАктуальногоПланаДействий.ВидАдресата КАК ВидАдресата,
	               |	ТаблицаАктуальногоПланаДействий.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
	               |	ТаблицаАктуальногоПланаДействий.Адресат КАК Адресат,
	               |	ТаблицаАктуальногоПланаДействий.ОтправкаPush КАК ОтправкаPush,
	               |	ТаблицаАктуальногоПланаДействий.ОтправкаPushWallet КАК ОтправкаPushWallet,
	               |	ТаблицаАктуальногоПланаДействий.ОтправкаMessenger КАК ОтправкаMessenger,
	               |	ТаблицаАктуальногоПланаДействий.ОтправкаSMS КАК ОтправкаSMS,
	               |	ТаблицаАктуальногоПланаДействий.КаналСистемыСообщений КАК КаналСистемыСообщений,
	               |	ТаблицаАктуальногоПланаДействий.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
	               |	ТаблицаАктуальногоПланаДействий.АккаунтSMS КАК АккаунтSMS,
	               |	ТаблицаАктуальногоПланаДействий.АккаунтEmail КАК АккаунтEmail,
	               |	ТаблицаАктуальногоПланаДействий.ЗадачаРежимНапоминания КАК ЗадачаРежимНапоминания,
	               |	ТаблицаАктуальногоПланаДействий.ВидСделки КАК ВидСделки,
	               |	ТаблицаАктуальногоПланаДействий.ЭтапСделки КАК ЭтапСделки,
	               |	ТаблицаАктуальногоПланаДействий.СоздаватьСделку КАК СоздаватьСделку,
	               |	ТаблицаАктуальногоПланаДействий.КоличествоГенерацийСделок КАК КоличествоГенерацийСделок,
	               |	ТаблицаАктуальногоПланаДействий.СценарийЧатБота КАК СценарийЧатБота,
	               |	ТаблицаАктуальногоПланаДействий.ШаблонСообщения КАК ШаблонСообщения,
	               |	ТаблицаАктуальногоПланаДействий.Описание КАК Описание,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(1024)) КАК Сообщение,
	               |	ЕСТЬNULL(ШаблоныСообщений.Наименование, """") КАК Наименование,
	               |	ЕСТЬNULL(ШаблоныСообщений.СодержаниеМессенджер, """") КАК СодержаниеМессенджер,
	               |	ЕСТЬNULL(ШаблоныСообщений.Содержание, """") КАК Содержание,
	               |	ЕСТЬNULL(ШаблоныСообщений.СодержаниеPush, """") КАК СодержаниеPush,
	               |	ЕСТЬNULL(ШаблоныСообщений.ТекстHTML, """") КАК ТекстHTML,
	               |	ЕСТЬNULL(ШаблоныСообщений.ЗадачаОписание, """") КАК ЗадачаОписание,
	               |	ЕСТЬNULL(ШаблоныСообщений.ЗадачаВидВзаимодействия, ЗНАЧЕНИЕ(Справочник.ВидыВзаимодействий.ПустаяСсылка)) КАК ЗадачаВидВзаимодействия,
	               |	ЕСТЬNULL(ШаблоныСообщений.ЗадачаПериодВыполнения, 0) КАК ЗадачаПериодВыполнения,
	               |	ВЫБОР
	               |		КОГДА ТаблицаАктуальногоПланаДействий.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота)
	               |			ТОГДА ЕСТЬNULL(СценарииЧатБотов.ВремяОтправкиСообщенийС, ДАТАВРЕМЯ(1, 1, 1))
	               |		ИНАЧЕ ЕСТЬNULL(ШаблоныСообщений.SMSВремяНачалаОтправки, ДАТАВРЕМЯ(1, 1, 1))
	               |	КОНЕЦ КАК SMSВремяНачалаОтправки,
	               |	ВЫБОР
	               |		КОГДА ТаблицаАктуальногоПланаДействий.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота)
	               |			ТОГДА ЕСТЬNULL(СценарииЧатБотов.ВремяОтправкиСообщенийПо, ДАТАВРЕМЯ(1, 1, 1))
	               |		ИНАЧЕ ЕСТЬNULL(ШаблоныСообщений.SMSВремяОкончанияОтправки, ДАТАВРЕМЯ(1, 1, 1))
	               |	КОНЕЦ КАК SMSВремяОкончанияОтправки,
	               |	НЕОПРЕДЕЛЕНО КАК ТаблицаЗадействованныхПараметров,
	               |	НЕОПРЕДЕЛЕНО КАК ТаблицаЗначенийПараметров
	               |ИЗ
	               |	ТаблицаАктуальногоПланаДействий КАК ТаблицаАктуальногоПланаДействий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	               |		ПО ТаблицаАктуальногоПланаДействий.ШаблонСообщения = ШаблоныСообщений.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СценарииЧатБотов КАК СценарииЧатБотов
	               |		ПО ТаблицаАктуальногоПланаДействий.СценарийЧатБота = СценарииЧатБотов.Ссылка";
	
	
	ТаблицаПланаДействий = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Возврат ТаблицаПланаДействий;
	
КонецФункции

// Функция - Получить параметры чат бота
//
// Параметры:
//  ТаблицаПланаДействий - 	 - 
//  УсловиеСобытия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыЧатБота(ТаблицаПланаДействий, УсловиеСобытия)

	ПараметрыЧатБота = Новый Структура;
	ПараметрыЧатБота.Вставить("РазрешенаРаботаСЧатБотом"				, Ложь);
	ПараметрыЧатБота.Вставить("ИспользуетсяРасширениеМессенджер"		, Ложь);
	ПараметрыЧатБота.Вставить("ТаблицаСценариев"						, Неопределено);
	
	Если НЕ ТаблицаПланаДействий.НайтиСтроки(Новый Структура("ВидДействия", Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота)).Количество() = 0 Тогда 
		ТаблицаВсехВариантовУсловийТриггерныхСобытий 	= ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
		КоллекцияВариантовУсловийТриггерныхСобытий 		= ТаблицаВсехВариантовУсловийТриггерныхСобытий.НайтиСтроки(Новый Структура("ВариантыУсловийТриггерныхСобытий, РазрешенаРаботаСЧатБотом", УсловиеСобытия, Истина));
		ПараметрыЧатБота.Вставить("РазрешенаРаботаСЧатБотом"					, КоллекцияВариантовУсловийТриггерныхСобытий.Количество() <> 0);
		Если ПараметрыЧатБота.РазрешенаРаботаСЧатБотом Тогда 
			ПараметрыЧатБота.Вставить("ИспользуетсяРасширениеМессенджер"		, ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер"));
		КонецЕсли;
		Если ПараметрыЧатБота.ИспользуетсяРасширениеМессенджер Тогда 
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТриггерноеСобытие"	, УсловиеСобытия);
			Запрос.УстановитьПараметр("МассивСценариев"		, ТаблицаПланаДействий.Скопировать(Новый Структура("ВидДействия", Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота), "СценарийЧатБота").ВыгрузитьКолонку("СценарийЧатБота"));
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СценарииЧатБотов.Ссылка КАК СценарииЧатБота,
			|	СценарииЧатБотов.ПометкаУдаления КАК ПометкаУдаления,
			|	СценарииЧатБотов.Используется КАК Используется,
			|	СценарииЧатБотов.ИмяМакетаПредопределенногоСценария КАК ИмяМакетаПредопределенногоСценария
			|ПОМЕСТИТЬ ТаблицаСценариев
			|ИЗ
			|	Справочник.СценарииЧатБотов КАК СценарииЧатБотов
			|ГДЕ
			|	СценарииЧатБотов.Ссылка В(&МассивСценариев)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СценарииЧатБотов.Ссылка КАК СценарииЧатБота
			|ПОМЕСТИТЬ ТаблицаДоступныхСценариев
			|ИЗ
			|	Справочник.СценарииЧатБотов КАК СценарииЧатБотов
			|ГДЕ
			|	СценарииЧатБотов.ТриггерныеСобытия.ТриггерноеСобытие = &ТриггерноеСобытие
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаСценариев.СценарииЧатБота КАК СценарииЧатБота,
			|	ТаблицаСценариев.ПометкаУдаления КАК ПометкаУдаления,
			|	ТаблицаСценариев.Используется КАК Используется,
			|	ВЫБОР
			|		КОГДА ТаблицаДоступныхСценариев.СценарииЧатБота ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК Доступно,
			|	ТаблицаСценариев.ИмяМакетаПредопределенногоСценария КАК ИмяМакетаПредопределенногоСценария
			|ИЗ
			|	ТаблицаСценариев КАК ТаблицаСценариев
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДоступныхСценариев КАК ТаблицаДоступныхСценариев
			|		ПО ТаблицаСценариев.СценарииЧатБота = ТаблицаДоступныхСценариев.СценарииЧатБота";
			
			ПараметрыЧатБота.Вставить("ТаблицаСценариев", Запрос.Выполнить().Выгрузить());
		КонецЕсли;
	КонецЕсли;

	Возврат ПараметрыЧатБота;
	
КонецФункции

// Функция - Получить данные для регистрации события
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеДляРегистрацииСобытия(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	ТаблицаДанныхОбъекта = Неопределено;
	
	// События по клиентам
	Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентРегистрация Тогда
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ПациентРегистрация(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);				
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентДеньРождения Тогда 
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ДеньРожденияПациента(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);				
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентПосещениеКлиники Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ПосещениеКлиники(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентНепосещениеКлиники Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_НепосещениеКлиники(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);		
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентПотенциальныйНеСталНовым Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ПотенциальныйНеСталНовым(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);		
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ПациентСменаСтатуса(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);		
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентОкончаниеСрокаДействияСтраховогоПолиса Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ПациентОкончаниеСрокаДействияСтраховогоПолиса(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);		
		
	//// События по картам		
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.КартыУстановкаКартыWalletНовомуКлиенту Тогда
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_УстановкаКартыWalletНовомуКлиенту(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);				
		
	// События по заявкам				
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЗаявкаНеОбработана(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
		
	//// События по сделкам
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаСменаЭтапа Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_СделкаСменаЭтапа(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_СделкаЗадержкаНаЭтапе(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	
	// События по листу ожидания
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияВыписаноНаправление Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЛистОжиданияВыписаноНаправление(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияОчередьНаЗапись Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЛистОжиданияОчередьНаЗапись(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияПрофосмотр Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЛистОжиданияПрофосмотр(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	
	// События по записям	
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЗаписьСозданиеЗаписиНаПрием(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЗаписьСменаСтатусаСотрудникомКлиники(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЗаписьСменаСтатусаПациентом(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);		
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЗаписьНачалоПриема(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);						
	
	// События по приемам
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершенПродолжаетЛечение Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ПриемЗавершенПродолжаетЛечение(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);	
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ПриемЗавершен(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
		
	// События по планам лечения
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПланЛеченияСозданиеПланаЛечения Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ПланЛеченияСозданиеПланаЛечения(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);
		
	// События по продажам и оплатам
	
		
	// События по лицевым счетам
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЛицевойСчетВзнос(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);			
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание Тогда	
		ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЛицевойСчетСписание(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);				
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетКритическийОстатокСредств Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЛицевойСчетКритическийОстатокСредств(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);			
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетОкончаниеСрокаДействия Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_ЛицевойСчетОкончаниеСрокаДействия(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);		
	//	
	//// События по бонусным счетам
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетНачисление Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_БонусныйСчетНачисление(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);			
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетСписание Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_БонусныйСчетСписание(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);				
	// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетОкончаниеСрокаДействия Тогда	
	//	ТаблицаДанныхОбъекта = ПолучитьДанныеСобытия_БонусныйСчетОкончаниеСрокаДействия(ДанныеТриггера, РегистрацияПоПодписке, РегистрацияЗапланированных, ОбъектСобытия);		
	
	КонецЕсли;
	
	Возврат ТаблицаДанныхОбъекта;
	
КонецФункции

// Процедура - Актуализировать запланированные события после фильтрации
//
// Параметры:
//  ДанныеТриггера		 - 	 - 
//  ОбъектСобытия		 - 	 - 
//  ТаблицаДанныхОбъекта - 	 - 
//
Процедура АктуализироватьЗапланированныеСобытияПослеФильтрации(ДанныеТриггера, ОбъектСобытия, ТаблицаДанныхОбъекта)
	
	Если НЕ ТаблицаДанныхОбъекта = Неопределено Тогда 
		МассивНеКорректныхДанных = Новый Массив;
		// Проверяем прошли ли запланированные строчки через систему фильтрации
		Для Каждого СтрокаТаблицыДанных Из ТаблицаДанныхОбъекта Цикл
			Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса Тогда 
				МассивСтрокРеестра = ДанныеТриггера.РеестрЗапланированных.НайтиСтроки(Новый Структура("ТриггерноеСобытие, ДатаСменыСтатуса, Контрагент", ДанныеТриггера.ТриггерноеСобытие, СтрокаТаблицыДанных.ДатаСменыСтатуса, СтрокаТаблицыДанных.Контрагент));
			// ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияВыписаноНаправление ИЛИ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияПрофосмотр Тогда	
			//	МассивСтрокРеестра = ДанныеТриггера.РеестрЗапланированных.НайтиСтроки(Новый Структура("ТриггерноеСобытие, ИсточникСобытия, ОбъектСобытия", ДанныеТриггера.ТриггерноеСобытие, СтрокаТаблицыДанных.ОбъектСобытия, СтрокаТаблицыДанных.ОбъектСобытия));								
			Иначе 	
				МассивСтрокРеестра = ДанныеТриггера.РеестрЗапланированных.НайтиСтроки(Новый Структура("ТриггерноеСобытие, ОбъектСобытия, Контрагент", ДанныеТриггера.ТриггерноеСобытие, ОбъектСобытия, СтрокаТаблицыДанных.Контрагент));
			КонецЕсли;	
			Если МассивСтрокРеестра.Количество() = 0 Тогда
				МассивНеКорректныхДанных.Добавить(СтрокаТаблицыДанных);
			Иначе
				Для Каждого СтрокаМассива Из МассивСтрокРеестра Цикл 
					СтрокаМассива.Подтверждено = Истина;
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла;
		// Подчищаем некорректные строки, если есть
		Для Каждого НекорректнаяСтрока Из МассивНеКорректныхДанных Цикл 
			ТаблицаДанныхОбъекта.Удалить(НекорректнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	// Меняем статус у непройденных фильтрацию
	Для Каждого СтрокаЗапланированных Из ДанныеТриггера.РеестрЗапланированных Цикл 
		Если НЕ СтрокаЗапланированных.Подтверждено Тогда 
			// Меняем статус с "Запланировано" на "Отклонено"
			МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, СтрокаЗапланированных);
			МенеджерЗаписиСобытия.Прочитать();
			Если МенеджерЗаписиСобытия.Выбран() И МенеджерЗаписиСобытия.Статус = Перечисления.СтатусыРегистрацииСобытий.Запланировано Тогда 
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, СтрокаЗапланированных);
				МенеджерЗаписиСобытия.Статус 	= Перечисления.СтатусыРегистрацииСобытий.Отклонено;
				// Пока закоментил, поля "СтатусЗантия" в Событии нет.
				// Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием И ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбъектСобытия, "СтатусЗанятия") <> Перечисления.СтатусыЗанятия.Запланировано Тогда 
				//	МенеджерЗаписиСобытия.Сообщение = СтрШаблон(НСтр("ru='Отклонено, по причине того, что занятие находится в статусе: %1';en='Rejected, due to the fact that the occupation is in the status: %1'"), Строка(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбъектСобытия, "СтатусЗанятия")));
				// Иначе 	
					МенеджерЗаписиСобытия.Сообщение = НСтр("ru='Отклонено, согласно правил фильтрации, указанных в триггере.';en='Rejected, according to the filter rules specified in the trigger.'");
				// КонецЕсли;
				МенеджерЗаписиСобытия.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить актуальные триггеры
//
// Параметры:
//  Источник - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьАктуальныеТриггеры(ОбъектСобытия)
	
	ДатаСобытия 				= Неопределено;
	ОбъектСобытияИсточник 		= ОбъектСобытия;
	МассивГибридныхТриггеров 	= Новый Массив;
	ПризнакОтмены 				= Ложь;
	
	Если ТипЗнч(ОбъектСобытия) = Тип("СправочникОбъект.Контрагенты") Тогда
		
#Область ___________________ИСТОЧНИК_СПРАВОЧНИК_КОНТРАГЕНТЫ____________________
		
		Если ОбъектСобытия.ЭтоГруппа ИЛИ ОбъектСобытия.ПометкаУдаления Тогда 
			Возврат Неопределено;			
		ИначеЕсли НачалоДня(ОбъектСобытия.ДатаРегистрации) = НачалоДня(ТекущаяДатаСеанса()) Тогда 
			ОбъектСобытия 		= ОбъектСобытия.Ссылка;
			ДатаСобытия			= ОбъектСобытия.ДатаРегистрации;			
			МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентРегистрация);
		КонецЕсли;
		
#КонецОбласти

	// ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("СправочникОбъект.Карты") Тогда

#Область ______________________ИСТОЧНИК_СПРАВОЧНИК_КАРТЫ_______________________
		
		// Если ОбъектСобытия.ЭтоГруппа ИЛИ ОбъектСобытия.ПометкаУдаления Тогда 
		//	Возврат Неопределено;			
		// ИначеЕсли ОбъектСобытия.ТипКода = Перечисления.ВидыКарт.Электронная Тогда
		//	Если ОбъектСобытия.ДополнительныеСвойства.Свойство("ЭтоНовый") И ОбъектСобытия.ДополнительныеСвойства.ЭтоНовый = Истина Тогда
		//		Если ОбъектСобытия.ДополнительныеСвойства.Свойство("ВидЭлектроннойКарты") И ОбъектСобытия.ДополнительныеСвойства.ВидЭлектроннойКарты = Перечисления.ТипыВнешнихСистем.Wallet Тогда 
		//			Если ЗначениеЗаполнено(ОбъектСобытия.ВладелецКарты) И ТипЗнч(ОбъектСобытия.ВладелецКарты) = Тип("СправочникСсылка.Контрагенты") Тогда 
		//				ОбъектСобытия 		= ОбъектСобытия.Ссылка;
		//				ДатаСобытия			= ОбъектСобытия.ДатаОткрытия;			
		//				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.КартыУстановкаКартыWalletНовомуКлиенту);
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		// КонецЕсли;
		
#КонецОбласти
		
	// ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("СправочникОбъект.Сделки") Тогда
	
#Область _____________________ИСТОЧНИК_СПРАВОЧНИК_СДЕЛКИ_______________________
	
		// ПоследняяСтрока = Неопределено;		
		// Если ОбъектСобытия.ИсторияИзмененияЭтапов.Количество() <> 0 Тогда 
		//	ОбъектСобытия.ИсторияИзмененияЭтапов.Сортировать("Дата");
		//	ПоследняяСтрока = ОбъектСобытия.ИсторияИзмененияЭтапов[ОбъектСобытия.ИсторияИзмененияЭтапов.Количество()-1]; 
		// КонецЕсли;
		// Если (ПоследняяСтрока <> Неопределено И ПоследняяСтрока.ПереходНаЭтап = ОбъектСобытия.ЭтапСделки И НачалоДня(ПоследняяСтрока.Дата) = НачалоДня(ТекущаяДатаСеанса())) Тогда // ИЛИ (ОбъектСобытия.ДополнительныеСвойства.Свойство("ЭтоНовый") И ОбъектСобытия.ДополнительныеСвойства.ЭтоНовый = Истина) Тогда 
		//	ДатаСобытия	= ПоследняяСтрока.Дата;
		//	МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаСменаЭтапа);
		// КонецЕсли;
		// Если МассивГибридныхТриггеров.Количество() = 0 Тогда 
		//	Возврат Неопределено;
		// КонецЕсли;	
		// ОбъектСобытия = ОбъектСобытия.Ссылка;
		
#КонецОбласти
		
	ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("РегистрНакопленияНаборЗаписей.ДенежныеСредстваНаЛицевыхСчетах") Тогда
	
#Область ________ИСТОЧНИК_РЕГИСТР_РАСЧЕТЫ_С_ПОКУПАТЕЛЯМИ_ЛИЦЕВЫЕ_СЧЕТА_________

		Если ОбъектСобытия.Количество() = 0 ИЛИ ОбъектСобытия.ДополнительныеСвойства.Свойство("ЭтоПроведениеЗагруженныхДанных") Тогда 
			Возврат Неопределено;
		КонецЕсли;	
		Регистратор = ?(ОбъектСобытия.Отбор.Найти("Регистратор") <> Неопределено, ОбъектСобытия.Отбор.Найти("Регистратор").Значение, Неопределено);
		Если НЕ ЗначениеЗаполнено(Регистратор) ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВводНачальныхОстатков") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ОбъектСобытия.ДополнительныеСвойства.Свойство("ЭтоПерепроведениеРеализации") Тогда
			ЭтоПерепроведениеРеализации = ОбъектСобытия.ДополнительныеСвойства.ЭтоПерепроведениеРеализации;
		Иначе 
			ЭтоПерепроведениеРеализации = Ложь;
		КонецЕсли;
		
		Для Каждого СтрокаНабора Из ОбъектСобытия Цикл 
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.СписаниеДенежныхСредств") И НачалоДня(СтрокаНабора.Период) = НачалоДня(ТекущаяДатаСеанса()) Тогда
				Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(Регистратор, "ТипДенежныхСредств") = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда 
					МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание);
					// МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетКритическийОстатокСредств);
					ОбъектСобытия 	= Регистратор;
					ДатаСобытия		= СтрокаНабора.Период;										
					Прервать;
				КонецЕсли;	
			ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
				Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(Регистратор, "ВидОперации") = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда
					МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос);
					ОбъектСобытия 	= Регистратор;
					ДатаСобытия		= СтрокаНабора.Период;										
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
#КонецОбласти

	// ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("РегистрНакопленияНаборЗаписей.БонусныеСчета") Тогда 

#Область __________________ИСТОЧНИК_РЕГИСТР_БОНУСНЫЕ_СЧЕТА_____________________
	
		// Если ОбъектСобытия.Количество() = 0 Тогда 
		//	Возврат Неопределено;
		// КонецЕсли;	
		// Регистратор = ?(ОбъектСобытия.Отбор.Найти("Регистратор") <> Неопределено, ОбъектСобытия.Отбор.Найти("Регистратор").Значение, Неопределено);
		// Если НЕ ЗначениеЗаполнено(Регистратор) Тогда
		//	Возврат Неопределено;
		// КонецЕсли;
		// Если ОбъектСобытия.ДополнительныеСвойства.Свойство("ЭтоПерепроведениеРеализации") Тогда
		//	ЭтоПерепроведениеРеализации = ОбъектСобытия.ДополнительныеСвойства.ЭтоПерепроведениеРеализации;
		// Иначе 
		//	ЭтоПерепроведениеРеализации = Ложь;
		// КонецЕсли;
		//
		// Для Каждого СтрокаНабора Из ОбъектСобытия Цикл 
		//	Если ЗначениеЗаполнено(СтрокаНабора.БонусныйСчет) И НачалоДня(СтрокаНабора.Период) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		//		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.Реализация") Тогда
		//			Если СтрокаНабора.ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
		//				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетНачисление);
		//			ИначеЕсли СтрокаНабора.ВидДвижения = ВидДвиженияНакопления.Расход Тогда	
		//				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетСписание);
		//			КонецЕсли;	
		//			ОбъектСобытия 	= Регистратор;
		//			ДатаСобытия		= СтрокаНабора.Период;										
		//			Прервать;
		//		ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОперацияПоБонусномуСчету") Тогда
		//			ВидыОпераций = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Регистратор, "ВидОперации");
		//			Если ВидыОпераций = Перечисления.ВидыОпераций.НачислениеБонусныйСчет Тогда 
		//				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетНачисление);
		//			ИначеЕсли ВидыОпераций = Перечисления.ВидыОпераций.СписаниеБонусныйСчет Тогда
		//				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.БонусныйСчетСписание);
		//			КонецЕсли;	
		//			ОбъектСобытия 	= Регистратор;
		//			ДатаСобытия		= СтрокаНабора.Период;										
		//			Прервать;
		//		КонецЕсли;
		//	КонецЕсли;
		// КонецЦикла;	
		
#КонецОбласти

	ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("ДокументОбъект.Событие") Тогда
	
#Область ______________________ИСТОЧНИК_ДОКУМЕНТ_СОБЫТИЕ_______________________
	
		Если НЕ ОбъектСобытия.Проведен ИЛИ НачалоДня(ОбъектСобытия.Дата) < НачалоДня(ТекущаяДатаСеанса()) ИЛИ НЕ ОбъектСобытия.ТипСобытия = Перечисления.ТипыСобытий.ПредварительнаяЗапись Тогда 
			Возврат Неопределено;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОбъектСобытия.ДополнительныеСвойства, "ИзмененСтатусЗаписи", Ложь) Тогда
			Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОбъектСобытия.ДополнительныеСвойства, "РаботаСЧатБотом", Ложь) Тогда
				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом);
			Иначе 	
				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники);
			КонецЕсли;	
		КонецЕсли;	
		// Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОбъектСобытия.ДополнительныеСвойства, "ПереносДатыВремени", Ложь) И ЗначениеЗаполнено(ОбъектСобытия.ДатаВремяНачала) И ЗначениеЗаполнено(ОбъектСобытия.ДатаНачалаДоИзменения) И ОбъектСобытия.ДатаВремяНачала <> ОбъектСобытия.ДатаНачалаДоИзменения Тогда 
		//	МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеПереносДатыВремени);
		// КонецЕсли;	
		// Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОбъектСобытия.ДополнительныеСвойства, "ЗаменаИнструктора", Ложь) И ЗначениеЗаполнено(ОбъектСобытия.Сотрудник) И ЗначениеЗаполнено(ОбъектСобытия.СотрудникДоИзменения) И ОбъектСобытия.Сотрудник <> ОбъектСобытия.СотрудникДоИзменения Тогда 
		//	МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеЗаменаИнструктора);
		// КонецЕсли;	
				
		МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием);
		// МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеКлиентПрибыл);
		МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема);
		// Если ОбъектСобытия.СтатусЗанятия = Перечисления.СтатусыЗанятия.Проведено Тогда 
		//	МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеПроведеноКлиентПрибыл);
		// КонецЕсли;	
		// МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено);
		
		ОбъектСобытия 			= ОбъектСобытия.Ссылка;
		
#КонецОбласти

	ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("ДокументОбъект.Прием") Тогда

#Область _______________________ИСТОЧНИК_ДОКУМЕНТ_ПРИЕМ________________________
	
		Если НЕ ОбъектСобытия.Проведен ИЛИ НачалоДня(ОбъектСобытия.Дата) < НачалоДня(ТекущаяДатаСеанса()) Тогда 
			Возврат Неопределено;
		КонецЕсли;
		Если ОбъектСобытия.РезультатПриема <> 0 И ЗначениеЗаполнено(ОбъектСобытия.ВремяОкончанияПриема) Тогда
			ДатаСобытия = ОбъектСобытия.ВремяОкончанияПриема;
			МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершен);
		// ИначеЕсли ОбъектСобытия.РезультатПриема = 2 И ЗначениеЗаполнено(ОбъектСобытия.ВремяОкончанияПриема) Тогда
		//	ДатаСобытия = ОбъектСобытия.ВремяОкончанияПриема;
		//	МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПриемЗавершенПродолжаетЛечение);
		КонецЕсли;	
		
		ОбъектСобытия 			= ОбъектСобытия.Ссылка;
		
#КонецОбласти

	ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("ДокументОбъект.ПланЛечения") Тогда

#Область ___________________ИСТОЧНИК_ДОКУМЕНТ_ПЛАН_ЛЕЧЕНИЯ_____________________
	
		Если НЕ ОбъектСобытия.Проведен ИЛИ НачалоДня(ОбъектСобытия.Дата) < НачалоДня(ТекущаяДатаСеанса()) Тогда 
			Возврат Неопределено;
		КонецЕсли;
		Если ОбъектСобытия.Статус <> Перечисления.СтатусыПланЛечения.Отвергнут Тогда
			ДатаСобытия = ОбъектСобытия.Дата;
			МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПланЛеченияСозданиеПланаЛечения);
		КонецЕсли;	
		
		ОбъектСобытия 			= ОбъектСобытия.Ссылка;
		
#КонецОбласти

	// ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("РегистрСведенийНаборЗаписей.СтатусыКонтрагентов") Тогда
	
#Область __________________ИСТОЧНИК_РЕГИСТР_СТАТУСЫ_КЛИЕНТОВ___________________
	
		// Если ОбъектСобытия.ОбменДанными.Загрузка = ИСТИНА ИЛИ ОбъектСобытия.Количество() = 0 Тогда 
		//	Возврат Неопределено;
		// КонецЕсли;	
		// Для Каждого ЗаписьРегистра Из ОбъектСобытия Цикл 
		//	Если НачалоДня(ЗаписьРегистра.Период) = НачалоДня(ТекущаяДатаСеанса()) Тогда 
		//		ОбъектСобытия 			= ЗаписьРегистра.Статус;
		//		ДатаСобытия				= ЗаписьРегистра.Период;
		//		ПараметрыКлюча 			= Новый Структура("Период, Контрагент", ЗаписьРегистра.Период, ЗаписьРегистра.Контрагент);
		//		ПараметрыМассив = Новый Массив;
		//		ПараметрыМассив.Добавить(ПараметрыКлюча); 		
		//		КлючЗаписи 				= Новый("РегистрСведенийКлючЗаписи.СтатусыКонтрагентов", ПараметрыМассив);
		//		
		//		Прервать;
		//	КонецЕсли;	
		// КонецЦикла;
		// МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса);
		
#КонецОбласти
		
	// ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("РегистрНакопленияНаборЗаписей.ПродажиСебестоимость") Тогда
	
#Область _______________ИСТОЧНИК_РЕГИСТР_ПРОДАЖИ_СЕБЕСТОИМОСТЬ_________________
	
		// Если ОбъектСобытия.Количество() = 0 Тогда 
		//	Возврат Неопределено;
		// КонецЕсли;
		// Для Каждого СтрокаНабора Из ОбъектСобытия Цикл 
		//	Если ЗначениеЗаполнено(СтрокаНабора.ДокументПродажи) И ТипЗнч(СтрокаНабора.ДокументПродажи) = Тип("ДокументСсылка.Реализация") Тогда
		//		Если НачалоДня(СтрокаНабора.Период) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		//			МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.Продажа);
		//			ОбъектСобытия 	= СтрокаНабора.ДокументПродажи;
		//			ДатаСобытия		= СтрокаНабора.Период;										
		//			Прервать;
		//		КонецЕсли;	
		//	КонецЕсли;
		// КонецЦикла;	
		
#КонецОбласти
		
	// ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("РегистрНакопленияНаборЗаписей.Оплаты") Тогда
	
#Область _______________________ИСТОЧНИК_РЕГИСТР_ОПЛАТЫ________________________
	
		// Если ОбъектСобытия.Количество() = 0 Тогда 
		//	Возврат Неопределено;
		// КонецЕсли;
		// Для Каждого СтрокаНабора Из ОбъектСобытия Цикл 
		//	Если ЗначениеЗаполнено(СтрокаНабора.ОснованиеОплаты) И ТипЗнч(СтрокаНабора.ОснованиеОплаты) = Тип("ДокументСсылка.Реализация") И НЕ ТипЗнч(СтрокаНабора.Регистратор) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
		//		Если НачалоДня(СтрокаНабора.Период) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		//			Если РегистрыНакопления.РасчетыСПокупателями.ПолучитьЗадолженностьПоДокументу(СтрокаНабора.ОснованиеОплаты) = 0 Тогда
		//				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаПолная);
		//			Иначе 
		//				МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаЧастичная);
		//			КонецЕсли;
		//			ОбъектСобытия 	= СтрокаНабора.ОснованиеОплаты;
		//			ДатаСобытия		= СтрокаНабора.Период;										
		//			Прервать;
		//		КонецЕсли;	
		//	КонецЕсли;
		// КонецЦикла;	
		
#КонецОбласти
		
	// ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("РегистрНакопленияНаборЗаписей.ОказаниеУслуг") Тогда
	
#Область ___________________ИСТОЧНИК_РЕГИСТР_ОКАЗАНИЕ_УСЛУГ____________________
	
		// Если ОбъектСобытия.Количество() = 0 Тогда 
		//	Возврат Неопределено;
		// КонецЕсли;
		// МассивЧленств = Новый Массив;
		// Для Каждого ЗаписьРегистра Из ОбъектСобытия Цикл
		//	Если НачалоДня(ЗаписьРегистра.Период) = НачалоДня(ТекущаяДатаСеанса()) И ЗаписьРегистра.Количество <> 0 Тогда
		//		МассивКонтаргентов = ЗаписьРегистра.Основание.СоставЗанятия.ВыгрузитьКолонку("Контрагент");
		//		// Если НЕ ЗначениеЗаполнено(МассивКонтаргентов) Тогда 
		//		//	Продолжить;
		//		// Иначе 
		//			ОбъектСобытия 		= ЗаписьРегистра.Основание;
		//			ДатаСобытия			= ЗаписьРегистра.Период;															
		//			Если ЗначениеЗаполнено(ЗаписьРегистра.ДокументОплаты) И ТипЗнч(ЗаписьРегистра.ДокументОплаты) = Тип("ДокументСсылка.ЧленствоПакетУслуг") Тогда
		//				МассивЧленств.Добавить(ЗаписьРегистра.ДокументОплаты);
		//			КонецЕсли;
		//			Прервать;						
		//		// КонецЕсли;		
		//	КонецЕсли;
		// КонецЦикла;
		// Если ЗначениеЗаполнено(ОбъектСобытия) Тогда 
		//	МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеСписаниеУслугиКлиентПрибыл);
		//	МассивГибридныхТриггеров.Добавить(Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеСписаниеУслугиПоНеявке);	
		// КонецЕсли;
	
#КонецОбласти
	
	КонецЕсли;
	
	Если ОбъектСобытияИсточник = ОбъектСобытия ИЛИ МассивГибридныхТриггеров.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	// Устанавливаем универсальные параметры для любого кейса
	Запрос.УстановитьПараметр("МассивГибридныхТриггеров"			, МассивГибридныхТриггеров);
	Запрос.УстановитьПараметр("ОбъектСобытия"						, ОбъектСобытия);
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"				, Ложь);
	Запрос.УстановитьПараметр("ТекущаяДата"							, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПризнакОтмены"						, ПризнакОтмены);	
	УстановитьПараметрыСообщенийДляТриггерныхДействий(Запрос);
	
	Если ТипЗнч(ОбъектСобытия) = Тип("ДокументСсылка.Событие") Тогда
		
#Область ______________ПЛАНИРОВАНИЕ_И_РЕГИСТРАЦИЯ_ДЛЯ_ТРИГГЕРОВ_ПО_ЗАПИСЯМ__________________
		
		// Анализируем и получаем триггеры которые не отработали в разрезе 3-х измерений:
		// 1. Триггер
		// 2. Контрагент
		// 3. ОбъектСобытия
		// СтруктураДанныхЗанятия = ПолучитьСтруктуруДанныхЗанятия(ОбъектСобытия);
		// Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(СтруктураДанныхЗанятия.ТаблицаТекущихЗначений, "ТаблицаТекущихЗначений");		
		//// Запрос.УстановитьПараметр("МассивКонтаргентов", МассивКонтаргентов);
		Запрос.УстановитьПараметр("ДатаЗаписи"					, ОбъектСобытияИсточник.ДатаСоздания);
		Запрос.УстановитьПараметр("ДатаВремяНачала"				, ОбъектСобытияИсточник.Дата);
		Запрос.УстановитьПараметр("ДатаВремяОкончания"			, Дата(1,1,1));		
		Запрос.УстановитьПараметр("ДатаОтменыЗаписи"			, Дата(1,1,1));	
		Запрос.УстановитьПараметр("Контрагент"					, ОбъектСобытияИсточник.Контрагент);
		Запрос.УстановитьПараметр("СтатусЗаписи"				, ОбъектСобытияИсточник.Статус);		
		
		// Подготавливаем текст запроса
		ИнициализироватьТекстЗапросаДляРегистрацииПриПодпискеНаЗапись(Запрос);
		
		ПакетныйРезультат 						= Запрос.ВыполнитьПакет();
		ТаблицаТриггеровВРазрезеКонтаргентов 	= ПакетныйРезультат[8].Выгрузить();
		ТаблицаДанныхТриггеров				 	= ПакетныйРезультат[3].Выгрузить();
		
		// Регистрируем события со статусом "Запланировано",
		// которые должны будут в соответсвующий период активироваться регламентом,
		// а также отклоняем не актуальные строки по очевидным причинам (фильтрации по условиям в триггере будет происходить позже)
		ЗарегистрироватьПланируемыеСобытия(ПакетныйРезультат[7].Выгрузить());
		
		// Формируем и возвращаем таблицу событий, которые надо зарегистрировать в данный момент (Старт: "В момент события")
		Для Каждого СтрокаДанныеТриггера ИЗ ТаблицаДанныхТриггеров Цикл 
			ТаблицаКонтрагентов = ТаблицаТриггеровВРазрезеКонтаргентов.Скопировать(Новый Структура("ТриггерноеСобытие", СтрокаДанныеТриггера.ТриггерноеСобытие), "НеОтработанныйКонтрагент");
			ТаблицаКонтрагентов.Свернуть("НеОтработанныйКонтрагент");			
			СтрокаДанныеТриггера.МассивНеобработанныхКонтрагентов = ТаблицаКонтрагентов.ВыгрузитьКолонку("НеОтработанныйКонтрагент");
		КонецЦикла;
		
		Возврат ТаблицаДанныхТриггеров;
		
#КонецОбласти
	
	// ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("ПеречислениеСсылка.СтатусыКонтрагентов") Тогда 
		
#Область __________ПЛАНИРОВАНИЕ_И_РЕГИСТРАЦИЯ_ДЛЯ_ТРИГГЕРОВ_ПО_СТАТУСАМ_КЛИЕНТОВ____________

		// Если ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(КлючЗаписи.Контрагент, "ОбезличенныйКлиент") = Истина Тогда 
		//	Возврат Неопределено;
		// КонецЕсли;

		// Запрос.УстановитьПараметр("Контрагент"			, КлючЗаписи.Контрагент);
		// Запрос.УстановитьПараметр("ДатаСобытия"			, КлючЗаписи.Период);
		//
		//// Подготавливаем текст запроса
		// ИнициализироватьТекстЗапросаДляРегистрацииСменыСтатусаКлиентаПриПодписке(Запрос);
		//
		// ПакетныйРезультат 						= Запрос.ВыполнитьПакет();
		// ТаблицаТриггеровТекущейРегистрации 		= ПакетныйРезультат[2].Выгрузить();
		// ТаблицаДанныхЗапланированныхТриггеров	= ПакетныйРезультат[6].Выгрузить();
		//
		//// Регистрируем события со статусом "Запланировано",
		//// которые должны будут в соответсвующий период активироваться регламентом,
		//// а также отклоняем не актуальные строки по очевидным причинам (фильтрации по условиям в триггере будет происходить позже)
		// ЗарегистрироватьПланируемыеСобытия(ТаблицаДанныхЗапланированныхТриггеров);
		//
		// ОбъектСобытия = КлючЗаписи;
		//
		// Возврат ТаблицаТриггеровТекущейРегистрации;
		
#КонецОбласти
		
	Иначе
		
#Область _____________ПЛАНИРОВАНИЕ_И_РЕГИСТРАЦИЯ_ДЛЯ_ВСЕХ_ОСТАЛЬНЫХ_ТРИГГЕРОВ_______________
		
		Если НЕ ЗначениеЗаполнено(ДатаСобытия) Тогда 
			ДатаСобытия = Неопределено;
		КонецЕсли;
		Если ТипЗнч(ОбъектСобытия) = Тип("СправочникСсылка.Контрагенты") Тогда
			Контрагент = ОбъектСобытия;
		Иначе 	
			Попытка
				Если ТипЗнч(ОбъектСобытия) = Тип("СправочникСсылка.Карты") Тогда 
					Контрагент = ОбъектСобытияИсточник.ВладелецКарты;
				ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("ДокументСсылка.Событие") ИЛИ ТипЗнч(ОбъектСобытия) = Тип("ДокументСсылка.Прием") ИЛИ ТипЗнч(ОбъектСобытия) = Тип("ДокументСсылка.ПланЛечения") Тогда 
					Контрагент = ОбъектСобытияИсточник.Контрагент;
				ИначеЕсли ТипЗнч(ОбъектСобытия) = Тип("ДокументСсылка.ОперацияПоБонусномуСчету") Тогда 
					ВладелецБонусногоСчета = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбъектСобытия, "ВладелецБонусногоСчета", "ВладелецБонусногоСчета");
					Если ТипЗнч(ВладелецБонусногоСчета) = Тип("СправочникСсылка.Контрагенты") Тогда 
						Контрагент = ВладелецБонусногоСчета;
					ИначеЕсли ТипЗнч(ВладелецБонусногоСчета) = Тип("СправочникСсылка.Карты") Тогда
						Контрагент = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВладелецБонусногоСчета, "ВладелецКарты", "Контрагент");
					Иначе 
						Контрагент = Неопределено;
					КонецЕсли;	
				Иначе 	
					Контрагент = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ОбъектСобытия, "Контрагент", "Контрагент").Контрагент;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
					Контрагент = Неопределено;
				КонецЕсли;	
			Исключение
				Контрагент = Неопределено;
			КонецПопытки;
		КонецЕсли;
		
		// Если ЗначениеЗаполнено(Контрагент) И ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда 
		//	Если ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Контрагент, "ОбезличенныйКлиент") = Истина Тогда 
		//		Возврат Неопределено;
		//	КонецЕсли;
		// КонецЕсли;
		
		// Анализируем и получаем триггеры которые не отработали в разрезе 2-х измерений:
		// 1. Триггер
		// 2. ОбъектСобытия
		Запрос.УстановитьПараметр("Контрагент"			, Контрагент);
		Запрос.УстановитьПараметр("ДатаСобытия"			, ДатаСобытия);
		
		// Подготавливаем текст запроса
		ИнициализироватьТекстЗапросаДляРегистрацииПриПодписке(Запрос);
		
		ПакетныйРезультат 						= Запрос.ВыполнитьПакет();
		ТаблицаТриггеровТекущейРегистрации 		= ПакетныйРезультат[2].Выгрузить();
		ТаблицаДанныхЗапланированныхТриггеров	= ПакетныйРезультат[6].Выгрузить();
		
		// Регистрируем события со статусом "Запланировано",
		// которые должны будут в соответсвующий период активироваться регламентом,
		// а также отклоняем не актуальные строки по очевидным причинам (фильтрации по условиям в триггере будет происходить позже)
		ЗарегистрироватьПланируемыеСобытия(ТаблицаДанныхЗапланированныхТриггеров);
		
		Возврат ТаблицаТриггеровТекущейРегистрации;
		
#КонецОбласти
		
	КонецЕсли;	
		
КонецФункции

// Процедура - Инициализировать текст запроса для регистрации при подписке на занятие
//
// Параметры:
//  Запрос	 - 	 - 
//
Процедура ИнициализироватьТекстЗапросаДляРегистрацииПриПодпискеНаЗапись(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТриггерныеСобытия.Ссылка КАК ТриггерноеСобытие,
	|	&Контрагент КАК Контрагент,
	|	&ДатаЗаписи КАК Дата,
	|	&ДатаВремяНачала КАК ДатаВремяНачала,
	|	&ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	&ДатаОтменыЗаписи КАК ДатаОтменыЗаписи,
	|	&СтатусЗаписи КАК СтатусЗаписи,
	|	ТриггерныеСобытия.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТриггерныеСобытия.Использование КАК Использование,
	|	ТриггерныеСобытия.ВидДействия КАК ВидДействия,
	|	ТриггерныеСобытия.Удалено КАК Удалено,
	|	ТриггерныеСобытия.Ссылка.Активно КАК Активно,
	|	ТриггерныеСобытия.Описание КАК Описание,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано) КАК ПланируемыйСтатус
	|ПОМЕСТИТЬ ТаблицаТриггеровИКонтрагентов
	|ИЗ
	|	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытия
	|ГДЕ
	|	ТриггерныеСобытия.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.УсловиеСобытия В(&МассивГибридныхТриггеров)
	|	И ТриггерныеСобытия.Ссылка.УсловиеСобытия <> ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)
	|	И ТриггерныеСобытия.Ссылка.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия)
	|	И ВЫБОР
	|			КОГДА ТриггерныеСобытия.Ссылка.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием)
	|				ТОГДА НЕ НАЧАЛОПЕРИОДА(&ДатаЗаписи, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТриггерныеСобытия.Ссылка,
	|	&Контрагент,
	|	&ДатаЗаписи,
	|	&ДатаВремяНачала,
	|	&ДатаВремяОкончания,
	|	&ДатаОтменыЗаписи,
	|	&СтатусЗаписи,
	|	ТриггерныеСобытия.ИдентификаторДействия,
	|	ТриггерныеСобытия.Использование,
	|	ТриггерныеСобытия.ВидДействия,
	|	ТриггерныеСобытия.Удалено,
	|	ТриггерныеСобытия.Ссылка.Активно,
	|	ТриггерныеСобытия.Описание,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|ИЗ
	|	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытия
	|ГДЕ
	|	&Контрагент <> НЕОПРЕДЕЛЕНО
	|	И ТриггерныеСобытия.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.УсловиеСобытия В(&МассивГибридныхТриггеров)
	|	И ВЫБОР
	|			КОГДА ТриггерныеСобытия.Ссылка.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТриггерныеСобытия.Ссылка.МоментСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия), ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия))
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ТриггерныеСобытия.Ссылка.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)
	|					И ТриггерныеСобытия.Ссылка.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТриггерныеСобытия.Ссылка.ПериодСобытияВид В (ЗНАЧЕНИЕ(Перечисление.Периодичность.Час), ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута))
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Статус КАК Статус
	|ПОМЕСТИТЬ ТаблицаОтработанныхТриггеров
	|ИЗ
	|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	|ГДЕ
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие В
	|			(ВЫБРАТЬ
	|				ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие
	|			ИЗ
	|				ТаблицаТриггеровИКонтрагентов
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие)
	|	И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = &ОбъектСобытия
	|	И ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаТриггеровИКонтрагентов.Контрагент КАК НеОтработанныйКонтрагент
	|ПОМЕСТИТЬ ТаблицаАктуальныхТриггеровДляТекущейРегистрации
	|ИЗ
	|	ТаблицаТриггеровИКонтрагентов КАК ТаблицаТриггеровИКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
	|		ПО ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие = ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	|			И ТаблицаТриггеровИКонтрагентов.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
	|ГДЕ
	|	ТаблицаТриггеровИКонтрагентов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
	|	И ТаблицаТриггеровИКонтрагентов.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	|	И ТаблицаТриггеровИКонтрагентов.Активно = ИСТИНА
	|	И ТаблицаТриггеровИКонтрагентов.Использование = ИСТИНА
	|	И ТаблицаТриггеровИКонтрагентов.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|	И ТаблицаТриггеровИКонтрагентов.Удалено = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие,
	|	ТаблицаТриггеровИКонтрагентов.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.УсловиеСобытия КАК УсловиеСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПараметрСобытия КАК ПараметрСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.МоментСобытия КАК МоментСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПериодСобытияВид КАК ПериодСобытияВид,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПериодСобытия КАК ПериодСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ВремяСобытия КАК ВремяСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СегментКонтрагентов КАК СегментКонтрагентов,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СегментУслуг КАК СегментУслуг,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ВидСделки КАК ВидСделки,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ВидБонусногоСчета КАК ВидБонусногоСчета,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПереходСЭтапа КАК ПереходСЭтапа,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПереходНаЭтап КАК ПереходНаЭтап,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ТипПолиса КАК ТипПолиса,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СтатусПациентаПриема КАК СтатусПациентаПриема,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.РезультатПриема КАК РезультатПриема,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СтатусЗаписи КАК СтатусЗаписи,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ИсточникЗаписи КАК ИсточникЗаписи,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПричинаОтмены КАК ПричинаОтмены,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.Наименование КАК Наименование,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.КодСинхронизации КАК КодСинхронизации,
	|	НЕОПРЕДЕЛЕНО КАК ПланДействийТриггерногоСобытия,
	|	НЕОПРЕДЕЛЕНО КАК ТаблицаНекондиционныхДействий,
	|	НЕОПРЕДЕЛЕНО КАК ПараметрыШаблона,
	|	НЕОПРЕДЕЛЕНО КАК МассивНеобработанныхКонтрагентов
	|ИЗ
	|	ТаблицаАктуальныхТриггеровДляТекущейРегистрации КАК ТаблицаАктуальныхТриггеров
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.УсловиеСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПараметрСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.МоментСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПериодСобытияВид,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПериодСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ВремяСобытия,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СегментКонтрагентов,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СегментУслуг,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ВидСделки,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ВидЛицевогоСчета,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ВидБонусногоСчета,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПереходСЭтапа,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПереходНаЭтап,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ТипПолиса,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СтатусПациентаПриема,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.РезультатПриема,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СтатусЗаписи,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.Наименование,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.КодСинхронизации,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ИсточникЗаписи,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.ПричинаОтмены,
	|	ТаблицаАктуальныхТриггеров.ТриггерноеСобытие.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Описание КАК Описание
	|ПОМЕСТИТЬ ЖурналЗапланированнойРегистрации
	|ИЗ
	|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	|ГДЕ
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие В
	|			(ВЫБРАТЬ
	|				ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие
	|			ИЗ
	|				ТаблицаТриггеровИКонтрагентов
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие)
	|	И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = &ОбъектСобытия
	|	И ЖурналРегистрацииТриггерныхСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналРегистрацииТриггерныхСобытий.Период,
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Описание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаТриггеровИКонтрагентов.Контрагент КАК Контрагент,
	|	ТаблицаТриггеровИКонтрагентов.Дата КАК Дата,
	|	ТаблицаТриггеровИКонтрагентов.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ТаблицаТриггеровИКонтрагентов.ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	ТаблицаТриггеровИКонтрагентов.ДатаОтменыЗаписи КАК ДатаОтменыЗаписи,
	|	ТаблицаТриггеровИКонтрагентов.СтатусЗаписи КАК СтатусЗаписи,
	|	ТаблицаТриггеровИКонтрагентов.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ВЫБОР
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Активно = ИСТИНА
	|				И ТаблицаТриггеровИКонтрагентов.Использование = ИСТИНА
	|				И ТаблицаТриггеровИКонтрагентов.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|				И ТаблицаТриггеровИКонтрагентов.Удалено = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДействиеАктуально,
	|	ТаблицаТриггеровИКонтрагентов.Описание КАК Описание,
	|	ВЫБОР
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Активно = ЛОЖЬ
	|			ТОГДА &ПользовательДеактивировалТриггер
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Использование = ЛОЖЬ
	|			ТОГДА &ПользовательДеактивировалДействие
	|		КОГДА ТаблицаТриггеровИКонтрагентов.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|			ТОГДА &ПользовательНеУказалВидДействия
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Удалено = ИСТИНА
	|			ТОГДА &ПользовательУдалилДействие
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Сообщение
	|ПОМЕСТИТЬ ТаблицаПланируемыхДействийТриггера
	|ИЗ
	|	ТаблицаТриггеровИКонтрагентов КАК ТаблицаТриггеровИКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
	|		ПО ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие = ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	|			И ТаблицаТриггеровИКонтрагентов.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
	|			И ТаблицаТриггеровИКонтрагентов.ИдентификаторДействия = ТаблицаОтработанныхТриггеров.ИдентификаторДействия
	|			И (ТаблицаОтработанныхТриггеров.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено))
	|ГДЕ
	|	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
	|	И ТаблицаТриггеровИКонтрагентов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И ТаблицаТриггеровИКонтрагентов.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|				ИЛИ НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	|		КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия <> ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено)
	|				И ТаблицаПланируемыхДействийТриггера.СтатусЗаписи = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	|		КОГДА ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	|	КОНЕЦ КАК СтатусКДействию,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.ТриггерноеСобытие ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.ТриггерноеСобытие
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие
	|	КОНЕЦ КАК ТриггерноеСобытие,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Контрагент
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Период
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ПериодОтбора,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.ИдентификаторДействия
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ИдентификаторДействия
	|	КОНЕЦ КАК ИдентификаторДействия,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Описание
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Описание
	|	КОНЕЦ КАК Описание,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|				ИЛИ НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия <> ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено)
	|						И ТаблицаПланируемыхДействийТриггера.СтатусЗаписи = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|					ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|				КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием)
	|					ТОГДА ТаблицаПланируемыхДействийТриггера.Дата
	|				КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаСотрудникомКлиники)
	|						ИЛИ ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьСменаСтатусаПациентом)
	|						ИЛИ ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗанятиеПереносДатыВремени)
	|						ИЛИ ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗанятиеЗаменаИнструктора)
	|					ТОГДА &ТекущаяДата
	|				КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)
	|					ТОГДА ТаблицаПланируемыхДействийТриггера.ДатаВремяНачала
	|				КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗанятиеПроведеноКлиентПрибыл)
	|					ТОГДА ТаблицаПланируемыхДействийТриггера.ДатаВремяОкончания
	|				КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено)
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаПланируемыхДействийТриггера.СтатусЗаписи = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|								ТОГДА ТаблицаПланируемыхДействийТриггера.ДатаОтменыЗаписи
	|							ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|						КОНЕЦ
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаОтсчета,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|			ТОГДА ТаблицаПланируемыхДействийТриггера.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаЗаписи,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|			ТОГДА &КлиентУдаленИзСоставаЗанятия
	|		КОГДА НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ТаблицаПланируемыхДействийТриггера.Сообщение
	|		КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия <> ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено)
	|				И ТаблицаПланируемыхДействийТриггера.СтатусЗаписи = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаПланируемыхДействийТриггера.СтатусЗаписи = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|						ТОГДА &ЗанятиеОтменено
	|					ИНАЧЕ &КлиентОтменилВизит
	|				КОНЕЦ
	|		КОГДА ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено)
	|				И ТаблицаПланируемыхДействийТриггера.СтатусЗаписи <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|			ТОГДА &ЗанятиеВновьАктуально
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Сообщение
	|	КОНЕЦ КАК Сообщение
	|ПОМЕСТИТЬ ТаблицаПланируемыхТриггеровИДатРегистрации
	|ИЗ
	|	ТаблицаПланируемыхДействийТриггера КАК ТаблицаПланируемыхДействийТриггера
	|		ПОЛНОЕ СОЕДИНЕНИЕ ЖурналЗапланированнойРегистрации КАК ЖурналЗапланированнойРегистрации
	|		ПО ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие = ЖурналЗапланированнойРегистрации.ТриггерноеСобытие
	|			И ТаблицаПланируемыхДействийТриггера.Контрагент = ЖурналЗапланированнойРегистрации.Контрагент
	|			И ТаблицаПланируемыхДействийТриггера.ИдентификаторДействия = ЖурналЗапланированнойРегистрации.ИдентификаторДействия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ) = ЛОЖЬ
	|					И ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ПериодОтбора КАК ПериодОтбора,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	|			ТОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, ЧАС, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	|								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|									ТОГДА -1
	|								ИНАЧЕ 1
	|							КОНЕЦ)
	|				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, МИНУТА, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	|								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|									ТОГДА -1
	|								ИНАЧЕ 1
	|							КОНЕЦ)
	|				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)
	|						И ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия)
	|					ТОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаЗапланированная,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию КАК СтатусКДействию,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.Контрагент КАК Контрагент,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.Описание КАК Описание,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.Сообщение КАК Сообщение,
	|	&ОбъектСобытия КАК ОбъектСобытия,
	|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке
	|ИЗ
	|	ТаблицаПланируемыхТриггеровИДатРегистрации КАК ТаблицаПланируемыхТриггеровИДатРегистрации
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|					И ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема)
	|					И ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|					И ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаЗаписи <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, ЧАС, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	|										КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|											ТОГДА -1
	|										ИНАЧЕ 1
	|									КОНЕЦ)
	|						КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, МИНУТА, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	|										КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|											ТОГДА -1
	|										ИНАЧЕ 1
	|									КОНЕЦ)
	|						ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|					КОНЕЦ > ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаЗаписи
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАктуальныхТриггеровДляТекущейРегистрации.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаАктуальныхТриггеровДляТекущейРегистрации.НеОтработанныйКонтрагент КАК НеОтработанныйКонтрагент
	|ИЗ
	|	ТаблицаАктуальныхТриггеровДляТекущейРегистрации КАК ТаблицаАктуальныхТриггеровДляТекущейРегистрации";
	
КонецПроцедуры

// Процедура - Инициализировать текст запроса для регистрации смены статуса клиента при подписке
//
// Параметры:
//  Запрос	 - 	 - 
//
Процедура ИнициализироватьТекстЗапросаДляРегистрацииСменыСтатусаКлиентаПриПодписке(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТриггерныеСобытия.Ссылка КАК ТриггерноеСобытие,
	|	&Контрагент КАК Контрагент,
	|	ТриггерныеСобытия.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТриггерныеСобытия.Использование КАК Использование,
	|	ТриггерныеСобытия.ВидДействия КАК ВидДействия,
	|	ТриггерныеСобытия.Удалено КАК Удалено,
	|	ТриггерныеСобытия.Ссылка.Активно КАК Активно,
	|	ТриггерныеСобытия.Описание КАК Описание,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано) КАК ПланируемыйСтатус
	|ПОМЕСТИТЬ ТаблицаТриггеров
	|ИЗ
	|	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытия
	|ГДЕ
	|	ТриггерныеСобытия.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.Активно = ИСТИНА
	|	И ТриггерныеСобытия.Ссылка.УсловиеСобытия В(&МассивГибридныхТриггеров)
	|	И ТриггерныеСобытия.Ссылка.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТриггерныеСобытия.Ссылка,
	|	&Контрагент,
	|	ТриггерныеСобытия.ИдентификаторДействия,
	|	ТриггерныеСобытия.Использование,
	|	ТриггерныеСобытия.ВидДействия,
	|	ТриггерныеСобытия.Удалено,
	|	ТриггерныеСобытия.Ссылка.Активно,
	|	ТриггерныеСобытия.Описание,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|ИЗ
	|	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытия
	|ГДЕ
	|	&Контрагент <> НЕОПРЕДЕЛЕНО
	|	И &ДатаСобытия <> НЕОПРЕДЕЛЕНО
	|	И ТриггерныеСобытия.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.Активно = ИСТИНА
	|	И ТриггерныеСобытия.Ссылка.УсловиеСобытия В(&МассивГибридныхТриггеров)
	|	И ТриггерныеСобытия.Ссылка.МоментСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия), ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия))
	|	И ТриггерныеСобытия.Ссылка.ПериодСобытияВид В (ЗНАЧЕНИЕ(Перечисление.Периодичность.Час), ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Статус КАК Статус
	|ПОМЕСТИТЬ ТаблицаОтработанныхТриггеров
	|ИЗ
	|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	|ГДЕ
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие В
	|			(ВЫБРАТЬ
	|				ТаблицаТриггеров.ТриггерноеСобытие
	|			ИЗ
	|				ТаблицаТриггеров
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаТриггеров.ТриггерноеСобытие)
	|	И ЖурналРегистрацииТриггерныхСобытий.Контрагент = &Контрагент
	|	И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = &ОбъектСобытия
	|	И ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТриггеров.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаТриггеров.ТриггерноеСобытие.УсловиеСобытия КАК УсловиеСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПараметрСобытия КАК ПараметрСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.МоментСобытия КАК МоментСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытияВид КАК ПериодСобытияВид,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытия КАК ПериодСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВремяСобытия КАК ВремяСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СегментКонтрагентов КАК СегментКонтрагентов,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СегментУслуг КАК СегментУслуг,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидСделки КАК ВидСделки,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидБонусногоСчета КАК ВидБонусногоСчета,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПереходСЭтапа КАК ПереходСЭтапа,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПереходНаЭтап КАК ПереходНаЭтап,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ТипПолиса КАК ТипПолиса,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтатусПациентаПриема КАК СтатусПациентаПриема,
	|	ТаблицаТриггеров.ТриггерноеСобытие.РезультатПриема КАК РезультатПриема,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтатусЗаписи КАК СтатусЗаписи,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ИсточникЗаписи КАК ИсточникЗаписи,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПричинаОтмены КАК ПричинаОтмены,
	|	ТаблицаТриггеров.ТриггерноеСобытие.Наименование КАК Наименование,
	|	ТаблицаТриггеров.ТриггерноеСобытие.КодСинхронизации КАК КодСинхронизации,
	|	НЕОПРЕДЕЛЕНО КАК ПланДействийТриггерногоСобытия,
	|	НЕОПРЕДЕЛЕНО КАК ТаблицаНекондиционныхДействий,
	|	НЕОПРЕДЕЛЕНО КАК ПараметрыШаблона,
	|	НЕОПРЕДЕЛЕНО КАК МассивНеобработанныхКонтрагентов
	|ИЗ
	|	ТаблицаТриггеров КАК ТаблицаТриггеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
	|		ПО ТаблицаТриггеров.ТриггерноеСобытие = ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	|			И ТаблицаТриггеров.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
	|ГДЕ
	|	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
	|	И ТаблицаТриггеров.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	|	И ТаблицаТриггеров.Активно = ИСТИНА
	|	И ТаблицаТриггеров.Использование = ИСТИНА
	|	И ТаблицаТриггеров.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|	И ТаблицаТриггеров.Удалено = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТриггеров.ТриггерноеСобытие,
	|	ТаблицаТриггеров.ТриггерноеСобытие.УсловиеСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПараметрСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.МоментСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытияВид,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВремяСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтруктурнаяЕдиница,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СегментКонтрагентов,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СегментУслуг,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидСделки,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидЛицевогоСчета,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидБонусногоСчета,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПереходСЭтапа,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПереходНаЭтап,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ТипПолиса,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтатусПациентаПриема,
	|	ТаблицаТриггеров.ТриггерноеСобытие.РезультатПриема,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтатусЗаписи,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ИсточникЗаписи,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПричинаОтмены,
	|	ТаблицаТриггеров.ТриггерноеСобытие.Наименование,
	|	ТаблицаТриггеров.ТриггерноеСобытие.КодСинхронизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Описание КАК Описание
	|ПОМЕСТИТЬ ЖурналЗапланированнойРегистрации
	|ИЗ
	|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	|ГДЕ
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие В
	|			(ВЫБРАТЬ
	|				ТаблицаТриггеров.ТриггерноеСобытие
	|			ИЗ
	|				ТаблицаТриггеров
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаТриггеров.ТриггерноеСобытие)
	|	И ЖурналРегистрацииТриггерныхСобытий.Контрагент = &Контрагент
	|	И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = &ОбъектСобытия
	|	И ЖурналРегистрацииТриггерныхСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналРегистрацииТриггерныхСобытий.Период,
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Описание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаТриггеровИКонтрагентов.Контрагент КАК Контрагент,
	|	&ДатаСобытия КАК Дата,
	|	ТаблицаТриггеровИКонтрагентов.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ВЫБОР
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Активно = ИСТИНА
	|				И ТаблицаТриггеровИКонтрагентов.Использование = ИСТИНА
	|				И ТаблицаТриггеровИКонтрагентов.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|				И ТаблицаТриггеровИКонтрагентов.Удалено = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДействиеАктуально,
	|	ТаблицаТриггеровИКонтрагентов.Описание КАК Описание,
	|	ВЫБОР
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Активно = ЛОЖЬ
	|			ТОГДА &ПользовательДеактивировалТриггер
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Использование = ЛОЖЬ
	|			ТОГДА &ПользовательДеактивировалДействие
	|		КОГДА ТаблицаТриггеровИКонтрагентов.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|			ТОГДА &ПользовательНеУказалВидДействия
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Удалено = ИСТИНА
	|			ТОГДА &ПользовательУдалилДействие
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Сообщение
	|ПОМЕСТИТЬ ТаблицаПланируемыхДействийТриггера
	|ИЗ
	|	ТаблицаТриггеров КАК ТаблицаТриггеровИКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
	|		ПО ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие = ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	|			И ТаблицаТриггеровИКонтрагентов.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
	|			И ТаблицаТриггеровИКонтрагентов.ИдентификаторДействия = ТаблицаОтработанныхТриггеров.ИдентификаторДействия
	|			И (ТаблицаОтработанныхТриггеров.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено))
	|ГДЕ
	|	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
	|	И ТаблицаТриггеровИКонтрагентов.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|				ИЛИ НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	|		КОГДА ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	|	КОНЕЦ КАК СтатусКДействию,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.ТриггерноеСобытие ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.ТриггерноеСобытие
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие
	|	КОНЕЦ КАК ТриггерноеСобытие,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Контрагент
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Период
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ПериодОтбора,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.ИдентификаторДействия
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ИдентификаторДействия
	|	КОНЕЦ КАК ИдентификаторДействия,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Описание
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Описание
	|	КОНЕЦ КАК Описание,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|				ИЛИ НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Дата
	|	КОНЕЦ КАК ДатаОтсчета,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|			ТОГДА &НеАктуально
	|		КОГДА НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ТаблицаПланируемыхДействийТриггера.Сообщение
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Сообщение
	|	КОНЕЦ КАК Сообщение
	|ПОМЕСТИТЬ ТаблицаПланируемыхТриггеровИДатРегистрации
	|ИЗ
	|	ТаблицаПланируемыхДействийТриггера КАК ТаблицаПланируемыхДействийТриггера
	|		ПОЛНОЕ СОЕДИНЕНИЕ ЖурналЗапланированнойРегистрации КАК ЖурналЗапланированнойРегистрации
	|		ПО ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие = ЖурналЗапланированнойРегистрации.ТриггерноеСобытие
	|			И ТаблицаПланируемыхДействийТриггера.Контрагент = ЖурналЗапланированнойРегистрации.Контрагент
	|			И ТаблицаПланируемыхДействийТриггера.ИдентификаторДействия = ЖурналЗапланированнойРегистрации.ИдентификаторДействия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ) = ЛОЖЬ
	|					И ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ПериодОтбора КАК ПериодОтбора,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	|			ТОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, ЧАС, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	|								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|									ТОГДА -1
	|								ИНАЧЕ 1
	|							КОНЕЦ)
	|				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, МИНУТА, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	|								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|									ТОГДА -1
	|								ИНАЧЕ 1
	|							КОНЕЦ)
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаЗапланированная,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию КАК СтатусКДействию,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.Контрагент КАК Контрагент,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.Описание КАК Описание,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.Сообщение КАК Сообщение,
	|	&ОбъектСобытия КАК ОбъектСобытия,
	|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке
	|ИЗ
	|	ТаблицаПланируемыхТриггеровИДатРегистрации КАК ТаблицаПланируемыхТриггеровИДатРегистрации";
		
КонецПроцедуры

// Процедура - Инициализировать текст запроса для регистрации при подписке на
//
// Параметры:
//  Запрос	 - 	 - 
//
Процедура ИнициализироватьТекстЗапросаДляРегистрацииПриПодписке(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТриггерныеСобытия.Ссылка КАК ТриггерноеСобытие,
	|	&Контрагент КАК Контрагент,
	|	ТриггерныеСобытия.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТриггерныеСобытия.Использование КАК Использование,
	|	ТриггерныеСобытия.ВидДействия КАК ВидДействия,
	|	ТриггерныеСобытия.Удалено КАК Удалено,
	|	ТриггерныеСобытия.Ссылка.Активно КАК Активно,
	|	ТриггерныеСобытия.Описание КАК Описание,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано) КАК ПланируемыйСтатус
	|ПОМЕСТИТЬ ТаблицаТриггеров
	|ИЗ
	|	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытия
	|ГДЕ
	|	ТриггерныеСобытия.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.Активно = ИСТИНА
	|	И ТриггерныеСобытия.Ссылка.УсловиеСобытия В(&МассивГибридныхТриггеров)
	|	И ТриггерныеСобытия.Ссылка.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТриггерныеСобытия.Ссылка,
	|	&Контрагент,
	|	ТриггерныеСобытия.ИдентификаторДействия,
	|	ТриггерныеСобытия.Использование,
	|	ТриггерныеСобытия.ВидДействия,
	|	ТриггерныеСобытия.Удалено,
	|	ТриггерныеСобытия.Ссылка.Активно,
	|	ТриггерныеСобытия.Описание,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|ИЗ
	|	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытия
	|ГДЕ
	|	&Контрагент <> НЕОПРЕДЕЛЕНО
	|	И &ДатаСобытия <> НЕОПРЕДЕЛЕНО
	|	И ТриггерныеСобытия.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТриггерныеСобытия.Ссылка.Активно = ИСТИНА
	|	И ТриггерныеСобытия.Ссылка.УсловиеСобытия В(&МассивГибридныхТриггеров)
	|	И ТриггерныеСобытия.Ссылка.МоментСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия), ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия))
	|	И ТриггерныеСобытия.Ссылка.ПериодСобытияВид В (ЗНАЧЕНИЕ(Перечисление.Периодичность.Час), ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Статус КАК Статус
	|ПОМЕСТИТЬ ТаблицаОтработанныхТриггеров
	|ИЗ
	|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	|ГДЕ
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие В
	|			(ВЫБРАТЬ
	|				ТаблицаТриггеров.ТриггерноеСобытие
	|			ИЗ
	|				ТаблицаТриггеров
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаТриггеров.ТриггерноеСобытие)
	|	И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = &ОбъектСобытия
	|	И ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТриггеров.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаТриггеров.ТриггерноеСобытие.УсловиеСобытия КАК УсловиеСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПараметрСобытия КАК ПараметрСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.МоментСобытия КАК МоментСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытияВид КАК ПериодСобытияВид,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытия КАК ПериодСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВремяСобытия КАК ВремяСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СегментКонтрагентов КАК СегментКонтрагентов,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СегментУслуг КАК СегментУслуг,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидСделки КАК ВидСделки,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидБонусногоСчета КАК ВидБонусногоСчета,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПереходСЭтапа КАК ПереходСЭтапа,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПереходНаЭтап КАК ПереходНаЭтап,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ТипПолиса КАК ТипПолиса,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтатусПациентаПриема КАК СтатусПациентаПриема,
	|	ТаблицаТриггеров.ТриггерноеСобытие.РезультатПриема КАК РезультатПриема,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтатусЗаписи КАК СтатусЗаписи,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ИсточникЗаписи КАК ИсточникЗаписи,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПричинаОтмены КАК ПричинаОтмены,
	|	ТаблицаТриггеров.ТриггерноеСобытие.Наименование КАК Наименование,
	|	ТаблицаТриггеров.ТриггерноеСобытие.КодСинхронизации КАК КодСинхронизации,
	|	НЕОПРЕДЕЛЕНО КАК ПланДействийТриггерногоСобытия,
	|	НЕОПРЕДЕЛЕНО КАК ТаблицаНекондиционныхДействий,
	|	НЕОПРЕДЕЛЕНО КАК ПараметрыШаблона,
	|	НЕОПРЕДЕЛЕНО КАК МассивНеобработанныхКонтрагентов
	|ИЗ
	|	ТаблицаТриггеров КАК ТаблицаТриггеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
	|		ПО ТаблицаТриггеров.ТриггерноеСобытие = ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	|			И ТаблицаТриггеров.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
	|			И (ТаблицаОтработанныхТриггеров.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено))
	|ГДЕ
	|	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
	|	И ТаблицаТриггеров.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	|	И ТаблицаТриггеров.Активно = ИСТИНА
	|	И ТаблицаТриггеров.Использование = ИСТИНА
	|	И ТаблицаТриггеров.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|	И ТаблицаТриггеров.Удалено = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТриггеров.ТриггерноеСобытие,
	|	ТаблицаТриггеров.ТриггерноеСобытие.УсловиеСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПараметрСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.МоментСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытияВид,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВремяСобытия,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтруктурнаяЕдиница,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СегментКонтрагентов,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СегментУслуг,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидСделки,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидЛицевогоСчета,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ВидБонусногоСчета,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПереходСЭтапа,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПереходНаЭтап,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ТипПолиса,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтатусПациентаПриема,
	|	ТаблицаТриггеров.ТриггерноеСобытие.РезультатПриема,
	|	ТаблицаТриггеров.ТриггерноеСобытие.СтатусЗаписи,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ИсточникЗаписи,
	|	ТаблицаТриггеров.ТриггерноеСобытие.ПричинаОтмены,
	|	ТаблицаТриггеров.ТриггерноеСобытие.Наименование,
	|	ТаблицаТриггеров.ТриггерноеСобытие.КодСинхронизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Описание КАК Описание
	|ПОМЕСТИТЬ ЖурналЗапланированнойРегистрации
	|ИЗ
	|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	|ГДЕ
	|	&Контрагент <> НЕОПРЕДЕЛЕНО
	|	И ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие В
	|			(ВЫБРАТЬ
	|				ТаблицаТриггеров.ТриггерноеСобытие
	|			ИЗ
	|				ТаблицаТриггеров
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаТриггеров.ТриггерноеСобытие)
	|	И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = &ОбъектСобытия
	|	И ЖурналРегистрацииТриггерныхСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналРегистрацииТриггерныхСобытий.Период,
	|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
	|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
	|	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
	|	ЖурналРегистрацииТриггерныхСобытий.Описание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаТриггеровИКонтрагентов.Контрагент КАК Контрагент,
	|	&ДатаСобытия КАК Дата,
	|	ТаблицаТриггеровИКонтрагентов.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ВЫБОР
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Активно = ИСТИНА
	|				И ТаблицаТриггеровИКонтрагентов.Использование = ИСТИНА
	|				И ТаблицаТриггеровИКонтрагентов.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|				И ТаблицаТриггеровИКонтрагентов.Удалено = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДействиеАктуально,
	|	ТаблицаТриггеровИКонтрагентов.Описание КАК Описание,
	|	ВЫБОР
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Активно = ЛОЖЬ
	|			ТОГДА &ПользовательДеактивировалТриггер
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Использование = ЛОЖЬ
	|			ТОГДА &ПользовательДеактивировалДействие
	|		КОГДА ТаблицаТриггеровИКонтрагентов.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	|			ТОГДА &ПользовательНеУказалВидДействия
	|		КОГДА ТаблицаТриггеровИКонтрагентов.Удалено = ИСТИНА
	|			ТОГДА &ПользовательУдалилДействие
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Сообщение
	|ПОМЕСТИТЬ ТаблицаПланируемыхДействийТриггера
	|ИЗ
	|	ТаблицаТриггеров КАК ТаблицаТриггеровИКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
	|		ПО ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие = ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	|			И ТаблицаТриггеровИКонтрагентов.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
	|			И ТаблицаТриггеровИКонтрагентов.ИдентификаторДействия = ТаблицаОтработанныхТриггеров.ИдентификаторДействия
	|			И (ТаблицаОтработанныхТриггеров.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено))
	|ГДЕ
	|	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
	|	И ТаблицаТриггеровИКонтрагентов.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|				ИЛИ НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	|		КОГДА ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	|	КОНЕЦ КАК СтатусКДействию,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.ТриггерноеСобытие ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.ТриггерноеСобытие
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие
	|	КОНЕЦ КАК ТриггерноеСобытие,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Контрагент
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Период
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ПериодОтбора,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.ИдентификаторДействия
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ИдентификаторДействия
	|	КОНЕЦ КАК ИдентификаторДействия,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|			ТОГДА ЖурналЗапланированнойРегистрации.Описание
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Описание
	|	КОНЕЦ КАК Описание,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|				ИЛИ НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Дата
	|	КОНЕЦ КАК ДатаОтсчета,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	|			ТОГДА &НеАктуально
	|		КОГДА НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	|			ТОГДА ТаблицаПланируемыхДействийТриггера.Сообщение
	|		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Сообщение
	|	КОНЕЦ КАК Сообщение
	|ПОМЕСТИТЬ ТаблицаПланируемыхТриггеровИДатРегистрации
	|ИЗ
	|	ТаблицаПланируемыхДействийТриггера КАК ТаблицаПланируемыхДействийТриггера
	|		ПОЛНОЕ СОЕДИНЕНИЕ ЖурналЗапланированнойРегистрации КАК ЖурналЗапланированнойРегистрации
	|		ПО ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие = ЖурналЗапланированнойРегистрации.ТриггерноеСобытие
	|			И ТаблицаПланируемыхДействийТриггера.Контрагент = ЖурналЗапланированнойРегистрации.Контрагент
	|			И ТаблицаПланируемыхДействийТриггера.ИдентификаторДействия = ЖурналЗапланированнойРегистрации.ИдентификаторДействия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ) = ЛОЖЬ
	|					И ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ПериодОтбора КАК ПериодОтбора,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	|			ТОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, ЧАС, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	|								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|									ТОГДА -1
	|								ИНАЧЕ 1
	|							КОНЕЦ)
	|				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, МИНУТА, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	|								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	|									ТОГДА -1
	|								ИНАЧЕ 1
	|							КОНЕЦ)
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаЗапланированная,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	|				И ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.УсловиеСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентПосещениеКлиники))
	|				И &ПризнакОтмены = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	|		ИНАЧЕ ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию
	|	КОНЕЦ КАК СтатусКДействию,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие КАК ТриггерноеСобытие,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.Контрагент КАК Контрагент,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТаблицаПланируемыхТриггеровИДатРегистрации.Описание КАК Описание,
	|	ВЫБОР
	|		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	|				И ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.УсловиеСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентПосещениеКлиники))
	|				И &ПризнакОтмены = ИСТИНА
	|			ТОГДА &ПосещениеОтменено
	|		ИНАЧЕ ТаблицаПланируемыхТриггеровИДатРегистрации.Сообщение
	|	КОНЕЦ КАК Сообщение,
	|	&ОбъектСобытия КАК ОбъектСобытия,
	|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке
	|ИЗ
	|	ТаблицаПланируемыхТриггеровИДатРегистрации КАК ТаблицаПланируемыхТриггеровИДатРегистрации
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	|					И ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.УсловиеСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентПосещениеКлиники))
	|				ТОГДА &ПризнакОтмены = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
		
КонецПроцедуры

// Процедура - Зарегистрировать планируемые события
//
// Параметры:
//  ТаблицаПланируемыхСобытий	 - 	 - 
//
Процедура ЗарегистрироватьПланируемыеСобытия(ЗНАЧ ТаблицаПланируемыхСобытий = Неопределено, РегистрацияНекондиционных = Ложь, ПланДействийТриггерногоСобытия = Неопределено)
	
	ДатаОтклонения = ТекущаяДатаСеанса();
	
	// Регистрация регламентных триггеров со статусом "Отклонено" по которым мы не получили актуальные данные
	Если ТаблицаПланируемыхСобытий = Неопределено И НЕ ПланДействийТриггерногоСобытия = Неопределено Тогда 
		Для Каждого СтрокаПлан Из ПланДействийТриггерногоСобытия Цикл 
			МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
			// Добавляем запись
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, СтрокаПлан);
			МенеджерЗаписиСобытия.Период 				= ДатаОтклонения;
			МенеджерЗаписиСобытия.ТриггерноеСобытие 	= СтрокаПлан.ТриггерноеСобытие;
			МенеджерЗаписиСобытия.Контрагент 			= Справочники.Контрагенты.ПустаяСсылка();
			МенеджерЗаписиСобытия.ОбъектСобытия 		= Неопределено;
			МенеджерЗаписиСобытия.ИдентификаторДействия = СтрокаПлан.ИдентификаторДействия;
			МенеджерЗаписиСобытия.РегистрацияПоПодписке	= Ложь;
			МенеджерЗаписиСобытия.Прочитать();
			Если НЕ МенеджерЗаписиСобытия.Выбран() Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, СтрокаПлан);
				МенеджерЗаписиСобытия.Период 				= ДатаОтклонения;
				МенеджерЗаписиСобытия.ТриггерноеСобытие 	= СтрокаПлан.ТриггерноеСобытие;
				МенеджерЗаписиСобытия.Контрагент 			= Справочники.Контрагенты.ПустаяСсылка();
				МенеджерЗаписиСобытия.ОбъектСобытия 		= Неопределено;
				МенеджерЗаписиСобытия.ИдентификаторДействия = СтрокаПлан.ИдентификаторДействия;
				МенеджерЗаписиСобытия.РегистрацияПоПодписке	= Ложь;
				МенеджерЗаписиСобытия.Статус 				= Перечисления.СтатусыРегистрацииСобытий.Отклонено;
				МенеджерЗаписиСобытия.Сообщение 			= НСтр("ru='Не обнаружено событий для срабатывания триггера на указанный период.';en='No events were detected for triggering the trigger for the specified period.'");
				МенеджерЗаписиСобытия.Записать();
			КонецЕсли;
		КонецЦикла;	
		Возврат;
	КонецЕсли;
	
	Для Каждого ПланируемоеСобытие Из ТаблицаПланируемыхСобытий Цикл
		МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
		Если ПланируемоеСобытие.СтатусКДействию = Перечисления.СтатусыРегистрацииСобытий.Запланировано Тогда  // необходимо запланировать
			Если ПланДействийТриггерногоСобытия = Неопределено Тогда 
				// Добавляем запись
				Если НЕ ЗначениеЗаполнено(ПланируемоеСобытие.ДатаЗапланированная) Тогда 
					Продолжить;
				КонецЕсли;				
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
				МенеджерЗаписиСобытия.Период = ПланируемоеСобытие.ДатаЗапланированная;			
				МенеджерЗаписиСобытия.Прочитать();
				Если НЕ МенеджерЗаписиСобытия.Выбран() Тогда
					ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
					МенеджерЗаписиСобытия.Период 	= ПланируемоеСобытие.ДатаЗапланированная;							
					МенеджерЗаписиСобытия.Статус 	= Перечисления.СтатусыРегистрацииСобытий.Запланировано;
					МенеджерЗаписиСобытия.Описание 	= ПланируемоеСобытие.Описание;
					МенеджерЗаписиСобытия.Сообщение = ПланируемоеСобытие.Сообщение;				
					МенеджерЗаписиСобытия.Записать();
				ИначеЕсли МенеджерЗаписиСобытия.Статус = Перечисления.СтатусыРегистрацииСобытий.Отклонено Тогда 
					ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
					МенеджерЗаписиСобытия.Период 	= ПланируемоеСобытие.ДатаЗапланированная;							
					МенеджерЗаписиСобытия.Статус 	= Перечисления.СтатусыРегистрацииСобытий.Запланировано;
					МенеджерЗаписиСобытия.Описание 	= ПланируемоеСобытие.Описание;
					МенеджерЗаписиСобытия.Сообщение = ПланируемоеСобытие.Сообщение;				
					МенеджерЗаписиСобытия.Записать();
				КонецЕсли;
			Иначе 
				Для Каждого СтрокаПлан Из ПланДействийТриггерногоСобытия Цикл 
					МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
					// Добавляем запись
					Если НЕ ЗначениеЗаполнено(ПланируемоеСобытие.ДатаЗапланированная) Тогда 
						Продолжить;
					КонецЕсли;				
					ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
					МенеджерЗаписиСобытия.Период 				= ПланируемоеСобытие.ДатаЗапланированная;
					МенеджерЗаписиСобытия.ИдентификаторДействия = СтрокаПлан.ИдентификаторДействия;
					МенеджерЗаписиСобытия.Прочитать();
					Если НЕ МенеджерЗаписиСобытия.Выбран() Тогда
						ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
						МенеджерЗаписиСобытия.Период 				= ПланируемоеСобытие.ДатаЗапланированная;
						МенеджерЗаписиСобытия.ИдентификаторДействия = СтрокаПлан.ИдентификаторДействия;
						МенеджерЗаписиСобытия.Статус 				= Перечисления.СтатусыРегистрацииСобытий.Запланировано;
						МенеджерЗаписиСобытия.Описание 				= СтрокаПлан.Описание;
						МенеджерЗаписиСобытия.Сообщение 			= СтрокаПлан.Сообщение;				
						МенеджерЗаписиСобытия.Записать();
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
		ИначеЕсли ПланируемоеСобытие.СтатусКДействию = Перечисления.СтатусыРегистрацииСобытий.Отклонено Тогда // отклонить запланированное
			// Отклоняем запись как неактуальную
			Если НЕ ЗначениеЗаполнено(ПланируемоеСобытие.ПериодОтбора) И РегистрацияНекондиционных = Ложь Тогда 
				Продолжить;
			КонецЕсли;							
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
			МенеджерЗаписиСобытия.Период = ?(ЗначениеЗаполнено(ПланируемоеСобытие.ПериодОтбора), ПланируемоеСобытие.ПериодОтбора, ДатаОтклонения);
			МенеджерЗаписиСобытия.Прочитать();
			Если МенеджерЗаписиСобытия.Выбран() И МенеджерЗаписиСобытия.Статус = Перечисления.СтатусыРегистрацииСобытий.Запланировано Тогда // И РегистрацияНекондиционных = Ложь Тогда 
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
				МенеджерЗаписиСобытия.Период 	= ?(ЗначениеЗаполнено(ПланируемоеСобытие.ПериодОтбора) И РегистрацияНекондиционных, ПланируемоеСобытие.ПериодОтбора, ?(ПланируемоеСобытие.ДатаЗапланированная = Дата(1, 1, 1), ДатаОтклонения, ПланируемоеСобытие.ДатаЗапланированная));
				МенеджерЗаписиСобытия.Статус 	= Перечисления.СтатусыРегистрацииСобытий.Отклонено;
				МенеджерЗаписиСобытия.Описание 	= ПланируемоеСобытие.Описание;
				МенеджерЗаписиСобытия.Сообщение = ПланируемоеСобытие.Сообщение;								
				МенеджерЗаписиСобытия.Записать();
			ИначеЕсли НЕ МенеджерЗаписиСобытия.Выбран() И РегистрацияНекондиционных = Истина Тогда 
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
				МенеджерЗаписиСобытия.Период 	= ?(ЗначениеЗаполнено(ПланируемоеСобытие.ПериодОтбора), ПланируемоеСобытие.ПериодОтбора, ДатаОтклонения);							
				МенеджерЗаписиСобытия.Статус 	= Перечисления.СтатусыРегистрацииСобытий.Отклонено;
				МенеджерЗаписиСобытия.Описание 	= ПланируемоеСобытие.Описание;
				МенеджерЗаписиСобытия.Сообщение = ПланируемоеСобытие.Сообщение;				
				МенеджерЗаписиСобытия.Записать();
			КонецЕсли;
		Иначе 
			// Корректируем запись
			Если НЕ ЗначениеЗаполнено(ПланируемоеСобытие.ПериодОтбора) Тогда  
				Продолжить;
			КонецЕсли;							
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
			МенеджерЗаписиСобытия.Период = ПланируемоеСобытие.ПериодОтбора;
			МенеджерЗаписиСобытия.Прочитать();
			Если МенеджерЗаписиСобытия.Выбран() И МенеджерЗаписиСобытия.Статус = Перечисления.СтатусыРегистрацииСобытий.Запланировано Тогда 
				Если НЕ ЗначениеЗаполнено(ПланируемоеСобытие.ДатаЗапланированная) Тогда
					// Отклоняем запись как неактуальную
					ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
					МенеджерЗаписиСобытия.Период 	= ДатаОтклонения;
					МенеджерЗаписиСобытия.Статус 	= Перечисления.СтатусыРегистрацииСобытий.Отклонено;
					МенеджерЗаписиСобытия.Описание 	= ПланируемоеСобытие.Описание;
					МенеджерЗаписиСобытия.Сообщение = ПланируемоеСобытие.Сообщение;								
					МенеджерЗаписиСобытия.Записать();
				ИначеЕсли ПланируемоеСобытие.ДатаЗапланированная <> ПланируемоеСобытие.ПериодОтбора И ПланируемоеСобытие.ДатаЗапланированная >= ТекущаяДатаСеанса() - 60*15 Тогда //+-15 минут
					// Обновляем запись
					ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
					МенеджерЗаписиСобытия.Период 	= ПланируемоеСобытие.ДатаЗапланированная;				
					МенеджерЗаписиСобытия.Статус 	= Перечисления.СтатусыРегистрацииСобытий.Запланировано;
					МенеджерЗаписиСобытия.Описание 	= ПланируемоеСобытие.Описание;
					МенеджерЗаписиСобытия.Сообщение = ПланируемоеСобытие.Сообщение;								
					МенеджерЗаписиСобытия.Записать();
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Зарегистрировать ошибки регистрации события
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  ТаблицаДанныхОбъекта		 - 	 - 
//  СтрокаДействия				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  СообщениеОбОшибке			 - 	 - 
//
Процедура ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера
												, ТаблицаДанныхОбъекта = Неопределено
												, СтруктураСобытия = Неопределено
												, РегистрацияПоПодписке = Ложь
												, РегистрацияЗапланированных = Ложь
												, СообщениеОбОшибке
												, Статус = Неопределено
												, АктуальнаяДатаРегистрации = Неопределено)
	
	ДатаРегистрацииОшибки = ТекущаяДатаСеанса();
	Если СообщениеОбОшибке = НСтр("ru = 'Перенесено в связи с активностью текущего диалога.'") Тогда 
		ДатаРегистрацииОшибки = ДатаРегистрацииОшибки + (60*15);
	КонецЕсли;
	Если ЗначениеЗаполнено(АктуальнаяДатаРегистрации) Тогда 
		ДатаРегистрацииОшибки = АктуальнаяДатаРегистрации;
	КонецЕсли;	
	ЭтоОшибкаПолученияЗначенийПарметровШаблона = СтрНайти(СообщениеОбОшибке, "Ошибка при получении значений параметров для шаблона триггерного события:") <> 0 ИЛИ СтрНайти(СообщениеОбОшибке, "Error getting parameter values for the trigger event template:") <> 0;
	
	Если СтруктураСобытия = Неопределено Тогда 
		Если РегистрацияЗапланированных Тогда 
			Для Каждого ПланируемоеСобытие Из ДанныеТриггера.РеестрЗапланированных Цикл
				СтрокаПлан = ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(ПланируемоеСобытие.ИдентификаторДействия, "ИдентификаторДействия");
				Если СтрокаПлан <> Неопределено И СтрокаПлан.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки Тогда 
					Продолжить;
				КонецЕсли;	
				МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
				МенеджерЗаписиСобытия.Период = ПланируемоеСобытие.Период;
				МенеджерЗаписиСобытия.Прочитать();
				Если МенеджерЗаписиСобытия.Выбран() И МенеджерЗаписиСобытия.Статус = Перечисления.СтатусыРегистрацииСобытий.Запланировано Тогда 
					ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, ПланируемоеСобытие);
					МенеджерЗаписиСобытия.Период 	= ДатаРегистрацииОшибки;
					МенеджерЗаписиСобытия.Статус 	= ?(ЗначениеЗаполнено(Статус), Статус, Перечисления.СтатусыРегистрацииСобытий.ОшибкаРегистрации);
					МенеджерЗаписиСобытия.Сообщение	= СообщениеОбОшибке;
					МенеджерЗаписиСобытия.Записать();
				КонецЕсли;			
			КонецЦикла;
			Если ЭтоОшибкаПолученияЗначенийПарметровШаблона Тогда 
				ДанныеТриггера.ПланДействийТриггерногоСобытия = ДанныеТриггера.ПланДействийТриггерногоСобытия.Скопировать(Новый Структура("ВидДействия", Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки));
			Иначе 
				ДанныеТриггера.ПланДействийТриггерногоСобытия = ДанныеТриггера.ПланДействийТриггерногоСобытия.СкопироватьКолонки();
			КонецЕсли;	
		ИначеЕсли НЕ ТаблицаДанныхОбъекта = Неопределено Тогда 
			ПланДействийТриггерногоСобытия = ДанныеТриггера.ПланДействийТриггерногоСобытия.СкопироватьКолонки();
			Для Каждого РегистрируемоеСобытие Из ТаблицаДанныхОбъекта Цикл 
				Для Каждого СтрокаПлан Из ДанныеТриггера.ПланДействийТриггерногоСобытия Цикл 
					Если ЭтоОшибкаПолученияЗначенийПарметровШаблона И СтрокаПлан.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки Тогда 
						ЗаполнитьЗначенияСвойств(ПланДействийТриггерногоСобытия.Добавить(), СтрокаПлан);
						Продолжить;						
					КонецЕсли;
					МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
					МенеджерЗаписиСобытия.Период 				= ДатаРегистрацииОшибки;
					МенеджерЗаписиСобытия.ТриггерноеСобытие 	= ДанныеТриггера.ТриггерноеСобытие;
					МенеджерЗаписиСобытия.Контрагент 			= РегистрируемоеСобытие.Контрагент;
					МенеджерЗаписиСобытия.ОбъектСобытия 		= РегистрируемоеСобытие.ОбъектСобытия;
					МенеджерЗаписиСобытия.ИдентификаторДействия = СтрокаПлан.ИдентификаторДействия;
					МенеджерЗаписиСобытия.РегистрацияПоПодписке = РегистрацияПоПодписке;
					МенеджерЗаписиСобытия.Прочитать();
					Если НЕ МенеджерЗаписиСобытия.Выбран() Тогда 
						МенеджерЗаписиСобытия.Период 				= ДатаРегистрацииОшибки;
						МенеджерЗаписиСобытия.ТриггерноеСобытие 	= ДанныеТриггера.ТриггерноеСобытие;
						МенеджерЗаписиСобытия.Контрагент 			= РегистрируемоеСобытие.Контрагент;
						МенеджерЗаписиСобытия.ОбъектСобытия 		= РегистрируемоеСобытие.ОбъектСобытия;
						МенеджерЗаписиСобытия.ИдентификаторДействия = СтрокаПлан.ИдентификаторДействия;
						МенеджерЗаписиСобытия.РегистрацияПоПодписке = РегистрацияПоПодписке;
						МенеджерЗаписиСобытия.Статус 				= ?(ЗначениеЗаполнено(Статус), Статус, Перечисления.СтатусыРегистрацииСобытий.ОшибкаРегистрации);
						МенеджерЗаписиСобытия.Описание 				= СтрокаПлан.Описание;
						МенеджерЗаписиСобытия.Сообщение				= СообщениеОбОшибке;
						МенеджерЗаписиСобытия.Записать();
					КонецЕсли;			
				КонецЦикла;
			КонецЦикла;
			ДанныеТриггера.ПланДействийТриггерногоСобытия = ПланДействийТриггерногоСобытия;
		КонецЕсли;
	Иначе 
		Если РегистрацияЗапланированных И СтруктураСобытия.Свойство("СтрокаРеестра") Тогда 
			МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, СтруктураСобытия.СтрокаРеестра);
			МенеджерЗаписиСобытия.Период = СтруктураСобытия.СтрокаРеестра.Период;
			МенеджерЗаписиСобытия.Прочитать();
			Если МенеджерЗаписиСобытия.Выбран() И МенеджерЗаписиСобытия.Статус = Перечисления.СтатусыРегистрацииСобытий.Запланировано Тогда 
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиСобытия, СтруктураСобытия.СтрокаРеестра);
				МенеджерЗаписиСобытия.Период 	= ДатаРегистрацииОшибки;
				МенеджерЗаписиСобытия.Статус 	= ?(ЗначениеЗаполнено(Статус), Статус, Перечисления.СтатусыРегистрацииСобытий.ОшибкаРегистрации);
				МенеджерЗаписиСобытия.Сообщение	= СообщениеОбОшибке;
				МенеджерЗаписиСобытия.Записать();
			КонецЕсли;			
		Иначе 	
			МенеджерЗаписиСобытия = РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.СоздатьМенеджерЗаписи();
			МенеджерЗаписиСобытия.Период 				= ДатаРегистрацииОшибки;
			МенеджерЗаписиСобытия.ТриггерноеСобытие 	= ДанныеТриггера.ТриггерноеСобытие;
			МенеджерЗаписиСобытия.Контрагент 			= СтруктураСобытия.СтрокаТаблицыДанных.Контрагент;
			МенеджерЗаписиСобытия.ОбъектСобытия 		= СтруктураСобытия.СтрокаТаблицыДанных.ОбъектСобытия;
			МенеджерЗаписиСобытия.ИдентификаторДействия = СтруктураСобытия.СтрокаПланДействий.ИдентификаторДействия;
			МенеджерЗаписиСобытия.РегистрацияПоПодписке = СтруктураСобытия.СтрокаТаблицыДанных.РегистрацияПоПодписке;
			МенеджерЗаписиСобытия.Прочитать();
			Если НЕ МенеджерЗаписиСобытия.Выбран() Тогда 
				МенеджерЗаписиСобытия.Период 				= ДатаРегистрацииОшибки;
				МенеджерЗаписиСобытия.ТриггерноеСобытие 	= ДанныеТриггера.ТриггерноеСобытие;
				МенеджерЗаписиСобытия.Контрагент 			= СтруктураСобытия.СтрокаТаблицыДанных.Контрагент;
				МенеджерЗаписиСобытия.ОбъектСобытия 		= СтруктураСобытия.СтрокаТаблицыДанных.ОбъектСобытия;
				МенеджерЗаписиСобытия.ИдентификаторДействия = СтруктураСобытия.СтрокаПланДействий.ИдентификаторДействия;
				МенеджерЗаписиСобытия.РегистрацияПоПодписке = СтруктураСобытия.СтрокаТаблицыДанных.РегистрацияПоПодписке;
				МенеджерЗаписиСобытия.Статус 				= ?(ЗначениеЗаполнено(Статус), Статус, Перечисления.СтатусыРегистрацииСобытий.ОшибкаРегистрации);
				МенеджерЗаписиСобытия.Описание 				= СтруктураСобытия.СтрокаПланДействий.Описание;
				МенеджерЗаписиСобытия.Сообщение				= СообщениеОбОшибке;
				МенеджерЗаписиСобытия.Записать();
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Зарегистрировать смену статусов клиентов
//
// Параметры:
//  ТаблицаУстановленныхСтатусов - 	 - 
//
Процедура ЗарегистрироватьСменуСтатусовКлиентов(ТаблицаУстановленныхСтатусов) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаУстановленныхСтатусов, "ТаблицаУстановленныхСтатусов");
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, Ложь);
	Запрос.УстановитьПараметр("ТекущаяДата"					, ТекущаяДатаСеанса());
	УстановитьПараметрыСообщенийДляТриггерныхДействий(Запрос);
	
	// Подготавливаем текст запроса
	ИнициализироватьТекстЗапросаДляРегистрацииСменыСтатусаКлиентовПерсональнымРегламентнымЗаданием(Запрос);
	
	ПакетныйРезультат 						= Запрос.ВыполнитьПакет();
	ТаблицаТриггеровТекущейРегистрации 		= ПакетныйРезультат[4].Выгрузить();
	ТаблицаДанныхЗапланированныхТриггеров	= ПакетныйРезультат[8].Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();		
	
	Если НЕ ТаблицаТриггеровТекущейРегистрации = Неопределено И НЕ ТаблицаТриггеровТекущейРегистрации.Количество() = 0 Тогда
		МассивИсключительноРегламентныхТриггеров = Справочники.ТриггерныеСобытия.ПолучитьМассивТриггеров(, Ложь);		
		Для Каждого СтрокаТекущаяРегистрация Из ТаблицаТриггеровТекущейРегистрации Цикл 
			ПараметрыКлюча 			= Новый Структура("Период, Контрагент", СтрокаТекущаяРегистрация.Период, СтрокаТекущаяРегистрация.Контрагент);
			ПараметрыМассив 		= Новый Массив;
			ПараметрыМассив.Добавить(ПараметрыКлюча); 		
			КлючЗаписи 				= Новый("РегистрСведенийКлючЗаписи.СтатусыКонтрагентов", ПараметрыМассив);
			// Регистрируем текущие как по подписке
			ЗарегистрироватьСобытие(СтрокаТекущаяРегистрация, Истина, , КлючЗаписи, МассивИсключительноРегламентныхТриггеров);
		КонецЦикла;
	КонецЕсли;	
	
	// Регистрируем события со статусом "Запланировано",
	// которые должны будут в соответсвующий период активироваться регламентом,
	// а также отклоняем не актуальные строки по очевидным причинам (фильтрации по условиям в триггере будет происходить позже)
	ЗарегистрироватьПланируемыеСобытия(ТаблицаДанныхЗапланированныхТриггеров);
	
КонецПроцедуры

// Процедура - Инициализировать текст запроса для регистрации смены статуса клиентов персональным регламентным заданием
//
// Параметры:
//  Запрос	 - 	 - 
//
Процедура ИнициализироватьТекстЗапросаДляРегистрацииСменыСтатусаКлиентовПерсональнымРегламентнымЗаданием(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаУстановленныхСтатусов.Период КАК Период,
	               |	ВЫРАЗИТЬ(ТаблицаУстановленныхСтатусов.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	               |	ТаблицаУстановленныхСтатусов.Статус КАК Статус
	               |ПОМЕСТИТЬ ТаблицаКонтрагентовСменившихСтатус
	               |ИЗ
	               |	ТаблицаУстановленныхСтатусов КАК ТаблицаУстановленныхСтатусов
	               |ГДЕ
	               |	ТаблицаУстановленныхСтатусов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	И ТаблицаУстановленныхСтатусов.Контрагент <> НЕОПРЕДЕЛЕНО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТриггерныеСобытия.Ссылка КАК ТриггерноеСобытие,
	               |	НЕОПРЕДЕЛЕНО КАК Контрагент,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТриггерныеСобытия.Ссылка.ПереходНаЭтап КАК Перечисление.СтатусыКонтрагентов), ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) КАК ПереходНаСтатус,
	               |	ТриггерныеСобытия.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТриггерныеСобытия.Использование КАК Использование,
	               |	ТриггерныеСобытия.ВидДействия КАК ВидДействия,
	               |	ТриггерныеСобытия.Удалено КАК Удалено,
	               |	ТриггерныеСобытия.Ссылка.Активно КАК Активно,
	               |	ТриггерныеСобытия.Описание КАК Описание,
	               |	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано) КАК ПланируемыйСтатус
	               |ПОМЕСТИТЬ ТаблицаТриггеров
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытия
	               |ГДЕ
	               |	ТриггерныеСобытия.Ссылка.ЭтоГруппа = ЛОЖЬ
	               |	И ТриггерныеСобытия.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ТриггерныеСобытия.Ссылка.Активно = ИСТИНА
	               |	И ТриггерныеСобытия.Ссылка.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса)
	               |	И ТриггерныеСобытия.Ссылка.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТриггерныеСобытия.Ссылка,
	               |	НЕОПРЕДЕЛЕНО,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТриггерныеСобытия.Ссылка.ПереходНаЭтап КАК Перечисление.СтатусыКонтрагентов), ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)),
	               |	ТриггерныеСобытия.ИдентификаторДействия,
	               |	ТриггерныеСобытия.Использование,
	               |	ТриггерныеСобытия.ВидДействия,
	               |	ТриггерныеСобытия.Удалено,
	               |	ТриггерныеСобытия.Ссылка.Активно,
	               |	ТриггерныеСобытия.Описание,
	               |	ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия.Действия КАК ТриггерныеСобытия
	               |ГДЕ
	               |	ТриггерныеСобытия.Ссылка.ЭтоГруппа = ЛОЖЬ
	               |	И ТриггерныеСобытия.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ТриггерныеСобытия.Ссылка.Активно = ИСТИНА
	               |	И ТриггерныеСобытия.Ссылка.УсловиеСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса)
	               |	И ТриггерныеСобытия.Ссылка.МоментСобытия В (ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия), ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия))
	               |	И ТриггерныеСобытия.Ссылка.ПериодСобытияВид В (ЗНАЧЕНИЕ(Перечисление.Периодичность.Час), ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТриггеров.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ЕСТЬNULL(ТаблицаКонтрагентовСменившихСтатус.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	               |	ЕСТЬNULL(ТаблицаКонтрагентовСменившихСтатус.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) КАК СтатусКонтрагента,
	               |	ЕСТЬNULL(ТаблицаКонтрагентовСменившихСтатус.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период,
	               |	ТаблицаТриггеров.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаТриггеров.Использование КАК Использование,
	               |	ТаблицаТриггеров.ВидДействия КАК ВидДействия,
	               |	ТаблицаТриггеров.Удалено КАК Удалено,
	               |	ТаблицаТриггеров.Активно КАК Активно,
	               |	ТаблицаТриггеров.Описание КАК Описание,
	               |	ТаблицаТриггеров.ПланируемыйСтатус КАК ПланируемыйСтатус
	               |ПОМЕСТИТЬ ТаблицаТриггеровИКонтрагентов
	               |ИЗ
	               |	ТаблицаТриггеров КАК ТаблицаТриггеров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовСменившихСтатус КАК ТаблицаКонтрагентовСменившихСтатус
	               |		ПО ТаблицаТриггеров.Контрагент <> ТаблицаКонтрагентовСменившихСтатус.Контрагент
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ТаблицаТриггеров.ПереходНаСтатус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	               |				ТОГДА ТаблицаТриггеров.ПереходНаСтатус = ТаблицаКонтрагентовСменившихСтатус.Статус
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ТаблицаТриггеров.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	               |				ТОГДА НАЧАЛОПЕРИОДА(ТаблицаКонтрагентовСменившихСтатус.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия,
	               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ЖурналРегистрацииТриггерныхСобытий.Статус КАК Статус
	               |ПОМЕСТИТЬ ТаблицаОтработанныхТриггеров
	               |ИЗ
	               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	               |ГДЕ
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие В
	               |			(ВЫБРАТЬ
	               |				ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие
	               |			ИЗ
	               |				ТаблицаТриггеровИКонтрагентов
	               |			СГРУППИРОВАТЬ ПО
	               |				ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие)
	               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент В
	               |			(ВЫБРАТЬ
	               |				ТаблицаТриггеровИКонтрагентов.Контрагент
	               |			ИЗ
	               |				ТаблицаТриггеровИКонтрагентов
	               |			ГДЕ
	               |				ТаблицаТриггеровИКонтрагентов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |	И ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЖурналРегистрацииТриггерныхСобытий.Период,
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
	               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
	               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия,
	               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
	               |	ЖурналРегистрацииТриггерныхСобытий.Статус
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТриггеров.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаТриггеров.Контрагент КАК Контрагент,
	               |	ТаблицаТриггеров.Период КАК Период,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.УсловиеСобытия КАК УсловиеСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПараметрСобытия КАК ПараметрСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.МоментСобытия КАК МоментСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытияВид КАК ПериодСобытияВид,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытия КАК ПериодСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ВремяСобытия КАК ВремяСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СегментКонтрагентов КАК СегментКонтрагентов,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СегментУслуг КАК СегментУслуг,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ВидСделки КАК ВидСделки,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ВидБонусногоСчета КАК ВидБонусногоСчета,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПереходСЭтапа КАК ПереходСЭтапа,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПереходНаЭтап КАК ПереходНаЭтап,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ТипПолиса КАК ТипПолиса,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СтатусПациентаПриема КАК СтатусПациентаПриема,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.РезультатПриема КАК РезультатПриема,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СтатусЗаписи КАК СтатусЗаписи,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ИсточникЗаписи КАК ИсточникЗаписи,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПричинаОтмены КАК ПричинаОтмены,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.Наименование КАК Наименование,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.КодСинхронизации КАК КодСинхронизации,
	               |	НЕОПРЕДЕЛЕНО КАК ПланДействийТриггерногоСобытия,
	               |	НЕОПРЕДЕЛЕНО КАК ТаблицаНекондиционныхДействий,
	               |	НЕОПРЕДЕЛЕНО КАК ПараметрыШаблона,
	               |	НЕОПРЕДЕЛЕНО КАК МассивНеобработанныхКонтрагентов
	               |ИЗ
	               |	ТаблицаТриггеровИКонтрагентов КАК ТаблицаТриггеров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
	               |		ПО (НАЧАЛОПЕРИОДА(ТаблицаТриггеров.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ТаблицаОтработанныхТриггеров.Период, ДЕНЬ))
	               |			И ТаблицаТриггеров.ТриггерноеСобытие = ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	               |			И ТаблицаТриггеров.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
	               |			И ТаблицаТриггеров.СтатусКонтрагента = ТаблицаОтработанныхТриггеров.ОбъектСобытия
	               |ГДЕ
	               |	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
	               |	И ТаблицаТриггеров.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	               |	И ТаблицаТриггеров.Активно = ИСТИНА
	               |	И ТаблицаТриггеров.Использование = ИСТИНА
	               |	И ТаблицаТриггеров.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	               |	И ТаблицаТриггеров.Удалено = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаТриггеров.ТриггерноеСобытие,
	               |	ТаблицаТриггеров.Контрагент,
	               |	ТаблицаТриггеров.Период,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.УсловиеСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПараметрСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.МоментСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытияВид,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПериодСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ВремяСобытия,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СтруктурнаяЕдиница,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СегментКонтрагентов,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СегментУслуг,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ВидСделки,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ВидЛицевогоСчета,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ВидБонусногоСчета,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПереходСЭтапа,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПереходНаЭтап,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ТипПолиса,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СтатусПациентаПриема,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.РезультатПриема,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.СтатусЗаписи,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ИсточникЗаписи,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.ПричинаОтмены,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.Наименование,
	               |	ТаблицаТриггеров.ТриггерноеСобытие.КодСинхронизации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЖурналРегистрацииТриггерныхСобытий.Период КАК Период,
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
	               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия,
	               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ЖурналРегистрацииТриггерныхСобытий.Описание КАК Описание
	               |ПОМЕСТИТЬ ЖурналЗапланированнойРегистрации
	               |ИЗ
	               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
	               |ГДЕ
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие В
	               |			(ВЫБРАТЬ
	               |				ТаблицаТриггеров.ТриггерноеСобытие
	               |			ИЗ
	               |				ТаблицаТриггеров
	               |			СГРУППИРОВАТЬ ПО
	               |				ТаблицаТриггеров.ТриггерноеСобытие)
	               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент В
	               |			(ВЫБРАТЬ
	               |				ТаблицаТриггеровИКонтрагентов.Контрагент
	               |			ИЗ
	               |				ТаблицаТриггеровИКонтрагентов
	               |			ГДЕ
	               |				ТаблицаТриггеровИКонтрагентов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |	И ЖурналРегистрацииТриггерныхСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЖурналРегистрацииТриггерныхСобытий.Период,
	               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие,
	               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
	               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия,
	               |	ЖурналРегистрацииТриггерныхСобытий.ИдентификаторДействия,
	               |	ЖурналРегистрацииТриггерныхСобытий.Описание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТриггеровИКонтрагентов.Период КАК Дата,
	               |	ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаТриггеровИКонтрагентов.Контрагент КАК Контрагент,
	               |	ТаблицаТриггеровИКонтрагентов.СтатусКонтрагента КАК ОбъектСобытия,
	               |	ТаблицаТриггеровИКонтрагентов.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ВЫБОР
	               |		КОГДА ТаблицаТриггеровИКонтрагентов.Активно = ИСТИНА
	               |				И ТаблицаТриггеровИКонтрагентов.Использование = ИСТИНА
	               |				И ТаблицаТриггеровИКонтрагентов.ВидДействия <> ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	               |				И ТаблицаТриггеровИКонтрагентов.Удалено = ЛОЖЬ
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ДействиеАктуально,
	               |	ТаблицаТриггеровИКонтрагентов.Описание КАК Описание,
	               |	ВЫБОР
	               |		КОГДА ТаблицаТриггеровИКонтрагентов.Активно = ЛОЖЬ
	               |			ТОГДА &ПользовательДеактивировалТриггер
	               |		КОГДА ТаблицаТриггеровИКонтрагентов.Использование = ЛОЖЬ
	               |			ТОГДА &ПользовательДеактивировалДействие
	               |		КОГДА ТаблицаТриггеровИКонтрагентов.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПустаяСсылка)
	               |			ТОГДА &ПользовательНеУказалВидДействия
	               |		КОГДА ТаблицаТриггеровИКонтрагентов.Удалено = ИСТИНА
	               |			ТОГДА &ПользовательУдалилДействие
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Сообщение
	               |ПОМЕСТИТЬ ТаблицаПланируемыхДействийТриггера
	               |ИЗ
	               |	ТаблицаТриггеровИКонтрагентов КАК ТаблицаТриггеровИКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
	               |		ПО (НАЧАЛОПЕРИОДА(ТаблицаТриггеровИКонтрагентов.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ТаблицаОтработанныхТриггеров.Период, ДЕНЬ))
	               |			И ТаблицаТриггеровИКонтрагентов.ТриггерноеСобытие = ТаблицаОтработанныхТриггеров.ТриггерноеСобытие
	               |			И ТаблицаТриггеровИКонтрагентов.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
	               |			И ТаблицаТриггеровИКонтрагентов.ИдентификаторДействия = ТаблицаОтработанныхТриггеров.ИдентификаторДействия
	               |			И ТаблицаТриггеровИКонтрагентов.СтатусКонтрагента = ТаблицаОтработанныхТриггеров.ОбъектСобытия
	               |			И (ТаблицаОтработанныхТриггеров.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено))
	               |ГДЕ
	               |	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
	               |	И ТаблицаТриггеровИКонтрагентов.ПланируемыйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	               |				ИЛИ НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	               |		КОГДА ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Зарегистрировано)
	               |	КОНЕЦ КАК СтатусКДействию,
	               |	ВЫБОР
	               |		КОГДА НЕ ЖурналЗапланированнойРегистрации.ТриггерноеСобытие ЕСТЬ NULL
	               |			ТОГДА ЖурналЗапланированнойРегистрации.ТриггерноеСобытие
	               |		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие
	               |	КОНЕЦ КАК ТриггерноеСобытие,
	               |	ВЫБОР
	               |		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	               |			ТОГДА ЖурналЗапланированнойРегистрации.Контрагент
	               |		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	               |			ТОГДА ЖурналЗапланированнойРегистрации.ОбъектСобытия
	               |		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ОбъектСобытия
	               |	КОНЕЦ КАК ОбъектСобытия,
	               |	ВЫБОР
	               |		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	               |			ТОГДА ЖурналЗапланированнойРегистрации.Период
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ПериодОтбора,
	               |	ВЫБОР
	               |		КОГДА НЕ ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	               |			ТОГДА ЖурналЗапланированнойРегистрации.ИдентификаторДействия
	               |		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.ИдентификаторДействия
	               |	КОНЕЦ КАК ИдентификаторДействия,
	               |	ВЫБОР
	               |		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	               |			ТОГДА ЖурналЗапланированнойРегистрации.Описание
	               |		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Описание
	               |	КОНЕЦ КАК Описание,
	               |	ВЫБОР
	               |		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	               |				ИЛИ НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Дата
	               |	КОНЕЦ КАК ДатаОтсчета,
	               |	ВЫБОР
	               |		КОГДА ТаблицаПланируемыхДействийТриггера.Контрагент ЕСТЬ NULL
	               |			ТОГДА &НеАктуально
	               |		КОГДА НЕ ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ)
	               |			ТОГДА ТаблицаПланируемыхДействийТриггера.Сообщение
	               |		ИНАЧЕ ТаблицаПланируемыхДействийТриггера.Сообщение
	               |	КОНЕЦ КАК Сообщение
	               |ПОМЕСТИТЬ ТаблицаПланируемыхТриггеровИДатРегистрации
	               |ИЗ
	               |	ТаблицаПланируемыхДействийТриггера КАК ТаблицаПланируемыхДействийТриггера
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ЖурналЗапланированнойРегистрации КАК ЖурналЗапланированнойРегистрации
	               |		ПО ТаблицаПланируемыхДействийТриггера.ТриггерноеСобытие = ЖурналЗапланированнойРегистрации.ТриггерноеСобытие
	               |			И ТаблицаПланируемыхДействийТриггера.Контрагент = ЖурналЗапланированнойРегистрации.Контрагент
	               |			И ТаблицаПланируемыхДействийТриггера.ИдентификаторДействия = ЖурналЗапланированнойРегистрации.ИдентификаторДействия
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТаблицаПланируемыхДействийТриггера.ДействиеАктуально, ЛОЖЬ) = ЛОЖЬ
	               |					И ЖурналЗапланированнойРегистрации.Контрагент ЕСТЬ NULL
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.ПериодОтбора КАК ПериодОтбора,
	               |	ВЫБОР
	               |		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Отклонено)
	               |			ТОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Час)
	               |					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, ЧАС, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	               |								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |									ТОГДА -1
	               |								ИНАЧЕ 1
	               |							КОНЕЦ)
	               |				КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытияВид = ЗНАЧЕНИЕ(Перечисление.Периодичность.Минута)
	               |					ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПланируемыхТриггеровИДатРегистрации.ДатаОтсчета, МИНУТА, ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.ПериодСобытия * ВЫБОР
	               |								КОГДА ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие.МоментСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия)
	               |									ТОГДА -1
	               |								ИНАЧЕ 1
	               |							КОНЕЦ)
	               |				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ДатаЗапланированная,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.СтатусКДействию КАК СтатусКДействию,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.ТриггерноеСобытие КАК ТриггерноеСобытие,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.Контрагент КАК Контрагент,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.ОбъектСобытия КАК ОбъектСобытия,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.ИдентификаторДействия КАК ИдентификаторДействия,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.Описание КАК Описание,
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации.Сообщение КАК Сообщение,
	               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке
	               |ИЗ
	               |	ТаблицаПланируемыхТриггеровИДатРегистрации КАК ТаблицаПланируемыхТриггеровИДатРегистрации";
		
КонецПроцедуры

// Функция - Получить дату триггера
//
// Параметры:
//  ДанныеТриггера	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДатуТриггера(ДанныеТриггера, ПериодПланирования = Неопределено)
	
	Сутки = 86400;
	ТекущаяДатаВыполнения = ТекущаяДатаСеанса();
	
	Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентНепосещениеКлиники Тогда 
		ТекущаяДатаВыполнения = ТекущаяДатаВыполнения - (ДанныеТриггера.ПараметрСобытия * Сутки + Сутки);
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентПотенциальныйНеСталНовым Тогда	
		ТекущаяДатаВыполнения = ТекущаяДатаВыполнения - (ДанныеТриггера.ПараметрСобытия * Сутки);
	КонецЕсли;
	
	Если ДанныеТриггера.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия ИЛИ
		ДанныеТриггера.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия Тогда
		
		Если ДанныеТриггера.ПериодСобытияВид = Перечисления.Периодичность.День Тогда 
			ПериодПланирования = (ДанныеТриггера.ПериодСобытия * 24 * 60 * 60);
		ИначеЕсли ДанныеТриггера.ПериодСобытияВид = Перечисления.Периодичность.Час Тогда
			ПериодПланирования = (ДанныеТриггера.ПериодСобытия * 60 * 60);
		ИначеЕсли ДанныеТриггера.ПериодСобытияВид = Перечисления.Периодичность.Минута Тогда
			ПериодПланирования = (ДанныеТриггера.ПериодСобытия * 60);
		Иначе 
			ПериодПланирования = 0;
		КонецЕсли;
		
		Если ДанныеТриггера.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия Тогда 
			Возврат ТекущаяДатаВыполнения + ПериодПланирования;
		ИначеЕсли ДанныеТриггера.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия Тогда	
			Возврат ТекущаяДатаВыполнения - ПериодПланирования;
		КонецЕсли;
	ИначеЕсли ДанныеТриггера.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия 
			И (ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе ИЛИ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаявкаНеОбработана) Тогда
		Если ДанныеТриггера.ПериодСобытияВид = Перечисления.Периодичность.День Тогда
			ПериодПланирования = (ДанныеТриггера.ПериодСобытия * 24 * 60);
		ИначеЕсли ДанныеТриггера.ПериодСобытияВид = Перечисления.Периодичность.Час Тогда
			ПериодПланирования = (ДанныеТриггера.ПериодСобытия * 60);
		ИначеЕсли ДанныеТриггера.ПериодСобытияВид = Перечисления.Периодичность.Минута Тогда
			ПериодПланирования = ДанныеТриггера.ПериодСобытия;
		Иначе 
			ПериодПланирования = 0;
		КонецЕсли;
		ТекущаяДатаВыполнения = ТекущаяДатаВыполнения - (ПериодПланирования * 60);
		Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
			Возврат ?(ТекущаяДатаВыполнения > НачалоДня(ТекущаяДатаСеанса()), НачалоДня(ТекущаяДатаСеанса()), ТекущаяДатаВыполнения);
		Иначе 
			Возврат ?(ТекущаяДатаВыполнения > НачалоДня(ТекущаяДатаСеанса()) - Сутки, НачалоДня(ТекущаяДатаСеанса()) - Сутки, ТекущаяДатаВыполнения);
		КонецЕсли;	
	Иначе
		ПериодПланирования = 0;
		Возврат ТекущаяДатаВыполнения;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить структуру контактной информации
//
// Параметры: ДанныеТриггера
//  ТаблицаДанныхОбъекта		 - 	 - 
//  ИнформироватьПоSMS	 - 	 - 
//  ИнформироватьПоEMail - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСтруктуруКонтактнойИнформации(ДанныеТриггера, ТаблицаДанныхОбъекта, СтруктураКонтактнойИнформации)
	                                              // Проверка триггеров 9034
												  
	ОтправитьСообщение 				= ЗначениеЗаполнено(ДанныеТриггера.ПланДействийТриггерногоСобытия)
										И НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.НайтиСтроки(Новый Структура("ВидДействия", Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение)).Количество() = 0;
		
	ИнформироватьПоEMail 			= НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо	, "ВидДействия") = Неопределено;
	АктивироватьЧатБота 			= НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота	, "ВидДействия") = Неопределено;	
	ИнформироватьКонтрагентаСобытия = НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(Перечисления.ВидыАдресатов.КонтрагентСобытия						, "ВидАдресата") = Неопределено;
	ИнформироватьВрачаПриема 		= НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(Перечисления.ВидыАдресатов.ВрачПриема								, "ВидАдресата") = Неопределено;
	ИнформироватьСотрудника		 	= НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(Перечисления.ВидыАдресатов.Сотрудник								, "ВидАдресата") = Неопределено;
	ИнформироватьКуратора		 	= НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(Перечисления.ВидыАдресатов.Куратор									, "ВидАдресата") = Неопределено;
	
	Если НЕ ОтправитьСообщение И НЕ ИнформироватьПоEMail И НЕ АктивироватьЧатБота Тогда 
		Возврат СтруктураКонтактнойИнформации;
	КонецЕсли;	
	
	МВТ 	= Новый МенеджерВременныхТаблиц;
	Запрос 	= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ТаблицаДанныхРегистрации"			, ТаблицаДанныхОбъекта.Скопировать(, "Контрагент, СтруктурнаяЕдиница"));
	Запрос.УстановитьПараметр("ТаблицаЗначенийПланДействий"			, ДанныеТриггера.ПланДействийТриггерногоСобытия.Скопировать(Новый Структура("ВидДействия", Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение), "ИдентификаторДействия, ВидАдресата, ВидАдресатаРезервный, Адресат"));
	Запрос.УстановитьПараметр("ТаблицаЗначенийПланДействийЧатБот"	, ДанныеТриггера.ПланДействийТриггерногоСобытия.Скопировать(Новый Структура("ВидДействия", Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота), "ИдентификаторДействия, ВидАдресата, ВидАдресатаРезервный, Адресат"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ ТаблицаЗначенийПланДействий.*
	|ПОМЕСТИТЬ ПланДействий
	|ИЗ &ТаблицаЗначенийПланДействий КАК ТаблицаЗначенийПланДействий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ТаблицаЗначенийПланДействийЧатБот.*
	|ПОМЕСТИТЬ ПланДействийЧатБот
	|ИЗ &ТаблицаЗначенийПланДействийЧатБот КАК ТаблицаЗначенийПланДействийЧатБот	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ТаблицаДанныхРегистрации.*
	|ПОМЕСТИТЬ ДанныеРегистрации
	|ИЗ &ТаблицаДанныхРегистрации КАК ТаблицаДанныхРегистрации";
	
	Запрос.Выполнить();
		
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
		
	Запрос.УстановитьПараметр("Триггер"							, ДанныеТриггера.ТриггерноеСобытие);
	// Запрос.УстановитьПараметр("ТекущаяСтруктурнаяЕдиница"		, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ОтправитьСообщение"				, ОтправитьСообщение);	
	Запрос.УстановитьПараметр("ИнформироватьПоEMail"			, ИнформироватьПоEMail);
	Запрос.УстановитьПараметр("АктивироватьЧатБота"				, АктивироватьЧатБота);		
	Запрос.УстановитьПараметр("ИнформироватьКонтрагентаСобытия"	, ИнформироватьКонтрагентаСобытия);
	Запрос.УстановитьПараметр("ИнформироватьСотрудника"			, ИнформироватьСотрудника);		
	Запрос.УстановитьПараметр("ИнформироватьВрачаПриема"		, ИнформироватьВрачаПриема);		
	Запрос.УстановитьПараметр("ИнформироватьКуратора"			, ИнформироватьКуратора);		
	
	Если ИнформироватьВрачаПриема ИЛИ ИнформироватьСотрудника Тогда 
		Запрос.УстановитьПараметр("МассивВрачей"				, ПолучитьМассивВрачейДляИнформирования(ДанныеТриггера, ТаблицаДанныхОбъекта, ИнформироватьВрачаПриема, ИнформироватьСотрудника));		
	Иначе 
		Запрос.УстановитьПараметр("МассивВрачей"				, Новый Массив);		
	КонецЕсли;
	
#Область __________________ЗАПРОС_КОНТАКТНАЯ_ИНФОРМАЦИЯ_____________________
	
	Запрос.Текст 					= 
	"ВЫБРАТЬ
	|	ПланДействий.ВидАдресата КАК ВидАдресата,
	|	ПланДействий.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
	|	ПланДействий.Адресат КАК Адресат,
	|	ТриггерныеСобытияНастройкиКаналовУведомлений.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТриггерныеСобытияНастройкиКаналовУведомлений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТриггерныеСобытияНастройкиКаналовУведомлений.ОтправкаPush КАК ОтправкаPush,
	|	ТриггерныеСобытияНастройкиКаналовУведомлений.ОтправкаPushWallet КАК ОтправкаPushWallet,
	|	ТриггерныеСобытияНастройкиКаналовУведомлений.ОтправкаMessenger КАК ОтправкаMessenger,
	|	ТриггерныеСобытияНастройкиКаналовУведомлений.ОтправкаSMS КАК ОтправкаSMS,
	|	ТриггерныеСобытияНастройкиКаналовУведомлений.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
	|	ВЫБОР
	|		КОГДА ТриггерныеСобытияНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS = ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)
	|				ИЛИ ТриггерныеСобытияНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS = НЕОПРЕДЕЛЕНО
	|			ТОГДА СервисSMSРассылкиПоУмолчанию.Значение
	|		ИНАЧЕ ТриггерныеСобытияНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS
	|	КОНЕЦ КАК АккаунтСервисаРассылкиSMS,
	|	ТриггерныеСобытияНастройкиКаналовУведомлений.КаналСистемыСообщений КАК КаналСистемыСообщений
	|ПОМЕСТИТЬ ТаблицаНастроекКаналовУведомлений
	|ИЗ
	|	Справочник.ТриггерныеСобытия.НастройкиКаналовУведомлений КАК ТриггерныеСобытияНастройкиКаналовУведомлений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланДействий КАК ПланДействий
	|		ПО ТриггерныеСобытияНастройкиКаналовУведомлений.ИдентификаторДействия = ПланДействий.ИдентификаторДействия,
	|	Константа.СервисSMSРассылкиПоУмолчанию КАК СервисSMSРассылкиПоУмолчанию
	|ГДЕ
	|	&ОтправитьСообщение
	|	И ТриггерныеСобытияНастройкиКаналовУведомлений.Ссылка = &Триггер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ИЛИ ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаДанныхДляРегистрации.Контрагент.СтруктурнаяЕдиница
	|		ИНАЧЕ ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаДанныхДляРегистрации.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаДанныхДляРегистрации
	|ИЗ
	|	ДанныеРегистрации КАК ТаблицаДанныхДляРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВнешниеСистемы.Ссылка) КАК ВнешняяСистема,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ТаблицаВнешнихСистем
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	&ОтправитьСообщение
	|	И ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВнешниеСистемы.Используется = ИСТИНА
	|	И ВнешниеСистемы.ТипВнешнейСистемы В (ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Chat2Desk))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВнешниеСистемы.ТипВнешнейСистемы,
	|	ВнешниеСистемы.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВнешниеСистемы.Ссылка) КАК ВнешняяСистема,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПланДействийЧатБот.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ПланДействийЧатБот.ВидАдресата КАК ВидАдресата,
	|	ПланДействийЧатБот.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
	|	ПланДействийЧатБот.Адресат КАК Адресат
	|ПОМЕСТИТЬ ТаблицаВнешнихСистемЧатБота
	|ИЗ
	|	ПланДействийЧатБот КАК ПланДействийЧатБот
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&АктивироватьЧатБота
	|	И ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВнешниеСистемы.Используется = ИСТИНА
	|	И ВнешниеСистемы.ТипВнешнейСистемы В (ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Telegram))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВнешниеСистемы.ТипВнешнейСистемы,
	|	ВнешниеСистемы.СтруктурнаяЕдиница,
	|	ПланДействийЧатБот.ИдентификаторДействия,
	|	ПланДействийЧатБот.ВидАдресата,
	|	ПланДействийЧатБот.ВидАдресатаРезервный,
	|	ПланДействийЧатБот.Адресат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНастроекКаналовУведомлений.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДанныхДляРегистрации.Контрагент КАК Контрагент,
	|	ТаблицаНастроекКаналовУведомлений.ВидАдресата КАК ВидАдресата,
	|	ТаблицаНастроекКаналовУведомлений.ВидАдресатаРезервный КАК ВидАдресатаРезервный,
	|	ТаблицаНастроекКаналовУведомлений.Адресат КАК Адресат,
	|	ВЫБОР
	|		КОГДА ТаблицаНастроекКаналовУведомлений.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаНастроекКаналовУведомлений.ОтправкаPush
	|	КОНЕЦ КАК ОтправкаPush,
	|	ВЫБОР
	|		КОГДА ТаблицаНастроекКаналовУведомлений.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаНастроекКаналовУведомлений.ОтправкаPushWallet
	|	КОНЕЦ КАК ОтправкаPushWallet,
	|	ВЫБОР
	|		КОГДА ТаблицаНастроекКаналовУведомлений.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаНастроекКаналовУведомлений.ОтправкаMessenger
	|	КОНЕЦ КАК ОтправкаMessenger,
	|	ВЫБОР
	|		КОГДА ТаблицаНастроекКаналовУведомлений.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаНастроекКаналовУведомлений.ОтправкаSMS
	|	КОНЕЦ КАК ОтправкаSMS,
	|	ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка) КАК АккаунтВнешнейСистемыPush,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемPushWallet.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемPushWallet.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ КАК АккаунтВнешнейСистемыPushWallet,
	|	ЕСТЬNULL(ТаблицаНастроекКаналовУведомлений.АккаунтВнешнейСистемы, ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)) КАК АккаунтВнешнейСистемы,
	|	ЕСТЬNULL(ТаблицаНастроекКаналовУведомлений.АккаунтВнешнейСистемы.ТипВнешнейСистемы, ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.ПустаяСсылка)) КАК ТипВнешнейСистемы,
	|	ЕСТЬNULL(ТаблицаНастроекКаналовУведомлений.АккаунтСервисаРассылкиSMS, ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)) КАК АккаунтСервисаРассылкиSMS,
	|	ЕСТЬNULL(ТаблицаНастроекКаналовУведомлений.КаналСистемыСообщений, """") КАК КаналСистемыСообщений
	|ПОМЕСТИТЬ ТаблицаДанныхНастроекКаналовОтправки
	|ИЗ
	|	ТаблицаДанныхДляРегистрации КАК ТаблицаДанныхДляРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНастроекКаналовУведомлений КАК ТаблицаНастроекКаналовУведомлений
	|		ПО ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница = ТаблицаНастроекКаналовУведомлений.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистемPushWallet
	|		ПО (ТаблицаВнешнихСистемPushWallet.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet))
	|			И (ТаблицаНастроекКаналовУведомлений.СтруктурнаяЕдиница = ТаблицаВнешнихСистемPushWallet.СтруктурнаяЕдиница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ
	|		ПО (ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet))
	|			И (ТаблицаВнешнихСистемPushWalletПоЛюбойСЕ.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|ГДЕ
	|	&ОтправитьСообщение = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБота.ИдентификаторДействия, ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ИдентификаторДействия),
	|	ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница,
	|	ТаблицаДанныхДляРегистрации.Контрагент,
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБота.ВидАдресата, ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВидАдресата),
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБота.ВидАдресатаРезервный, ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВидАдресатаРезервный),
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБота.Адресат, ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.Адресат),
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ТаблицаВнешнихСистемЧатБота.СтруктурнаяЕдиница ЕСТЬ NULL
	|				И ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБота.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБота.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБота.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБота.ТипВнешнейСистемы
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ТипВнешнейСистемы
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка),
	|	""""
	|ИЗ
	|	ТаблицаДанныхДляРегистрации КАК ТаблицаДанныхДляРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистемЧатБота КАК ТаблицаВнешнихСистемЧатБота
	|		ПО ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница = ТаблицаВнешнихСистемЧатБота.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистемЧатБота КАК ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ
	|		ПО (ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|ГДЕ
	|	&АктивироватьЧатБота = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБота.ВидАдресата, ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВидАдресата),
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБота.ВидАдресатаРезервный, ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВидАдресатаРезервный),
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБота.Адресат, ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.Адресат),
	|	ТаблицаДанныхДляРегистрации.Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаВнешнихСистемЧатБота.СтруктурнаяЕдиница ЕСТЬ NULL
	|				И ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБота.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБота.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБота.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБота.ТипВнешнейСистемы
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ТипВнешнейСистемы
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница,
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБота.ИдентификаторДействия, ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ИдентификаторДействия)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ИдентификаторДействия, ТаблицаВнешнихСистемЧатБота.ИдентификаторДействия),
	|	ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница,
	|	ТаблицаДанныхДляРегистрации.Контрагент,
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВидАдресата, ТаблицаВнешнихСистемЧатБота.ВидАдресата),
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВидАдресатаРезервный, ТаблицаВнешнихСистемЧатБота.ВидАдресатаРезервный),
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.Адресат, ТаблицаВнешнихСистемЧатБота.Адресат),
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ТаблицаВнешнихСистемЧатБота.СтруктурнаяЕдиница ЕСТЬ NULL
	|				И ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБота.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБота.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ТипВнешнейСистемы
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБота.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБота.ТипВнешнейСистемы
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка),
	|	""""
	|ИЗ
	|	ТаблицаДанныхДляРегистрации КАК ТаблицаДанныхДляРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистемЧатБота КАК ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ
	|		ПО (ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистемЧатБота КАК ТаблицаВнешнихСистемЧатБота
	|		ПО ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница = ТаблицаВнешнихСистемЧатБота.СтруктурнаяЕдиница
	|ГДЕ
	|	&АктивироватьЧатБота = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВидАдресата, ТаблицаВнешнихСистемЧатБота.ВидАдресата),
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВидАдресатаРезервный, ТаблицаВнешнихСистемЧатБота.ВидАдресатаРезервный),
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.Адресат, ТаблицаВнешнихСистемЧатБота.Адресат),
	|	ТаблицаДанныхДляРегистрации.Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаВнешнихСистемЧатБота.СтруктурнаяЕдиница ЕСТЬ NULL
	|				И ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.СтруктурнаяЕдиница ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБота.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБота.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ТипВнешнейСистемы
	|		КОГДА НЕ ТаблицаВнешнихСистемЧатБота.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемЧатБота.ТипВнешнейСистемы
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДанныхДляРегистрации.СтруктурнаяЕдиница,
	|	ЕСТЬNULL(ТаблицаВнешнихСистемЧатБотаПоЛюбойСЕ.ИдентификаторДействия, ТаблицаВнешнихСистемЧатБота.ИдентификаторДействия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Карты.ВладелецКарты КАК Справочник.Контрагенты) КАК ВладелецКарты
	|ПОМЕСТИТЬ ВладельцыКартWallet
	|ИЗ
	|	Справочник.Карты КАК Карты
	|ГДЕ
	|	Карты.ПометкаУдаления = ЛОЖЬ
	|	И Карты.Заблокирована = ЛОЖЬ
	|	И Карты.ТипКода = ЗНАЧЕНИЕ(Перечисление.ВидыКарт.Wallet)
	|	И Карты.КоличествоУстановок > 0
	|	И Карты.ВладелецКарты В
	|			(ВЫБРАТЬ
	|				ТаблицаДанныхДляРегистрации.Контрагент
	|			ИЗ
	|				ТаблицаДанныхДляРегистрации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент,
	|	КонтрагентыКонтактнаяИнформация.Вид КАК ВидКИ,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	ВЫБОР
	|		КОГДА КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильноеПриложениеКлиента)
	|			ТОГДА КонтрагентыКонтактнаяИнформация.НомерТелефона
	|		ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(20))
	|	КОНЕЦ КАК НомерТелефонаPush,
	|	НЕОПРЕДЕЛЕНО КАК АккаунтВнешнейСистемыPush,
	|	ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(1024)) КАК Представление,
	|	ВЫБОР
	|		КОГДА ВладельцыКартWallet.ВладелецКарты ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьКартаWallet,
	|	КонтрагентыКонтактнаяИнформация.НеУчаствоватьВРассылке КАК РассылкаЗапрещена,
	|	КонтрагентыКонтактнаяИнформация.НеУчаствоватьВРассылке КАК РассылкаЗапрещенаPush
	|ПОМЕСТИТЬ ТаблицаКлиентовСКонтактнымиДаннымиДляОтправкиСообщений
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВладельцыКартWallet КАК ВладельцыКартWallet
	|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = ВладельцыКартWallet.ВладелецКарты
	|ГДЕ
	|	(&ОтправитьСообщение = ИСТИНА
	|				И &ИнформироватьКонтрагентаСобытия = ИСТИНА
	|			ИЛИ &АктивироватьЧатБота = ИСТИНА)
	|	И КонтрагентыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаДанныхДляРегистрации.Контрагент
	|			ИЗ
	|				ТаблицаДанныхДляРегистрации)
	|	И КонтрагентыКонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильноеПриложениеКлиента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента))
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильноеПриложениеКлиента)
	|			ТОГДА КонтрагентыКонтактнаяИнформация.НомерТелефона
	|		ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(20))
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(1024)),
	|	КонтрагентыКонтактнаяИнформация.НеУчаствоватьВРассылке,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона,
	|	ВЫБОР
	|		КОГДА ВладельцыКартWallet.ВладелецКарты ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	КонтрагентыКонтактнаяИнформация.Ссылка,
	|	КонтрагентыКонтактнаяИнформация.Вид,
	|	КонтрагентыКонтактнаяИнформация.НеУчаствоватьВРассылке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхНастроекКаналовОтправки.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТаблицаДанныхНастроекКаналовОтправки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДанныхНастроекКаналовОтправки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА КонтактныеДанныеДляОтправкиPush.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаPush
	|	КОНЕЦ КАК ОтправкаPush,
	|	ВЫБОР
	|		КОГДА КонтактныеДанныеДляОтправкиPushWallet.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаPushWallet
	|	КОНЕЦ КАК ОтправкаPushWallet,
	|	ВЫБОР
	|		КОГДА КонтактныеДанныеДляОтправкиMessengerSMS.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаMessenger
	|	КОНЕЦ КАК ОтправкаMessenger,
	|	ВЫБОР
	|		КОГДА КонтактныеДанныеДляОтправкиMessengerSMS.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаSMS
	|	КОНЕЦ КАК ОтправкаSMS,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемыPush КАК АккаунтВнешнейСистемыPush,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемыPushWallet КАК АккаунтВнешнейСистемыPushWallet,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтСервисаРассылкиSMS КАК АккаунтСервисаРассылкиSMS,
	|	ТаблицаДанныхНастроекКаналовОтправки.КаналСистемыСообщений КАК КаналСистемыСообщений,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPush.НомерТелефона, """") КАК НомерТелефонаPush,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPush.Представление, """") КАК ПредставлениеPush,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPush.РассылкаЗапрещенаPush, ЛОЖЬ) КАК РассылкаЗапрещенаPush,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPushWallet.НомерТелефона, """") КАК НомерТелефонаPushWallet,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPushWallet.Представление, """") КАК ПредставлениеPushWallet,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPushWallet.РассылкаЗапрещена, ЛОЖЬ) КАК РассылкаЗапрещенаPushWallet,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиMessengerSMS.НомерТелефона, """") КАК НомерТелефонаMessengerSMS,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиMessengerSMS.Представление, """") КАК ПредставлениеMessengerSMS,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиMessengerSMS.РассылкаЗапрещена, ЛОЖЬ) КАК РассылкаЗапрещенаMessengerSMS
	|ИЗ
	|	ТаблицаДанныхНастроекКаналовОтправки КАК ТаблицаДанныхНастроекКаналовОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКлиентовСКонтактнымиДаннымиДляОтправкиСообщений КАК КонтактныеДанныеДляОтправкиPush
	|		ПО ТаблицаДанныхНастроекКаналовОтправки.Контрагент = КонтактныеДанныеДляОтправкиPush.Контрагент
	|			И (КонтактныеДанныеДляОтправкиPush.НомерТелефонаPush <> """")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКлиентовСКонтактнымиДаннымиДляОтправкиСообщений КАК КонтактныеДанныеДляОтправкиPushWallet
	|		ПО ТаблицаДанныхНастроекКаналовОтправки.Контрагент = КонтактныеДанныеДляОтправкиPushWallet.Контрагент
	|			И (КонтактныеДанныеДляОтправкиPushWallet.ЕстьКартаWallet)
	|			И (ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемыPushWallet <> ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКлиентовСКонтактнымиДаннымиДляОтправкиСообщений КАК КонтактныеДанныеДляОтправкиMessengerSMS
	|		ПО ТаблицаДанныхНастроекКаналовОтправки.Контрагент = КонтактныеДанныеДляОтправкиMessengerSMS.Контрагент
	|			И (КонтактныеДанныеДляОтправкиMessengerSMS.ВидКИ = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ПО ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемы = КонтактыМессенджеров.ВнешняяСистема
	|			И (ТаблицаДанныхНастроекКаналовОтправки.Контрагент = (ВЫРАЗИТЬ(КонтактыМессенджеров.ОбъектИдентификации КАК Справочник.Контрагенты)))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТаблицаДанныхНастроекКаналовОтправки.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Telegram)
	|				ТОГДА НЕ КонтактыМессенджеров.ОбъектИдентификации ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхНастроекКаналовОтправки.Контрагент,
	|	ВЫБОР
	|		КОГДА КонтактныеДанныеДляОтправкиPush.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаPush
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КонтактныеДанныеДляОтправкиPushWallet.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаPushWallet
	|	КОНЕЦ,
	|	ТаблицаДанныхНастроекКаналовОтправки.ИдентификаторДействия,
	|	ТаблицаДанныхНастроекКаналовОтправки.СтруктурнаяЕдиница,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемыPush,
	|	ВЫБОР
	|		КОГДА КонтактныеДанныеДляОтправкиMessengerSMS.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаMessenger
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КонтактныеДанныеДляОтправкиMessengerSMS.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаSMS
	|	КОНЕЦ,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиMessengerSMS.РассылкаЗапрещена, ЛОЖЬ),
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиMessengerSMS.Представление, """"),
	|	ТаблицаДанныхНастроекКаналовОтправки.КаналСистемыСообщений,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPush.Представление, """"),
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемы,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPush.РассылкаЗапрещенаPush, ЛОЖЬ),
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемыPushWallet,
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPushWallet.Представление, """"),
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиMessengerSMS.НомерТелефона, """"),
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPush.НомерТелефона, """"),
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPushWallet.РассылкаЗапрещена, ЛОЖЬ),
	|	ЕСТЬNULL(КонтактныеДанныеДляОтправкиPushWallet.НомерТелефона, """"),
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтСервисаРассылкиSMS
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхНастроекКаналовОтправки.ИдентификаторДействия,
	|	ТаблицаДанныхНастроекКаналовОтправки.СтруктурнаяЕдиница,
	|	ТаблицаДанныхНастроекКаналовОтправки.Контрагент,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ТаблицаДанныхНастроекКаналовОтправки.ОтправкаMessenger,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемы,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтСервисаРассылкиSMS,
	|	ТаблицаДанныхНастроекКаналовОтправки.КаналСистемыСообщений,
	|	"""",
	|	"""",
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	КонтактыМессенджеров.НеУчаствоватьВРассылке
	|ИЗ
	|	ТаблицаДанныхНастроекКаналовОтправки КАК ТаблицаДанныхНастроекКаналовОтправки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|		ПО ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемы = КонтактыМессенджеров.ВнешняяСистема
	|			И (ТаблицаДанныхНастроекКаналовОтправки.Контрагент = (ВЫРАЗИТЬ(КонтактыМессенджеров.ОбъектИдентификации КАК Справочник.Контрагенты)))
	|			И (КонтактыМессенджеров.НомерМессенджера = """")
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхНастроекКаналовОтправки.ОтправкаMessenger,
	|	ТаблицаДанныхНастроекКаналовОтправки.Контрагент,
	|	ТаблицаДанныхНастроекКаналовОтправки.СтруктурнаяЕдиница,
	|	ТаблицаДанныхНастроекКаналовОтправки.ИдентификаторДействия,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемы,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтСервисаРассылкиSMS,
	|	КонтактыМессенджеров.НеУчаствоватьВРассылке,
	|	ТаблицаДанныхНастроекКаналовОтправки.КаналСистемыСообщений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	КонтрагентыКонтактнаяИнформация.НеУчаствоватьВРассылке КАК НеУчаствоватьВРассылке
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	&ИнформироватьКонтрагентаСобытия = ИСТИНА
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)
	|	И КонтрагентыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаДанныхДляРегистрации.Контрагент
	|			ИЗ
	|				ТаблицаДанныхДляРегистрации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.Куратор КАК Менеджер
	|ПОМЕСТИТЬ ТаблицаОсновныхМенеджеров
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	&ИнформироватьКуратора = ИСТИНА
	|	И Контрагенты.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаДанныхДляРегистрации.Контрагент
	|			ИЗ
	|				ТаблицаДанныхДляРегистрации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОсновныхМенеджеров.Менеджер КАК Сотрудник
	|ПОМЕСТИТЬ ТаблицаСотрудников
	|ИЗ
	|	ТаблицаОсновныхМенеджеров КАК ТаблицаОсновныхМенеджеров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивВрачей)
	|	И (&ИнформироватьВрачаПриема
	|			ИЛИ &ИнформироватьСотрудника)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиКонтактнаяИнформация.Ссылка КАК Сотрудник,
	|	СотрудникиКонтактнаяИнформация.Вид КАК Вид,
	|	ВЫРАЗИТЬ(СотрудникиКонтактнаяИнформация.Представление КАК СТРОКА(1024)) КАК Представление,
	|	СотрудникиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ПОМЕСТИТЬ ТаблицаКонтактнойИнформацииСотрудников
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	(&ОтправитьСообщение = ИСТИНА
	|			ИЛИ &ИнформироватьПоEMail)
	|	И (&ИнформироватьВрачаПриема
	|			ИЛИ &ИнформироватьСотрудника
	|			ИЛИ &ИнформироватьКуратора)
	|	И СотрудникиКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И СотрудникиКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаСотрудников.Сотрудник
	|			ИЗ
	|				ТаблицаСотрудников
	|			ГДЕ
	|				ТаблицаСотрудников.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
	|	И СотрудникиКонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудника), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailСотрудника))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхНастроекКаналовОтправки.ИдентификаторДействия КАК ИдентификаторДействия,
	|	ТаблицаДанныхНастроекКаналовОтправки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДанныхНастроекКаналовОтправки.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК ОтправкаPush,
	|	ЛОЖЬ КАК ОтправкаPushWallet,
	|	ВЫБОР
	|		КОГДА ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi)
	|			ТОГДА ЕСТЬNULL(СотрудникиКонтактнаяИнформация.НомерТелефона, """") <> """"
	|		ИНАЧЕ ТаблицаДанныхНастроекКаналовОтправки.ОтправкаMessenger
	|	КОНЕЦ КАК ОтправкаMessenger,
	|	ЛОЖЬ КАК ОтправкаSMS,
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
	|	ТаблицаДанныхНастроекКаналовОтправки.КаналСистемыСообщений КАК КаналСистемыСообщений,
	|	НЕОПРЕДЕЛЕНО КАК АккаунтСервисаРассылкиSMS,
	|	ЕСТЬNULL(СотрудникиКонтактнаяИнформация.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
	|	ЕСТЬNULL(СотрудникиКонтактнаяИнформация.НомерТелефона, """") КАК НомерТелефонаMessengerSMS,
	|	ЕСТЬNULL(СотрудникиКонтактнаяИнформация.Представление, """") КАК Представление,
	|	ЛОЖЬ КАК РассылкаЗапрещенаMessengerSMS
	|ИЗ
	|	ТаблицаДанныхНастроекКаналовОтправки КАК ТаблицаДанныхНастроекКаналовОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКонтактнойИнформацииСотрудников КАК СотрудникиКонтактнаяИнформация
	|		ПО (СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудника))
	|			И (ТаблицаДанныхНастроекКаналовОтправки.ОтправкаMessenger)
	|ГДЕ
	|	&ОтправитьСообщение = ИСТИНА
	|	И (&ИнформироватьВрачаПриема
	|			ИЛИ &ИнформироватьСотрудника
	|			ИЛИ &ИнформироватьКуратора)
	|	И ТаблицаДанныхНастроекКаналовОтправки.ОтправкаMessenger
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхНастроекКаналовОтправки.ИдентификаторДействия,
	|	ТаблицаДанныхНастроекКаналовОтправки.СтруктурнаяЕдиница,
	|	ТаблицаДанныхНастроекКаналовОтправки.Контрагент,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СотрудникиКонтактнаяИнформация.НомерТелефона, """") <> """"
	|			ТОГДА ТаблицаДанныхНастроекКаналовОтправки.ОтправкаSMS
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ТаблицаДанныхНастроекКаналовОтправки.АккаунтСервисаРассылкиSMS,
	|	ЕСТЬNULL(СотрудникиКонтактнаяИнформация.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)),
	|	ЕСТЬNULL(СотрудникиКонтактнаяИнформация.НомерТелефона, """"),
	|	ЕСТЬNULL(СотрудникиКонтактнаяИнформация.Представление, """"),
	|	ЛОЖЬ
	|ИЗ
	|	ТаблицаДанныхНастроекКаналовОтправки КАК ТаблицаДанныхНастроекКаналовОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКонтактнойИнформацииСотрудников КАК СотрудникиКонтактнаяИнформация
	|		ПО (СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудника))
	|			И (ТаблицаДанныхНастроекКаналовОтправки.ОтправкаSMS)
	|ГДЕ
	|	&ОтправитьСообщение = ИСТИНА
	|	И (&ИнформироватьВрачаПриема
	|			ИЛИ &ИнформироватьСотрудника
	|			ИЛИ &ИнформироватьКуратора)
	|	И ТаблицаДанныхНастроекКаналовОтправки.ОтправкаSMS
	|	И ЕСТЬNULL(СотрудникиКонтактнаяИнформация.Вид, ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудника)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКонтактнойИнформацииСотрудников.Сотрудник КАК Сотрудник,
	|	ТаблицаКонтактнойИнформацииСотрудников.Представление КАК Представление,
	|	ТаблицаКонтактнойИнформацииСотрудников.НомерТелефона КАК НомерТелефона,
	|	ЛОЖЬ КАК НеУчаствоватьВРассылке
	|ИЗ
	|	ТаблицаКонтактнойИнформацииСотрудников КАК ТаблицаКонтактнойИнформацииСотрудников
	|ГДЕ
	|	&ИнформироватьПоEMail
	|	И ТаблицаКонтактнойИнформацииСотрудников.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailСотрудника)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОсновныхМенеджеров.Контрагент КАК Контрагент,
	|	ТаблицаОсновныхМенеджеров.Менеджер КАК Менеджер
	|ИЗ
	|	ТаблицаОсновныхМенеджеров КАК ТаблицаОсновныхМенеджеров";	
		
#КонецОбласти
		
	РезультатПакетаЗапросов 				= Запрос.ВыполнитьПакет();
	ТаблицаКлиентовСНомерамиТелефонов 		= РезультатПакетаЗапросов[7].Выгрузить();
	ТаблицаКлиентовСУказаннымиEmail 		= РезультатПакетаЗапросов[8].Выгрузить();
	ТаблицаСотрудниковСНомерамиТелефонов 	= РезультатПакетаЗапросов[12].Выгрузить();
	ТаблицаСотрудниковСУказаннымиEmail 		= РезультатПакетаЗапросов[13].Выгрузить();
	ТаблицаОсновныхМенеджеров 				= РезультатПакетаЗапросов[14].Выгрузить();
		
	// Уничтожаем временную Таблицу
	Запрос.МенеджерВременныхТаблиц.Закрыть();	
	
	СтруктураКонтактнойИнформации.Вставить("ТаблицаКлиентовСНомерамиТелефонов"		, ТаблицаКлиентовСНомерамиТелефонов);
	СтруктураКонтактнойИнформации.Вставить("ТаблицаКлиентовСУказаннымиEmail"		, ТаблицаКлиентовСУказаннымиEmail);
	СтруктураКонтактнойИнформации.Вставить("ТаблицаОсновныхМенеджеров"				, ТаблицаОсновныхМенеджеров);
	СтруктураКонтактнойИнформации.Вставить("ТаблицаСотрудниковСНомерамиТелефонов"	, ТаблицаСотрудниковСНомерамиТелефонов);
	СтруктураКонтактнойИнформации.Вставить("ТаблицаСотрудниковСУказаннымиEmail"		, ТаблицаСотрудниковСУказаннымиEmail);
			
	Возврат СтруктураКонтактнойИнформации;
	
КонецФункции

// Функция - Получить массив врачей для информирования
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  ТаблицаДанныхОбъекта	 - 	 - 
//  ИнформироватьВрачаПриема - 	 - 
//  ИнформироватьСотрудника	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивВрачейДляИнформирования(ДанныеТриггера, ТаблицаДанныхОбъекта, ИнформироватьВрачаПриема, ИнформироватьСотрудника)
	
	МассивВрачей = Новый Массив;
	Если ИнформироватьВрачаПриема Тогда 
		ТаблицаВсехВариантовУсловийТриггерныхСобытий = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуВсехВариантовУсловийТриггерныхСобытий();
		СтрокаВариантУсловияТриггерногоСобытия = ТаблицаВсехВариантовУсловийТриггерныхСобытий.Найти(ДанныеТриггера.УсловиеСобытия, "ВариантыУсловийТриггерныхСобытий");
		Если СтрокаВариантУсловияТриггерногоСобытия = Неопределено Тогда 
			// Запрос.УстановитьПараметр("МассивВрачей"	, Новый Массив);
		ИначеЕсли СтрокаВариантУсловияТриггерногоСобытия.ВиртуальнаяГруппаСобытий = "СобытияПоЗаписям" Тогда
			Если ТаблицаДанныхОбъекта.Колонки.Найти("Сотрудник") <> Неопределено Тогда 
				МассивВрачей = ТаблицаДанныхОбъекта.ВыгрузитьКолонку("Сотрудник");
			Иначе 
				// Запрос.УстановитьПараметр("МассивВрачей"	, Новый Массив);
			КонецЕсли;	
		Иначе 	
			// Запрос.УстановитьПараметр("МассивВрачей"	, Новый Массив);
		КонецЕсли;
	Иначе 
		// Запрос.УстановитьПараметр("МассивВрачей"	, Новый Массив);			
	КонецЕсли;
	
	Если ИнформироватьСотрудника Тогда 
		Для Каждого СтрокаДействие Из ДанныеТриггера.ПланДействийТриггерногоСобытия Цикл 
			Если СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение ИЛИ СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
				Если СтрокаДействие.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник И ТипЗнч(СтрокаДействие.Адресат) = Тип("СправочникСсылка.Сотрудники") И ЗначениеЗаполнено(СтрокаДействие.Адресат) Тогда 
					Если МассивВрачей.Найти(СтрокаДействие.Адресат) = Неопределено Тогда 
						МассивВрачей.Добавить(СтрокаДействие.Адресат);	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	Возврат МассивВрачей;
	
КонецФункции

// Функция - Получить структуру данных занятия
//
// Параметры:
//  Занятие	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуруДанныхЗанятия(Запись)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредварительнаяЗапись.Ссылка КАК Ссылка,
	|	ПредварительнаяЗапись.Дата КАК Дата,
	|	ПредварительнаяЗапись.ДатаСоздания КАК ДатаСоздания,
	|	ДАТАВРЕМЯ(1,1,1) КАК ДатаВремяОкончания,
	|	ДАТАВРЕМЯ(1,1,1) КАК ДатаОтменыЗаписи,
	|	ПредварительнаяЗапись.Контрагент КАК Контрагент,	
	|	ПредварительнаяЗапись.Статус КАК Статус
	|ПОМЕСТИТЬ ТаблицаОсновныхДанныхЗанятия
	|ИЗ
	|	Документ.Событие КАК ПредварительнаяЗапись
	|ГДЕ
	|	ПредварительнаяЗапись.Ссылка = &Запись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятиеСоставЗанятия.ДатаЗаписи КАК ДатаЗаписи,
	|	ЗанятиеСоставЗанятия.Контрагент КАК Контрагент,
	|	ЗанятиеСоставЗанятия.ДатаПрибытия КАК ДатаПрибытия,
	|	ЗанятиеСоставЗанятия.СтатусПрибытия КАК СтатусПрибытия,
	|	ЗанятиеСоставЗанятия.ДатаОтмены КАК ДатаОтмены,
	|	ЗанятиеСоставЗанятия.СписаниеПодтвержденоКлиентом КАК СписаниеПодтвержденоКлиентом,
	|	ЗанятиеСоставЗанятия.Ссылка КАК Ссылка,
	|	ЗанятиеСоставЗанятия.Ссылка.Дата КАК Дата,
	|	ЗанятиеСоставЗанятия.Ссылка.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ЗанятиеСоставЗанятия.Ссылка.ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	ЗанятиеСоставЗанятия.Ссылка.ДатаОтменыЗанятия КАК ДатаОтменыЗанятия,
	|	ЗанятиеСоставЗанятия.Ссылка.СтатусЗанятия КАК СтатусЗанятия,
	|	ЗанятиеСоставЗанятия.Ссылка.ТипЗанятия КАК ТипЗанятия
	|ПОМЕСТИТЬ ТаблицаСоставаЗанятия
	|ИЗ
	|	Документ.Занятие.СоставЗанятия КАК ЗанятиеСоставЗанятия
	|ГДЕ
	|	ЗанятиеСоставЗанятия.Ссылка = &Занятие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОсновныхДанныхЗанятия.Ссылка КАК Ссылка,
	|	ТаблицаОсновныхДанныхЗанятия.Дата КАК Дата,
	|	ТаблицаОсновныхДанныхЗанятия.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ТаблицаОсновныхДанныхЗанятия.ДатаВремяОкончания КАК ДатаВремяОкончания,
	|	ТаблицаОсновныхДанныхЗанятия.ДатаОтменыЗанятия КАК ДатаОтменыЗанятия,
	|	ТаблицаОсновныхДанныхЗанятия.СтатусЗанятия КАК СтатусЗанятия,
	|	ТаблицаОсновныхДанныхЗанятия.ТипЗанятия КАК ТипЗанятия,
	|	ТаблицаОсновныхДанныхЗанятия.УслугаТипСписанияЗанятием КАК УслугаТипСписанияЗанятием,
	|	ЕСТЬNULL(ТаблицаСоставаЗанятия.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаписи,
	|	ЕСТЬNULL(ТаблицаСоставаЗанятия.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ЕСТЬNULL(ТаблицаСоставаЗанятия.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПрибытия,
	|	ЕСТЬNULL(ТаблицаСоставаЗанятия.СтатусПрибытия, -1) КАК СтатусПрибытия,
	|	ЕСТЬNULL(ТаблицаСоставаЗанятия.ДатаОтмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтмены,
	|	ЕСТЬNULL(ТаблицаСоставаЗанятия.СписаниеПодтвержденоКлиентом, ЛОЖЬ) КАК СписаниеПодтвержденоКлиентом
	|ИЗ
	|	ТаблицаОсновныхДанныхЗанятия КАК ТаблицаОсновныхДанныхЗанятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСоставаЗанятия КАК ТаблицаСоставаЗанятия
	|		ПО ТаблицаОсновныхДанныхЗанятия.Ссылка = ТаблицаСоставаЗанятия.Ссылка";
	
	Запрос.УстановитьПараметр("Запись", Запись);
	ДанныеЗанятия = Запрос.Выполнить().Выгрузить();
	ТаблицаСоставаЗанятия = ДанныеЗанятия.Скопировать(, "ДатаЗаписи, Контрагент, ДатаПрибытия, СтатусПрибытия, ДатаОтмены, СписаниеПодтвержденоКлиентом");
	
	СтруктуруДанныхЗанятия = Новый Структура;
	СтруктуруДанныхЗанятия.Вставить("ТаблицаТекущихЗначений", ТаблицаСоставаЗанятия);
	Если ДанныеЗанятия.Количество() = 0 Тогда 
		СтруктуруДанныхЗанятия.Вставить("ДатаЗанятия"				, Неопределено);
		СтруктуруДанныхЗанятия.Вставить("ДатаВремяНачала"			, Неопределено);
		СтруктуруДанныхЗанятия.Вставить("ДатаВремяОкончания"		, Неопределено);		
		СтруктуруДанныхЗанятия.Вставить("ДатаОтменыЗанятия"			, Неопределено);
		СтруктуруДанныхЗанятия.Вставить("СтатусЗанятия"				, Неопределено);
		СтруктуруДанныхЗанятия.Вставить("ТипЗанятия"				, Неопределено);
		СтруктуруДанныхЗанятия.Вставить("УслугаТипСписанияЗанятием"	, Неопределено);		
	Иначе 
		СтруктуруДанныхЗанятия.Вставить("ДатаЗанятия"				, ДанныеЗанятия[0].Дата);
		СтруктуруДанныхЗанятия.Вставить("ДатаВремяНачала"			, ДанныеЗанятия[0].ДатаВремяНачала);
		СтруктуруДанныхЗанятия.Вставить("ДатаВремяОкончания"		, ДанныеЗанятия[0].ДатаВремяОкончания);		
		СтруктуруДанныхЗанятия.Вставить("ДатаОтменыЗанятия"			, ДанныеЗанятия[0].ДатаОтменыЗанятия);
		СтруктуруДанныхЗанятия.Вставить("СтатусЗанятия"				, ДанныеЗанятия[0].СтатусЗанятия);
		СтруктуруДанныхЗанятия.Вставить("ТипЗанятия"				, ДанныеЗанятия[0].ТипЗанятия);
		СтруктуруДанныхЗанятия.Вставить("УслугаТипСписанияЗанятием"	, ДанныеЗанятия[0].УслугаТипСписанияЗанятием);				
	КонецЕсли;	
	
	Возврат СтруктуруДанныхЗанятия;
	
КонецФункции

// Функция - Получить записи операции по членству пакету услуг
//
// Параметры:
//  ДокументОперация - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗаписиОперацииПоЧленствуПакетуУслуг(ДокументОперация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОперация", ДокументОперация);
	Запрос.УстановитьПараметр("ТекущаяДата"		, ТекущаяДатаСеанса());
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыЧленствПакетовУслуг.Период КАК Период,
	               |	ВЫРАЗИТЬ(СтатусыЧленствПакетовУслуг.Регистратор КАК Документ.ОперацииСЧленствомПакетомУслуг) КАК ДокументОперация,
	               |	ВЫРАЗИТЬ(СтатусыЧленствПакетовУслуг.Регистратор КАК Документ.ОперацииСЧленствомПакетомУслуг).ВидОперации КАК ВидОперации,
	               |	ВЫРАЗИТЬ(СтатусыЧленствПакетовУслуг.Регистратор КАК Документ.ОперацииСЧленствомПакетомУслуг).Контрагент КАК Контрагент,
	               |	СтатусыЧленствПакетовУслуг.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	               |	СтатусыЧленствПакетовУслуг.Статус КАК Статус
	               |ПОМЕСТИТЬ ТаблицаЗаписейОперации
	               |ИЗ
	               |	РегистрСведений.СтатусыЧленствПакетовУслуг КАК СтатусыЧленствПакетовУслуг
	               |ГДЕ
	               |	СтатусыЧленствПакетовУслуг.Регистратор = &ДокументОперация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтатусыЧленствПакетовУслугСрезПоследних.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг
	               |ПОМЕСТИТЬ ТаблицаАктуальныхЧленстПакетовУслуг
	               |ИЗ
	               |	РегистрСведений.СтатусыЧленствПакетовУслуг.СрезПоследних(
	               |			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
	               |			ЧленствоПакетУслуг В
	               |					(ВЫБРАТЬ
	               |						ТаблицаЗаписейОперации.ЧленствоПакетУслуг
	               |					ИЗ
	               |						ТаблицаЗаписейОперации)
	               |				И ВЫБОР
	               |					КОГДА Регистратор = &ДокументОперация
	               |						ТОГДА Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК СтатусыЧленствПакетовУслугСрезПоследних
	               |ГДЕ
	               |	НЕ СтатусыЧленствПакетовУслугСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен), ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Закрыт))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗаписейОперации.Период КАК Период,
	               |	ТаблицаЗаписейОперации.ДокументОперация КАК ДокументОперация,
	               |	ТаблицаЗаписейОперации.ВидОперации КАК ВидОперации,
	               |	ТаблицаЗаписейОперации.Контрагент КАК Контрагент,
	               |	ТаблицаЗаписейОперации.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	               |	ТаблицаЗаписейОперации.Статус КАК Статус
	               |ИЗ
	               |	ТаблицаЗаписейОперации КАК ТаблицаЗаписейОперации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАктуальныхЧленстПакетовУслуг КАК ТаблицаАктуальныхЧленстПакетовУслуг
	               |		ПО ТаблицаЗаписейОперации.ЧленствоПакетУслуг = ТаблицаАктуальныхЧленстПакетовУслуг.ЧленствоПакетУслуг
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	ЗаписиОперации = Запрос.Выполнить().Выгрузить();
	
	Возврат ЗаписиОперации;
	
КонецФункции

// Функция - Инициализировать таблицу времени работы структурной единицы
//
// Параметры:
//  ТаблицаДанныхОбъекта - 	 - 
//  ДанныеТриггера		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьТаблицуВремениРаботыСтруктурнойЕдиницы(ТаблицаДанныхОбъекта, ДанныеТриггера);

	НеобходимоПоставитьЗадачу = НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру, "ВидДействия") = Неопределено;
	
	Если НеобходимоПоставитьЗадачу Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РасписаниеРаботы.Ссылка КАК СтруктурнаяЕдиница,
		               |	РасписаниеРаботы.НачалоРаботы КАК НачалоРаботы,
		               |	ВЫБОР
		               |		КОГДА РасписаниеРаботы.ОкончаниеРаботы = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |			ТОГДА КОНЕЦПЕРИОДА(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДЕНЬ)
		               |		ИНАЧЕ РасписаниеРаботы.ОкончаниеРаботы
		               |	КОНЕЦ КАК ОкончаниеРаботы
		               |ИЗ
		               |	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК РасписаниеРаботы
		               |ГДЕ
		               |	РасписаниеРаботы.Ссылка В(&МассивСтруктурныхЕдиниц)
		               |	И ДЕНЬНЕДЕЛИ(РасписаниеРаботы.ДеньНедели) = ДЕНЬНЕДЕЛИ(&Дата)
		               |	И НЕ РасписаниеРаботы.ДеньНедели = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |	И РасписаниеРаботы.Активность = ИСТИНА";
		
		Запрос.УстановитьПараметр("Дата"					, ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц"	, ТаблицаДанныхОбъекта.ВыгрузитьКолонку("СтруктурнаяЕдиница"));
		
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Процедура - Начать генерацию объектов информирования
//
// Параметры:
//  ДанныеТриггера							 - 	 - 
//  ТаблицаДанныхОбъекта					 - 	 - 
//  СтруктураКонтактнойИнформации	 - 	 - 
//  ТаблицаВремениРаботыСтруктурнойЕдиницы	 - 	 - 
//  РегистрацияЗапланированных				 - 	 - 
//
Процедура НачатьГенерациюОбъектовИнформирования(ДанныеТриггера,
												ТаблицаДанныхОбъекта,
												СтруктураКонтактнойИнформации,
												ТаблицаВремениРаботыСтруктурнойЕдиницы,
												ПараметрыРегистрации)
	
	Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентНепосещениеКлиники Тогда
		СгруппироватьДанныеПоПосещениям(ТаблицаДанныхОбъекта);
	КонецЕсли;             
	
	ТаблицаИнформацииПоСделкам = Неопределено;
	// РазрешенаРаботаСоСделками = НЕ ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки, "ВидДействия") = Неопределено;
	// Если РазрешенаРаботаСоСделками Тогда
	//	ТаблицаИнформацииПоСделкам = ПолучитьТаблицуСделокДляДанныхОбъекта(ДанныеТриггера, ТаблицаДанныхОбъекта);
	// КонецЕсли;
		
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанныхОбъекта Цикл
		Если ПараметрыРегистрации.РегистрацияЗапланированных Тогда 
			Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентСменаСтатуса Тогда 
				МассивСтрокРеестра = ДанныеТриггера.РеестрЗапланированных.НайтиСтроки(Новый Структура("ТриггерноеСобытие, ДатаСменыСтатуса, Контрагент, Подтверждено", ДанныеТриггера.ТриггерноеСобытие, СтрокаТаблицыДанных.ДатаСменыСтатуса, СтрокаТаблицыДанных.Контрагент, Истина));
			Иначе 	
				МассивСтрокРеестра = ДанныеТриггера.РеестрЗапланированных.НайтиСтроки(Новый Структура("ТриггерноеСобытие, ОбъектСобытия, Контрагент, Подтверждено", ДанныеТриггера.ТриггерноеСобытие, СтрокаТаблицыДанных.ОбъектСобытия, СтрокаТаблицыДанных.Контрагент, Истина));
			КонецЕсли;	
			Для Каждого СтрокаРеестра Из МассивСтрокРеестра Цикл 
				СтрокаПлан = ДанныеТриггера.ПланДействийТриггерногоСобытия.Найти(СтрокаРеестра.ИдентификаторДействия, "ИдентификаторДействия");
				Если СтрокаПлан = Неопределено Тогда 
					
					ЗаписьЖурналаРегистрации(
					НСтр("ru='ТриггерныеСобытия.Рассинхронизация реестра с планом действий';en='Trigger Events.Desynchronizing the registry with the action plan'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.НайтиПоТипу(ТипЗнч(ДанныеТриггера.ТриггерноеСобытие)),
					ДанныеТриггера.ТриггерноеСобытие,
					НСтр("ru='Запланированное событие не найдено в плане действий:';en='The scheduled event was not found in the action plan:'") + Символы.ПС + Строка(СтрокаРеестра.Период) + Символы.ПС + Строка(СтрокаРеестра.Контрагент) + Символы.ПС + Строка(СтрокаРеестра.ОбъектСобытия) + Символы.ПС + Строка(СтрокаРеестра.ИдентификаторДействия));
					
					
				Иначе 	
					Если СтрокаПлан.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ СтрокаПлан.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки Тогда 
						ТаблицаИнформацииПоСделкам = ПолучитьТаблицуСделокДляДанныхОбъекта(ДанныеТриггера, ТаблицаДанныхОбъекта, СтрокаПлан);
					КонецЕсли;	
					ЗарегистрироватьСобытиеВЖурнале(ДанныеТриггера,
													СтрокаТаблицыДанных,
													СтрокаПлан,
													СтрокаРеестра,
													СтруктураКонтактнойИнформации,
													ТаблицаВремениРаботыСтруктурнойЕдиницы,
													ТаблицаИнформацииПоСделкам,
													ПараметрыРегистрации);
					
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаПлан Из ДанныеТриггера.ПланДействийТриггерногоСобытия Цикл
				Если СтрокаПлан.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ СтрокаПлан.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки Тогда 
					ТаблицаИнформацииПоСделкам = ПолучитьТаблицуСделокДляДанныхОбъекта(ДанныеТриггера, ТаблицаДанныхОбъекта, СтрокаПлан);
				КонецЕсли;					
				ЗарегистрироватьСобытиеВЖурнале(ДанныеТриггера,
												СтрокаТаблицыДанных,
												СтрокаПлан,
												,
												СтруктураКонтактнойИнформации,
												ТаблицаВремениРаботыСтруктурнойЕдиницы,
												ТаблицаИнформацииПоСделкам,
												ПараметрыРегистрации);				
			КонецЦикла;
		КонецЕсли;
		
		// Добавление в стек обновления электронных карт
		Если (ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос
			ИЛИ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание)
			И ЗначениеЗаполнено(СтрокаТаблицыДанных.Контрагент) И ТипЗнч(СтрокаТаблицыДанных.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда 
			
			Попытка
				КартыКонтрагента = Справочники.Карты.ПолучитьКартыКлиента(СтрокаТаблицыДанных.Контрагент,, Перечисления.ВидыКарт.Wallet, Ложь,, Ложь);
				Если ЗначениеЗаполнено(КартыКонтрагента) Тогда 
					ЛицевыеСчета       = "";
					Баланс 			   = "";
					
					СимвольныйКодВалюты = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодЦелойчастиВалюты();
					ИконкиУведомлений   = Справочники.Карты.ПолучитьИконкиУведомлений();
					
					// ОбменДаннымиСерверСтоматология.ДобавитьЛицевыеСчетаВОбновляемыеПоля(ЛицевыеСчета, Баланс, СтрокаТаблицыДанных.Контрагент, ИконкиУведомлений, СимвольныйКодВалюты);
					
					// Для Каждого КартаКонтрагента Из КартыКонтрагента Цикл
					//	РегистрыСведений.СтекОбновленияЭлектронныхКарт.ДобавитьЗаписьВСтек(КартаКонтрагента, "accounts", ЛицевыеСчета); 
					//	РегистрыСведений.СтекОбновленияЭлектронныхКарт.ДобавитьЗаписьВСтек(КартаКонтрагента, "balance" , Баланс); 
					// КонецЦикла;
				КонецЕсли;
			Исключение
				
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры

// Функция - Получить таблицу сделок для данных объекта
//
// Параметры:
//  ДанныеТриггера		 - 	 - 
//  ТаблицаДанныхОбъекта - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуСделокДляДанныхОбъекта(ДанныеТриггера, ТаблицаДанныхОбъекта, СтрокаПлан)
	
	Запрос = Новый Запрос;                                 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаДанныхОбъекта, "ТаблицаОбъектов");
	
	Запрос.УстановитьПараметр("ВидСделки", СтрокаПлан.ВидСделки);
	
	Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПланЛеченияСозданиеПланаЛечения Тогда
		
#Область СделкиПоПлануЛечения
		
		МассивПлановЛечения = ТаблицаДанныхОбъекта.ВыгрузитьКолонку("ПланЛечения");
		УсловиеПоискаСделок = "Сделки.ПланЛечения В
		|			(&МассивПлановЛечения)";
		Запрос.УстановитьПараметр("МассивПлановЛечения", МассивПлановЛечения);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Сделки.Ссылка КАК Сделка,
		               |	Сделки.ВидСделки КАК ВидСделки,
		               |	Сделки.ЭтапСделки КАК ЭтапСделки,
		               |	Сделки.ДатаСделки КАК ДатаСделки,
		               |	Сделки.ПланЛечения КАК ПланЛечения,
		               |	Сделки.РезультатСделки КАК РезультатСделки,
		               |	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки
		               |ПОМЕСТИТЬ ТаблицаСделок
		               |ИЗ
		               |	Справочник.Сделки КАК Сделки
		               |ГДЕ
		               |	Сделки.ПометкаУдаления = ЛОЖЬ
		               |	И Сделки.ВидСделки = &ВидСделки
		               |	И &УсловиеПоискаСделок
		               |	И Сделки.СтруктурнаяЕдиница В
		               |			(ВЫБРАТЬ
		               |				ТаблицаОбъектов.СтруктурнаяЕдиница
		               |			ИЗ
		               |				ТаблицаОбъектов)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаСделок.Сделка) КАК КоличествоСделок,
		               |	ТаблицаСделок.ПланЛечения КАК ПланЛечения
		               |ПОМЕСТИТЬ ТаблицаКоличестваСделок
		               |ИЗ
		               |	ТаблицаСделок КАК ТаблицаСделок
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаСделок.ПланЛечения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(ТаблицаСделок.ДатаСделки) КАК ДатаСделки,
		               |	ТаблицаСделок.ПланЛечения КАК ПланЛечения
		               |ПОМЕСТИТЬ ТаблицаПоследнихОткрытыхСделок
		               |ИЗ
		               |	ТаблицаСделок КАК ТаблицаСделок
		               |ГДЕ
		               |	ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаСделок.ПланЛечения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	МАКСИМУМ(ТаблицаСделок.ДатаЗавершенияСделки) КАК ДатаЗавершенияСделки,
		               |	ТаблицаСделок.ПланЛечения КАК ПланЛечения
		               |ПОМЕСТИТЬ ТаблицаПоследнихЗакртыхСделок
		               |ИЗ
		               |	ТаблицаСделок КАК ТаблицаСделок
		               |ГДЕ
		               |	НЕ ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаСделок.ПланЛечения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТаблицаКоличестваСделок.ПланЛечения КАК ПланЛечения,
		               |	ЕСТЬNULL(ТаблицаПоследнихОткрытыхСделок.ДатаСделки, НЕОПРЕДЕЛЕНО) КАК ДатаПоследнейСделки,
		               |	ЕСТЬNULL(ТаблицаПоследнихЗакртыхСделок.ДатаЗавершенияСделки, НЕОПРЕДЕЛЕНО) КАК ДатаПоследнейЗавершеннойСделки,
		               |	ТаблицаКоличестваСделок.КоличествоСделок КАК КоличествоСделок
		               |ПОМЕСТИТЬ ТаблицаИнформацииПоСделкам
		               |ИЗ
		               |	ТаблицаКоличестваСделок КАК ТаблицаКоличестваСделок
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихОткрытыхСделок КАК ТаблицаПоследнихОткрытыхСделок
		               |		ПО ТаблицаКоличестваСделок.ПланЛечения = ТаблицаПоследнихОткрытыхСделок.ПланЛечения
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихЗакртыхСделок КАК ТаблицаПоследнихЗакртыхСделок
		               |		ПО ТаблицаКоличестваСделок.ПланЛечения = ТаблицаПоследнихЗакртыхСделок.ПланЛечения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ТаблицаСделок.ПланЛечения, ЕСТЬNULL(ТаблицаСделок1.ПланЛечения, ТаблицаИнформацииПоСделкам.ПланЛечения)) КАК ПланЛечения,
		               |	ЕСТЬNULL(ТаблицаСделок.Сделка, НЕОПРЕДЕЛЕНО) КАК ТекущаяСделка,
		               |	ЕСТЬNULL(ТаблицаСделок.ЭтапСделки, НЕОПРЕДЕЛЕНО) КАК ЭтапТекущейСделки,
		               |	ЕСТЬNULL(ТаблицаСделок1.Сделка, НЕОПРЕДЕЛЕНО) КАК ЗавершеннаяСделка,
		               |	ЕСТЬNULL(ТаблицаСделок1.ЭтапСделки, НЕОПРЕДЕЛЕНО) КАК ЭтапЗавершеннойСделки,
		               |	ТаблицаИнформацииПоСделкам.КоличествоСделок КАК КоличествоСделок
		               |ИЗ
		               |	ТаблицаИнформацииПоСделкам КАК ТаблицаИнформацииПоСделкам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок
		               |		ПО ТаблицаИнформацииПоСделкам.ПланЛечения = ТаблицаСделок.ПланЛечения
		               |			И ТаблицаИнформацииПоСделкам.ДатаПоследнейСделки = ТаблицаСделок.ДатаСделки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок1
		               |		ПО ТаблицаИнформацииПоСделкам.ПланЛечения = ТаблицаСделок1.ПланЛечения
		               |			И ТаблицаИнформацииПоСделкам.ДатаПоследнейЗавершеннойСделки = ТаблицаСделок1.ДатаЗавершенияСделки";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоискаСделок", УсловиеПоискаСделок);
		
#КонецОбласти
		
	Иначе 
		
#Область СделкиПоКонтрагенту
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Сделки.Ссылка КАК Сделка,
		               |	Сделки.ВидСделки КАК ВидСделки,
		               |	Сделки.ЭтапСделки КАК ЭтапСделки,
		               |	Сделки.ДатаСделки КАК ДатаСделки,
		               |	Сделки.Контрагент КАК Контрагент,
		               |	Сделки.ПланЛечения КАК ПланЛечения,
		               |	Сделки.РезультатСделки КАК РезультатСделки,
		               |	Сделки.ДатаЗавершенияСделки КАК ДатаЗавершенияСделки
		               |ПОМЕСТИТЬ ТаблицаСделок
		               |ИЗ
		               |	Справочник.Сделки КАК Сделки
		               |ГДЕ
		               |	Сделки.ПометкаУдаления = ЛОЖЬ
		               |	И Сделки.ВидСделки = &ВидСделки
		               |	И Сделки.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаОбъектов.Контрагент
		               |			ИЗ
		               |				ТаблицаОбъектов) 
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СУММА(ВЫБОР
		               |			КОГДА ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоличествоОткрытыхСделок,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТаблицаСделок.РезультатСделки <> ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоличествоЗакрытыхСделок,
		               |	ТаблицаСделок.Контрагент КАК Контрагент
		               |ПОМЕСТИТЬ ТаблицаКоличестваСделок
		               |ИЗ
		               |	ТаблицаСделок КАК ТаблицаСделок
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаСделок.Контрагент
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(ТаблицаСделок.ДатаСделки) КАК ДатаСделки,
		               |	ТаблицаСделок.Контрагент КАК Контрагент
		               |ПОМЕСТИТЬ ТаблицаПоследнихОткрытыхСделок
		               |ИЗ
		               |	ТаблицаСделок КАК ТаблицаСделок
		               |ГДЕ
		               |	ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаСделок.Контрагент
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	МАКСИМУМ(ТаблицаСделок.ДатаЗавершенияСделки) КАК ДатаЗавершенияСделки,
		               |	ТаблицаСделок.Контрагент КАК Контрагент
		               |ПОМЕСТИТЬ ТаблицаПоследнихЗакртыхСделок
		               |ИЗ
		               |	ТаблицаСделок КАК ТаблицаСделок
		               |ГДЕ
		               |	НЕ ТаблицаСделок.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаСделок.Контрагент
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТаблицаКоличестваСделок.Контрагент КАК Контрагент,
		               |	ЕСТЬNULL(ТаблицаПоследнихОткрытыхСделок.ДатаСделки, НЕОПРЕДЕЛЕНО) КАК ДатаПоследнейСделки,
		               |	ЕСТЬNULL(ТаблицаПоследнихЗакртыхСделок.ДатаЗавершенияСделки, НЕОПРЕДЕЛЕНО) КАК ДатаПоследнейЗавершеннойСделки,
		               |	ТаблицаКоличестваСделок.КоличествоОткрытыхСделок КАК КоличествоОткрытыхСделок,
		               |	ТаблицаКоличестваСделок.КоличествоЗакрытыхСделок КАК КоличествоЗакрытыхСделок
		               |ПОМЕСТИТЬ ТаблицаИнформацииПоСделкам
		               |ИЗ
		               |	ТаблицаКоличестваСделок КАК ТаблицаКоличестваСделок
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихОткрытыхСделок КАК ТаблицаПоследнихОткрытыхСделок
		               |		ПО ТаблицаКоличестваСделок.Контрагент = ТаблицаПоследнихОткрытыхСделок.Контрагент
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихЗакртыхСделок КАК ТаблицаПоследнихЗакртыхСделок
		               |		ПО ТаблицаКоличестваСделок.Контрагент = ТаблицаПоследнихЗакртыхСделок.Контрагент
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ТаблицаСделок.Контрагент, ЕСТЬNULL(ТаблицаСделок1.Контрагент, ТаблицаИнформацииПоСделкам.Контрагент)) КАК Контрагент,
		               |	ЕСТЬNULL(ТаблицаСделок.Сделка, НЕОПРЕДЕЛЕНО) КАК ТекущаяСделка,
		               |	ЕСТЬNULL(ТаблицаСделок.ЭтапСделки, НЕОПРЕДЕЛЕНО) КАК ЭтапТекущейСделки,
		               |	ЕСТЬNULL(ТаблицаСделок1.Сделка, НЕОПРЕДЕЛЕНО) КАК ЗавершеннаяСделка,
		               |	ЕСТЬNULL(ТаблицаСделок1.ЭтапСделки, НЕОПРЕДЕЛЕНО) КАК ЭтапЗавершеннойСделки,
		               |	ТаблицаИнформацииПоСделкам.КоличествоОткрытыхСделок КАК КоличествоСделок,
		               |	ТаблицаИнформацииПоСделкам.КоличествоЗакрытыхСделок КАК КоличествоЗакрытыхСделок
		               |ИЗ
		               |	ТаблицаИнформацииПоСделкам КАК ТаблицаИнформацииПоСделкам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок
		               |		ПО ТаблицаИнформацииПоСделкам.Контрагент = ТаблицаСделок.Контрагент
		               |			И ТаблицаИнформацииПоСделкам.ДатаПоследнейСделки = ТаблицаСделок.ДатаСделки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСделок КАК ТаблицаСделок1
		               |		ПО ТаблицаИнформацииПоСделкам.Контрагент = ТаблицаСделок1.Контрагент
		               |			И ТаблицаИнформацииПоСделкам.ДатаПоследнейЗавершеннойСделки = ТаблицаСделок1.ДатаЗавершенияСделки";
		
#КонецОбласти
		
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Процедура - Сгруппировать данные по посещениям
//
// Параметры:
//  ТаблицаДанныхОбъекта - 	 - 
//
Процедура СгруппироватьДанныеПоПосещениям(ТаблицаДанныхОбъекта)
	
	ТаблицаГруппировки = ТаблицаДанныхОбъекта.Скопировать(, "ДатаПрихода, Контрагент, ОбъектСобытия, Основание, СтруктурнаяЕдиница, РегистрацияПоПодписке, РегистрацияЗапланированных");
	ТаблицаГруппировки.Свернуть("ДатаПрихода, Контрагент, ОбъектСобытия, Основание, СтруктурнаяЕдиница, РегистрацияПоПодписке, РегистрацияЗапланированных");
	Если ТаблицаГруппировки.Количество() <> ТаблицаДанныхОбъекта.Количество() Тогда 
		ТаблицаСгруппированныхДанных = ТаблицаДанныхОбъекта.СкопироватьКолонки();
		Для Каждого СтрокаТЗ Из ТаблицаГруппировки Цикл 
			МассивСтрок = ТаблицаДанныхОбъекта.НайтиСтроки(Новый Структура("ДатаПрихода, Контрагент, Основание, СтруктурнаяЕдиница, РегистрацияПоПодписке, РегистрацияЗапланированных", СтрокаТЗ.ДатаПрихода, СтрокаТЗ.Контрагент, СтрокаТЗ.Основание, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.РегистрацияПоПодписке, СтрокаТЗ.РегистрацияЗапланированных));
			Если МассивСтрок.Количество() <> 0 Тогда 
				ЗаполнитьЗначенияСвойств(ТаблицаСгруппированныхДанных.Добавить(), МассивСтрок[0]);
			КонецЕсли;	
		КонецЦикла;
		ТаблицаДанныхОбъекта 			= ТаблицаСгруппированныхДанных;
		ТаблицаСгруппированныхДанных 	= Неопределено;
	КонецЕсли;
	ТаблицаГруппировки 				= Неопределено;		
	
КонецПроцедуры

// Процедура - Зарегистрировать событие в журнале
//
// Параметры:
//  ДанныеТриггера							 - 	 - 
//  СтрокаТаблицыДанных						 - 	 - 
//  СтрокаПлан								 - 	 - 
//  СтрокаРеестра							 - 	 - 
//  СтруктураКонтактнойИнформации	 - 	 - 
//  ТаблицаВремениРаботыСтруктурнойЕдиницы	 - 	 - 
//
Процедура ЗарегистрироватьСобытиеВЖурнале(ДанныеТриггера,
											СтрокаТаблицыДанных,
											СтрокаПланДействий,
											СтрокаРеестра = Неопределено,
											СтруктураКонтактнойИнформации,
											ТаблицаВремениРаботыСтруктурнойЕдиницы,
											ТаблицаИнформацииПоСделкам = Неопределено,
											ПараметрыРегистрации)

	
	Период = ТекущаяДатаСеанса();
	МассивНомеров 				= Новый Массив;
	МассивEmail 				= Новый Массив;
		
	// Отправляем сообщение
	Если СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда
		Попытка
			РассылкаЗапрещена 			= Ложь;
			РассылкаЗапрещенаДляУслуги 	= Ложь;
			ТаблицаКонтактов = ВернутьТаблицуКонтактов(СтрокаТаблицыДанных, СтрокаПланДействий, СтруктураКонтактнойИнформации, РассылкаЗапрещена, РассылкаЗапрещенаДляУслуги);
			Если НЕ ТаблицаКонтактов.Количество() = 0 Тогда
				Если СтрокаПланДействий.ТаблицаЗначенийПараметров <> Неопределено И НЕ СтрокаПланДействий.ТаблицаЗначенийПараметров.Колонки.Найти("СсылкаНаОценкуИОтзыв") = Неопределено Тогда 
					// Это конктретный триггер "ЗанятиеПроведеноКлиентПрибыл" и в шаблоне есть параметр "СсылкаНаОценкуИОтзыв"
					// Попробуем получить ссылку
					КороткаяСсылкаНаОценкуЗанятия = Неопределено; // РегламентныеЗаданияСерверСтоматология.ПолучитьКороткуюСсылку(СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.ОбъектСобытия, СтрокаТаблицыДанных.Контрагент, "rating");
					Если НЕ ЗначениеЗаполнено(КороткаяСсылкаНаОценкуЗанятия) Тогда
						// Пишем в журнал регистрации триггерных событий
						СообщениеОбОшибке = НСтр("ru='Не удалось сгенерировать ссылку для оценки и отзыва по занятию для клиента.';en='Failed to generate lesson rating and feedback link for customer.'");			
						СтруктураСобытия = Новый Структура;
						СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
						СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
						СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
						ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);			
					Иначе
						Попытка
							ИнициализацияВнешнейСистемыОценокИОтзывов(Истина);
						Исключение
							ВызватьИсключение;
						КонецПопытки;
						
						МассивСтрокЗначений = СтрокаПланДействий.ТаблицаЗначенийПараметров.НайтиСтроки(Новый Структура("Контрагент, ОбъектСобытия", СтрокаТаблицыДанных.Контрагент, СтрокаТаблицыДанных.ОбъектСобытия));
						Для Каждого СтрокЗначений Из МассивСтрокЗначений Цикл 
							СтрокЗначений.СсылкаНаОценкуИОтзыв = КороткаяСсылкаНаОценкуЗанятия;
						КонецЦикла;	
						ПараметрыSMSОбъекта = ИнициализироватьПараметрыSMSОбъекта(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, ТаблицаКонтактов, Период);
						ВыполнитьОтправкуСообщений(ПараметрыSMSОбъекта);
					КонецЕсли;
				ИначеЕсли СтрокаПланДействий.ТаблицаЗначенийПараметров <> Неопределено И НЕ СтрокаПланДействий.ТаблицаЗначенийПараметров.Колонки.Найти("СсылкаНаИнформациюОЗаписиНаЗанятие") = Неопределено Тогда
					КороткаяСсылкаНаИнформациюОЗаписи = Неопределено; // РегламентныеЗаданияСерверСтоматология.ПолучитьКороткуюСсылку(СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.ОбъектСобытия, СтрокаТаблицыДанных.Контрагент, "record");
					Если НЕ ЗначениеЗаполнено(КороткаяСсылкаНаИнформациюОЗаписи) Тогда
						// Пишем в журнал регистрации триггерных событий
						СообщениеОбОшибке = НСтр("ru='Не удалось сгенерировать ссылку на информацию о записи на занятие.';en='Failed to generate class enrollment information link.'");			
						СтруктураСобытия = Новый Структура;
						СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
						СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
						СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
						ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);			
					Иначе
						Попытка
							ИнициализацияВнешнейСистемыОценокИОтзывов(Истина);
						Исключение
							ВызватьИсключение;
						КонецПопытки;
						МассивСтрокЗначений = СтрокаПланДействий.ТаблицаЗначенийПараметров.НайтиСтроки(Новый Структура("Контрагент, ОбъектСобытия", СтрокаТаблицыДанных.Контрагент, СтрокаТаблицыДанных.ОбъектСобытия));
						Для Каждого СтрокЗначений Из МассивСтрокЗначений Цикл 
							СтрокЗначений.СсылкаНаИнформациюОЗаписиНаЗанятие = КороткаяСсылкаНаИнформациюОЗаписи;
						КонецЦикла;	
						ПараметрыSMSОбъекта = ИнициализироватьПараметрыSMSОбъекта(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, ТаблицаКонтактов, Период);
						ВыполнитьОтправкуСообщений(ПараметрыSMSОбъекта);
					КонецЕсли;
				Иначе 
					ПараметрыSMSОбъекта = ИнициализироватьПараметрыSMSОбъекта(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, ТаблицаКонтактов, Период);
					ВыполнитьОтправкуСообщений(ПараметрыSMSОбъекта);
				КонецЕсли;
			ИначеЕсли РассылкаЗапрещена ИЛИ РассылкаЗапрещенаДляУслуги Тогда 
				// Пишем в журнал регистрации триггерных событий
				Если РассылкаЗапрещена Тогда 
					СообщениеОбОшибке = НСтр("ru='Рассылка сообщений запрещена.';en='Sending messages is prohibited.'");			
				Иначе 
					СообщениеОбОшибке = НСтр("ru='Рассылка сообщений для услуги в занятии запрещена.';en='Sending messages for the service in the lesson is prohibited.'");			
				КонецЕсли;	
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
				СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
				СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
				ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);			
			Иначе 
				// Пишем в журнал регистрации триггерных событий
				СообщениеОбОшибке = НСтр("ru='Не обнаружены соответствующие контактные данные получателя для рассылки сообщений, либо не корректно указан аккаунт уведомлений для структурной единицы регистрации данного события.';en='The corresponding contact details of the recipient for sending messages were not found, or the notification account for the structural unit for registering this event was not correctly specified.'");			
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
				СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
				СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
				ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);			
			КонецЕсли;
		Исключение
			// Пишем в журнал регистрации триггерных событий
			СообщениеОбОшибке = НСтр("ru='Ошибка создания документа ""РассылкаСообщений"":';en='Error creating a document ""Sending Messages"":'") + Символы.ПС + ОписаниеОшибки();			
			СтруктураСобытия = Новый Структура;
			СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
			СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
			СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
			ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке);			
		КонецПопытки;
	КонецЕсли;
	
	// Отправляем Email
	Если СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо И ЗначениеЗаполнено(СтрокаПланДействий.АккаунтEmail) Тогда 
		Попытка
			РассылкаЗапрещена = Ложь;			
			ТаблицаКонтактов = ВернутьТаблицуКонтактов(СтрокаТаблицыДанных, СтрокаПланДействий, СтруктураКонтактнойИнформации, РассылкаЗапрещена);
			Если НЕ ТаблицаКонтактов.Количество() = 0 Тогда 
				ПараметрыEmailОбъекта = ИнициализироватьПараметрыEmailОбъекта(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, ТаблицаКонтактов, Период);
				ОписаниеОшибки = "";
				ОтправитьЭлектронноеПисьмо(ПараметрыEmailОбъекта, ОписаниеОшибки);
				Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда 
					// Пишем в журнал регистрации триггерных событий
					СообщениеОбОшибке = НСтр("ru='Ошибка отправки электронного письма:';en='Error sending email:'") + Символы.ПС + ?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, ОписаниеОшибки());			
					СтруктураСобытия = Новый Структура;
					СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
					СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
					СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
					ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке);			
				КонецЕсли;
			ИначеЕсли РассылкаЗапрещена Тогда 
				// Пишем в журнал регистрации триггерных событий
				СообщениеОбОшибке = НСтр("ru='Рассылка сообщений запрещена.';en='Sending messages is prohibited.'");			
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
				СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
				СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
				ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);				
			Иначе 
				// Пишем в журнал регистрации триггерных событий
				СообщениеОбОшибке = НСтр("ru='Не обнаружен адрес электронной почты для рассылки сообщений.';en='The email address for sending messages was not found.'");			
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
				СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
				СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
				ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);				
			КонецЕсли;
		Исключение
			// Пишем в журнал регистрации триггерных событий
			СообщениеОбОшибке = НСтр("ru='Ошибка создания документа ""ЭлектронноеПисьмоИсходящее"":';en='Error creating a document ""Outgoing Email"":'") + Символы.ПС + ОписаниеОшибки();			
			СтруктураСобытия = Новый Структура;
			СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
			СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
			СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
			ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке);			
		КонецПопытки;		
	КонецЕсли;
		
	// Производим предопределенное действие
	Если НЕ ТаблицаИнформацииПоСделкам = Неопределено И
		(СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ
		СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки) Тогда 
		
		Попытка
			Если СтрокаПланДействий.ВидСделки.ТипСделки = Перечисления.ТипыСделок.Продление Тогда
				Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
					СтрокаИнформация = ТаблицаИнформацииПоСделкам.Найти(СтрокаТаблицыДанных.ОбъектСобытия, "ТекущаяСделка");
				Иначе 	
					СтрокаИнформация = ТаблицаИнформацииПоСделкам.Найти(СтрокаТаблицыДанных.ОбъектСобытия, "ЧленствоПакетУслуг");
				КонецЕсли;	
			Иначе
				Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
					СтрокаИнформация = ТаблицаИнформацииПоСделкам.Найти(СтрокаТаблицыДанных.ОбъектСобытия, "ТекущаяСделка");
				ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПланЛеченияСозданиеПланаЛечения Тогда	
					СтрокаИнформация = ТаблицаИнформацииПоСделкам.Найти(СтрокаТаблицыДанных.ПланЛечения, "ПланЛечения");
				Иначе 	
					СтрокаИнформация = ТаблицаИнформацииПоСделкам.Найти(СтрокаТаблицыДанных.Контрагент, "Контрагент");
				КонецЕсли;	
			КонецЕсли;	
			Если СтрокаИнформация <> Неопределено Тогда 
				Если СтрокаИнформация.ТекущаяСделка <> Неопределено Тогда 
					Если СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки
						И ЗначениеЗаполнено(СтрокаПланДействий.ЭтапСделки)
						И СтрокаИнформация.ЭтапТекущейСделки <> СтрокаПланДействий.ЭтапСделки Тогда 
						Если СтрокаПланДействий.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
							ПараметрыОбъектаДействия = ИнициализироватьПараметрыОбъектаСделка(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, , Период);
							УстановитьЭтапСделке(СтрокаИнформация.ТекущаяСделка, СтрокаПланДействий.ЭтапСделки, ПараметрыОбъектаДействия);
						ИначеЕсли СтрокаПланДействий.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
							ПараметрыОбъектаДействия = ИнициализироватьПараметрыОбъектаСделка(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, , Период);
							УстановитьЭтапСделке(СтрокаИнформация.ТекущаяСделка, СтрокаПланДействий.ЭтапСделки, ПараметрыОбъектаДействия);
						Иначе 	
							Если СтрокаПланДействий.ЭтапСделки.НомерЭтапа > СтрокаИнформация.ЭтапТекущейСделки.НомерЭтапа Тогда 
								ПараметрыОбъектаДействия = ИнициализироватьПараметрыОбъектаСделка(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, , Период);
								УстановитьЭтапСделке(СтрокаИнформация.ТекущаяСделка, СтрокаПланДействий.ЭтапСделки, ПараметрыОбъектаДействия);
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки
						И ЗначениеЗаполнено(СтрокаПланДействий.ЭтапСделки)
						И СтрокаИнформация.ЭтапТекущейСделки <> СтрокаПланДействий.ЭтапСделки Тогда
						ПараметрыОбъектаДействия = ИнициализироватьПараметрыОбъектаСделка(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, , Период);
						УстановитьЭтапСделке(СтрокаИнформация.ТекущаяСделка, СтрокаПланДействий.ЭтапСделки, ПараметрыОбъектаДействия);
					КонецЕсли;
				ИначеЕсли СтрокаПланДействий.СоздаватьСделку И СтрокаПланДействий.КоличествоГенерацийСделок > СтрокаИнформация.КоличествоСделок И НЕ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
					ПараметрыОбъектаДействия = ИнициализироватьПараметрыОбъектаСделка(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, Истина, Период);
					СоздатьСделку(ПараметрыОбъектаДействия);
				КонецЕсли;
			ИначеЕсли СтрокаПланДействий.СоздаватьСделку И НЕ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.СделкаЗадержкаНаЭтапе Тогда 
				ПараметрыОбъектаДействия = ИнициализироватьПараметрыОбъектаСделка(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, Истина, Период);
				СоздатьСделку(ПараметрыОбъектаДействия);
			КонецЕсли;
		Исключение
			// Пишем в журнал регистрации триггерных событий
			СообщениеОбОшибке = НСтр("ru='Ошибка генерации/редактирования Сделки:';en='Error generating/editing a Transaction:'") + Символы.ПС + ОписаниеОшибки();			
			СтруктураСобытия = Новый Структура;
			СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
			СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
			СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
			ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке);			
		КонецПопытки;
	КонецЕсли;
	
	// Активируем чат-бота
	Если СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота Тогда
		Попытка
			РассылкаЗапрещена 			= Ложь;
			РассылкаЗапрещенаДляУслуги 	= Ложь;
			ТаблицаКонтактов = ВернутьТаблицуКонтактов(СтрокаТаблицыДанных, СтрокаПланДействий, СтруктураКонтактнойИнформации, РассылкаЗапрещена, РассылкаЗапрещенаДляУслуги);
			Если НЕ ТаблицаКонтактов.Количество() = 0 Тогда
				ПараметрыДиалогаЧатБота = ИнициализироватьПараметрыДиалогаЧатБота(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, ТаблицаКонтактов, Период);
				ЗапускСценарияНеобходимоПеренести = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыДиалогаЧатБота, "ЗапускСценарияНеобходимоПеренести", Ложь);
				Если ЗапускСценарияНеобходимоПеренести Тогда
					СообщениеОбОшибке = НСтр("ru = 'Старт сценария отложен. Время старта перенесено в разрешенный временной диапазон отправки сообщений.'");			
					СтруктураСобытия = Новый Структура;
					СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
					СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
					СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
					ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Запланировано, ПараметрыДиалогаЧатБота.ДатаСтарта);			
				Иначе 	
					РезультатАктивации = ЗапуститьСценарийЧатБота(ПараметрыДиалогаЧатБота);
					Если НЕ РезультатАктивации.ВыполненоУспешно Тогда
						ЗапускСценарияНеобходимоПеренести = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатАктивации, "ЗапускСценарияНеобходимоПеренести", Ложь);
						Если ЗапускСценарияНеобходимоПеренести Тогда 
							СообщениеОбОшибке = НСтр("ru = 'Перенесено в связи с активностью текущего диалога.'");			
							СтруктураСобытия = Новый Структура;
							СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
							СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
							СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
							ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Запланировано);			
						Иначе 	
							// Пишем в журнал регистрации триггерных событий
							СообщениеОбОшибке = РезультатАктивации.ОписаниеОшибки;			
							СтруктураСобытия = Новый Структура;
							СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
							СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
							СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
							ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);			
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли РассылкаЗапрещена ИЛИ РассылкаЗапрещенаДляУслуги Тогда 
				// Пишем в журнал регистрации триггерных событий
				Если РассылкаЗапрещена Тогда 
					СообщениеОбОшибке = НСтр("ru='Рассылка сообщений запрещена.';en='Sending messages is prohibited.'");			
				Иначе 
					СообщениеОбОшибке = НСтр("ru='Рассылка сообщений для услуги в занятии запрещена.';en='Sending messages for the service in the lesson is prohibited.'");			
				КонецЕсли;	
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
				СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
				СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
				ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);			
			Иначе 
				// Пишем в журнал регистрации триггерных событий
				СообщениеОбОшибке = НСтр("ru='Не обнаружены соответствующие контактные данные получателя для рассылки сообщений, либо не корректно указан аккаунт уведомлений для структурной единицы регистрации данного события.';en='The corresponding contact details of the recipient for sending messages were not found, or the notification account for the structural unit for registering this event was not correctly specified.'");			
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
				СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
				СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
				ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке, Перечисления.СтатусыРегистрацииСобытий.Отклонено);			
			КонецЕсли;
		Исключение
			// Пишем в журнал регистрации триггерных событий
			СообщениеОбОшибке = НСтр("ru='Ошибка активации чат-бота:';en='Chatbot activation error:'") + Символы.ПС + ОписаниеОшибки();			
			СтруктураСобытия = Новый Структура;
			СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
			СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
			СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
			ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке);			
		КонецПопытки;
	КонецЕсли;
	
	// Создаем задачу
	Если СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру И ЗначениеЗаполнено(СтрокаПланДействий.Адресат) Тогда 
		Попытка
			ПараметрыОбъектаЗадача = ИнициализироватьПараметрыОбъектаЗадача(ДанныеТриггера, СтрокаТаблицыДанных, СтрокаПланДействий, СтрокаРеестра, ТаблицаВремениРаботыСтруктурнойЕдиницы, Период);
			СоздатьЗадачу(ПараметрыОбъектаЗадача);
		Исключение
			// Пишем в журнал регистрации триггерных событий
			СообщениеОбОшибке = НСтр("ru='Ошибка создания задачи пользователю:';en='Error creating a task for the user:'") + Символы.ПС + ОписаниеОшибки();			
			СтруктураСобытия = Новый Структура;
			СтруктураСобытия.Вставить("СтрокаТаблицыДанных"	, СтрокаТаблицыДанных);
			СтруктураСобытия.Вставить("СтрокаПланДействий"	, СтрокаПланДействий);
			СтруктураСобытия.Вставить("СтрокаРеестра"		, СтрокаРеестра);			
			ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, , СтруктураСобытия, ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке);			
		КонецПопытки;				
	КонецЕсли;
	
КонецПроцедуры

// Функция - Вернуть таблицу контактов
//
// Параметры:
//  СтрокаТаблицыДанных				 - 	 - 
//  СтрокаПланДействий				 - 	 - 
//  СтруктураКонтактнойИнформации	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьТаблицуКонтактов(СтрокаТаблицыДанных, СтрокаПланДействий, СтруктураКонтактнойИнформации, РассылкаЗапрещена = Ложь, РассылкаЗапрещенаДляУслуги = Ложь)
	   
	ТаблицаКонтактов 		= Новый ТаблицаЗначений;
	МассивТиповПолучателей 	= Новый Массив;
	МассивТиповПолучателей.Добавить(Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	МассивТиповПолучателей.Добавить(Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	МассивСервисРассылки 	= Новый Массив;
	МассивСервисРассылки.Добавить(Новый ОписаниеТипов("СправочникСсылка.СервисыРассылки"));
	МассивСервисРассылки.Добавить(Новый ОписаниеТипов("СправочникСсылка.ВнешниеСистемы"));

	ТаблицаКонтактов.Колонки.Добавить("Получатель"				, Новый ОписаниеТипов(МассивТиповПолучателей));
	ТаблицаКонтактов.Колонки.Добавить("НомерТелефона"			, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
	ТаблицаКонтактов.Колонки.Добавить("Адрес"					, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаКонтактов.Колонки.Добавить("СервисРассылки"			, Новый ОписаниеТипов(МассивСервисРассылки));
	ТаблицаКонтактов.Колонки.Добавить("КаналСистемыСообщений"	, Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(32)));
	
	АккаунтОтправки 				= Неопределено;
	МассивСтрокДляОтправки 			= Неопределено;
	НеУчаствоватьВРассылкеСообщений = Ложь;
	Если СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.КонтрагентСобытия Тогда
		Если СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение И СтруктураКонтактнойИнформации.Свойство("ТаблицаКлиентовСНомерамиТелефонов") Тогда 
			Если СтрокаПланДействий.ТаблицаЗначенийПараметров <> Неопределено И НЕ СтрокаПланДействий.ТаблицаЗначенийПараметров.Колонки.Найти("СсылкаНаИнформациюОЗаписиНаЗанятие") = Неопределено Тогда 
				Если ТипЗнч(СтрокаТаблицыДанных.ОбъектСобытия) = Тип("ДокументСсылка.Занятие") Тогда 
					НеУчаствоватьВРассылкеСообщений = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТаблицыДанных.ОбъектСобытия, "Номенклатура"), "НеУчаствоватьВРассылкеСообщений");
					Если НеУчаствоватьВРассылкеСообщений = Истина Тогда 
						РассылкаЗапрещенаДляУслуги = Истина;
						Возврат ТаблицаКонтактов;
					КонецЕсли;	
			    КонецЕсли;
			КонецЕсли;
			Если МассивСтрокДляОтправки = Неопределено Тогда  
				МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаКлиентовСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Контрагент, ОтправкаPush", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.Контрагент, Истина));			
				Если МассивСтрокСНомерами.Количество() > 0 Тогда
					МассивСтрокДляОтправки = МассивСтрокСНомерами;
				КонецЕсли;
			КонецЕсли;
			Если МассивСтрокДляОтправки = Неопределено Тогда 
				МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаКлиентовСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Контрагент, ОтправкаPushWallet", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.Контрагент, Истина));			
				Если МассивСтрокСНомерами.Количество() > 0 Тогда
					МассивСтрокДляОтправки = МассивСтрокСНомерами;
				КонецЕсли;
			КонецЕсли;			
			Если МассивСтрокДляОтправки = Неопределено Тогда 
				МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаКлиентовСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Контрагент, ОтправкаMessenger", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.Контрагент, Истина));			
				Если МассивСтрокСНомерами.Количество() > 0 Тогда
					МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
					// АккаунтОтправки 		= СтрокаПланДействий.АккаунтВнешнейСистемы;
				КонецЕсли;
			КонецЕсли;
			Если МассивСтрокДляОтправки = Неопределено Тогда 
				МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаКлиентовСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Контрагент, ОтправкаSMS", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.Контрагент, Истина));			
				Если МассивСтрокСНомерами.Количество() > 0 Тогда
					МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
					// АккаунтОтправки 		= СтрокаПланДействий.АккаунтSMS;					
				КонецЕсли;
			КонецЕсли;
			Если МассивСтрокДляОтправки <> Неопределено Тогда 
				ПолучитьПриведенныеНомера(СтрокаТаблицыДанных.Контрагент, МассивСтрокДляОтправки, ТаблицаКонтактов, Истина, АккаунтОтправки, РассылкаЗапрещена); 			
			КонецЕсли;	
		ИначеЕсли СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо И СтруктураКонтактнойИнформации.Свойство("ТаблицаКлиентовСУказаннымиEmail") Тогда 	 
			МассивСтрокСЭлектроннымиАдресами = СтруктураКонтактнойИнформации.ТаблицаКлиентовСУказаннымиEmail.НайтиСтроки(Новый Структура("Контрагент", СтрокаТаблицыДанных.Контрагент));			
			ПолучитьКорректныеЭлектронныеАдреса(СтрокаТаблицыДанных.Контрагент, МассивСтрокСЭлектроннымиАдресами, ТаблицаКонтактов, РассылкаЗапрещена); 			
		ИначеЕсли СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.АктивироватьЧатБота И СтруктураКонтактнойИнформации.Свойство("ТаблицаКлиентовСНомерамиТелефонов") Тогда 
			Если МассивСтрокДляОтправки = Неопределено Тогда 
				МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаКлиентовСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Контрагент, ОтправкаMessenger", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.Контрагент, Истина));			
				Если МассивСтрокСНомерами.Количество() > 0 Тогда
					МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
					// АккаунтОтправки 		= СтрокаПланДействий.АккаунтВнешнейСистемы;
				КонецЕсли;
			КонецЕсли;
			Если МассивСтрокДляОтправки <> Неопределено Тогда 
				ПолучитьПриведенныеНомера(СтрокаТаблицыДанных.Контрагент, МассивСтрокДляОтправки, ТаблицаКонтактов, Истина, АккаунтОтправки, РассылкаЗапрещена); 			
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда	
		Если СтруктураКонтактнойИнформации.Свойство("ТаблицаОсновныхМенеджеров") Тогда 
			МассивСтрокСМенеджерами = СтруктураКонтактнойИнформации.ТаблицаОсновныхМенеджеров.НайтиСтроки(Новый Структура("Контрагент", СтрокаТаблицыДанных.Контрагент));
			Если МассивСтрокСМенеджерами.Количество() <> 0 Тогда
				Если ЗначениеЗаполнено(МассивСтрокСМенеджерами[0].Менеджер) И СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда
					Если МассивСтрокДляОтправки = Неопределено Тогда 
						МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Сотрудник, ОтправкаMessenger", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, МассивСтрокСМенеджерами[0].Менеджер, Истина));			
						Если МассивСтрокСНомерами.Количество() > 0 Тогда
							МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
							// АккаунтОтправки 		= СтрокаПланДействий.АккаунтВнешнейСистемы;							
						КонецЕсли;
					КонецЕсли;
					Если МассивСтрокДляОтправки = Неопределено Тогда 
						МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Сотрудник, ОтправкаSMS", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, МассивСтрокСМенеджерами[0].Менеджер, Истина));			
						Если МассивСтрокСНомерами.Количество() > 0 Тогда
							МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
							// АккаунтОтправки 		= СтрокаПланДействий.АккаунтSMS;								
						КонецЕсли;
					КонецЕсли;
					Если МассивСтрокДляОтправки <> Неопределено Тогда 
						ПолучитьПриведенныеНомера(МассивСтрокСМенеджерами[0].Менеджер, МассивСтрокДляОтправки, ТаблицаКонтактов, Истина, АккаунтОтправки, РассылкаЗапрещена); 			
					КонецЕсли;	
				ИначеЕсли ЗначениеЗаполнено(МассивСтрокСМенеджерами[0].Менеджер) И СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда
					МассивСтрокСЭлектроннымиАдресами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСУказаннымиEmail.НайтиСтроки(Новый Структура("Сотрудник", МассивСтрокСМенеджерами[0].Менеджер));
					ПолучитьКорректныеЭлектронныеАдреса(МассивСтрокСМенеджерами[0].Менеджер, МассивСтрокСЭлектроннымиАдресами, ТаблицаКонтактов, РассылкаЗапрещена); 								
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема ИЛИ СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник Тогда	
		Если СтруктураКонтактнойИнформации.Свойство("ТаблицаСотрудниковСНомерамиТелефонов") И СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда			
			Если СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема Тогда 
				Если МассивСтрокДляОтправки = Неопределено Тогда 				
					МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Сотрудник, ОтправкаMessenger", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.Сотрудник, Истина));					
					Если МассивСтрокСНомерами.Количество() > 0 Тогда
						МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
						// АккаунтОтправки 		= СтрокаПланДействий.АккаунтВнешнейСистемы;							
					КонецЕсли;
				КонецЕсли;
				Если МассивСтрокДляОтправки = Неопределено Тогда 
					МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Сотрудник, ОтправкаSMS", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаТаблицыДанных.Сотрудник, Истина));					
					Если МассивСтрокСНомерами.Количество() > 0 Тогда 
						МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
						// АккаунтОтправки 		= СтрокаПланДействий.АккаунтSMS;							
					КонецЕсли;
				КонецЕсли;
				Если МассивСтрокДляОтправки <> Неопределено Тогда 
					ПолучитьПриведенныеНомера(СтрокаТаблицыДанных.Сотрудник, МассивСтрокДляОтправки, ТаблицаКонтактов, Истина, АккаунтОтправки, РассылкаЗапрещена); 			
				КонецЕсли;	
			ИначеЕсли СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник И ТипЗнч(СтрокаПланДействий.Адресат) = Тип("СправочникСсылка.Сотрудники") И ЗначениеЗаполнено(СтрокаПланДействий.Адресат) Тогда  
				Если МассивСтрокДляОтправки = Неопределено Тогда 				
					МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Сотрудник, ОтправкаMessenger", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаПланДействий.Адресат, Истина));						
					Если МассивСтрокСНомерами.Количество() > 0 Тогда
						МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
						// АккаунтОтправки 		= СтрокаПланДействий.АккаунтВнешнейСистемы;							
					КонецЕсли;
				КонецЕсли;
				Если МассивСтрокДляОтправки = Неопределено Тогда 								
					МассивСтрокСНомерами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСНомерамиТелефонов.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница, Сотрудник, ОтправкаSMS", СтрокаПланДействий.ИдентификаторДействия, СтрокаТаблицыДанных.СтруктурнаяЕдиница, СтрокаПланДействий.Адресат, Истина));						
					Если МассивСтрокСНомерами.Количество() > 0 Тогда				
						МассивСтрокДляОтправки 	= МассивСтрокСНомерами;
						// АккаунтОтправки 		= СтрокаПланДействий.АккаунтSMS;							
					КонецЕсли;	
				КонецЕсли;
				Если МассивСтрокДляОтправки <> Неопределено Тогда 
					ПолучитьПриведенныеНомера(СтрокаПланДействий.Адресат, МассивСтрокДляОтправки, ТаблицаКонтактов, Истина, АккаунтОтправки, РассылкаЗапрещена); 			
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли СтруктураКонтактнойИнформации.Свойство("ТаблицаСотрудниковСУказаннымиEmail") И ((СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема И ЗначениеЗаполнено(СтрокаТаблицыДанных.Сотрудник)) ИЛИ СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник) И СтрокаПланДействий.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда
			Если СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема Тогда 				
				МассивСтрокСЭлектроннымиАдресами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСУказаннымиEmail.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТаблицыДанных.Сотрудник));
				ПолучитьКорректныеЭлектронныеАдреса(СтрокаТаблицыДанных.Сотрудник, МассивСтрокСЭлектроннымиАдресами, ТаблицаКонтактов, РассылкаЗапрещена); 								
			ИначеЕсли СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник И ТипЗнч(СтрокаПланДействий.Адресат) = Тип("СправочникСсылка.Сотрудники") И ЗначениеЗаполнено(СтрокаПланДействий.Адресат) Тогда  
				МассивСтрокСЭлектроннымиАдресами = СтруктураКонтактнойИнформации.ТаблицаСотрудниковСУказаннымиEmail.НайтиСтроки(Новый Структура("Сотрудник", СтрокаПланДействий.Адресат));
				ПолучитьКорректныеЭлектронныеАдреса(СтрокаПланДействий.Адресат, МассивСтрокСЭлектроннымиАдресами, ТаблицаКонтактов, РассылкаЗапрещена); 								
			КонецЕсли;						
		КонецЕсли;					
	КонецЕсли;	
	
	Возврат ТаблицаКонтактов;
	
КонецФункции		
			
// Процедура - Получить приведенные номера клиента
//
// Параметры:
//  МассивСтрокКлиентаСНомерами	 - 	 - 
//  МассивНомеров				 - 	 - 
//
Процедура ПолучитьПриведенныеНомера(Получатель, МассивСтрокСНомерами, ТаблицаКонтактов, ЭтоМассивПолучателейСКонтактнымиДанными = Ложь, СервисРассылки = Неопределено, РассылкаЗапрещена = Ложь)
	
	ТаблицаКонтактов.Очистить();
	Для Каждого СтрокаНомераТелефона Из МассивСтрокСНомерами Цикл
		Если ЭтоМассивПолучателейСКонтактнымиДанными Тогда 
			Если СтрокаНомераТелефона.ОтправкаPush Тогда 
				Если ЗначениеЗаполнено(СтрокаНомераТелефона.НомерТелефонаPush) И ЗначениеЗаполнено(СтрокаНомераТелефона.АккаунтВнешнейСистемыPush) Тогда
					Если НЕ СтрокаНомераТелефона.РассылкаЗапрещенаPush Тогда 
						НовыйПолучатель = ТаблицаКонтактов.Добавить();
						НовыйПолучатель.Получатель 		= Получатель;
						НовыйПолучатель.НомерТелефона 	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(СтрокаНомераТелефона.НомерТелефонаPush, Ложь);
						НовыйПолучатель.СервисРассылки 	= СтрокаНомераТелефона.АккаунтВнешнейСистемыPush;
					Иначе 
						РассылкаЗапрещена = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаНомераТелефона.ОтправкаPushWallet Тогда 
				Если ЗначениеЗаполнено(СтрокаНомераТелефона.НомерТелефонаPushWallet) И ЗначениеЗаполнено(СтрокаНомераТелефона.АккаунтВнешнейСистемыPushWallet) Тогда
					Если НЕ СтрокаНомераТелефона.РассылкаЗапрещенаPushWallet Тогда 
						НовыйПолучатель = ТаблицаКонтактов.Добавить();
						НовыйПолучатель.Получатель 		= Получатель;
						НовыйПолучатель.НомерТелефона 	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(СтрокаНомераТелефона.НомерТелефонаPushWallet, Ложь);
						НовыйПолучатель.СервисРассылки 	= СтрокаНомераТелефона.АккаунтВнешнейСистемыPushWallet;
					Иначе 
						РассылкаЗапрещена = Истина;
					КонецЕсли;
				КонецЕсли;					
			ИначеЕсли СтрокаНомераТелефона.ОтправкаMessenger Тогда
				Если НЕ СтрокаНомераТелефона.РассылкаЗапрещенаMessengerSMS Тогда
					Если ЗначениеЗаполнено(СтрокаНомераТелефона.АккаунтВнешнейСистемы) Тогда
						Если ТаблицаКонтактов.НайтиСтроки(Новый Структура("Получатель, СервисРассылки", Получатель, СтрокаНомераТелефона.АккаунтВнешнейСистемы)).Количество() = 0 Тогда 
							НовыйПолучатель = ТаблицаКонтактов.Добавить();
							НовыйПолучатель.Получатель 		= Получатель;
							Если ЗначениеЗаполнено(СтрокаНомераТелефона.НомерТелефонаMessengerSMS) Тогда
								НовыйПолучатель.НомерТелефона 	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(СтрокаНомераТелефона.НомерТелефонаMessengerSMS, Ложь);
							КонецЕсли;
							НовыйПолучатель.СервисРассылки 	= СтрокаНомераТелефона.АккаунтВнешнейСистемы;
							Если ЗначениеЗаполнено(СтрокаНомераТелефона.КаналСистемыСообщений) Тогда 
								НовыйПолучатель.КаналСистемыСообщений = СтрокаНомераТелефона.КаналСистемыСообщений;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе 
					РассылкаЗапрещена = Истина;
				КонецЕсли;				
			ИначеЕсли СтрокаНомераТелефона.ОтправкаSMS Тогда
				Если ЗначениеЗаполнено(СтрокаНомераТелефона.НомерТелефонаMessengerSMS) И ЗначениеЗаполнено(СтрокаНомераТелефона.АккаунтСервисаРассылкиSMS) Тогда
					Если НЕ СтрокаНомераТелефона.РассылкаЗапрещенаMessengerSMS Тогда 					
						НовыйПолучатель = ТаблицаКонтактов.Добавить();
						НовыйПолучатель.Получатель 		= Получатель;
						НовыйПолучатель.НомерТелефона 	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(СтрокаНомераТелефона.НомерТелефонаMessengerSMS, Ложь);					
						НовыйПолучатель.СервисРассылки 	= СтрокаНомераТелефона.АккаунтСервисаРассылкиSMS;
					Иначе 
						РассылкаЗапрещена = Истина;
					КонецЕсли;					
				КонецЕсли;
			КонецЕсли;	
		Иначе 	
			Если ЗначениеЗаполнено(СтрокаНомераТелефона.НомерТелефона) Тогда
				НовыйПолучатель = ТаблицаКонтактов.Добавить();
				НовыйПолучатель.Получатель 		= Получатель;
				НовыйПолучатель.НомерТелефона 	= ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(СтрокаНомераТелефона.НомерТелефона, Ложь);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	РассылкаЗапрещена = ТаблицаКонтактов.Количество() = 0 И РассылкаЗапрещена;
	
КонецПроцедуры

// Процедура - Получить массив корректных электронных адресов
//
// Параметры:
//  МассивСтрокКлиентаСEmail - 	 - 
//  МассивEmail				 - 	 - 
//
Процедура ПолучитьКорректныеЭлектронныеАдреса(Получатель, МассивСтрокКлиентаСEmail, ТаблицаКонтактов, РассылкаЗапрещена = Ложь)
	
	ТаблицаКонтактов.Очистить();
	
	Для Каждого СтрокаEmailКлиента Из МассивСтрокКлиентаСEmail Цикл 
		Если ЗначениеЗаполнено(СтрокаEmailКлиента.Представление) И ЭлектроннаяПочтаКорректна(СтрокаEmailКлиента.Представление) Тогда 
			Если НЕ СтрокаEmailКлиента.НеУчаствоватьВРассылке Тогда 			
				НовыйПолучатель = ТаблицаКонтактов.Добавить();
				НовыйПолучатель.Получатель 		= Получатель;
				НовыйПолучатель.Адрес 			= СокрЛП(СтрокаEmailКлиента.Представление);
			Иначе 
				РассылкаЗапрещена = Истина;
			КонецЕсли;								
		КонецЕсли;
	КонецЦикла;	
	
	РассылкаЗапрещена = ТаблицаКонтактов.Количество() = 0 И РассылкаЗапрещена;
	
КонецПроцедуры

// Функция проверяет корректность адреса электронной почты
//
// Параметры:
//  ОбъектКИ	 - ОбъектXDTO	 - объект XDTO контактной информации
//  ИмяРеквизита - строка	 - имя реквизита формы, с которым будет связано сообщение об ошибке
// 
// Возвращаемое значение:
//  Булево - признак корректности
//
Функция ЭлектроннаяПочтаКорректна(ЭлектроннаяПочтаКлиента)
	
	СтрокаОшибки = "";
	
	Попытка
		Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ЭлектроннаяПочтаКлиента);
		Если Результат.Количество() > 1 Тогда
			СтрокаОшибки = Нстр("ru='Допускается ввод только одного адреса электронной почты';en='Allowed input only one addresses email of mail'");
		КонецЕсли;
	Исключение
		СтрокаОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат ПустаяСтрока(СтрокаОшибки);
	
КонецФункции

// Процедура - Инициализировать параметры шаблона
//
// Параметры:
//  ПараметрыШаблона - 	 - 
//  ДанныеТриггера	 - 	 - 
//
Процедура ИнициализироватьПараметрыШаблона(ДанныеТриггера, ПараметрыРегистрации, ТаблицаДанныхОбъекта, РегистрацияВФоне = Ложь)
	
	// Инициализируем таблицу параметров, которые мы использовали в шаблоне
	ТаблицаВсехПараметров 				= ОбщегоНазначенияПовтИсп.ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов();
	ТаблицаЗадействованныхПараметров 	= ТаблицаВсехПараметров.СкопироватьКолонки();
	Для Каждого СтрокаТаблицы Из ТаблицаВсехПараметров Цикл
		Для Каждого СтрокаПланДействия Из ДанныеТриггера.ПланДействийТриггерногоСобытия Цикл
			Если СтрокаПланДействия.ШаблонСообщения = Неопределено Тогда 
				Продолжить;				
			КонецЕсли;
			Если СтрокаПланДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда
				Если СтрНайти(СтрокаПланДействия.СодержаниеМессенджер, СтрокаТаблицы.НаименованиеПараметра) <> 0 Тогда 
					ЗаполнитьЗначенияСвойств(ТаблицаЗадействованныхПараметров.Добавить(), СтрокаТаблицы);
				КонецЕсли;					
				Если СтрНайти(СтрокаПланДействия.Содержание, СтрокаТаблицы.НаименованиеПараметра) <> 0 Тогда 
					ЗаполнитьЗначенияСвойств(ТаблицаЗадействованныхПараметров.Добавить(), СтрокаТаблицы);
				КонецЕсли;
				Если СтрНайти(СтрокаПланДействия.СодержаниеPush, СтрокаТаблицы.НаименованиеПараметра) <> 0 Тогда 
					ЗаполнитьЗначенияСвойств(ТаблицаЗадействованныхПараметров.Добавить(), СтрокаТаблицы);
				КонецЕсли;					
			ИначеЕсли СтрокаПланДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЭлектронноеПисьмо Тогда 
				Если СтрНайти(СтрокаПланДействия.ТекстHTML, СтрокаТаблицы.НаименованиеПараметра) <> 0 Тогда 
					ЗаполнитьЗначенияСвойств(ТаблицаЗадействованныхПараметров.Добавить(), СтрокаТаблицы);
				КонецЕсли;	
			ИначеЕсли СтрокаПланДействия.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ЗадачаМенеджеру Тогда 
				Если СтрНайти(СтрокаПланДействия.ЗадачаОписание, СтрокаТаблицы.НаименованиеПараметра) <> 0 Тогда 
					ЗаполнитьЗначенияСвойств(ТаблицаЗадействованныхПараметров.Добавить(), СтрокаТаблицы);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	// Формируем текст запроса. Получаем таблицу значений.
	Если ТаблицаЗадействованныхПараметров.Количество() <> 0 Тогда
		ТаблицаЗадействованныхПараметров.Свернуть("НаименованиеПараметра, ПредставлениеПараметра, РеквизитПараметра, ОсновнаяТаблицаОбъекта, ВидОсновнойТаблицыОбъекта, ОбъектПараметра, ПредставлениеОсновнойТаблицаОбъекта, ИзОсновнойТаблицы, ФорматПараметра, ИнициализированВИсходнойТаблице");		
		Для Каждого СтрокаПланДействия Из ДанныеТриггера.ПланДействийТриггерногоСобытия Цикл
			СтрокаПланДействия.ТаблицаЗадействованныхПараметров = ТаблицаЗадействованныхПараметров;
		КонецЦикла;
		
		ТаблицаОбъектовПараметра = ТаблицаЗадействованныхПараметров.Скопировать(Новый Структура("ИнициализированВИсходнойТаблице", Ложь), "ОсновнаяТаблицаОбъекта, ВидОсновнойТаблицыОбъекта");
		ТаблицаОбъектовПараметра.Свернуть("ОсновнаяТаблицаОбъекта, ВидОсновнойТаблицыОбъекта");
		// Если нужно получить актуальные данные итогового регистра - обновим их в итоговом в принудительном порядке
		РегистрацияВФоне = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаДанныхОбъекта, "ТаблицаДанныхОбъекта");
		ТекстЗапроса = Запрос.Текст;		
		// Генерируем таблицы для получения значений параметров
		Для Каждого СтрокаОбъектПараметр Из ТаблицаОбъектовПараметра Цикл
			Если ТаблицаОбъектовПараметра.Индекс(СтрокаОбъектПараметр) = 0 Тогда 
				ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ" + Символы.ПС;
			Иначе 
				ТекстЗапроса = ТекстЗапроса + ";" + Символы.ПС + Символы.ПС + "////////////////////////////////////////////////////////////////////////////////" + Символы.ПС + "ВЫБРАТЬ" + Символы.ПС;
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса + Символы.Таб + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + ".Ссылка КАК Ссылка" + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + "," + Символы.ПС;
			Если СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта = "Контрагенты" Тогда
				ТекстЗапроса = ТекстЗапроса + Символы.Таб + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + ".Наименование КАК НаименованиеКонтрагента" + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + "," + Символы.ПС;
				// ТекстЗапроса = ТекстЗапроса + Символы.Таб + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + ".НаименованиеСокращенное КАК НаименованиеКонтрагентаСокращенное" + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + "," + Символы.ПС;
			КонецЕсли;
			МассивПсевдонимов = Новый Массив;
			МассивПараметров = ТаблицаЗадействованныхПараметров.НайтиСтроки(Новый Структура("ОсновнаяТаблицаОбъекта, ВидОсновнойТаблицыОбъекта", СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта, СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта));
			Для Каждого ЭлементМассива Из МассивПараметров Цикл
				Если ЭлементМассива.НаименованиеПараметра = "{НаименованиеКонтрагентаСокращенное}" ИЛИ ЭлементМассива.НаименованиеПараметра = "{Email}" ИЛИ ЭлементМассива.НаименованиеПараметра = "{СсылкаНаОценкуИОтзыв}" ИЛИ ЭлементМассива.НаименованиеПараметра = "{СсылкаНаИнформациюОЗаписиНаЗанятие}" Тогда 
					Продолжить;
				КонецЕсли;
				Если НЕ МассивПсевдонимов.Найти(?(ЭлементМассива.ИзОсновнойТаблицы, СтрСоединить(СтрРазделить(ЭлементМассива.НаименованиеПараметра, " {}")) + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта, ЭлементМассива.РеквизитПараметра)) = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				МассивПсевдонимов.Добавить(?(ЭлементМассива.ИзОсновнойТаблицы, СтрСоединить(СтрРазделить(ЭлементМассива.НаименованиеПараметра, " {}")) + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта, ЭлементМассива.РеквизитПараметра));				
				// Если ЭлементМассива.НаименованиеПараметра = "{СсылкаНаОценкуИОтзыв}" Тогда 
				//	ТекстЗапроса = ТекстЗапроса + Символы.Таб + """" + " КАК " + СтрСоединить(СтрРазделить(ЭлементМассива.НаименованиеПараметра, " {}")) + ?(МассивПараметров.Найти(ЭлементМассива) = МассивПараметров.Количество() - 1, "", ",") + Символы.ПС
				// Иначе 
					ТекстЗапроса = ТекстЗапроса + Символы.Таб + ?(ЭлементМассива.ИзОсновнойТаблицы, ЭлементМассива.ВидОсновнойТаблицыОбъекта + ЭлементМассива.ОсновнаяТаблицаОбъекта, ЭлементМассива.ОбъектПараметра) + "." + ЭлементМассива.РеквизитПараметра + " КАК " + ?(ЭлементМассива.ИзОсновнойТаблицы, СтрСоединить(СтрРазделить(ЭлементМассива.НаименованиеПараметра, " {}")) + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта, ЭлементМассива.РеквизитПараметра) + ?(МассивПараметров.Найти(ЭлементМассива) = МассивПараметров.Количество() - 1, "", ",") + Символы.ПС
				// КонецЕсли;	
			КонецЦикла;
			Если Прав(СокрЛП(ТекстЗапроса), 1) = "," Тогда 
				ТекстЗапроса = Лев(СокрЛП(ТекстЗапроса), СтрНайти(СокрЛП(ТекстЗапроса), ",", НаправлениеПоиска.СКонца) - 1) + Символы.ПС;
			КонецЕсли;	
			ТекстЗапроса = ТекстЗапроса + "ПОМЕСТИТЬ " + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + Символы.ПС;
			ТекстЗапроса = ТекстЗапроса + "ИЗ" + Символы.ПС + Символы.Таб + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + "." + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + " КАК " + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + Символы.ПС;
			ТекстЗапроса = ТекстЗапроса + "ГДЕ" + Символы.ПС + Символы.Таб + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + ".Ссылка В" + 
				?(СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта = "Контрагенты", "(ВЫБРАТЬ ТаблицаДанныхОбъекта.Контрагент ИЗ ТаблицаДанныхОбъекта)", "(ВЫБРАТЬ ТаблицаДанныхОбъекта.ОбъектСобытия ИЗ ТаблицаДанныхОбъекта)") + Символы.ПС;
		КонецЦикла;
		Если ТаблицаОбъектовПараметра.Количество() <> 0 Тогда 
			ТекстЗапроса = ТекстЗапроса + ";" + Символы.ПС + Символы.ПС + "////////////////////////////////////////////////////////////////////////////////" + Символы.ПС;
		КонецЕсли;	
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ" + Символы.ПС + Символы.Таб + "*" + Символы.ПС + "ИЗ" + Символы.ПС + Символы.Таб + "ТаблицаДанныхОбъекта КАК ТаблицаДанныхОбъекта" + Символы.ПС;
		// Цепляем левым соединением все сгенерированные таблицы к основной для получения общей таблицы значений
		Для Каждого СтрокаОбъектПараметр Из ТаблицаОбъектовПараметра Цикл
			ТекстЗапроса = ТекстЗапроса + "ЛЕВОЕ СОЕДИНЕНИЕ " + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + " КАК " + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + Символы.ПС + Символы.Таб + 
					"ПО ТаблицаДанныхОбъекта." + ?(СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта = "Контрагенты", "Контрагент", "ОбъектСобытия") + " = " + СтрокаОбъектПараметр.ВидОсновнойТаблицыОбъекта + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + ".Ссылка" + СтрокаОбъектПараметр.ОсновнаяТаблицаОбъекта + Символы.ПС;
		КонецЦикла;	
		Запрос.Текст = ТекстЗапроса;
		// Получаем таблицу значений
		Попытка
			ТаблицаЗначенийПараметров = Запрос.Выполнить().Выгрузить();
			СтрокаПараметраСсылкаНаОценкуИОтзыв = ТаблицаЗадействованныхПараметров.Найти("{СсылкаНаОценкуИОтзыв}", "НаименованиеПараметра");
			Если НЕ СтрокаПараметраСсылкаНаОценкуИОтзыв = Неопределено Тогда
				Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеПроведеноКлиентПрибыл Тогда 
					ТаблицаЗначенийПараметров.Колонки.Добавить("СсылкаНаОценкуИОтзыв", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(900)));
				Иначе 
					ТаблицаЗадействованныхПараметров.Удалить(СтрокаПараметраСсылкаНаОценкуИОтзыв);
				КонецЕсли;	
			КонецЕсли;
			СтрокаПараметраСсылкаНаИнформациюОЗаписи = ТаблицаЗадействованныхПараметров.Найти("{СсылкаНаИнформациюОЗаписиНаЗанятие}", "НаименованиеПараметра");
			Если НЕ СтрокаПараметраСсылкаНаИнформациюОЗаписи = Неопределено Тогда
				Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием ИЛИ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема Тогда 
					ТаблицаЗначенийПараметров.Колонки.Добавить("СсылкаНаИнформациюОЗаписиНаЗанятие", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(900)));
				Иначе 
					ТаблицаЗадействованныхПараметров.Удалить(СтрокаПараметраСсылкаНаИнформациюОЗаписи);
				КонецЕсли;	
			КонецЕсли;
			
			Для Каждого СтрокаПланДействия Из ДанныеТриггера.ПланДействийТриггерногоСобытия Цикл
				СтрокаПланДействия.ТаблицаЗначенийПараметров = ТаблицаЗначенийПараметров;
			КонецЦикла;
		Исключение
			// Пишем в журнал регистрации триггерных событий
			СообщениеОбОшибке = НСтр("ru='Ошибка при получении значений параметров для шаблона триггерного события:';en='Error getting parameter values for the trigger event template:'") + Символы.ПС + Символы.ПС + ОписаниеОшибки();			
			ЗарегистрироватьОшибкиРегистрацииСобытия(ДанныеТриггера, ТаблицаДанныхОбъекта, , ПараметрыРегистрации.РегистрацияПоПодписке, ПараметрыРегистрации.РегистрацияЗапланированных, СообщениеОбОшибке);
			// Пишем в системный журнал
			ЗаписьЖурналаРегистрации("РегистрацияТриггерныхСобытий.ПолучениеЗначенийПараметровДляШаблона", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ТриггерныеСобытия, ДанныеТриггера.ТриггерноеСобытие, СообщениеОбОшибке + Символы.ПС + "Фиксация: " + Строка(ТекущаяДатаСеанса()) + Символы.ПС + "Триггерное событие: " + Строка(ДанныеТриггера.ТриггерноеСобытие));									
		КонецПопытки;
		Запрос.МенеджерВременныхТаблиц.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

// Функция - Инициализировать параметры SMSОбъекта
//
// Параметры:
//  ДанныеТриггера	 - 	 - 
//  ДанныеОбъекта	 - 	 - 
//  МассивНомеров	 - 	 - 
//  Период			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПараметрыSMSОбъекта(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра = Неопределено, ТаблицаКонтактов, Период)
	
	ДатаОтправки = ?(ЗначениеЗаполнено(Период), Период, ТекущаяДатаСеанса());
	ПараметрыSMSОбъекта = Новый Структура;
	ПараметрыSMSОбъекта.Вставить("Период"						, Период);
	ПараметрыSMSОбъекта.Вставить("ТриггерноеСобытие"			, ДанныеТриггера.ТриггерноеСобытие);		
	ПараметрыSMSОбъекта.Вставить("СтруктурнаяЕдиница"			, ДанныеОбъекта.СтруктурнаяЕдиница);	
	ПараметрыSMSОбъекта.Вставить("ВидОперации"					, Перечисления.ВидОперацииОтправкаSMS.ОтправкаSMSПолучателю);	
	ПараметрыSMSОбъекта.Вставить("СервисSMSРассылки"			, СтрокаПланДействий.АккаунтSMS);
	ПараметрыSMSОбъекта.Вставить("Тип"							, Перечисления.ТипыСобытий.SMS);
	// ПараметрыSMSОбъекта.Вставить("КаналСистемыСообщений"		, СтрокаПланДействий.КаналСистемыСообщений);
	ПараметрыSMSОбъекта.Вставить("Содержание"					, СтрокаПланДействий.Содержание);
	ВремяНачалаТекущейОтправки 		= НачалоДня(ДатаОтправки) + (Час(СтрокаПланДействий.SMSВремяНачалаОтправки) * 60 * 60) + (Минута(СтрокаПланДействий.SMSВремяНачалаОтправки) * 60);
	ВремяОкончанияТекущейОтправки 	= НачалоДня(ДатаОтправки) + (Час(СтрокаПланДействий.SMSВремяОкончанияОтправки) * 60 * 60) + (Минута(СтрокаПланДействий.SMSВремяОкончанияОтправки) * 60);
	
	Если (СтрокаПланДействий.SMSВремяНачалаОтправки = Дата(1, 1, 1) И СтрокаПланДействий.SMSВремяОкончанияОтправки = Дата(1, 1, 1)) 
		ИЛИ (ДатаОтправки >= ВремяНачалаТекущейОтправки И ДатаОтправки <= ВремяОкончанияТекущейОтправки) Тогда 
		ПараметрыSMSОбъекта.Вставить("ОтправитьНемедленно"		, Ложь); // ИСТИНА
		ПараметрыSMSОбъекта.Вставить("ДатаОтправки"				, ДатаОтправки);
	ИначеЕсли ДатаОтправки < ВремяНачалаТекущейОтправки	Тогда 
		ПараметрыSMSОбъекта.Вставить("ОтправитьНемедленно"		, Ложь);
		ПараметрыSMSОбъекта.Вставить("ДатаОтправки"				, ВремяНачалаТекущейОтправки);
	Иначе 
		ПараметрыSMSОбъекта.Вставить("ОтправитьНемедленно"		, Ложь);
		ПараметрыSMSОбъекта.Вставить("ДатаОтправки"				, ВремяНачалаТекущейОтправки + (24 * 60 * 60));
	КонецЕсли;	
	ПараметрыSMSОбъекта.Вставить("Комментарий"					, "Сформирован автоматически по триггеру: " + Символы.ПС + ДанныеТриггера.Наименование);
	ПараметрыSMSОбъекта.Вставить("ПараметрЖурналаРегистрации"	, "РассылкаСообщений." + ДанныеТриггера.Наименование);	
	ПараметрыSMSОбъекта.Вставить("ДанныеТриггера"				, ДанныеТриггера);	
	ПараметрыSMSОбъекта.Вставить("ДанныеОбъекта"				, ДанныеОбъекта);
	ПараметрыSMSОбъекта.Вставить("ДанныеДействия"				, СтрокаПланДействий);			
	ПараметрыSMSОбъекта.Вставить("ТаблицаКонтактов"				, ТаблицаКонтактов);	
	ПараметрыSMSОбъекта.Вставить("ПараметрыРегистрацииТриггера"	, СформироватьПараметрыРегистрацииТриггерногоСобытия(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра, ПараметрыSMSОбъекта));	
	
	Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентДеньРождения Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ПоздравлениеСДнемРождения");	
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентПосещениеКлиники Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОПосещенииКлиники");	
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентНепосещениеКлиники Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОНепосещенииКлиники");	
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием Тогда
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОЗаписиПациетаНаПрием");			
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеКлиентПрибыл Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОПрибытииКлиентаНаЗанятие");			
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеОтменено Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОбОтменеЗанятия");			
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеКлиентНеПрибыл Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОНеПрибытииКлиенатНаЗанятие");			
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаПлатежПоРассрочке Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОбОчередномПлатежеПоРассрочке");			
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаПолная ИЛИ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаОплатаЧастичная Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОбОплате");
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.Продажа Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОбПродаже");
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос ИЛИ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание Тогда 
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформированиеОИзмененииБаланса");				
	КонецЕсли;
	
	Если ТипЗнч(ДанныеОбъекта.ОбъектСобытия) = Тип("ДокументСсылка.Событие") Тогда 
		ПараметрыSMSОбъекта.Вставить("ДокументОснование", ДанныеОбъекта.ОбъектСобытия);
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетВзнос ИЛИ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛицевойСчетСписание Тогда
		ПараметрыSMSОбъекта.Вставить("ДокументОснование", ДанныеОбъекта.ОбъектСобытия);
	КонецЕсли;
	
	Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьНачалоПриема
		И СтрокаПланДействий.ТаблицаЗначенийПараметров <> Неопределено И НЕ СтрокаПланДействий.ТаблицаЗначенийПараметров.Колонки.Найти("СсылкаНаИнформациюОЗаписиНаЗанятие") = Неопределено Тогда
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "НапоминаниеОЗаписи");
	ИначеЕсли ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗаписьСозданиеЗаписиНаПрием
		И СтрокаПланДействий.ТаблицаЗначенийПараметров <> Неопределено И НЕ СтрокаПланДействий.ТаблицаЗначенийПараметров.Колонки.Найти("СсылкаНаИнформациюОЗаписиНаЗанятие") = Неопределено Тогда
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформироватьОПодтвержденииЗанятия");	
	КонецЕсли;
	
	Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЗанятиеПроведеноКлиентПрибыл
		И СтрокаПланДействий.ТаблицаЗначенийПараметров <> Неопределено И НЕ СтрокаПланДействий.ТаблицаЗначенийПараметров.Колонки.Найти("СсылкаНаОценкуИОтзыв") = Неопределено Тогда
		ПараметрыSMSОбъекта.Вставить("НазначениеЗадачи"				, "ИнформироватьОбОценкеЗанятия");		
	КонецЕсли;
	
	Возврат ПараметрыSMSОбъекта;
	
КонецФункции	

// Функция - Инициализировать параметры email объекта
//
// Параметры:
//  ДанныеТриггера	 - 	 - 
//  ДанныеОбъекта	 - 	 - 
//  МассивEmail		 - 	 - 
//  Период			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПараметрыEmailОбъекта(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра = Неопределено, ТаблицаКонтактов, Период)
	
	Если ОбщегоНазначенияПовтИсп.ЭтоСеансРегламентногоЗадания() Тогда 
		Пользователь = ОбщегоНазначенияПовтИсп.ПолучитьСлужебногоСотрудника();
	Иначе 
		Пользователь = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	
	ПараметрыEmailОбъекта = Новый Структура;
	ПараметрыEmailОбъекта.Вставить("Период"							, Период);
	ПараметрыEmailОбъекта.Вставить("ТриггерноеСобытие"				, ДанныеТриггера.ТриггерноеСобытие);			
	ПараметрыEmailОбъекта.Вставить("СтруктурнаяЕдиница"				, ДанныеОбъекта.СтруктурнаяЕдиница); // ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;	
	ПараметрыEmailОбъекта.Вставить("АвторДокумента"					, Пользователь);		
	ПараметрыEmailОбъекта.Вставить("УчетнаяЗапись"					, СтрокаПланДействий.АккаунтEmail);	
	ПараметрыEmailОбъекта.Вставить("Кодировка"						, "utf-8");		
	ПараметрыEmailОбъекта.Вставить("ЕстьВложения"					, Ложь);		
	ПараметрыEmailОбъекта.Вставить("Важность"						, Перечисления.ВариантыВажностиЗадачи.Обычная);
	ПараметрыEmailОбъекта.Вставить("Тема"							, СтрокаПланДействий.Наименование);
	ПараметрыEmailОбъекта.Вставить("ТекстHTML"						, ИнициализироватьСодержаниеСПараметрами(СтрокаПланДействий.ТекстHTML, СтрокаПланДействий, ДанныеОбъекта));
	ПараметрыEmailОбъекта.Вставить("ТипТекста"						, Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыEmailОбъекта.Вставить("Ответственный"					, Пользователь);
	ПараметрыEmailОбъекта.Вставить("ОтправительПредставление"		, ?(ЗначениеЗаполнено(СтрокаПланДействий.АккаунтEmail.ИмяПользователя), СтрокаПланДействий.АккаунтEmail.ИмяПользователя + " <" + СтрокаПланДействий.АккаунтEmail.АдресЭлектроннойПочты + ">", СтрокаПланДействий.АккаунтEmail.АдресЭлектроннойПочты));
	ПараметрыEmailОбъекта.Вставить("ПараметрЖурналаРегистрации"		, "ЭлектронноеПисьмоИсходящее." + ДанныеТриггера.Наименование);	
	ПараметрыEmailОбъекта.Вставить("ДанныеТриггера"					, ДанныеТриггера);	
	ПараметрыEmailОбъекта.Вставить("ДанныеОбъекта"					, ДанныеОбъекта);
	ПараметрыEmailОбъекта.Вставить("ДанныеДействия"					, СтрокаПланДействий);		
	ПараметрыEmailОбъекта.Вставить("ТаблицаКонтактов"				, ТаблицаКонтактов);	
	ПараметрыEmailОбъекта.Вставить("ПараметрыРегистрацииТриггера"	, СформироватьПараметрыРегистрацииТриггерногоСобытия(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра, ПараметрыEmailОбъекта));	
	
	Возврат ПараметрыEmailОбъекта;
	
КонецФункции	

// Функция - Инициализировать параметры диалога чат бота
//
// Параметры:
//  ДанныеТриггера		 - 	 - 
//  ДанныеОбъекта		 - 	 - 
//  СтрокаПланДействий	 - 	 - 
//  СтрокаРеестра		 - 	 - 
//  ТаблицаКонтактов	 - 	 - 
//  Период				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПараметрыДиалогаЧатБота(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра = Неопределено, ТаблицаКонтактов, Период)
	
	ДатаСтарта = ?(ЗначениеЗаполнено(Период), Период, ТекущаяДатаСеанса());
	ПараметрыДиалогаЧатБота = Новый Структура;
	ПараметрыДиалогаЧатБота.Вставить("Период"							, Период);
	ПараметрыДиалогаЧатБота.Вставить("ТриггерноеСобытие"				, ДанныеТриггера.ТриггерноеСобытие);		
	ПараметрыДиалогаЧатБота.Вставить("СтруктурнаяЕдиница"				, ДанныеОбъекта.СтруктурнаяЕдиница);
	ПараметрыДиалогаЧатБота.Вставить("СценарийЧатБота"					, СтрокаПланДействий.СценарийЧатБота);
	ПараметрыДиалогаЧатБота.Вставить("ЗапускСценарияНеобходимоПеренести", Ложь);
	
	// ПараметрыДиалогаЧатБота.Вставить("СервисSMSРассылки"			, СтрокаПланДействий.АккаунтSMS);
	// ПараметрыSMSОбъекта.Вставить("КаналСистемыСообщений"		, СтрокаПланДействий.КаналСистемыСообщений);
	ВремяНачалаТекущейОтправки 		= НачалоДня(ДатаСтарта) + (Час(СтрокаПланДействий.SMSВремяНачалаОтправки) * 60 * 60) + (Минута(СтрокаПланДействий.SMSВремяНачалаОтправки) * 60);
	ВремяОкончанияТекущейОтправки 	= НачалоДня(ДатаСтарта) + (Час(СтрокаПланДействий.SMSВремяОкончанияОтправки) * 60 * 60) + (Минута(СтрокаПланДействий.SMSВремяОкончанияОтправки) * 60);
	
	Если (СтрокаПланДействий.SMSВремяНачалаОтправки = Дата(1, 1, 1) И СтрокаПланДействий.SMSВремяОкончанияОтправки = Дата(1, 1, 1)) 
		ИЛИ (ДатаСтарта >= ВремяНачалаТекущейОтправки И ДатаСтарта <= ВремяОкончанияТекущейОтправки) Тогда 
		ПараметрыДиалогаЧатБота.Вставить("АктивироватьНемедленно"		, Ложь); // ИСТИНА
		ПараметрыДиалогаЧатБота.Вставить("ДатаСтарта"					, ДатаСтарта);
	ИначеЕсли ДатаСтарта < ВремяНачалаТекущейОтправки	Тогда 
		ПараметрыДиалогаЧатБота.Вставить("АктивироватьНемедленно"		, Ложь);
		ПараметрыДиалогаЧатБота.Вставить("ДатаСтарта"					, ВремяНачалаТекущейОтправки);
		ПараметрыДиалогаЧатБота.Вставить("ЗапускСценарияНеобходимоПеренести", Истина);		
	Иначе 
		ПараметрыДиалогаЧатБота.Вставить("АктивироватьНемедленно"		, Ложь);
		ПараметрыДиалогаЧатБота.Вставить("ДатаСтарта"					, ВремяНачалаТекущейОтправки + (24 * 60 * 60));
		ПараметрыДиалогаЧатБота.Вставить("ЗапускСценарияНеобходимоПеренести", Истина);			
	КонецЕсли;

	ПараметрыДиалогаЧатБота.Вставить("Комментарий"						, "{Активирован автоматически} по триггеру: " + Символы.ПС + ДанныеТриггера.Наименование);
	ПараметрыДиалогаЧатБота.Вставить("ПараметрЖурналаРегистрации"		, "Активация чат-бота." + ДанныеТриггера.Наименование);	
	ПараметрыДиалогаЧатБота.Вставить("ДанныеТриггера"					, ДанныеТриггера);	
	ПараметрыДиалогаЧатБота.Вставить("ДанныеСценария"					, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеОбъекта));
	ПараметрыДиалогаЧатБота.Вставить("ДанныеДействия"					, СтрокаПланДействий);			
	ПараметрыДиалогаЧатБота.Вставить("ТаблицаКонтактов"					, ТаблицаКонтактов);	
	ПараметрыДиалогаЧатБота.Вставить("ПараметрыРегистрацииТриггера"		, СформироватьПараметрыРегистрацииТриггерногоСобытия(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра, ПараметрыДиалогаЧатБота));	
	
	Возврат ПараметрыДиалогаЧатБота;
	
КонецФункции	

// Функция - Инициализировать параметры объекта задача
//
// Параметры:
//  ДанныеТриггера							 - 	 - 
//  ДанныеОбъекта							 - 	 - 
//  ТаблицаВремениРаботыСтруктурнойЕдиницы	 - 	 - 
//  Период									 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПараметрыОбъектаЗадача(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра = Неопределено, ТаблицаВремениРаботыСтруктурнойЕдиницы, Период)
	
	Если ОбщегоНазначенияПовтИсп.ЭтоСеансРегламентногоЗадания() Тогда 
		Пользователь = ОбщегоНазначенияПовтИсп.ПолучитьСлужебногоСотрудника();
	Иначе 
		Пользователь = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	
	ПараметрыОбъектаЗадача = Новый Структура;
	ПараметрыОбъектаЗадача.Вставить("Период"						, Период);
	ПараметрыОбъектаЗадача.Вставить("ТриггерноеСобытие"				, ДанныеТриггера.ТриггерноеСобытие);	
	ПараметрыОбъектаЗадача.Вставить("СтруктурнаяЕдиница"			, ДанныеОбъекта.СтруктурнаяЕдиница); // ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ПараметрыОбъектаЗадача.Вставить("ЗадачаАвтор"					, Пользователь); 
	Если СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник ИЛИ СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников Тогда 
		ПараметрыОбъектаЗадача.Вставить("Исполнитель"				, СтрокаПланДействий.Адресат);
	ИначеЕсли СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.ВрачПриема Тогда 
		ПараметрыОбъектаЗадача.Вставить("Исполнитель"				, ДанныеОбъекта.Сотрудник);
	ИначеЕсли СтрокаПланДействий.ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда 
		Если ЗначениеЗаполнено(ДанныеОбъекта.Контрагент) Тогда
			Менеджер = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДанныеОбъекта.Контрагент, "Куратор");
			Если ЗначениеЗаполнено(Менеджер) Тогда 
				ПараметрыОбъектаЗадача.Вставить("Исполнитель"		, Менеджер);
			КонецЕсли;
		КонецЕсли;
		Если НЕ ПараметрыОбъектаЗадача.Свойство("Исполнитель") Тогда 
			ПараметрыОбъектаЗадача.Вставить("Исполнитель"			, СтрокаПланДействий.Адресат);
		КонецЕсли;
	КонецЕсли;
	ПараметрыОбъектаЗадача.Вставить("ВидВзаимодействияСправочник"	, СтрокаПланДействий.ЗадачаВидВзаимодействия);	
	ПараметрыОбъектаЗадача.Вставить("ВидВзаимодействия"				, ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаПланДействий.ЗадачаВидВзаимодействия, "ВидВзаимодействия"));		
	ПараметрыОбъектаЗадача.Вставить("Контрагент"					, ДанныеОбъекта.Контрагент);
	ПараметрыОбъектаЗадача.Вставить("ЗадачаПредмет"					, ДанныеОбъекта.ОбъектСобытия);			
	ПараметрыОбъектаЗадача.Вставить("ЗадачаТема"					, СтрокаПланДействий.Наименование);		
	ПараметрыОбъектаЗадача.Вставить("Наименование"					, ПараметрыОбъектаЗадача.ЗадачаТема + " (" + Строка(ПараметрыОбъектаЗадача.ВидВзаимодействияСправочник) + ")");			
	ПараметрыОбъектаЗадача.Вставить("ЗадачаОписание"				, ИнициализироватьСодержаниеСПараметрами(СтрокаПланДействий.ЗадачаОписание, СтрокаПланДействий, ДанныеОбъекта));
	ПараметрыОбъектаЗадача.Вставить("ЗадачаРежимНапоминания"		, СтрокаПланДействий.ЗадачаРежимНапоминания);	
	
	СтрокаВремяРаботы = ТаблицаВремениРаботыСтруктурнойЕдиницы.Найти(ДанныеОбъекта.СтруктурнаяЕдиница, "СтруктурнаяЕдиница");
	Если СтрокаВремяРаботы = Неопределено ИЛИ (СтрокаВремяРаботы.НачалоРаботы = Дата(1,1,1) И СтрокаВремяРаботы.ОкончаниеРаботы = Дата(1,1,1)) Тогда 
		ПараметрыОбъектаЗадача.Вставить("ЗадачаНазначеннаяДатаНачало"	, НачалоДня(ТекущаяДатаСеанса()) + (Час(ДанныеТриггера.ВремяСобытия)*60*60) + (Минута(ДанныеТриггера.ВремяСобытия)*60));
		ПараметрыОбъектаЗадача.Вставить("ЗадачаНазначеннаяДата"			, КонецДня(ПараметрыОбъектаЗадача.ЗадачаНазначеннаяДатаНачало + (?(СтрокаПланДействий.ЗадачаПериодВыполнения < 1, 1, СтрокаПланДействий.ЗадачаПериодВыполнения) - 1) * 24 * 60 * 60));	
	Иначе 
		Если СтрокаВремяРаботы.НачалоРаботы >= Дата(1,1,1) + (Час(ДанныеТриггера.ВремяСобытия)*60*60) + (Минута(ДанныеТриггера.ВремяСобытия)*60) Тогда 
			ПараметрыОбъектаЗадача.Вставить("ЗадачаНазначеннаяДатаНачало"	, НачалоДня(ТекущаяДатаСеанса()) + (Час(СтрокаВремяРаботы.НачалоРаботы)*60*60) + (Минута(СтрокаВремяРаботы.НачалоРаботы)*60));
		// ИначеЕсли СтрокаВремяРаботы.ОкончаниеРаботы <= Дата(1,1,1) + (Час(ДанныеТриггера.ВремяСобытия)*60*60) + (Минута(ДанныеТриггера.ВремяСобытия)*60) Тогда
		//	ПараметрыОбъектаЗадача.Вставить("ЗадачаНазначеннаяДатаНачало"	, НачалоДня(ТекущаяДатаСеанса()) + (Час(СтрокаВремяРаботы.ОкончаниеРаботы)*60*60) + (Минута(СтрокаВремяРаботы.ОкончаниеРаботы)*60));
		Иначе 	
			ПараметрыОбъектаЗадача.Вставить("ЗадачаНазначеннаяДатаНачало"	, НачалоДня(ТекущаяДатаСеанса()) + (Час(ДанныеТриггера.ВремяСобытия)*60*60) + (Минута(ДанныеТриггера.ВремяСобытия)*60));
		КонецЕсли;
		Если СтрокаВремяРаботы.ОкончаниеРаботы <= КонецДня(Дата(1,1,1) + (?(СтрокаПланДействий.ЗадачаПериодВыполнения < 1, 1, СтрокаПланДействий.ЗадачаПериодВыполнения) - 1) * 24 * 60 * 60) Тогда 
			ПараметрыОбъектаЗадача.Вставить("ЗадачаНазначеннаяДата"			, НачалоДня(ТекущаяДатаСеанса()) + ((?(СтрокаПланДействий.ЗадачаПериодВыполнения < 1, 1, СтрокаПланДействий.ЗадачаПериодВыполнения) - 1) * 24 * 60 * 60) + (Час(СтрокаВремяРаботы.ОкончаниеРаботы)*60*60) + (Минута(СтрокаВремяРаботы.ОкончаниеРаботы)*60));
		Иначе 
			ПараметрыОбъектаЗадача.Вставить("ЗадачаНазначеннаяДата"			, КонецДня(ПараметрыОбъектаЗадача.ЗадачаНазначеннаяДатаНачало + (?(СтрокаПланДействий.ЗадачаПериодВыполнения < 1, 1, СтрокаПланДействий.ЗадачаПериодВыполнения) - 1) * 24 * 60 * 60));	
		КонецЕсли;
		Если НачалоДня(ПараметрыОбъектаЗадача.ЗадачаНазначеннаяДатаНачало) = НачалоДня(ПараметрыОбъектаЗадача.ЗадачаНазначеннаяДата) И ПараметрыОбъектаЗадача.ЗадачаНазначеннаяДата - ПараметрыОбъектаЗадача.ЗадачаНазначеннаяДатаНачало = СтрокаВремяРаботы.ОкончаниеРаботы - СтрокаВремяРаботы.НачалоРаботы Тогда  	
			ПараметрыОбъектаЗадача.Вставить("ЗадачаНазначеннаяДата"			, НачалоДня(ТекущаяДатаСеанса()));
			ПараметрыОбъектаЗадача.Удалить("ЗадачаНазначеннаяДатаНачало");
		КонецЕсли;	
	КонецЕсли;	
	ПараметрыОбъектаЗадача.Вставить("ПараметрЖурналаРегистрации"	, "Взаимодействие." + ДанныеТриггера.Наименование);	
	ПараметрыОбъектаЗадача.Вставить("ДанныеТриггера"				, ДанныеТриггера);	
	ПараметрыОбъектаЗадача.Вставить("ДанныеОбъекта"					, ДанныеОбъекта);
	ПараметрыОбъектаЗадача.Вставить("ДанныеДействия"				, СтрокаПланДействий);	
	ПараметрыОбъектаЗадача.Вставить("ПараметрыРегистрацииТриггера"	, СформироватьПараметрыРегистрацииТриггерногоСобытия(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра, ПараметрыОбъектаЗадача));	
	
	Возврат ПараметрыОбъектаЗадача;
	
КонецФункции	

// Функция - Инициализировать параметры объекта сделка
//
// Параметры:
//  ПараметрыОбъектаДействия - 	 - 
//  ДанныеТриггера			 - 	 - 
//  ДанныеОбъекта			 - 	 - 
//  СозданиеСделки			 - 	 - 
//  Период					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПараметрыОбъектаСделка(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра = Неопределено, СозданиеСделки = Ложь, Период)
	
	Если ОбщегоНазначенияПовтИсп.ЭтоСеансРегламентногоЗадания() Тогда 
		Пользователь = ОбщегоНазначенияПовтИсп.ПолучитьСлужебногоСотрудника();
	Иначе 
		Пользователь = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	
	ПараметрыОбъектаДействия = Новый Структура;
	ПараметрыОбъектаДействия.Вставить("Период"						, Период);
	ПараметрыОбъектаДействия.Вставить("ТриггерноеСобытие"			, ДанныеТриггера.ТриггерноеСобытие);		
	ПараметрыОбъектаДействия.Вставить("ВидСделки"					, СтрокаПланДействий.ВидСделки);
	ПараметрыОбъектаДействия.Вставить("ДатаСделки"					, ПараметрыОбъектаДействия.Период);
	ПараметрыОбъектаДействия.Вставить("Контрагент"					, ДанныеОбъекта.Контрагент);
	Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПланЛеченияСозданиеПланаЛечения Тогда 
		ПараметрыОбъектаДействия.Вставить("ПланЛечения"				, ДанныеОбъекта.ПланЛечения);
		ПараметрыОбъектаДействия.Вставить("Врач"					, ДанныеОбъекта.Сотрудник);
	КонецЕсли;	
	Если СтрокаПланДействий.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда 
		ПараметрыОбъектаДействия.Вставить("Реализация"				, ДанныеОбъекта.ОбъектСобытия);
		ПараметрыОбъектаДействия.Вставить("РезультатСделки"			, Перечисления.РезультатыСделок.Успех);
		ПараметрыОбъектаДействия.Вставить("ДатаЗавершенияСделки"	, ПараметрыОбъектаДействия.Период);
		ПараметрыОбъектаДействия.Вставить("СуммаДокумента"			, ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДанныеОбъекта.ОбъектСобытия, "СуммаДокумента"));
	ИначеЕсли СтрокаПланДействий.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
		// ПараметрыОбъектаДействия.Вставить("ПричинаОтказа"		, ДанныеТриггера.);
		ПараметрыОбъектаДействия.Вставить("РезультатСделки"			, Перечисления.РезультатыСделок.Отказ);
		ПараметрыОбъектаДействия.Вставить("ДатаЗавершенияСделки"	, ПараметрыОбъектаДействия.Период);			
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДанныеОбъекта.СтруктурнаяЕдиница) Тогда 
		ПараметрыОбъектаДействия.Вставить("СтруктурнаяЕдиница"		, ДанныеОбъекта.СтруктурнаяЕдиница); 
	Иначе 
		ПараметрыОбъектаДействия.Вставить("СтруктурнаяЕдиница"		, Справочники.ВидыСделок.ПолучитьСтруктурнуюЕдиницуПримененияВидаСделки(СтрокаПланДействий.ВидСделки)); 
	КонецЕсли;	
	ПараметрыОбъектаДействия.Вставить("ЭтапСделки"					, СтрокаПланДействий.ЭтапСделки);
	ПараметрыОбъектаДействия.Вставить("Автор"						, Пользователь);
	ПараметрыОбъектаДействия.Вставить("Менеджер"					, ДанныеОбъекта.Контрагент.Куратор);
	ПараметрыОбъектаДействия.Вставить("Описание"					, "");	
	Если СозданиеСделки Тогда 
		ПараметрыОбъектаДействия.Вставить("Описание"				, "Сделка сгенерирована автоматически триггерным событием: " + СокрЛП(Строка(ДанныеТриггера.ТриггерноеСобытие)));
	ИначеЕсли СтрокаПланДействий.ЭтапСделки = Справочники.ЭтапыСделок.Успех ИЛИ СтрокаПланДействий.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
		ПараметрыОбъектаДействия.Вставить("Описание"				, "Сделка завершена автоматически триггерным событием: " + СокрЛП(Строка(ДанныеТриггера.ТриггерноеСобытие)));
	КонецЕсли;
	
	ПараметрыОбъектаДействия.Вставить("ПараметрЖурналаРегистрации"	, "Сделки." + ДанныеТриггера.Наименование);	
	ПараметрыОбъектаДействия.Вставить("ДанныеТриггера"				, ДанныеТриггера);	
	ПараметрыОбъектаДействия.Вставить("ДанныеОбъекта"				, ДанныеОбъекта);
	ПараметрыОбъектаДействия.Вставить("ДанныеДействия"				, СтрокаПланДействий);		
	ПараметрыОбъектаДействия.Вставить("ПараметрыРегистрацииТриггера", СформироватьПараметрыРегистрацииТриггерногоСобытия(ДанныеТриггера, ДанныеОбъекта, СтрокаПланДействий, СтрокаРеестра, ПараметрыОбъектаДействия));	
	
	Возврат ПараметрыОбъектаДействия;
	
КонецФункции	

// Функция - Сформировать параметры регистрации триггерного события
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  ДанныеОбъекта			 - 	 - 
//  ПараметрыОбъектаЗадача	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьПараметрыРегистрацииТриггерногоСобытия(ДанныеТриггера, ДанныеОбъекта = Неопределено, ДанныеДействия = Неопределено, СтрокаРеестра = Неопределено, ПараметрыГенерируемогоОбъекта)
	
	ПараметрыРегистрацииТриггера = Новый Структура();
	ПараметрыРегистрацииТриггера.Вставить("ОбъектГенерации"							, Неопределено);
	
	ПараметрыРегистрацииТриггера.Вставить("Период"									, ПараметрыГенерируемогоОбъекта.Период);
	ПараметрыРегистрацииТриггера.Вставить("ТриггерноеСобытие"						, ДанныеТриггера.ТриггерноеСобытие);
	ПараметрыРегистрацииТриггера.Вставить("Контрагент"								, Справочники.Контрагенты.ПустаяСсылка());
	ПараметрыРегистрацииТриггера.Вставить("ОбъектСобытия"							, Неопределено);
	ПараметрыРегистрацииТриггера.Вставить("ИсточникСобытия"							, Неопределено);			
	ПараметрыРегистрацииТриггера.Вставить("ИдентификаторДействия"					, ?(ДанныеДействия = Неопределено, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"), ДанныеДействия.ИдентификаторДействия));
	ПараметрыРегистрацииТриггера.Вставить("РегистрацияПоПодписке"					, Ложь);	
	ПараметрыРегистрацииТриггера.Вставить("Описание"								, ?(ДанныеДействия = Неопределено, "", ДанныеДействия.Описание));
	ПараметрыРегистрацииТриггера.Вставить("Сообщение"								, ?(ДанныеДействия = Неопределено, "", ДанныеДействия.Сообщение));
	
	Если ДанныеОбъекта = Неопределено Тогда 
		ПараметрыРегистрацииТриггера.Вставить("Статус"								, Перечисления.СтатусыРегистрацииСобытий.Отклонено);
		ПараметрыРегистрацииТриггера.Вставить("РегистрацияЗапланированных"			, Ложь);				
	Иначе
		ПараметрыРегистрацииТриггера.Вставить("РегистрацияЗапланированных"			, ДанныеОбъекта.РегистрацияЗапланированных);		
		Если ДанныеОбъекта.РегистрацияЗапланированных Тогда 
			Если НЕ СтрокаРеестра = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ПараметрыРегистрацииТриггера, СтрокаРеестра);
				ПараметрыРегистрацииТриггера.Вставить("Статус"						, Перечисления.СтатусыРегистрацииСобытий.Зарегистрировано);
			Иначе 	
				// МассивСтрокРеестра = ДанныеТриггера.РеестрЗапланированных.НайтиСтроки(Новый Структура("ТриггерноеСобытие, ОбъектСобытия, Контрагент, Подтверждено", ДанныеТриггера.ТриггерноеСобытие, ДанныеОбъекта.ОбъектСобытия, ДанныеОбъекта.Контрагент, Истина));
				// Если МассивСтрокРеестра.Количество() <> 0 Тогда
				//	ЗаполнитьЗначенияСвойств(ПараметрыРегистрацииТриггера, МассивСтрокРеестра[0]);					
				//	ПараметрыРегистрацииТриггера.Вставить("Статус"					, Перечисления.СтатусыРегистрацииСобытий.Зарегистрировано);
				// Иначе 
					ПараметрыРегистрацииТриггера = Неопределено;
				// КонецЕсли;
			КонецЕсли;
		Иначе 	
			ПараметрыРегистрацииТриггера.Вставить("Период"							, ПараметрыГенерируемогоОбъекта.Период);
			ПараметрыРегистрацииТриггера.Вставить("ТриггерноеСобытие"				, ДанныеТриггера.ТриггерноеСобытие);
			ПараметрыРегистрацииТриггера.Вставить("Контрагент"						, ДанныеОбъекта.Контрагент);
			ПараметрыРегистрацииТриггера.Вставить("ОбъектСобытия"					, ДанныеОбъекта.ОбъектСобытия);
			Если ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияВыписаноНаправление ИЛИ ДанныеТриггера.УсловиеСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ЛистОжиданияПрофосмотр Тогда
				ПараметрыРегистрацииТриггера.Вставить("ИсточникСобытия"				, ДанныеОбъекта.ИсточникСобытия);
			КонецЕсли;				
			ПараметрыРегистрацииТриггера.Вставить("ИдентификаторДействия"			, ДанныеДействия.ИдентификаторДействия);
			ПараметрыРегистрацииТриггера.Вставить("РегистрацияПоПодписке"			, ДанныеОбъекта.РегистрацияПоПодписке);
			ПараметрыРегистрацииТриггера.Вставить("Статус"							, Перечисления.СтатусыРегистрацииСобытий.Зарегистрировано);
		КонецЕсли;
	КонецЕсли;

	Возврат ПараметрыРегистрацииТриггера;
	
КонецФункции

// Процедура - Выполнить отправку SMS
//
// Параметры:
//  ПараметрыSMSОбъекта	 - 	 - 
//
Процедура ВыполнитьОтправкуСообщений(ПараметрыSMSОбъекта)
	
	Если ПараметрыSMSОбъекта.ПараметрыРегистрацииТриггера = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументРассылки 							= Документы.РассылкаСообщений.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокументРассылки, ПараметрыSMSОбъекта);
	ДокументРассылки.Дата 						= ПараметрыSMSОбъекта.Период;
	
	ЭтоПуш 			= Ложь;
	ЭтоМессенджер 	= Ложь;
	Для Каждого СтрокаКонтакт Из ПараметрыSMSОбъекта.ТаблицаКонтактов Цикл
		Если ДокументРассылки.Получатели.НайтиСтроки(Новый Структура("Получатель, НомерТелефона", СтрокаКонтакт.Получатель, СтрокаКонтакт.НомерТелефона)).Количество() = 0 Тогда 
			НоваяСтрока 						= ДокументРассылки.Получатели.Добавить();
			НоваяСтрока.Получатель 				= СтрокаКонтакт.Получатель;
			НоваяСтрока.НомерТелефона 			= СтрокаКонтакт.НомерТелефона;
			Если НЕ ЗначениеЗаполнено(ПараметрыSMSОбъекта.СервисSMSРассылки) И ЗначениеЗаполнено(СтрокаКонтакт.СервисРассылки) Тогда 
				ПараметрыSMSОбъекта.СервисSMSРассылки = СтрокаКонтакт.СервисРассылки;
			КонецЕсли;	
			НоваяСтрока.СервисРассылки 			= СтрокаКонтакт.СервисРассылки; // ПараметрыSMSОбъекта.СервисSMSРассылки;
			Если ЗначениеЗаполнено(НоваяСтрока.СервисРассылки) И ТипЗнч(НоваяСтрока.СервисРассылки) = Тип("СправочникСсылка.ВнешниеСистемы") Тогда 
				ТипВнешнейСистемы 	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(НоваяСтрока.СервисРассылки, "ТипВнешнейСистемы");
				Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi ИЛИ ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда 
					ЭтоМессенджер 	= Истина;
				ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet Тогда
					ЭтоПуш 			= Истина;
				КонецЕсли;	
			КонецЕсли;	
			Если ЗначениеЗаполнено(СтрокаКонтакт.КаналСистемыСообщений) Тогда 
				НоваяСтрока.ИдКанала			= СтрокаКонтакт.КаналСистемыСообщений;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ДокументРассылки.СервисSMSРассылки 			= ПараметрыSMSОбъекта.СервисSMSРассылки;
	
	Если ЭтоПуш Тогда
		ДокументРассылки.Тип 					= Перечисления.ТипыСобытий.ПушУведомление;		
		Если ЗначениеЗаполнено(СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.СодержаниеPush)) Тогда
			СодержаниеСообщения 				= СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.СодержаниеPush);
		ИначеЕсли ЗначениеЗаполнено(СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.СодержаниеМессенджер)) Тогда
			СодержаниеСообщения 				= СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.СодержаниеМессенджер);// СтруктураСодержания.СодержаниеМессенджерHTML;//;
		Иначе 
			СодержаниеСообщения 				= СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.Содержание);
		КонецЕсли;	
		ДокументРассылки.Содержание 			= ИнициализироватьСодержаниеСПараметрами(СодержаниеСообщения, ПараметрыSMSОбъекта.ДанныеДействия, ПараметрыSMSОбъекта.ДанныеОбъекта);
	ИначеЕсли ЭтоМессенджер Тогда
		ДокументРассылки.Тип 					= Перечисления.ТипыСобытий.Мессенджер;				
		Если ЗначениеЗаполнено(СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.СодержаниеМессенджер)) Тогда
			СодержаниеСообщения 				= СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.СодержаниеМессенджер);
		ИначеЕсли ЗначениеЗаполнено(СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.СодержаниеPush)) Тогда
			СодержаниеСообщения 				= СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.СодержаниеPush);// СтруктураСодержания.СодержаниеМессенджерHTML;//;
		Иначе 
			СодержаниеСообщения 				= СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.Содержание);
		КонецЕсли;	
		ДокументРассылки.Содержание 			= ИнициализироватьСодержаниеСПараметрами(СодержаниеСообщения, ПараметрыSMSОбъекта.ДанныеДействия, ПараметрыSMSОбъекта.ДанныеОбъекта);
	Иначе 
		СодержаниеСообщения 					= СокрЛП(ПараметрыSMSОбъекта.ДанныеДействия.Содержание);
		ДокументРассылки.Содержание 			= ИнициализироватьСодержаниеСПараметрами(СодержаниеСообщения, ПараметрыSMSОбъекта.ДанныеДействия, ПараметрыSMSОбъекта.ДанныеОбъекта);		
	КонецЕсли;	
	
	ДокументРассылки.ШаблонСообщения 			= ПараметрыSMSОбъекта.ДанныеДействия.ШаблонСообщения;
	
	Если ДокументРассылки.Получатели.Количество() = 1 Тогда 
		ДокументРассылки.ВидОперации 			= Перечисления.ВидОперацииОтправкаSMS.ОтправкаSMSПолучателю;
	Иначе
		ДокументРассылки.ВидОперации 			= Перечисления.ВидОперацииОтправкаSMS.МассоваяРассылкаSMS;
	КонецЕсли;
	
	ДокументРассылки.ДополнительныеСвойства.Вставить("ПараметрыРегистрацииТриггера", ПараметрыSMSОбъекта.ПараметрыРегистрацииТриггера);
	Попытка
		ДокументРассылки.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ДокументРассылки.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
		
КонецПроцедуры

// Функция - Запустить сценарий чат бота
//
// Параметры:
//  ПараметрыДиалогаЧатБота	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗапуститьСценарийЧатБота(ПараметрыДиалогаЧатБота)
	
	ПараметрыДиалогаЧатБота.Вставить("СтартСценария", Истина);
	Справочники.СценарииЧатБотов.ВыполнитьЭтапСценария(ПараметрыДиалогаЧатБота);	
	
	Возврат ПараметрыДиалогаЧатБота;
	
КонецФункции

// Процедура - Отправить электронное письмо
//
// Параметры:
//  ПараметрыEmailОбъекта	 - 	 - 
//
Процедура ОтправитьЭлектронноеПисьмо(ПараметрыEmailОбъекта, ОписаниеОшибки)
	
	Если ПараметрыEmailОбъекта.ПараметрыРегистрацииТриггера = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки 			= "";
	ДополнительноеСообщение = "";
	
	Если НЕ ЗначениеЗаполнено(ПараметрыEmailОбъекта.УчетнаяЗапись) Тогда 
		ОписаниеОшибки = НСтр("ru= 'Не выбрана учетная запись электронной почты';en= 'No email account selected'");
		Возврат;
	КонецЕсли;
	
	// Актуализируем флаг активности учетной записи
	УчетнаяЗаписьИспользуетсяДляОтправки = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ПараметрыEmailОбъекта.УчетнаяЗапись, "ИспользоватьДляОтправки");
	
	// Уходим, если не активна
	Если УчетнаяЗаписьИспользуетсяДляОтправки = Ложь Тогда 
		ОписаниеОшибки = НСтр("ru= 'Выбранная учетная запись электронной почты не используется для отправки электронных писем';en= 'The selected email account is not used to send emails'");
		Возврат;
	КонецЕсли;
	
	// Проверим авторизацию и актуализируем активность учетной записи
	РаботаСПочтовымиСообщениямиСлужебный.ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты(ПараметрыEmailОбъекта.УчетнаяЗапись, ОписаниеОшибки, ДополнительноеСообщение);
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		КомментарийУчетнойЗаписи = НСтр("ru= 'Учетная запись электронной почты деактивирована автоматически триггерным событием при попытке авторизации перед отправкой сообщения. Проверьте настройки учетной записи.';en= 'The email account is deactivated automatically by a trigger event when attempting to log in before sending the message. Check your account settings.'");
		Справочники.УчетныеЗаписиЭлектроннойПочты.ОбновитьАктивностьУчетнойЗаписиЭлектроннойПочты(ПараметрыEmailОбъекта.УчетнаяЗапись, Ложь, Ложь, КомментарийУчетнойЗаписи);	
		Возврат;
	КонецЕсли;
	
	ИсходящееЭлектронноеПисьмо 					= Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Дата           	= ПараметрыEmailОбъекта.Период;
	ЗаполнитьЗначенияСвойств(ИсходящееЭлектронноеПисьмо, ПараметрыEmailОбъекта);
	
	Для Каждого СтрокаКонтакт Из ПараметрыEmailОбъекта.ТаблицаКонтактов Цикл
		СтрокаТЧ = ИсходящееЭлектронноеПисьмо.ПолучателиПисьма.Добавить();
		СтрокаТЧ.Адрес = СтрокаКонтакт.Адрес;
		ИсходящееЭлектронноеПисьмо.СписокПолучателейПисьма = ИсходящееЭлектронноеПисьмо.СписокПолучателейПисьма + "," + СтрокаКонтакт.Получатель + " <" + СтрокаКонтакт.Адрес + "> ";
	КонецЦикла;
	
	ИсходящееЭлектронноеПисьмо.СписокПолучателейПисьма = Сред(ИсходящееЭлектронноеПисьмо.СписокПолучателейПисьма, 2, СтрДлина(ИсходящееЭлектронноеПисьмо.СписокПолучателейПисьма));
	
	ИсходящееЭлектронноеПисьмо.ДополнительныеСвойства.Вставить("ПараметрыРегистрацииТриггера", ПараметрыEmailОбъекта.ПараметрыРегистрацииТриггера);
	УровеньЖурналаРегистрацииКоллизии = Неопределено;
	
	Для Каждого Элемент из ИсходящееЭлектронноеПисьмо.ТриггерноеСобытие.Действия Цикл
		Если ИсходящееЭлектронноеПисьмо.Тема = Элемент.ШаблонСообщения.Наименование Тогда
			ИсходящееЭлектронноеПисьмо.ШаблонСообщения = Элемент.ШаблонСообщения;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ИсходящееЭлектронноеПисьмо, ОписаниеОшибки, , , УровеньЖурналаРегистрацииКоллизии);
	
	Если Не Результат Тогда
		Отказ = Истина;
		ЗаписьЖурналаРегистрации(ПараметрыEmailОбъекта.ПараметрЖурналаРегистрации, ?(УровеньЖурналаРегистрацииКоллизии = Неопределено, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрацииКоллизии),
		ПараметрыEmailОбъекта.ДанныеТриггера.ТриггерноеСобытие.Метаданные(), ПараметрыEmailОбъекта.ДанныеОбъекта.ОбъектСобытия, ОписаниеОшибки);
	ИначеЕсли НЕ ИсходящееЭлектронноеПисьмо.Проведен Тогда 
		Попытка
			ИсходящееЭлектронноеПисьмо.ОбменДанными.Загрузка = Истина;
			ИсходящееЭлектронноеПисьмо.Записать(РежимЗаписиДокумента.Запись);
		Исключение
		КонецПопытки;	
	КонецЕсли; 		
	
КонецПроцедуры

// Процедура - Создать задачу
//
// Параметры:
//  ПараметрыОбъектаЗадача	 - 	 - 
//
Процедура СоздатьЗадачу(ПараметрыОбъектаЗадача)
	
	Если ПараметрыОбъектаЗадача.ПараметрыРегистрацииТриггера = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Задача_Объект = Задачи.Взаимодействие.СоздатьЗадачу();
	Задача_Объект.Заполнить(ПараметрыОбъектаЗадача);
	ЗаполнитьЗначенияСвойств(Задача_Объект, ПараметрыОбъектаЗадача);
	// Заполним параметры напоминания		
	Задачи.Взаимодействие.ЗаполнитьПараметрыНапоминания(Задача_Объект, ПараметрыОбъектаЗадача);			
	Задача_Объект.ДополнительныеСвойства.Вставить("ПараметрыРегистрацииТриггера", ПараметрыОбъектаЗадача.ПараметрыРегистрацииТриггера);			
	Задача_Объект.Записать();
	
КонецПроцедуры

// Процедура - Создать сделку
//
// Параметры:
//  ПараметрыОбъектаДействия - 	 - 
//
Процедура СоздатьСделку(ПараметрыОбъектаДействия)
	
	Если ПараметрыОбъектаДействия.ПараметрыРегистрацииТриггера = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Сделка_Объект = Справочники.Сделки.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Сделка_Объект, ПараметрыОбъектаДействия);
	Сделка_Объект.Врач = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОбъектаДействия, "Врач", Сделка_Объект.Врач);
	Сделка_Объект.ДополнительныеСвойства.Вставить("ПараметрыРегистрацииТриггера", ПараметрыОбъектаДействия.ПараметрыРегистрацииТриггера);			
	Сделка_Объект.Записать();
	
КонецПроцедуры

// Процедура - Установить этап сделке
//
// Параметры:
//  ТекущаяСделка			 - 	 - 
//  ЭтапСделки				 - 	 - 
//  ПараметрыОбъектаДействия - 	 - 
//
Процедура УстановитьЭтапСделке(ТекущаяСделка, ЭтапСделки, ПараметрыОбъектаДействия)
	
	Если ПараметрыОбъектаДействия.ПараметрыРегистрацииТриггера = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Сделка_Объект 				= ТекущаяСделка.ПолучитьОбъект();
	Сделка_Объект.ЭтапСделки 	= ЭтапСделки;
	Если ПараметрыОбъектаДействия.Свойство("РезультатСделки") Тогда
		Сделка_Объект.РезультатСделки = ПараметрыОбъектаДействия.РезультатСделки;
		Сделка_Объект.ДатаЗавершенияСделки = ПараметрыОбъектаДействия.ДатаЗавершенияСделки;
		Если ПараметрыОбъектаДействия.РезультатСделки = Перечисления.РезультатыСделок.Успех Тогда 
			Сделка_Объект.Реализация 	= ПараметрыОбъектаДействия.Реализация;
			Сделка_Объект.СуммаСделки 	= ПараметрыОбъектаДействия.СуммаДокумента;
		ИначеЕсли ПараметрыОбъектаДействия.РезультатСделки = Перечисления.РезультатыСделок.Отказ Тогда 
			// Сделка_Объект.ПричинаОтказа = ПараметрыОбъектаДействия.ПричинаОтказа;
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Сделка_Объект.ПланЛечения) Тогда 
		Сделка_Объект.ПланЛечения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОбъектаДействия, "ПланЛечения", Сделка_Объект.ПланЛечения);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Сделка_Объект.Врач) Тогда 
		Сделка_Объект.Врач = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОбъектаДействия, "ПланЛечения", Сделка_Объект.ПланЛечения);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ПараметрыОбъектаДействия.Описание) Тогда 
		Сделка_Объект.Описание = Сделка_Объект.Описание + ?(ЗначениеЗаполнено(СокрЛП(Сделка_Объект.Описание)), Символы.ПС, "") + ПараметрыОбъектаДействия.Описание;
	КонецЕсли;	
	Сделка_Объект.ДополнительныеСвойства.Вставить("ПараметрыРегистрацииТриггера", ПараметрыОбъектаДействия.ПараметрыРегистрацииТриггера);			
	Сделка_Объект.Записать();
	
КонецПроцедуры

// Процедура - Установить параметры сообщений для триггерных действий
//
// Параметры:
//  Запрос	 - 	 - 
//
Процедура УстановитьПараметрыСообщенийДляТриггерныхДействий(Запрос)
	
	Запрос.УстановитьПараметр("ПользовательПометилНаУдалениеТриггер"					, НСтр("ru='Пользователь пометил на удаление триггер.';en='The user marked the trigger for deletion.'"));
	Запрос.УстановитьПараметр("ПользовательДеактивировалТриггер"						, НСтр("ru='Пользователь деактивировал триггер.';en='The user activated the trigger.'"));	
	Запрос.УстановитьПараметр("ПользовательДеактивировалДействие"						, НСтр("ru='Пользователь деактивировал действие.';en='The user deactivated the action.'"));
	Запрос.УстановитьПараметр("ПользовательНеУказалВидДействия"							, НСтр("ru='Пользователь не указал вид действия.';en='The user did not specify the type of action.'"));
	Запрос.УстановитьПараметр("ПользовательУдалилДействие"								, НСтр("ru='Пользователь удалил действие.';en='The user deleted the action.'"));
	Запрос.УстановитьПараметр("ПользовательДобавилДействиеВПланПослеМоментаПланирования", НСтр("ru='Пользователь добавил действие в план после события.';en='The user added an action to the plan after the event.'"));	
	Запрос.УстановитьПараметр("КлиентУдаленИзСоставаЗанятия"							, НСтр("ru='Клиент удален из состава занятия.';en='The client was removed from the class.'"));
	Запрос.УстановитьПараметр("ПосещениеОтменено"										, НСтр("ru='Посещение отменено.';en='Visit canceled.'"));
	Запрос.УстановитьПараметр("ЗанятиеОтменено"											, НСтр("ru='Занятие отменено.';en='Class canceled.'"));
	Запрос.УстановитьПараметр("КлиентОтменилВизит"										, НСтр("ru='Клиент отменил визит.';en='The client canceled the session.'"));
	Запрос.УстановитьПараметр("ЗанятиеВновьАктуально"									, НСтр("ru='Занятие вновь актуально.';en='The lesson is relevant again.'"));
	Запрос.УстановитьПараметр("НеАктуально"												, НСтр("ru='Не актуально.';en='No longer relevant.'"));
	
КонецПроцедуры

// Функция - Получить актуальную задачу прошлого СРМ
//
// Параметры:
//  ПараметрыОбъектаЗадача	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьАктуальнуюЗадачуПрошлогоСРМ(ПараметрыОбъектаЗадача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Взаимодействие.Ссылка КАК Ссылка
	               |ИЗ
	               |	Задача.Взаимодействие КАК Взаимодействие
	               |ГДЕ
	               |	Взаимодействие.ТриггерноеСобытие = &ТриггерноеСобытие
	               |	И Взаимодействие.Контрагент = &Контрагент
	               |	И Взаимодействие.ЗадачаПредмет = &ЗадачаПредмет
	               |	И Взаимодействие.КодСинхронизации <> &КодСинхронизации";
	
	Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ПараметрыОбъектаЗадача.ДанныеТриггера.ТриггерноеСобытие);
	Запрос.УстановитьПараметр("Контрагент"			, ПараметрыОбъектаЗадача.Контрагент);
	Запрос.УстановитьПараметр("ЗадачаПредмет"		, ПараметрыОбъектаЗадача.ЗадачаПредмет);
	Запрос.УстановитьПараметр("КодСинхронизации"	, "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция - Инициализировать содержание с параметрами
//
// Параметры:
//  Содержание		 - 	 - 
//  ДанныеТриггера	 - 	 - 
//  ДанныеОбъекта	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСодержаниеСПараметрами(ЗНАЧ Содержание, ДанныеДействия, ДанныеОбъекта)
	
	Если ДанныеДействия.ТаблицаЗадействованныхПараметров = Неопределено ИЛИ ДанныеДействия.ТаблицаЗначенийПараметров = Неопределено Тогда 
		Возврат Содержание;
	КонецЕсли;
	
	МассивСтрокЗначений = ДанныеДействия.ТаблицаЗначенийПараметров.НайтиСтроки(Новый Структура("Контрагент, ОбъектСобытия", ДанныеОбъекта.Контрагент, ДанныеОбъекта.ОбъектСобытия));
	
	Если МассивСтрокЗначений.Количество() = 0 Тогда 
		Возврат Содержание;
	КонецЕсли;	
		         
	Для Каждого СтрокаЗадействованныйПараметр ИЗ ДанныеДействия.ТаблицаЗадействованныхПараметров Цикл
		Если СтрокаЗадействованныйПараметр.ИзОсновнойТаблицы И СтрокаЗадействованныйПараметр.ИнициализированВИсходнойТаблице = Ложь Тогда 
			ЗначениеПарметра = МассивСтрокЗначений[0][СтрСоединить(СтрРазделить(СтрокаЗадействованныйПараметр.НаименованиеПараметра, " {}")) + СтрокаЗадействованныйПараметр.ОсновнаяТаблицаОбъекта];
		ИначеЕсли ДанныеДействия.ТаблицаЗначенийПараметров.Колонки.Найти(СтрокаЗадействованныйПараметр.РеквизитПараметра) <> Неопределено Тогда 	
			ЗначениеПарметра = МассивСтрокЗначений[0][СтрокаЗадействованныйПараметр.РеквизитПараметра];
		ИначеЕсли СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{Email}" Тогда 
			ЗначениеПарметра = Справочники.Контрагенты.ПолучитьEmailКонтрагента(ДанныеОбъекта.Контрагент);
		ИначеЕсли СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{ПолныйАдресКлиники}" Тогда 
			ЗначениеПарметра = Справочники.СтруктурныеЕдиницы.ПолучитьАдресСтруктурнойЕдиницы(ДанныеОбъекта.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ИначеЕсли СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{КороткийАдресКлиники}" Тогда 
			ЗначениеПарметра = Справочники.СтруктурныеЕдиницы.ПолучитьАдресСтруктурнойЕдиницы(ДанныеОбъекта.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.КороткийАдресСтруктурнойЕдиницы);			
		ИначеЕсли СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{ЯндексКарты}" Тогда 
			ЗначениеПарметра = Справочники.СтруктурныеЕдиницы.ПолучитьЯндексКартыСтруктурнойЕдиницы(ДанныеОбъекта.СтруктурнаяЕдиница);	
		ИначеЕсли СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{ЯндексОтзывы}" Тогда 
			ЗначениеПарметра = Справочники.СтруктурныеЕдиницы.ПолучитьЯндексОтзывыСтруктурнойЕдиницы(ДанныеОбъекта.СтруктурнаяЕдиница);	
		ИначеЕсли СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{СайтКлиники}" Тогда 
			ЗначениеПарметра = Справочники.СтруктурныеЕдиницы.ПолучитьСайтСтруктурнойЕдиницы(ДанныеОбъекта.СтруктурнаяЕдиница);	
		ИначеЕсли СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{ОценкаПриема}" И ДанныеДействия.ТаблицаЗначенийПараметров.Колонки.Найти("Прием") <> Неопределено Тогда 
			ЗначениеПараметра = РегистрыСведений.ОценкиПриемов.ПолучитьОценкуПриема(ДанныеОбъекта.Прием);
			// Если ЗначениеЗаполнено(ЗначениеПараметра) ИЛИ ТипЗнч(ЗначениеПараметра) = Тип("Число") Тогда 
			//	ЗначениеПараметра = ПолучитьСклоненияСтрокиПоЧислу("балл", ЗначениеПараметра, , "ЧС=Количественное", "ПД=Родительный");
			// КонецЕсли;				
		Иначе 
			ЗначениеПарметра = Null;
		КонецЕсли;
		Если ЗначениеПарметра = Null Тогда 
			ЗначениеПарметра = "";
		ИначеЕсли НЕ ЗначениеЗаполнено(ЗначениеПарметра) И НЕ ТипЗнч(ЗначениеПарметра) = Тип("Число") И НЕ ТипЗнч(ЗначениеПарметра) = Тип("Дата") Тогда 
			ЗначениеПарметра = "";
		ИначеЕсли СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{ОценкаПриема}" И (ЗначениеЗаполнено(ЗначениеПараметра) ИЛИ ТипЗнч(ЗначениеПараметра) = Тип("Число")) Тогда 
			ЗначениеПараметра = ПолучитьСклоненияСтрокиПоЧислу("балл", ЗначениеПараметра, , "ЧС=Количественное", "ПД=Именительный")[0];			
		КонецЕсли;
		// Распарсим идентификатор
		Если ЗначениеЗаполнено(ЗначениеПарметра) И СтрокаЗадействованныйПараметр.НаименованиеПараметра = "{ИдентификаторКонференции}" Тогда
			ЗначениеПарметра = ПолучитьИдентификаторКонференцииПоСсылке(ЗначениеПарметра);
		КонецЕсли;	
		Содержание = СтрЗаменить(Содержание, СтрокаЗадействованныйПараметр.НаименованиеПараметра, СокрЛП(?(ЗначениеЗаполнено(СтрокаЗадействованныйПараметр.ФорматПараметра), Формат(ЗначениеПарметра, СтрокаЗадействованныйПараметр.ФорматПараметра), Строка(ЗначениеПарметра))));
	КонецЦикла;	
	
	Возврат СокрЛП(Содержание);
	
КонецФункции

// Функция - Преобразовать в структуру
//
// Параметры:
//  ДанныеТриггера	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПреобразоватьВСтруктуру(ДанныеТриггера)
	        
	СтруктураДанныхТриггера = Новый Структура();
	СтруктураДанныхТриггера.Вставить("ТриггерноеСобытие"									, Неопределено);
	СтруктураДанныхТриггера.Вставить("УсловиеСобытия"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("ПараметрСобытия"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("МоментСобытия"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("ПериодСобытияВид"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("ПериодСобытия"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("ВремяСобытия"											, Неопределено);
	СтруктураДанныхТриггера.Вставить("СтруктурнаяЕдиница"									, Неопределено);
	СтруктураДанныхТриггера.Вставить("СегментКонтрагентов"									, Неопределено);
	СтруктураДанныхТриггера.Вставить("СегментУслуг"											, Неопределено);
	СтруктураДанныхТриггера.Вставить("ВидСделки"											, Неопределено);
	СтруктураДанныхТриггера.Вставить("ВидЛицевогоСчета"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("ВидБонусногоСчета"									, Неопределено);		
	СтруктураДанныхТриггера.Вставить("ПереходСЭтапа"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("ПереходНаЭтап"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("ТипПолиса"											, Неопределено);
	СтруктураДанныхТриггера.Вставить("СтатусПациентаПриема"									, Неопределено);
	СтруктураДанныхТриггера.Вставить("РезультатПриема"										, Неопределено);		
	СтруктураДанныхТриггера.Вставить("СтатусЗаписи"											, Неопределено);		
	СтруктураДанныхТриггера.Вставить("ИсточникЗаписи"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("Наименование"											, Неопределено);
	СтруктураДанныхТриггера.Вставить("КодСинхронизации"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("ПланДействийТриггерногоСобытия"						, Неопределено);
	СтруктураДанныхТриггера.Вставить("ТаблицаНекондиционныхДействий"						, Неопределено);	
	СтруктураДанныхТриггера.Вставить("ПараметрыШаблона"										, Неопределено);
	СтруктураДанныхТриггера.Вставить("МассивНеобработанныхКонтрагентов"						, Неопределено);
	СтруктураДанныхТриггера.Вставить("РеестрЗапланированных"								, Неопределено);
	
	ЗаполнитьЗначенияСвойств(СтруктураДанныхТриггера, ДанныеТриггера);
	
	Возврат СтруктураДанныхТриггера;	
	
КонецФункции

// Функция - Получить идентификатор конференции по ссылке
//
// Параметры:
//  СсылкаНаКонференцию	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьИдентификаторКонференцииПоСсылке(СсылкаНаКонференцию)
	
	ИдентификаторКонференции = "";

	МассивЧастейСсылки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СсылкаНаКонференцию, "/");
	Если МассивЧастейСсылки.Количество() = 0 Тогда 
		ИдентификаторКонференции = "";
	Иначе 
		Если СтрДлина(МассивЧастейСсылки[МассивЧастейСсылки.Количество() - 1]) = 9 Тогда 
			ИдентификаторКонференции = МассивЧастейСсылки[МассивЧастейСсылки.Количество() - 1];
		ИначеЕсли МассивЧастейСсылки.Количество() > 1 И СтрДлина(МассивЧастейСсылки[МассивЧастейСсылки.Количество() - 2]) = 9 Тогда
			ИдентификаторКонференции = МассивЧастейСсылки[МассивЧастейСсылки.Количество() - 2];
		ИначеЕсли МассивЧастейСсылки.Количество() > 2 И СтрДлина(МассивЧастейСсылки[МассивЧастейСсылки.Количество() - 3]) = 9 Тогда
			ИдентификаторКонференции = МассивЧастейСсылки[МассивЧастейСсылки.Количество() - 3];
		Иначе 
			ИдентификаторКонференции = "";
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат СокрЛП(ИдентификаторКонференции);
	
КонецФункции

// Функция - Вернуть статус клиента
//
// Параметры:
//  Контрагент	 - 	 - 
//  Период		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьСтатусКлиента(Контрагент, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыКонтрагентов.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	               |ГДЕ
	               |	СтатусыКонтрагентов.Период = &Период
	               |	И СтатусыКонтрагентов.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Период"		, Период);
	Запрос.УстановитьПараметр("Контрагент"	, Контрагент);
	
	ВыборкаСтатусов = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаСтатусов.Следующий() Тогда 
		Возврат ВыборкаСтатусов.Статус;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;		
	
КонецФункции

// Функция - Получить данные оперции СЧПУ
//
// Параметры:
//  ДокументОперация - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеОперцииСЧПУ(ДокументОперация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОперация", );
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЧленствПакетовУслуг.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	|	СтатусыЧленствПакетовУслуг.ЧленствоПакетУслуг.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.СтатусыЧленствПакетовУслуг КАК СтатусыЧленствПакетовУслуг
	|ГДЕ
	|	СтатусыЧленствПакетовУслуг.Регистратор = &ДокументОперация";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура - Инициализация внешней системы оценок и отзывов
//
// Параметры:
//  АктивироватьСистему	 - 	 - 
//
Процедура ИнициализацияВнешнейСистемыОценокИОтзывов(АктивироватьСистему = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.ОценкиИОтзывы, Ложь); 
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда			
		ВнешняяСистема = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(Перечисления.ТипыВнешнихСистем.ОценкиИОтзывы,,Истина);
	КонецЕсли;
	
	Если ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВнешняяСистема, "Используется") = Ложь И АктивироватьСистему <> Неопределено И АктивироватьСистему = Истина Тогда 
		ВлкОтклВС = ВнешняяСистема.ПолучитьОбъект();
		Если АктивироватьСистему = Неопределено Тогда 
			АктивироватьСистему = Константы.УдалитьИнформироватьОбОценкеЗанятия.Получить();
		КонецЕсли;	
		Если АктивироватьСистему Тогда
			ВлкОтклВС.Используется 	= Истина;
			УидСессии        		= ЛичныйКабинет.УидТекущейСессии();
			Справочники.ВнешниеСистемы.ПодключитьВнешнююСистему(ВнешняяСистема, Ложь, УидСессии);
		Иначе
			ВлкОтклВС.Используется = Ложь;
		КонецЕсли;
		ВлкОтклВС.Записать();
	КонецЕсли;

КонецПроцедуры

#Область ______________ФУНКЦИИ_ПОЛУЧЕНИЯ_ДАННЫХ_ДЛЯ_РЕГИСТРАЦИИ______________

// Функция - Получить данные события пациент регистрация
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ПациентРегистрация(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ
		
		Запрос.УстановитьПараметр("ТриггерноеСобытие"		, ДанныеТриггера.ТриггерноеСобытие);		
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СправочникКонтрагенты.Ссылка КАК Справочник.Контрагенты) КАК Контрагент,
		|	СправочникКонтрагенты.Ссылка КАК ОбъектСобытия,
		|	ВЫРАЗИТЬ(СправочникКонтрагенты.СтруктурнаяЕдиница КАК Справочник.СтруктурныеЕдиницы) КАК СтруктурнаяЕдиница,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ПОМЕСТИТЬ ТаблицаКонтрагентов
		|ИЗ
		|	Справочник.Контрагенты КАК СправочникКонтрагенты
		|ГДЕ
		|	СправочникКонтрагенты.Ссылка = &Контрагент
		|	И СправочникКонтрагенты.ЭтоГруппа = ЛОЖЬ
		|	И СправочникКонтрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
		|	И СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)
		|	И СправочникКонтрагенты.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	СправочникКонтрагенты.Ссылка,
		|	ВЫРАЗИТЬ(СправочникКонтрагенты.СтруктурнаяЕдиница КАК Справочник.СтруктурныеЕдиницы),
		|	ВЫРАЗИТЬ(СправочникКонтрагенты.Ссылка КАК Справочник.Контрагенты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ РеестрОтработанных
		|ИЗ
		|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|ГДЕ
		|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
		|	И ЖурналРегистрацииТриггерныхСобытий.Контрагент В
		|			(ВЫБРАТЬ
		|				ТаблицаКонтрагентов.Контрагент
		|			ИЗ
		|				ТаблицаКонтрагентов)
		|	И ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаКонтрагентов.Контрагент КАК Контрагент,
		|	ТаблицаКонтрагентов.ОбъектСобытия КАК ОбъектСобытия,
		|	ТаблицаКонтрагентов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаКонтрагентов.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	ТаблицаКонтрагентов.РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
		|ГДЕ
		|	НЕ ТаблицаКонтрагентов.Контрагент В
		|				(ВЫБРАТЬ
		|					РеестрОтработанных.Контрагент
		|				ИЗ
		|					РеестрОтработанных)";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)",
			"СправочникКонтрагенты.Ссылка В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если РегистрацияПоПодписке Тогда 
			Запрос.УстановитьПараметр("Контрагент"			, ОбъектСобытия);
		ИначеЕсли РегистрацияЗапланированных Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СправочникКонтрагенты.Ссылка = &Контрагент", "СправочникКонтрагенты.Ссылка В(&МассивКонтрагентов)");
			Запрос.УстановитьПараметр("МассивКонтрагентов"	, ДанныеТриггера.МассивНеобработанныхКонтрагентов);
		КонецЕсли;	
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		Запрос.УстановитьПараметр("ТриггерноеСобытие"		, ДанныеТриггера.ТриггерноеСобытие);		
		Запрос.УстановитьПараметр("ДатаТриггера"			, ПолучитьДатуТриггера(ДанныеТриггера));
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
		|ИЗ
		|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|ГДЕ
		|	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
		|	И ЖурналРегистрацииТриггерныхСобытий.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СправочникКонтрагенты.Ссылка КАК Контрагент,
		|	СправочникКонтрагенты.Ссылка КАК ОбъектСобытия,
		|	СправочникКонтрагенты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	Справочник.Контрагенты КАК СправочникКонтрагенты
		|ГДЕ
		|	СправочникКонтрагенты.ЭтоГруппа = ЛОЖЬ
		|	И СправочникКонтрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
		|	И НАЧАЛОПЕРИОДА(СправочникКонтрагенты.ДатаРегистрации, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|	И СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)
		|	И СправочникКонтрагенты.ПометкаУдаления = ЛОЖЬ
		|	И НЕ СправочникКонтрагенты.Ссылка В
		|				(ВЫБРАТЬ
		|					ТаблицаОтработанныхКонтрагентов.Контрагент
		|				ИЗ
		|					ТаблицаОтработанныхКонтрагентов)
		|
		|СГРУППИРОВАТЬ ПО
		|	СправочникКонтрагенты.Ссылка,
		|	СправочникКонтрагенты.СтруктурнаяЕдиница,
		|	СправочникКонтрагенты.Ссылка";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)",
			"СправочникКонтрагенты.Ссылка В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
				
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события день рождения клиента
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  РегистрацияПоПодписке	 - 	 - 
//  ОбъектСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ДеньРожденияПациента(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ
		
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СправочникКонтрагенты.Ссылка КАК Контрагент,
		|	СправочникКонтрагенты.Ссылка КАК ОбъектСобытия,
		|	СправочникКонтрагенты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	Справочник.Контрагенты КАК СправочникКонтрагенты
		|ГДЕ
		|	СправочникКонтрагенты.ЭтоГруппа = ЛОЖЬ
		|	И СправочникКонтрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
		|	И СправочникКонтрагенты.ДатаРожденияКлиента <> ДАТАВРЕМЯ(1, 1, 1)
		|	И МЕСЯЦ(СправочникКонтрагенты.ДатаРожденияКлиента) = МЕСЯЦ(&ДатаТриггера)
		|	И ДЕНЬ(СправочникКонтрагенты.ДатаРожденияКлиента) = ДЕНЬ(&ДатаТриггера)
		|	И СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)
		|	И СправочникКонтрагенты.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	СправочникКонтрагенты.Ссылка,
		|	СправочникКонтрагенты.СтруктурнаяЕдиница,
		|	СправочникКонтрагенты.Ссылка";
				
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)",
			"СправочникКонтрагенты.Ссылка В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СправочникКонтрагенты.Ссылка В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события клиент смена статуса
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ПациентСменаСтатуса(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);	
	Запрос.УстановитьПараметр("ТриггерноеСобытие"			, ДанныеТриггера.ТриггерноеСобытие);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ЗАПЛАНИРОВАННЫХ_ИЛИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Контрагент"			, ОбъектСобытия.Контрагент);
		Запрос.УстановитьПараметр("ДатаТриггера"		, ОбъектСобытия.Период);
		Запрос.Текст = "ВЫБРАТЬ
		               |	СтатусыКонтрагентов.Период КАК Период,
		               |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
		               |	СтатусыКонтрагентов.Статус КАК Статус
		               |ПОМЕСТИТЬ ТаблицаКонтрагентовСменившихСтатус
		               |ИЗ
		               |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		               |ГДЕ
		               |	СтатусыКонтрагентов.Период = &ДатаТриггера
		               |	И СтатусыКонтрагентов.Контрагент = &Контрагент
		               |	И СтатусыКонтрагентов.Контрагент В(&СегментКонтрагентов)
		               |	И СтатусыКонтрагентов.Статус = &ПереходНаСтатус
		               |	И НЕ СтатусыКонтрагентов.Контрагент.ОбезличенныйКлиент
		               |	И СтатусыКонтрагентов.Контрагент.ПометкаУдаления = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Статус
		               |ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
		               |ИЗ
		               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |ГДЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
		               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент = &Контрагент
		               |	И ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		               |	И НАЧАЛОПЕРИОДА(ЖурналРегистрацииТриггерныхСобытий.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаКонтрагентовСменившихСтатус.Период КАК Период,
		               |	ТаблицаКонтрагентовСменившихСтатус.Контрагент КАК Контрагент,
		               |	ТаблицаКонтрагентовСменившихСтатус.Статус КАК Статус
		               |ПОМЕСТИТЬ ТаблицаНеОтработанныхКонтрагентов
		               |ИЗ
		               |	ТаблицаКонтрагентовСменившихСтатус КАК ТаблицаКонтрагентовСменившихСтатус
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхКонтрагентов КАК ТаблицаОтработанныхКонтрагентов
		               |		ПО ТаблицаКонтрагентовСменившихСтатус.Контрагент = ТаблицаОтработанныхКонтрагентов.Контрагент
		               |			И ТаблицаКонтрагентовСменившихСтатус.Статус = ТаблицаОтработанныхКонтрагентов.Статус
		               |ГДЕ
		               |	ТаблицаОтработанныхКонтрагентов.Контрагент ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СтатусыКонтрагентов.Период КАК Период,
		               |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
		               |	СтатусыКонтрагентов.Статус КАК Статус
		               |ПОМЕСТИТЬ ТаблицаИсторииСтатусов
		               |ИЗ
		               |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		               |ГДЕ
		               |	СтатусыКонтрагентов.Контрагент = &Контрагент
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаИсторииСтатусов.Период КАК Период,
		               |	ТаблицаИсторииСтатусов.Контрагент КАК Контрагент,
		               |	ТаблицаИсторииСтатусов.Статус КАК Статус,
		               |	КОЛИЧЕСТВО(ТаблицаИсторииСтатусов1.Контрагент) КАК НомерПоПорядку
		               |ПОМЕСТИТЬ ТаблицаПорядковыхНомеровИсходныхСтатусов
		               |ИЗ
		               |	ТаблицаИсторииСтатусов КАК ТаблицаИсторииСтатусов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИсторииСтатусов КАК ТаблицаИсторииСтатусов1
		               |		ПО ТаблицаИсторииСтатусов.Контрагент = ТаблицаИсторииСтатусов1.Контрагент
		               |			И ТаблицаИсторииСтатусов.Период > ТаблицаИсторииСтатусов1.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИсторииСтатусов.Период,
		               |	ТаблицаИсторииСтатусов.Контрагент,
		               |	ТаблицаИсторииСтатусов.Статус
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаНеОтработанныхКонтрагентов.Период КАК Период,
		               |	ТаблицаНеОтработанныхКонтрагентов.Контрагент КАК Контрагент,
		               |	ТаблицаНеОтработанныхКонтрагентов.Статус КАК Статус,
		               |	ТаблицаПорядковыхНомеровИсходныхСтатусов.НомерПоПорядку КАК НомерПоПорядку
		               |ПОМЕСТИТЬ ТаблицаПорядковыхНомеровКлиентовСменившихСтатус
		               |ИЗ
		               |	ТаблицаНеОтработанныхКонтрагентов КАК ТаблицаНеОтработанныхКонтрагентов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровИсходныхСтатусов КАК ТаблицаПорядковыхНомеровИсходныхСтатусов
		               |		ПО ТаблицаНеОтработанныхКонтрагентов.Период = ТаблицаПорядковыхНомеровИсходныхСтатусов.Период
		               |			И ТаблицаНеОтработанныхКонтрагентов.Контрагент = ТаблицаПорядковыхНомеровИсходныхСтатусов.Контрагент
		               |			И ТаблицаНеОтработанныхКонтрагентов.Статус = ТаблицаПорядковыхНомеровИсходныхСтатусов.Статус
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Контрагент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Период КАК ДатаСменыСтатуса,
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Контрагент КАК Контрагент,
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Статус КАК ОбъектСобытия,
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.НомерПоПорядку КАК НомерПоПорядку,
		               |	ЕСТЬNULL(ТаблицаПорядковыхНомеровИсходныхСтатусов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) КАК ПрошлыйСтатус,
		               |	ТаблицаПорядковыхНомеровИсходныхСтатусов.НомерПоПорядку КАК НомерПоПорядкуПрошлого,
		               |	ТаблицаПорядковыхНомеровИсходныхСтатусов.Период КАК ПериодПрошлого,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус КАК ТаблицаПорядковыхНомеровКлиентовСменившихСтатус
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровИсходныхСтатусов КАК ТаблицаПорядковыхНомеровИсходныхСтатусов
		               |		ПО ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Контрагент = ТаблицаПорядковыхНомеровИсходныхСтатусов.Контрагент
		               |			И (ВЫБОР
		               |				КОГДА ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.НомерПоПорядку = 0
		               |					ТОГДА ЛОЖЬ
		               |				ИНАЧЕ ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.НомерПоПорядку = ТаблицаПорядковыхНомеровИсходныхСтатусов.НомерПоПорядку + 1
		               |			КОНЕЦ)
		               |ГДЕ
		               |	ЕСТЬNULL(ТаблицаПорядковыхНомеровИсходныхСтатусов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) = &ПереходСоСтатуса
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерПоПорядку";
			
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтатусыКонтрагентов.Контрагент В(&СегментКонтрагентов)",
			"СтатусыКонтрагентов.Контрагент В
			|			(ВЫБРАТЬ
			|				СоставСегментов.ОбъектСегмента
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтатусыКонтрагентов.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ПереходСЭтапа) Тогда 
			Запрос.УстановитьПараметр("ПереходСоСтатуса", ДанныеТриггера.ПереходСЭтапа);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(ТаблицаПорядковыхНомеровИсходныхСтатусов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) = &ПереходСоСтатуса", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ПереходНаЭтап) Тогда 
			Запрос.УстановитьПараметр("ПереходНаСтатус", ДанныеТриггера.ПереходНаЭтап);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтатусыКонтрагентов.Статус = &ПереходНаСтатус", "ИСТИНА");
		КонецЕсли;

#КонецОбласти

	Иначе

#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));

		Запрос.Текст = "ВЫБРАТЬ
		               |	СтатусыКонтрагентов.Период КАК Период,
		               |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
		               |	СтатусыКонтрагентов.Статус КАК Статус
		               |ПОМЕСТИТЬ ТаблицаКонтрагентовСменившихСтатус
		               |ИЗ
		               |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		               |ГДЕ
		               |	НАЧАЛОПЕРИОДА(СтатусыКонтрагентов.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |	И СтатусыКонтрагентов.Контрагент В(&СегментКонтрагентов)
		               |	И СтатусыКонтрагентов.Статус = &ПереходНаСтатус
		               |	И НЕ СтатусыКонтрагентов.Контрагент.ОбезличенныйКлиент
		               |	И СтатусыКонтрагентов.Контрагент.ПометкаУдаления = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Статус
		               |ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
		               |ИЗ
		               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |ГДЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
		               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаКонтрагентовСменившихСтатус.Контрагент
		               |			ИЗ
		               |				ТаблицаКонтрагентовСменившихСтатус)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаКонтрагентовСменившихСтатус.Период КАК Период,
		               |	ТаблицаКонтрагентовСменившихСтатус.Контрагент КАК Контрагент,
		               |	ТаблицаКонтрагентовСменившихСтатус.Статус КАК Статус
		               |ПОМЕСТИТЬ ТаблицаНеОтработанныхКонтрагентов
		               |ИЗ
		               |	ТаблицаКонтрагентовСменившихСтатус КАК ТаблицаКонтрагентовСменившихСтатус
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхКонтрагентов КАК ТаблицаОтработанныхКонтрагентов
		               |		ПО ТаблицаКонтрагентовСменившихСтатус.Контрагент = ТаблицаОтработанныхКонтрагентов.Контрагент
		               |			И ТаблицаКонтрагентовСменившихСтатус.Статус = ТаблицаОтработанныхКонтрагентов.Статус
		               |ГДЕ
		               |	ТаблицаОтработанныхКонтрагентов.Контрагент ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СтатусыКонтрагентов.Период КАК Период,
		               |	СтатусыКонтрагентов.Контрагент КАК Контрагент,
		               |	СтатусыКонтрагентов.Статус КАК Статус
		               |ПОМЕСТИТЬ ТаблицаИсторииСтатусов
		               |ИЗ
		               |	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		               |ГДЕ
		               |	СтатусыКонтрагентов.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаНеОтработанныхКонтрагентов.Контрагент
		               |			ИЗ
		               |				ТаблицаНеОтработанныхКонтрагентов)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаИсторииСтатусов.Период КАК Период,
		               |	ТаблицаИсторииСтатусов.Контрагент КАК Контрагент,
		               |	ТаблицаИсторииСтатусов.Статус КАК Статус,
		               |	КОЛИЧЕСТВО(ТаблицаИсторииСтатусов1.Контрагент) КАК НомерПоПорядку
		               |ПОМЕСТИТЬ ТаблицаПорядковыхНомеровИсходныхСтатусов
		               |ИЗ
		               |	ТаблицаИсторииСтатусов КАК ТаблицаИсторииСтатусов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИсторииСтатусов КАК ТаблицаИсторииСтатусов1
		               |		ПО ТаблицаИсторииСтатусов.Контрагент = ТаблицаИсторииСтатусов1.Контрагент
		               |			И ТаблицаИсторииСтатусов.Период > ТаблицаИсторииСтатусов1.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИсторииСтатусов.Период,
		               |	ТаблицаИсторииСтатусов.Контрагент,
		               |	ТаблицаИсторииСтатусов.Статус
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаНеОтработанныхКонтрагентов.Период КАК Период,
		               |	ТаблицаНеОтработанныхКонтрагентов.Контрагент КАК Контрагент,
		               |	ТаблицаНеОтработанныхКонтрагентов.Статус КАК Статус,
		               |	ТаблицаПорядковыхНомеровИсходныхСтатусов.НомерПоПорядку КАК НомерПоПорядку
		               |ПОМЕСТИТЬ ТаблицаПорядковыхНомеровКлиентовСменившихСтатус
		               |ИЗ
		               |	ТаблицаНеОтработанныхКонтрагентов КАК ТаблицаНеОтработанныхКонтрагентов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровИсходныхСтатусов КАК ТаблицаПорядковыхНомеровИсходныхСтатусов
		               |		ПО ТаблицаНеОтработанныхКонтрагентов.Период = ТаблицаПорядковыхНомеровИсходныхСтатусов.Период
		               |			И ТаблицаНеОтработанныхКонтрагентов.Контрагент = ТаблицаПорядковыхНомеровИсходныхСтатусов.Контрагент
		               |			И ТаблицаНеОтработанныхКонтрагентов.Статус = ТаблицаПорядковыхНомеровИсходныхСтатусов.Статус
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Контрагент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Период КАК ДатаСменыСтатуса,
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Контрагент КАК Контрагент,
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Статус КАК ОбъектСобытия,
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.НомерПоПорядку КАК НомерПоПорядку,
		               |	ЕСТЬNULL(ТаблицаПорядковыхНомеровИсходныхСтатусов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) КАК ПрошлыйСтатус,
		               |	ТаблицаПорядковыхНомеровИсходныхСтатусов.НомерПоПорядку КАК НомерПоПорядкуПрошлого,
		               |	ТаблицаПорядковыхНомеровИсходныхСтатусов.Период КАК ПериодПрошлого,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаПорядковыхНомеровКлиентовСменившихСтатус КАК ТаблицаПорядковыхНомеровКлиентовСменившихСтатус
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровИсходныхСтатусов КАК ТаблицаПорядковыхНомеровИсходныхСтатусов
		               |		ПО ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.Контрагент = ТаблицаПорядковыхНомеровИсходныхСтатусов.Контрагент
		               |			И (ВЫБОР
		               |				КОГДА ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.НомерПоПорядку = 0
		               |					ТОГДА ЛОЖЬ
		               |				ИНАЧЕ ТаблицаПорядковыхНомеровКлиентовСменившихСтатус.НомерПоПорядку = ТаблицаПорядковыхНомеровИсходныхСтатусов.НомерПоПорядку + 1
		               |			КОНЕЦ)
		               |ГДЕ
		               |	ЕСТЬNULL(ТаблицаПорядковыхНомеровИсходныхСтатусов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) = &ПереходСоСтатуса
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерПоПорядку";
			
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтатусыКонтрагентов.Контрагент В(&СегментКонтрагентов)",
			"СтатусыКонтрагентов.Контрагент В
			|			(ВЫБРАТЬ
			|				СоставСегментов.ОбъектСегмента
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтатусыКонтрагентов.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ПереходСЭтапа) Тогда 
			Запрос.УстановитьПараметр("ПереходСоСтатуса", ДанныеТриггера.ПереходСЭтапа);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(ТаблицаПорядковыхНомеровИсходныхСтатусов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)) = &ПереходСоСтатуса", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ПереходНаЭтап) Тогда 
			Запрос.УстановитьПараметр("ПереходНаСтатус", ДанныеТриггера.ПереходНаЭтап);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтатусыКонтрагентов.Статус = &ПереходНаСтатус", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события посещение клиники
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  РегистрацияПоПодписке	 - 	 - 
//  ОбъектСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ПосещениеКлиники(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);	
	Запрос.УстановитьПараметр("ПараметрНомерПосещения"		, ДанныеТриггера.ПараметрСобытия);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ЗАПЛАНИРОВАННЫХ_ИЛИ_ПО_ПОДПИСКЕ

		Запрос.Текст = 
		"ВЫБРАТЬ
			               |	Посещение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	Посещение.ДатаПрихода КАК ДатаПосещения,
			               |	Посещение.Ссылка КАК Посещение,
			               |	ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) КАК Клиент,
			               |	Посещение.Основание КАК Основание
			               |ПОМЕСТИТЬ ТаблицаПосещенийПоКлиентам
			               |ИЗ
			               |	Документ.Посещение КАК Посещение
			               |ГДЕ
			               |	Посещение.Проведен = ИСТИНА
			               |	И Посещение.ПризнакОтменен = ЛОЖЬ
			               |	И Посещение.Контрагент = &Контрагент
			               |	И Посещение.Контрагент В(&СегментКонтрагентов)
			               |	И ВЫБОР
			               |			КОГДА НЕ ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) ЕСТЬ NULL
			               |				ТОГДА ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты).ОбезличенныйКлиент = ЛОЖЬ
			               |			ИНАЧЕ ИСТИНА
			               |		КОНЕЦ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТаблицаПосещенийПоКлиентам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	ТаблицаПосещенийПоКлиентам.ДатаПосещения КАК ДатаПосещения,
			               |	ТаблицаПосещенийПоКлиентам.Посещение КАК Посещение,
			               |	ТаблицаПосещенийПоКлиентам.Клиент КАК Клиент,
			               |	ТаблицаПосещенийПоКлиентам.Основание КАК Основание,
			               |	КОЛИЧЕСТВО(ТаблицаПосещений_1.Посещение) КАК Номер
			               |ПОМЕСТИТЬ ИтоговаяТаблицаПосещений
			               |ИЗ
			               |	ТаблицаПосещенийПоКлиентам КАК ТаблицаПосещенийПоКлиентам
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПосещенийПоКлиентам КАК ТаблицаПосещений_1
			               |		ПО ТаблицаПосещенийПоКлиентам.ДатаПосещения >= ТаблицаПосещений_1.ДатаПосещения
			               |			И ТаблицаПосещенийПоКлиентам.Клиент = ТаблицаПосещений_1.Клиент
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ТаблицаПосещенийПоКлиентам.СтруктурнаяЕдиница,
			               |	ТаблицаПосещенийПоКлиентам.ДатаПосещения,
			               |	ТаблицаПосещенийПоКлиентам.Посещение,
			               |	ТаблицаПосещенийПоКлиентам.Клиент,
			               |	ТаблицаПосещенийПоКлиентам.Основание
			               |
			               |ИМЕЮЩИЕ
			               |	КОЛИЧЕСТВО(ТаблицаПосещений_1.Посещение) = &ПараметрНомерПосещения И
			               |	ТаблицаПосещенийПоКлиентам.Посещение = &Посещение
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ИтоговаяТаблицаПосещений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	ИтоговаяТаблицаПосещений.ДатаПосещения КАК ДатаПосещения,
			               |	ИтоговаяТаблицаПосещений.Посещение КАК Посещение,
			               |	ИтоговаяТаблицаПосещений.Клиент КАК Контрагент,
			               |	ИтоговаяТаблицаПосещений.Посещение КАК ОбъектСобытия,
			               |	ИтоговаяТаблицаПосещений.Основание КАК Основание,
			               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
			               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
			               |ИЗ
			               |	ИтоговаяТаблицаПосещений КАК ИтоговаяТаблицаПосещений";
					
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Посещение.Контрагент В(&СегментКонтрагентов)",
			"Посещение.Контрагент В
			|			(ВЫБРАТЬ
			|				СоставСегментов.ОбъектСегмента
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Посещение.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	

		Если РегистрацияПоПодписке Тогда 
			Запрос.УстановитьПараметр("Контрагент"			, ОбъектСобытия.Контрагент);
			Запрос.УстановитьПараметр("Посещение"			, ОбъектСобытия);
		ИначеЕсли РегистрацияЗапланированных Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Посещение.Контрагент = &Контрагент", "Посещение.Контрагент В(&МассивКонтрагентов)");
			Запрос.УстановитьПараметр("МассивКонтрагентов"	, ДанныеТриггера.МассивНеобработанныхКонтрагентов);
			Запрос.УстановитьПараметр("Посещение"			, ОбъектСобытия);
		КонецЕсли;	
		
#КонецОбласти

	Иначе

#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.Текст = 
		"ВЫБРАТЬ
			               |	Посещение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	Посещение.ДатаПрихода КАК ДатаПрихода,
			               |	Посещение.Ссылка КАК Посещение,
			               |	ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) КАК Клиент,
			               |	Посещение.Основание КАК Основание
			               |ПОМЕСТИТЬ ТаблицаПосещенийПоДате
			               |ИЗ
			               |	Документ.Посещение КАК Посещение
			               |ГДЕ
			               |	Посещение.Проведен = ИСТИНА
			               |	И Посещение.ПризнакОтменен = ЛОЖЬ
			               |	И Посещение.Контрагент В(&СегментКонтрагентов)
			               |	И НАЧАЛОПЕРИОДА(Посещение.ДатаПрихода, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
			               |	И НЕ ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) ЕСТЬ NULL
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	Посещение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	Посещение.ДатаПрихода КАК ДатаПосещения,
			               |	Посещение.Ссылка КАК Посещение,
			               |	Посещение.Контрагент КАК Клиент,
			               |	Посещение.Основание КАК Основание
			               |ПОМЕСТИТЬ ТаблицаПосещенийПоКлиентам
			               |ИЗ
			               |	Документ.Посещение КАК Посещение
			               |ГДЕ
			               |	Посещение.Проведен = ИСТИНА
			               |	И Посещение.ПризнакОтменен = ЛОЖЬ
			               |	И Посещение.Контрагент В
			               |			(ВЫБРАТЬ
			               |				ТаблицаПосещенийПоДате.Клиент
			               |			ИЗ
			               |				ТаблицаПосещенийПоДате)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТаблицаПосещенийПоКлиентам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	ТаблицаПосещенийПоКлиентам.ДатаПосещения КАК ДатаПосещения,
			               |	ТаблицаПосещенийПоКлиентам.Посещение КАК Посещение,
			               |	ТаблицаПосещенийПоКлиентам.Клиент КАК Клиент,
			               |	ТаблицаПосещенийПоКлиентам.Основание КАК Основание,
			               |	КОЛИЧЕСТВО(ТаблицаПосещений_1.Посещение) КАК Номер
			               |ПОМЕСТИТЬ ИтоговаяТаблицаПосещений
			               |ИЗ
			               |	ТаблицаПосещенийПоКлиентам КАК ТаблицаПосещенийПоКлиентам
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПосещенийПоКлиентам КАК ТаблицаПосещений_1
			               |		ПО ТаблицаПосещенийПоКлиентам.ДатаПосещения >= ТаблицаПосещений_1.ДатаПосещения
			               |			И ТаблицаПосещенийПоКлиентам.Клиент = ТаблицаПосещений_1.Клиент
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ТаблицаПосещенийПоКлиентам.СтруктурнаяЕдиница,
			               |	ТаблицаПосещенийПоКлиентам.ДатаПосещения,
			               |	ТаблицаПосещенийПоКлиентам.Посещение,
			               |	ТаблицаПосещенийПоКлиентам.Клиент,
			               |	ТаблицаПосещенийПоКлиентам.Основание
			               |
			               |ИМЕЮЩИЕ
			               |	КОЛИЧЕСТВО(ТаблицаПосещений_1.Посещение) = &ПараметрНомерПосещения И
			               |	НАЧАЛОПЕРИОДА(ТаблицаПосещенийПоКлиентам.ДатаПосещения, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ИтоговаяТаблицаПосещений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	ИтоговаяТаблицаПосещений.ДатаПосещения КАК ДатаПосещения,
			               |	ИтоговаяТаблицаПосещений.Посещение КАК Посещение,
			               |	ИтоговаяТаблицаПосещений.Клиент КАК Контрагент,
			               |	ИтоговаяТаблицаПосещений.Посещение КАК ОбъектСобытия,
			               |	ИтоговаяТаблицаПосещений.Основание КАК Основание,
			               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
			               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
			               |ИЗ
			               |	ИтоговаяТаблицаПосещений КАК ИтоговаяТаблицаПосещений";
			
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Посещение.Контрагент В(&СегментКонтрагентов)",
			"Посещение.Контрагент В
			|			(ВЫБРАТЬ
			|				СоставСегментов.ОбъектСегмента
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Посещение.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
#КонецОбласти
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события непосещение клиники
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  РегистрацияПоПодписке	 - 	 - 
//  ОбъектСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_НепосещениеКлиники(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
//	1. Не отправляются потому что триггер не нашел необходимые данные для регистрации на текущий период.
//	2. Логика поиска триггером данных:
//	2.1 посещения проведены, не отменены
//	2.2 триггер ищет день в день (отчет показывает равно или более)
//	2.3 триггер анализирует посещения по ЧПУ и по Реализациям (посещения с пустым основанием отсеиваются)
//	2.4 триггер анализирует посещения в разрезе ЧПУ/Посещения по нему (с 31.08.2020 исключен данный пункт из логики!!!)
//	2.5 все ЧПУ попавшие в выборку после проверки пункта 2.4 должны иметь статус "Активен" на текущий момент (иначе отсеиваются) 
//
//	Повторюсь: Анализируем "не посещение" по каждому ЧПУ (в разрезе) а не общее. (с 31.08.2020 исключен данный пункт из логики!!!)
//				Если ЧПУ закрыто на момент отработки триггера - не имеет смысл информировать клиента о его "Не хождении".

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ
		
		
#КонецОбласти
		 
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТекущаяДата"			, НачалоДня(ТекущаяДатаСеанса()));
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Посещение.ДатаПрихода КАК ДатаПрихода,
		               |	Посещение.Ссылка КАК Посещение,
		               |	ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
		               |	ВЫРАЗИТЬ(Посещение.Основание КАК Документ.ЧленствоПакетУслуг) КАК Основание,
		               |	Посещение.Основание.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		               |ПОМЕСТИТЬ ТаблицаПредположительныхПосещенийПоЧленствам
		               |ИЗ
		               |	Документ.Посещение КАК Посещение
		               |ГДЕ
		               |	Посещение.Проведен = ИСТИНА
		               |	И Посещение.ПризнакОтменен = ЛОЖЬ
		               |	И Посещение.Контрагент В(&СегментКонтрагентов)
		               |	И НЕ ВЫРАЗИТЬ(Посещение.Основание КАК Документ.ЧленствоПакетУслуг) ЕСТЬ NULL
		               |	И НАЧАЛОПЕРИОДА(Посещение.ДатаПрихода, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |	И ВЫБОР
		               |			КОГДА НЕ ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |				ТОГДА ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты).ОбезличенныйКлиент = ЛОЖЬ
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И Посещение.Контрагент.ПометкаУдаления = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЧленстваПакетыУслугИтоги.ДатаАктивации КАК ДатаАктивации,
		               |	ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
		               |	ВЫРАЗИТЬ(ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг.Контрагент КАК Справочник.Контрагенты) КАК Контрагент
		               |ПОМЕСТИТЬ ТаблицаАктивныхЧленствПакетовУслуг
		               |ИЗ
		               |	РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
		               |ГДЕ
		               |	ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг В
		               |			(ВЫБРАТЬ
		               |				ТаблицаПредположительныхПосещенийПоЧленствам.Основание
		               |			ИЗ
		               |				ТаблицаПредположительныхПосещенийПоЧленствам)
		               |	И ЧленстваПакетыУслугИтоги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЧленстваПакетыУслугИтоги.ДатаАктивации,
		               |	ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг,
		               |	ВЫРАЗИТЬ(ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг.Контрагент КАК Справочник.Контрагенты)
		               |ИЗ
		               |	РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредположительныхПосещенийПоЧленствам КАК ТаблицаПредположительныхПосещенийПоЧленствам
		               |		ПО ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг = ТаблицаПредположительныхПосещенийПоЧленствам.Основание
		               |ГДЕ
		               |	НАЧАЛОПЕРИОДА(ЧленстваПакетыУслугИтоги.ДатаАктивации, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |	И ЧленстваПакетыУслугИтоги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
		               |	И ТаблицаПредположительныхПосещенийПоЧленствам.Основание ЕСТЬ NULL
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЧленстваПакетыУслугИтоги.ДатаАктивации,
		               |	ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг,
		               |	ВЫРАЗИТЬ(ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг.Контрагент КАК Справочник.Контрагенты)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПредположительныхПосещенийПоЧленствам.ДатаПрихода КАК ДатаПрихода,
		               |	ТаблицаПредположительныхПосещенийПоЧленствам.Посещение КАК Посещение,
		               |	ТаблицаПредположительныхПосещенийПоЧленствам.Контрагент КАК Контрагент,
		               |	ВЫРАЗИТЬ(ТаблицаПредположительныхПосещенийПоЧленствам.Основание КАК Документ.ЧленствоПакетУслуг) КАК Основание,
		               |	ТаблицаПредположительныхПосещенийПоЧленствам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		               |ПОМЕСТИТЬ ТаблицаПредположительноАктуальныхПосещенийПоЧленствам
		               |ИЗ
		               |	ТаблицаПредположительныхПосещенийПоЧленствам КАК ТаблицаПредположительныхПосещенийПоЧленствам
		               |ГДЕ
		               |	ТаблицаПредположительныхПосещенийПоЧленствам.Основание В
		               |			(ВЫБРАТЬ
		               |				ТаблицаАктивныхЧленствПакетовУслуг.ЧленствоПакетУслуг
		               |			ИЗ
		               |				ТаблицаАктивныхЧленствПакетовУслуг)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствам.ДатаПрихода КАК ДатаПрихода,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствам.Посещение КАК Посещение,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствам.Контрагент КАК Контрагент,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствам.Основание КАК Основание,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		               |ПОМЕСТИТЬ ТаблицаПредположительноАктуальныхПосещенийПоЧленствамКонтрагента
		               |ИЗ
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствам КАК ТаблицаПредположительноАктуальныхПосещенийПоЧленствам
		               |ГДЕ
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствам.Контрагент = ТаблицаПредположительноАктуальныхПосещенийПоЧленствам.Основание.Контрагент
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Посещение.ДатаПрихода КАК ДатаПрихода,
		               |	Посещение.Ссылка КАК Посещение,
		               |	ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
		               |	ВЫРАЗИТЬ(Посещение.Основание КАК Документ.Реализация) КАК Основание,
		               |	Посещение.Основание.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		               |ПОМЕСТИТЬ ТаблицаПредположительноАктуальныхПосещенийПоРеализациям
		               |ИЗ
		               |	Документ.Посещение КАК Посещение
		               |ГДЕ
		               |	Посещение.Проведен = ИСТИНА
		               |	И Посещение.ПризнакОтменен = ЛОЖЬ
		               |	И Посещение.Контрагент В(&СегментКонтрагентов)
		               |	И Посещение.Основание ССЫЛКА Документ.Реализация
		               |	И НАЧАЛОПЕРИОДА(Посещение.ДатаПрихода, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |	И ВЫБОР
		               |			КОГДА НЕ ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |				ТОГДА ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты).ОбезличенныйКлиент = ЛОЖЬ
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствамКонтрагента.ДатаПрихода КАК ДатаПрихода,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствамКонтрагента.Посещение КАК Посещение,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствамКонтрагента.Контрагент КАК Контрагент,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствамКонтрагента.Основание КАК Основание,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствамКонтрагента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		               |ПОМЕСТИТЬ ТаблицаАктуальныхПосещений
		               |ИЗ
		               |	ТаблицаПредположительноАктуальныхПосещенийПоЧленствамКонтрагента КАК ТаблицаПредположительноАктуальныхПосещенийПоЧленствамКонтрагента
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаПредположительноАктуальныхПосещенийПоРеализациям.ДатаПрихода,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоРеализациям.Посещение,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоРеализациям.Контрагент,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоРеализациям.Основание,
		               |	ТаблицаПредположительноАктуальныхПосещенийПоРеализациям.СтруктурнаяЕдиница
		               |ИЗ
		               |	ТаблицаПредположительноАктуальныхПосещенийПоРеализациям КАК ТаблицаПредположительноАктуальныхПосещенийПоРеализациям
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(Посещение.ДатаПрихода) КАК ДатаПрихода,
		               |	ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты) КАК Контрагент
		               |ПОМЕСТИТЬ ТаблицаПоследнихПосещений
		               |ИЗ
		               |	Документ.Посещение КАК Посещение
		               |ГДЕ
		               |	Посещение.Проведен = ИСТИНА
		               |	И Посещение.ПризнакОтменен = ЛОЖЬ
		               |	И Посещение.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаАктуальныхПосещений.Контрагент
		               |			ИЗ
		               |				ТаблицаАктуальныхПосещений
		               |		
		               |			ОБЪЕДИНИТЬ
		               |		
		               |			ВЫБРАТЬ
		               |				ТаблицаАктивныхЧленствПакетовУслуг.Контрагент
		               |			ИЗ
		               |				ТаблицаАктивныхЧленствПакетовУслуг)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫРАЗИТЬ(Посещение.Контрагент КАК Справочник.Контрагенты)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаАктуальныхПосещений.ДатаПрихода КАК ДатаПрихода,
		               |	ТаблицаАктуальныхПосещений.Посещение КАК Посещение,
		               |	ТаблицаАктуальныхПосещений.Контрагент КАК Контрагент,
		               |	ТаблицаАктуальныхПосещений.Основание КАК ОбъектСобытия,
		               |	ТаблицаАктуальныхПосещений.Основание КАК Основание,
		               |	ТаблицаАктуальныхПосещений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаАктуальныхПосещений КАК ТаблицаАктуальныхПосещений
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПоследнихПосещений КАК ТаблицаПоследнихПосещений
		               |		ПО ТаблицаАктуальныхПосещений.Контрагент = ТаблицаПоследнихПосещений.Контрагент
		               |			И ТаблицаАктуальныхПосещений.ДатаПрихода = ТаблицаПоследнихПосещений.ДатаПрихода
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаАктивныхЧленствПакетовУслуг.ДатаАктивации,
		               |	ЗНАЧЕНИЕ(Документ.Посещение.ПустаяСсылка),
		               |	ТаблицаАктивныхЧленствПакетовУслуг.Контрагент,
		               |	ТаблицаАктивныхЧленствПакетовУслуг.ЧленствоПакетУслуг,
		               |	ТаблицаАктивныхЧленствПакетовУслуг.ЧленствоПакетУслуг,
		               |	ТаблицаАктивныхЧленствПакетовУслуг.ЧленствоПакетУслуг.СтруктурнаяЕдиница,
		               |	&РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаАктивныхЧленствПакетовУслуг КАК ТаблицаАктивныхЧленствПакетовУслуг
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Посещение КАК Посещение
		               |		ПО ТаблицаАктивныхЧленствПакетовУслуг.Контрагент = Посещение.Контрагент
		               |			И ТаблицаАктивныхЧленствПакетовУслуг.ЧленствоПакетУслуг = Посещение.Основание
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихПосещений КАК ТаблицаПоследнихПосещений
		               |		ПО ТаблицаАктивныхЧленствПакетовУслуг.Контрагент = ТаблицаПоследнихПосещений.Контрагент
		               |			И ТаблицаАктивныхЧленствПакетовУслуг.ДатаАктивации <= ТаблицаПоследнихПосещений.ДатаПрихода
		               |ГДЕ
		               |	Посещение.Ссылка ЕСТЬ NULL
		               |	И ТаблицаПоследнихПосещений.Контрагент ЕСТЬ NULL
		               |	И НАЧАЛОПЕРИОДА(ТаблицаАктивныхЧленствПакетовУслуг.ДатаАктивации, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаАктивныхЧленствПакетовУслуг.ДатаАктивации,
		               |	ТаблицаАктивныхЧленствПакетовУслуг.Контрагент,
		               |	ТаблицаАктивныхЧленствПакетовУслуг.ЧленствоПакетУслуг,
		               |	ТаблицаАктивныхЧленствПакетовУслуг.ЧленствоПакетУслуг.СтруктурнаяЕдиница,
		               |	ТаблицаАктивныхЧленствПакетовУслуг.ЧленствоПакетУслуг";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Посещение.Контрагент В(&СегментКонтрагентов)",
			"Посещение.Контрагент В
			|			(ВЫБРАТЬ
			|				СоставСегментов.ОбъектСегмента
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Посещение.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
				
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события потенциальный не стал клиентом
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  РегистрацияПоПодписке	 - 	 - 
//  ОбъектСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ПотенциальныйНеСталНовым(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ
		
		
#КонецОбласти
		 
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ТриггерноеСобытие"		, ДанныеТриггера.ТриггерноеСобытие);
		Запрос.УстановитьПараметр("ДатаТриггера"			, ПолучитьДатуТриггера(ДанныеТриггера));
		// Запрос.УстановитьПараметр("ТекущаяДата"				, НачалоДня(ТекущаяДатаСеанса()));
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда
			Запрос.УстановитьПараметр("СегментКонтрагентов"	, ДанныеТриггера.СегментКонтрагентов);			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент
			               |ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
			               |ИЗ
			               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
			               |ГДЕ
			               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
			               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
			               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК ОбъектСобытия,
			               |	СтатусыКонтрагентовСрезПоследних.Контрагент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
			               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
			               |ИЗ
			               |	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(
			               |			,
			               |			Контрагент.ПометкаУдаления = ЛОЖЬ
			               |				И Контрагент.ОбезличенныйКлиент = ЛОЖЬ
			               |				И НЕ Контрагент В
			               |						(ВЫБРАТЬ
			               |							ТаблицаОтработанныхКонтрагентов.Контрагент
			               |						ИЗ
			               |							ТаблицаОтработанныхКонтрагентов)
			               |				И Контрагент В
			               |					(ВЫБРАТЬ
			               |						ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты)
			               |					ИЗ
			               |						РегистрСведений.СоставСегментов КАК СоставСегментов
			               |					ГДЕ
			               |						СоставСегментов.Сегмент = &СегментКонтрагентов
			               |						И НЕ ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты) ЕСТЬ NULL)) КАК СтатусыКонтрагентовСрезПоследних
			               |ГДЕ
			               |	НАЧАЛОПЕРИОДА(СтатусыКонтрагентовСрезПоследних.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
			               |	И СтатусыКонтрагентовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный)";
			
		Иначе 
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент
			               |ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
			               |ИЗ
			               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
			               |ГДЕ
			               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
			               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
			               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК ОбъектСобытия,
			               |	СтатусыКонтрагентовСрезПоследних.Контрагент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
			               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
			               |ИЗ
			               |	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(
			               |			,
			               |			Контрагент.ПометкаУдаления = ЛОЖЬ
			               |				И Контрагент.ОбезличенныйКлиент = ЛОЖЬ
			               |				И НЕ Контрагент В
			               |						(ВЫБРАТЬ
			               |							ТаблицаОтработанныхКонтрагентов.Контрагент
			               |						ИЗ
			               |							ТаблицаОтработанныхКонтрагентов)) КАК СтатусыКонтрагентовСрезПоследних
			               |ГДЕ
			               |	НАЧАЛОПЕРИОДА(СтатусыКонтрагентовСрезПоследних.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
			               |	И СтатусыКонтрагентовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный)";
		КонецЕсли;	
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события пациент окончание срока действия страхового полиса
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ПациентОкончаниеСрокаДействияСтраховогоПолиса(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ
		
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПолисыМедицинскогоСтрахования.Ссылка КАК ОбъектСобытия,
		|	ПолисыМедицинскогоСтрахования.Контрагент КАК Контрагент,
		|	ПолисыМедицинскогоСтрахования.ТипПолиса КАК ТипПолиса,
		|	ПолисыМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ПолисыМедицинскогоСтрахования.СерияПолиса КАК СерияПолиса,
		|	ПолисыМедицинскогоСтрахования.НомерПолиса КАК НомерПолиса,
		|	ПолисыМедицинскогоСтрахования.ЛимитПолиса КАК ЛимитПолиса,
		|	ПолисыМедицинскогоСтрахования.ДанаНачала КАК ДатаВыдачи,
		|	ПолисыМедицинскогоСтрахования.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ТаблицаПациентовСИстекающимиПолисами
		|ИЗ
		|	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПолисыМедицинскогоСтрахования.ДатаОкончания, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПациентовСИстекающимиПолисами.Контрагент КАК Контрагент,
		|	ТаблицаПациентовСИстекающимиПолисами.ОбъектСобытия КАК ОбъектСобытия,
		|	ТаблицаПациентовСИстекающимиПолисами.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ТаблицаПациентовСИстекающимиПолисами.СерияПолиса КАК СерияПолиса,
		|	ТаблицаПациентовСИстекающимиПолисами.НомерПолиса КАК НомерПолиса,
		|	ТаблицаПациентовСИстекающимиПолисами.ЛимитПолиса КАК ЛимитПолиса,
		|	ТаблицаПациентовСИстекающимиПолисами.ДатаВыдачи КАК ДатаВыдачи,
		|	ТаблицаПациентовСИстекающимиПолисами.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ТаблицаПациентовСИстекающимиПолисамиФильтрация
		|ИЗ
		|	ТаблицаПациентовСИстекающимиПолисами КАК ТаблицаПациентовСИстекающимиПолисами
		|ГДЕ
		|	ТаблицаПациентовСИстекающимиПолисами.Контрагент В(&СегментКонтрагентов)
		|	И ТаблицаПациентовСИстекающимиПолисами.ТипПолиса = &ТипПолиса
		|	И ТаблицаПациентовСИстекающимиПолисами.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТаблицаПациентовСИстекающимиПолисами.Контрагент.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация.Контрагент КАК Контрагент,
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация.ОбъектСобытия КАК ОбъектСобытия,
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация.СерияПолиса КАК СерияПолиса,
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация.НомерПолиса КАК НомерПолиса,
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация.ЛимитПолиса КАК ЛимитПолиса,
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация.ДатаВыдачи КАК ДатаВыдачи,
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ТаблицаНеОтработнныхИстекающихПолисов
		|ИЗ
		|	ТаблицаПациентовСИстекающимиПолисамиФильтрация КАК ТаблицаПациентовСИстекающимиПолисамиФильтрация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ТаблицаПациентовСИстекающимиПолисамиФильтрация.Контрагент = ЖурналРегистрацииТриггерныхСобытий.Контрагент
		|			И ТаблицаПациентовСИстекающимиПолисамиФильтрация.ОбъектСобытия = ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		|ГДЕ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНеОтработнныхИстекающихПолисов.Контрагент КАК Контрагент,
		|	ТаблицаНеОтработнныхИстекающихПолисов.ОбъектСобытия КАК ОбъектСобытия,
		|	ТаблицаНеОтработнныхИстекающихПолисов.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ТаблицаНеОтработнныхИстекающихПолисов.СерияПолиса КАК СерияПолиса,
		|	ТаблицаНеОтработнныхИстекающихПолисов.НомерПолиса КАК НомерПолиса,
		|	ТаблицаНеОтработнныхИстекающихПолисов.ЛимитПолиса КАК ЛимитПолиса,
		|	ТаблицаНеОтработнныхИстекающихПолисов.ДатаВыдачи КАК ДатаВыдачи,
		|	ТаблицаНеОтработнныхИстекающихПолисов.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаНеОтработнныхИстекающихПолисов.Контрагент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаНеОтработнныхИстекающихПолисов КАК ТаблицаНеОтработнныхИстекающихПолисов";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаПациентовСИстекающимиПолисами.Контрагент В(&СегментКонтрагентов)",
		"ТаблицаПациентовСИстекающимиПолисами.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаПациентовСИстекающимиПолисами.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ТипПолиса) Тогда
			Запрос.УстановитьПараметр("ТипПолиса", ДанныеТриггера.ТипПолиса);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаПациентовСИстекающимиПолисами.ТипПолиса = &ТипПолиса", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
		
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события установка карты wallet новому клиенту
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_УстановкаКартыWalletНовомуКлиенту(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
		
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ
		
		Запрос.УстановитьПараметр("ТриггерноеСобытие"		, ДанныеТриггера.ТриггерноеСобытие);		
		Запрос.УстановитьПараметр("Карта"					, ОбъектСобытия);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Карты.ВладелецКарты КАК Контрагент,
		               |	Карты.Ссылка КАК ОбъектСобытия,
		               |	Карты.ВладелецКарты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ПОМЕСТИТЬ ТаблицаКонтрагентов
		               |ИЗ
		               |	Справочник.Карты КАК Карты
		               |ГДЕ
		               |	Карты.Ссылка = &Карта
		               |	И Карты.ВладелецКарты В(&СегментКонтрагентов)
		               |	И Карты.ПометкаУдаления = ЛОЖЬ
		               |	И Карты.Заблокирована = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Карты.Ссылка,
		               |	Карты.ВладелецКарты,
		               |	Карты.ВладелецКарты.СтруктурнаяЕдиница
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент
		               |ПОМЕСТИТЬ РеестрОтработанных
		               |ИЗ
		               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |ГДЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
		               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаКонтрагентов.Контрагент
		               |			ИЗ
		               |				ТаблицаКонтрагентов)
		               |	И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = &Карта
		               |	И ЖурналРегистрацииТриггерныхСобытий.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаКонтрагентов.Контрагент КАК Контрагент,
		               |	ТаблицаКонтрагентов.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаКонтрагентов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ТаблицаКонтрагентов.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТаблицаКонтрагентов.РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
		               |ГДЕ
		               |	НЕ ТаблицаКонтрагентов.Контрагент В
		               |				(ВЫБРАТЬ
		               |					РеестрОтработанных.Контрагент
		               |				ИЗ
		               |					РеестрОтработанных)";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Карты.ВладелецКарты В(&СегментКонтрагентов)",
			"Карты.ВладелецКарты В
			|			(ВЫБРАТЬ
			|				СоставСегментов.ОбъектСегмента
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Карты.ВладелецКарты В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
				
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события заявка не обработана
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЗаявкаНеОбработана(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		
#КонецОбласти
		
	Иначе
		 
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		ЗадержкаМинут = 0;
		Запрос.УстановитьПараметр("ДатаВыборки"					, ПолучитьДатуТриггера(ДанныеТриггера, ЗадержкаМинут));
		Если ЗадержкаМинут = 0 Тогда 
			Возврат Неопределено;
		КонецЕсли;	
		Запрос.УстановитьПараметр("ТриггерноеСобытие"			, ДанныеТриггера.ТриггерноеСобытие);
		// Запрос.УстановитьПараметр("ТекущаяСтруктурнаяЕдиница"	, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ТекущаяДата"					, ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ПараметрЗадержкаМинут"		, ЗадержкаМинут);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Заявки.Ссылка КАК Заявка,
		               |	Заявки.ДатаСоздания КАК ДатаСоздания,
		               |	Заявки.ОсновнойМенеджер КАК ОсновнойМенеджер,
		               |	Заявки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		               |ПОМЕСТИТЬ АнализируемаяТаблицаЗаявок
		               |ИЗ
		               |	Справочник.Заявки КАК Заявки
		               |ГДЕ
		               |	Заявки.ПометкаУдаления = ЛОЖЬ
		               |	И Заявки.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |	И Заявки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.НеОбработана)
		               |	И Заявки.ДатаСоздания > &ДатаВыборки
		               |	И ДОБАВИТЬКДАТЕ(Заявки.ДатаСоздания, МИНУТА, &ПараметрЗадержкаМинут) <= &ТекущаяДата
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	АнализируемаяТаблицаЗаявок.Заявка КАК Заявка
		               |ПОМЕСТИТЬ ТаблицаОтработанныхСобытий
		               |ИЗ
		               |	АнализируемаяТаблицаЗаявок КАК АнализируемаяТаблицаЗаявок
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		               |			И (АнализируемаяТаблицаЗаявок.Заявка = (ВЫРАЗИТЬ(ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Справочник.Заявки)))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	АнализируемаяТаблицаЗаявок.Заявка КАК Заявка,
		               |	АнализируемаяТаблицаЗаявок.ДатаСоздания КАК ДатаСоздания,
		               |	АнализируемаяТаблицаЗаявок.ОсновнойМенеджер КАК ОсновнойМенеджер,
		               |	АнализируемаяТаблицаЗаявок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		               |ПОМЕСТИТЬ ТаблицаНеОтработанныхЗаявок
		               |ИЗ
		               |	АнализируемаяТаблицаЗаявок КАК АнализируемаяТаблицаЗаявок
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхСобытий КАК ТаблицаОтработанныхСобытий
		               |		ПО АнализируемаяТаблицаЗаявок.Заявка = ТаблицаОтработанныхСобытий.Заявка
		               |ГДЕ
		               |	ТаблицаОтработанныхСобытий.Заявка ЕСТЬ NULL
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	АнализируемаяТаблицаЗаявок.Заявка,
		               |	АнализируемаяТаблицаЗаявок.ДатаСоздания,
		               |	АнализируемаяТаблицаЗаявок.ОсновнойМенеджер,
		               |	АнализируемаяТаблицаЗаявок.СтруктурнаяЕдиница
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РасписаниеРаботы.Ссылка КАК СтруктурнаяЕдиница,
		               |	ДЕНЬНЕДЕЛИ(РасписаниеРаботы.ДеньНедели) КАК ДеньНедели,
		               |	РасписаниеРаботы.ДеньНедели КАК ддд,
		               |	РасписаниеРаботы.НачалоРаботы КАК НачалоРаботы,
		               |	ВЫБОР
		               |		КОГДА РасписаниеРаботы.ОкончаниеРаботы = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |			ТОГДА КОНЕЦПЕРИОДА(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДЕНЬ)
		               |		ИНАЧЕ РасписаниеРаботы.ОкончаниеРаботы
		               |	КОНЕЦ КАК ОкончаниеРаботы
		               |ПОМЕСТИТЬ ТаблицаВремениРаботыСЕ
		               |ИЗ
		               |	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК РасписаниеРаботы
		               |ГДЕ
		               |	РасписаниеРаботы.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ТаблицаНеОтработанныхЗаявок.СтруктурнаяЕдиница
		               |			ИЗ
		               |				ТаблицаНеОтработанныхЗаявок)
		               |	И НЕ РасписаниеРаботы.ДеньНедели = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |	И РасписаниеРаботы.Активность = ИСТИНА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаНеОтработанныхЗаявок.Заявка КАК Заявка,
		               |	ТаблицаНеОтработанныхЗаявок.ДатаСоздания КАК ДатаСоздания,
		               |	ТаблицаНеОтработанныхЗаявок.ОсновнойМенеджер КАК ОсновнойМенеджер,
		               |	ТаблицаНеОтработанныхЗаявок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.ДеньНедели, ДЕНЬНЕДЕЛИ(ТаблицаНеОтработанныхЗаявок.ДатаСоздания)) КАК ДеньНедели,
		               |	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТаблицаНеОтработанныхЗаявок.ДатаСоздания, ДЕНЬ), ЧАС, ЧАС(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.НачалоРаботы, ДАТАВРЕМЯ(1, 1, 1)))), МИНУТА, МИНУТА(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.НачалоРаботы, ДАТАВРЕМЯ(1, 1, 1)))), СЕКУНДА, СЕКУНДА(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.НачалоРаботы, ДАТАВРЕМЯ(1, 1, 1)))) КАК НачалоРаботы,
		               |	ВЫБОР
		               |		КОГДА ДЕНЬ(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.ОкончаниеРаботы, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59))) > ДЕНЬ(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.НачалоРаботы, ДАТАВРЕМЯ(1, 1, 1)))
		               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТаблицаНеОтработанныхЗаявок.ДатаСоздания, ДЕНЬ), ЧАС, ЧАС(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.ОкончаниеРаботы, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)))), МИНУТА, МИНУТА(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.ОкончаниеРаботы, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)))), СЕКУНДА, СЕКУНДА(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.ОкончаниеРаботы, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)))), СЕКУНДА, 86400)
		               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТаблицаНеОтработанныхЗаявок.ДатаСоздания, ДЕНЬ), ЧАС, ЧАС(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.ОкончаниеРаботы, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)))), МИНУТА, МИНУТА(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.ОкончаниеРаботы, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)))), СЕКУНДА, СЕКУНДА(ЕСТЬNULL(ТаблицаВремениРаботыСЕ1.ОкончаниеРаботы, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59))))
		               |	КОНЕЦ КАК ОкончаниеРаботы,
		               |	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ТаблицаНеОтработанныхЗаявок.ДатаСоздания, СЕКУНДА, 86400), ДЕНЬ), ЧАС, ЧАС(ЕСТЬNULL(ТаблицаВремениРаботыСЕ2.НачалоРаботы, ДАТАВРЕМЯ(1, 1, 1)))), МИНУТА, МИНУТА(ЕСТЬNULL(ТаблицаВремениРаботыСЕ2.НачалоРаботы, ДАТАВРЕМЯ(1, 1, 1)))), СЕКУНДА, СЕКУНДА(ЕСТЬNULL(ТаблицаВремениРаботыСЕ2.НачалоРаботы, ДАТАВРЕМЯ(1, 1, 1)))) КАК НачалоРаботыСледующегоДня
		               |ПОМЕСТИТЬ ТаблицаЗаявокИРежимовРаботыСЕ
		               |ИЗ
		               |	ТаблицаНеОтработанныхЗаявок КАК ТаблицаНеОтработанныхЗаявок
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВремениРаботыСЕ КАК ТаблицаВремениРаботыСЕ1
		               |		ПО ТаблицаНеОтработанныхЗаявок.СтруктурнаяЕдиница = ТаблицаВремениРаботыСЕ1.СтруктурнаяЕдиница
		               |			И (ДЕНЬНЕДЕЛИ(ТаблицаНеОтработанныхЗаявок.ДатаСоздания) = ТаблицаВремениРаботыСЕ1.ДеньНедели)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВремениРаботыСЕ КАК ТаблицаВремениРаботыСЕ2
		               |		ПО ТаблицаНеОтработанныхЗаявок.СтруктурнаяЕдиница = ТаблицаВремениРаботыСЕ2.СтруктурнаяЕдиница
		               |			И (ДЕНЬНЕДЕЛИ(ДОБАВИТЬКДАТЕ(ТаблицаНеОтработанныхЗаявок.ДатаСоздания, СЕКУНДА, 86400)) = ТаблицаВремениРаботыСЕ2.ДеньНедели)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.Заявка КАК Заявка,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.Заявка КАК ОбъектСобытия,
		               |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.ДатаСоздания КАК ДатаСоздания,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.ОсновнойМенеджер КАК ОсновнойМенеджер,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.ДеньНедели КАК ДеньНедели,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.НачалоРаботы КАК НачалоРаботы,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.ОкончаниеРаботы КАК ОкончаниеРаботы,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.НачалоРаботыСледующегоДня КАК НачалоРаботыСледующегоДня,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.Заявка.Фамилия КАК Фамилия,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.Заявка.Имя КАК Имя,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.Заявка.Отчество КАК Отчество,
		               |	ТаблицаЗаявокИРежимовРаботыСЕ.Заявка.НомерТелефона КАК НомерТелефона,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаЗаявокИРежимовРаботыСЕ КАК ТаблицаЗаявокИРежимовРаботыСЕ
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА ТаблицаЗаявокИРежимовРаботыСЕ.ДатаСоздания МЕЖДУ ТаблицаЗаявокИРежимовРаботыСЕ.НачалоРаботы И ТаблицаЗаявокИРежимовРаботыСЕ.ОкончаниеРаботы
		               |				ТОГДА ВЫБОР
		               |						КОГДА ДОБАВИТЬКДАТЕ(ТаблицаЗаявокИРежимовРаботыСЕ.ДатаСоздания, МИНУТА, &ПараметрЗадержкаМинут) <= ТаблицаЗаявокИРежимовРаботыСЕ.ОкончаниеРаботы
		               |							ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаЗаявокИРежимовРаботыСЕ.ДатаСоздания, МИНУТА, &ПараметрЗадержкаМинут) <= &ТекущаяДата
		               |						ИНАЧЕ ДОБАВИТЬКДАТЕ(ТаблицаЗаявокИРежимовРаботыСЕ.НачалоРаботыСледующегоДня, МИНУТА, &ПараметрЗадержкаМинут) <= &ТекущаяДата
		               |					КОНЕЦ
		               |			КОГДА ТаблицаЗаявокИРежимовРаботыСЕ.ДатаСоздания < ТаблицаЗаявокИРежимовРаботыСЕ.НачалоРаботы
		               |				ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаЗаявокИРежимовРаботыСЕ.НачалоРаботы, МИНУТА, &ПараметрЗадержкаМинут) <= &ТекущаяДата
		               |			КОГДА ТаблицаЗаявокИРежимовРаботыСЕ.ДатаСоздания > ТаблицаЗаявокИРежимовРаботыСЕ.ОкончаниеРаботы
		               |				ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаЗаявокИРежимовРаботыСЕ.НачалоРаботыСледующегоДня, МИНУТА, &ПараметрЗадержкаМинут) <= &ТекущаяДата
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(ТаблицаЗаявокИРежимовРаботыСЕ.ДатаСоздания, МИНУТА, &ПараметрЗадержкаМинут) <= &ТекущаяДата
		               |		КОНЕЦ";
		
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события сделка смена этапа
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  РегистрацияПоПодписке	 - 	 - 
//  ОбъектСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_СделкаСменаЭтапа(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Сделка"					, ОбъектСобытия);

		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	СделкиИсторияИзмененияЭтапов.НомерСтроки КАК НомерСтроки,
		               |	СделкиИсторияИзмененияЭтапов.Дата КАК Дата,
		               |	СделкиИсторияИзмененияЭтапов.ПереходСЭтапа КАК ПереходСЭтапа,
		               |	СделкиИсторияИзмененияЭтапов.ПереходНаЭтап КАК ПереходНаЭтап
		               |ПОМЕСТИТЬ ПоследнееИзменение
		               |ИЗ
		               |	Справочник.Сделки.ИсторияИзмененияЭтапов КАК СделкиИсторияИзмененияЭтапов
		               |ГДЕ
		               |	СделкиИсторияИзмененияЭтапов.Ссылка = &Сделка
		               |	И СделкиИсторияИзмененияЭтапов.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |	И СделкиИсторияИзмененияЭтапов.Ссылка.ВидСделки = &ВидСделки
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИсторияИзмененияЭтапов.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ИсторияИзмененияЭтапов.Ссылка.Контрагент КАК Контрагент,
		               |	ИсторияИзмененияЭтапов.Ссылка КАК ОбъектСобытия,
		               |	ИсторияИзмененияЭтапов.Ссылка.ВидСделки КАК ВидСделки,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	Справочник.Сделки.ИсторияИзмененияЭтапов КАК ИсторияИзмененияЭтапов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследнееИзменение КАК ПоследнееИзменение
		               |		ПО (ПоследнееИзменение.Дата = ИсторияИзмененияЭтапов.Дата)
		               |			И (ПоследнееИзменение.ПереходСЭтапа = ИсторияИзмененияЭтапов.ПереходСЭтапа)
		               |			И (ПоследнееИзменение.ПереходНаЭтап = ИсторияИзмененияЭтапов.ПереходНаЭтап)
		               |ГДЕ
		               |	ИсторияИзмененияЭтапов.Ссылка = &Сделка
		               |	И ИсторияИзмененияЭтапов.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |	И ИсторияИзмененияЭтапов.Ссылка.ВидСделки = &ВидСделки
		               |	И ИсторияИзмененияЭтапов.Ссылка.Контрагент В(&СегментКонтрагентов)
		               |	И ИсторияИзмененияЭтапов.ПереходСЭтапа = &ПереходСЭтапа
		               |	И ИсторияИзмененияЭтапов.ПереходНаЭтап = &ПереходНаЭтап
		               |	И ИсторияИзмененияЭтапов.Ссылка.Контрагент.ОбезличенныйКлиент = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ИсторияИзмененияЭтапов.Ссылка.СтруктурнаяЕдиница,
		               |	ИсторияИзмененияЭтапов.Ссылка,
		               |	ИсторияИзмененияЭтапов.Ссылка.Контрагент,
		               |	ИсторияИзмененияЭтапов.Ссылка.ВидСделки";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Ссылка.Контрагент В(&СегментКонтрагентов)",
			"ИсторияИзмененияЭтапов.Ссылка.Контрагент В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты)
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов И НЕ ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты) ЕСТЬ NULL)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияИзмененияЭтапов.Ссылка.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидСделки) Тогда
			Запрос.УстановитьПараметр("ВидСделки", ДанныеТриггера.ВидСделки);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СделкиИсторияИзмененияЭтапов.Ссылка.ВидСделки = &ВидСделки", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияИзмененияЭтапов.Ссылка.ВидСделки = &ВидСделки", "ИСТИНА");			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ПереходСЭтапа) Тогда 
			Запрос.УстановитьПараметр("ПереходСЭтапа", ДанныеТриггера.ПереходСЭтапа);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияИзмененияЭтапов.ПереходСЭтапа = &ПереходСЭтапа", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ПереходНаЭтап) Тогда 
			Запрос.УстановитьПараметр("ПереходНаЭтап", ДанныеТриггера.ПереходНаЭтап);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияИзмененияЭтапов.ПереходНаЭтап = &ПереходНаЭтап", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Сделки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	Сделки.Ссылка.Контрагент КАК Контрагент,
		               |	Сделки.Ссылка КАК ОбъектСобытия,
		               |	Сделки.Ссылка.ВидСделки КАК ВидСделки,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ПОМЕСТИТЬ ТаблицаСделок
		               |ИЗ
		               |	Справочник.Сделки.ИсторияИзмененияЭтапов КАК Сделки
		               |ГДЕ
		               |	Сделки.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |	И Сделки.Ссылка.ВидСделки = &ВидСделки
		               |	И Сделки.Ссылка.Контрагент В(&СегментКонтрагентов)
		               |	И НАЧАЛОПЕРИОДА(Сделки.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |	И Сделки.ПереходСЭтапа = &ПереходСЭтапа
		               |	И Сделки.ПереходНаЭтап = &ПереходНаЭтап
		               |	И Сделки.Ссылка.Контрагент.ОбезличенныйКлиент = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Сделки.Ссылка.СтруктурнаяЕдиница,
		               |	Сделки.Ссылка,
		               |	Сделки.Ссылка.Контрагент,
		               |	Сделки.Ссылка.ВидСделки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Сделка
		               |ПОМЕСТИТЬ ТаблицаОтработанныхСделок
		               |ИЗ
		               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |ГДЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
		               |	И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия В
		               |			(ВЫБРАТЬ
		               |				ТаблицаСделок.ОбъектСобытия
		               |			ИЗ
		               |				ТаблицаСделок)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТаблицаСделок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ТаблицаСделок.Контрагент КАК Контрагент,
		               |	ТаблицаСделок.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаСделок.ВидСделки КАК ВидСделки,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаСделок КАК ТаблицаСделок
		               |ГДЕ
		               |	НЕ ТаблицаСделок.ОбъектСобытия В
		               |				(ВЫБРАТЬ
		               |					ТаблицаОтработанныхСделок.Сделка
		               |				ИЗ
		               |					ТаблицаОтработанныхСделок)";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Ссылка.Контрагент В(&СегментКонтрагентов)",
			"Сделки.Ссылка.Контрагент В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты)
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов И НЕ ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты) ЕСТЬ NULL)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Ссылка.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидСделки) Тогда
			Запрос.УстановитьПараметр("ВидСделки", ДанныеТриггера.ВидСделки);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.Ссылка.ВидСделки = &ВидСделки", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ПереходСЭтапа) Тогда 
			Запрос.УстановитьПараметр("ПереходСЭтапа", ДанныеТриггера.ПереходСЭтапа);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.ПереходСЭтапа = &ПереходСЭтапа", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ПереходНаЭтап) Тогда 
			Запрос.УстановитьПараметр("ПереходНаЭтап", ДанныеТриггера.ПереходНаЭтап);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.ПереходНаЭтап = &ПереходНаЭтап", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события сделка задержка на этапе
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_СделкаЗадержкаНаЭтапе(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		
#КонецОбласти
		
	Иначе
		 
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		ЗадержкаМинут = 0;
		Запрос.УстановитьПараметр("ДатаВыборки"				, ПолучитьДатуТриггера(ДанныеТриггера, ЗадержкаМинут));
		Если ЗадержкаМинут = 0 Тогда 
			Возврат Неопределено;
		КонецЕсли;	
		Запрос.УстановитьПараметр("ТриггерноеСобытие"		, ДанныеТриггера.ТриггерноеСобытие);
		Запрос.УстановитьПараметр("ТекущаяДата"				, ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ВидСделки"				, ДанныеТриггера.ВидСделки);
		Запрос.УстановитьПараметр("ЗадержкаНаЭтапе"			, ДанныеТриггера.ПереходСЭтапа);
		Запрос.УстановитьПараметр("ПараметрЗадержкаМинут"	, ЗадержкаМинут);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ИсторияИзмененияЭтапаСделок.Ссылка КАК Сделка
		               |ПОМЕСТИТЬ АнализируемаяТаблицаСделок
		               |ИЗ
		               |	Справочник.Сделки.ИсторияИзмененияЭтапов КАК ИсторияИзмененияЭтапаСделок
		               |ГДЕ
		               |	ИсторияИзмененияЭтапаСделок.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |	И ИсторияИзмененияЭтапаСделок.Ссылка.ВидСделки = &ВидСделки
		               |	И ИсторияИзмененияЭтапаСделок.Ссылка.Контрагент В(&СегментКонтрагентов)
		               |	И ИсторияИзмененияЭтапаСделок.Дата > ДОБАВИТЬКДАТЕ(&ДатаВыборки, МИНУТА, -240)
		               |	И ИсторияИзмененияЭтапаСделок.ПереходНаЭтап = &ЗадержкаНаЭтапе
		               |	И ИсторияИзмененияЭтапаСделок.Ссылка.Контрагент.ОбезличенныйКлиент = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ИсторияИзмененияЭтапаСделок.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	АнализируемаяТаблицаСделок.Сделка КАК Сделка
		               |ПОМЕСТИТЬ ТаблицаОтработанныхСобытий
		               |ИЗ
		               |	АнализируемаяТаблицаСделок КАК АнализируемаяТаблицаСделок
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		               |			И (АнализируемаяТаблицаСделок.Сделка = (ВЫРАЗИТЬ(ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Справочник.Сделки)))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СделкиИсторияИзмененияЭтапов.Ссылка КАК Ссылка,
		               |	СделкиИсторияИзмененияЭтапов.НомерСтроки КАК НомерСтроки,
		               |	СделкиИсторияИзмененияЭтапов.Дата КАК Дата,
		               |	СделкиИсторияИзмененияЭтапов.ПереходСЭтапа КАК ПереходСЭтапа,
		               |	СделкиИсторияИзмененияЭтапов.ПереходНаЭтап КАК ПереходНаЭтап
		               |ПОМЕСТИТЬ ТаблицаИсторииИзмененияЭтапов
		               |ИЗ
		               |	Справочник.Сделки.ИсторияИзмененияЭтапов КАК СделкиИсторияИзмененияЭтапов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АнализируемаяТаблицаСделок КАК АнализируемаяТаблицаСделок
		               |		ПО СделкиИсторияИзмененияЭтапов.Ссылка = АнализируемаяТаблицаСделок.Сделка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхСобытий КАК ТаблицаОтработанныхСобытий
		               |		ПО СделкиИсторияИзмененияЭтапов.Ссылка = ТаблицаОтработанныхСобытий.Сделка
		               |ГДЕ
		               |	ТаблицаОтработанныхСобытий.Сделка ЕСТЬ NULL
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СделкиИсторияИзмененияЭтапов.Ссылка,
		               |	СделкиИсторияИзмененияЭтапов.Дата,
		               |	СделкиИсторияИзмененияЭтапов.ПереходСЭтапа,
		               |	СделкиИсторияИзмененияЭтапов.ПереходНаЭтап,
		               |	СделкиИсторияИзмененияЭтапов.НомерСтроки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаИсторииИзмененияЭтапов.Ссылка КАК Ссылка,
		               |	ТаблицаИсторииИзмененияЭтапов.НомерСтроки КАК НомерСтроки,
		               |	ТаблицаИсторииИзмененияЭтапов.Дата КАК Дата,
		               |	ТаблицаИсторииИзмененияЭтапов.ПереходСЭтапа КАК ПереходСЭтапа,
		               |	ТаблицаИсторииИзмененияЭтапов.ПереходНаЭтап КАК ПереходНаЭтап,
		               |	КОЛИЧЕСТВО(ТаблицаИсторииИзмененияЭтапов1.ПереходНаЭтап) КАК НомерПоПорядку
		               |ПОМЕСТИТЬ ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов
		               |ИЗ
		               |	ТаблицаИсторииИзмененияЭтапов КАК ТаблицаИсторииИзмененияЭтапов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИсторииИзмененияЭтапов КАК ТаблицаИсторииИзмененияЭтапов1
		               |		ПО ТаблицаИсторииИзмененияЭтапов.Дата >= ТаблицаИсторииИзмененияЭтапов1.Дата
		               |			И (ВЫБОР
		               |				КОГДА ТаблицаИсторииИзмененияЭтапов.Дата = ТаблицаИсторииИзмененияЭтапов1.Дата
		               |					ТОГДА ТаблицаИсторииИзмененияЭтапов.НомерСтроки >= ТаблицаИсторииИзмененияЭтапов1.НомерСтроки
		               |				ИНАЧЕ ИСТИНА
		               |			КОНЕЦ)
		               |			И ТаблицаИсторииИзмененияЭтапов.Ссылка = ТаблицаИсторииИзмененияЭтапов1.Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИсторииИзмененияЭтапов.Ссылка,
		               |	ТаблицаИсторииИзмененияЭтапов.НомерСтроки,
		               |	ТаблицаИсторииИзмененияЭтапов.Дата,
		               |	ТаблицаИсторииИзмененияЭтапов.ПереходСЭтапа,
		               |	ТаблицаИсторииИзмененияЭтапов.ПереходНаЭтап
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.Ссылка КАК Сделка,
		               |	ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.НомерСтроки КАК НомерСтроки,
		               |	ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.Дата КАК Дата,
		               |	ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.ПереходСЭтапа КАК ПереходСЭтапа,
		               |	ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.ПереходНаЭтап КАК ПереходНаЭтап,
		               |	ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.НомерПоПорядку КАК НомерПоПорядку,
		               |	РАЗНОСТЬДАТ(ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.Дата, ЕСТЬNULL(ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов1.Дата, &ТекущаяДата), МИНУТА) КАК ЗадержкаНаЭтапе
		               |ПОМЕСТИТЬ ИтоговаяТаблица
		               |ИЗ
		               |	ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов КАК ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов КАК ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов1
		               |		ПО (ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.НомерПоПорядку = ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов1.НомерПоПорядку - 1)
		               |			И ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.ПереходНаЭтап = ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов1.ПереходСЭтапа
		               |			И ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.Дата <> ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов1.Дата
		               |			И ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.Ссылка = ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов1.Ссылка
		               |ГДЕ
		               |	ТаблицаПорядковыхНомеровИсторииИзмененияЭтапов.ПереходНаЭтап = &ЗадержкаНаЭтапе
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИтоговаяТаблица.Сделка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ИтоговаяТаблица.Сделка КАК Сделка,
		               |	ИтоговаяТаблица.Сделка КАК ОбъектСобытия,
		               |	ИтоговаяТаблица.Сделка.Контрагент КАК Контрагент,
		               |	ИтоговаяТаблица.ПереходСЭтапа КАК ПереходСЭтапа,
		               |	ИтоговаяТаблица.ПереходНаЭтап КАК ПереходНаЭтап,
		               |	МАКСИМУМ(ИтоговаяТаблица.Дата) КАК ДатаПереходаНаЭтап,
		               |	СРЕДНЕЕ(ИтоговаяТаблица.ЗадержкаНаЭтапе) КАК ЗадержкаНаЭтапе,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ИтоговаяТаблица КАК ИтоговаяТаблица
		               |ГДЕ
		               |	ИтоговаяТаблица.ЗадержкаНаЭтапе > &ПараметрЗадержкаМинут
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ИтоговаяТаблица.Сделка.СтруктурнаяЕдиница,
		               |	ИтоговаяТаблица.Сделка,
		               |	ИтоговаяТаблица.Сделка.Контрагент,
		               |	ИтоговаяТаблица.ПереходСЭтапа,
		               |	ИтоговаяТаблица.ПереходНаЭтап,
		               |	ИтоговаяТаблица.Сделка";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияИзмененияЭтапаСделок.Ссылка.Контрагент В(&СегментКонтрагентов)",
			"ИсторияИзмененияЭтапаСделок.Ссылка.Контрагент В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты)
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов И НЕ ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Контрагенты) ЕСТЬ NULL)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсторияИзмененияЭтапаСделок.Ссылка.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события лицевой счет взнос
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЛицевойСчетВзнос(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
		
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("ПоступлениеДенежныхСредств"	, ОбъектСобытия);
		Запрос.УстановитьПараметр("ТекущаяДата"					, ТекущаяДатаСеанса());

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеДенежныхСредств.Ссылка КАК ОбъектСобытия,
		|	ПоступлениеДенежныхСредств.ЛицевойСчетКонтрагента КАК ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА ПоступлениеДенежныхСредств.Контрагент ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ПоступлениеДенежныхСредств.Контрагент КАК Справочник.Контрагенты)
		|		КОГДА ПоступлениеДенежныхСредств.Контрагент ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ВЫРАЗИТЬ(ПоступлениеДенежныхСредств.Контрагент КАК Справочник.Сотрудники).Контрагент
		|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеДенежныхСредств.Контрагент КАК Справочник.Контрагенты)
		|	КОНЕЦ КАК Контрагент,
		|	ПоступлениеДенежныхСредств.Дата КАК ДатаПлатежа,
		|	ПоступлениеДенежныхСредств.ЛицевойСчетКонтрагента КАК ВидЛицевогоСчета,
		|	ПоступлениеДенежныхСредств.СуммаДокумента КАК СуммаВзноса
		|ПОМЕСТИТЬ ТаблицаУчтенныхАвансов
		|ИЗ
		|	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
		|ГДЕ
		|	ПоступлениеДенежныхСредств.Ссылка = &ПоступлениеДенежныхСредств
		|	И ПоступлениеДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВзносНаЛицевойСчет)
		|	И НАЧАЛОПЕРИОДА(ПоступлениеДенежныхСредств.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаУчтенныхАвансов.ОбъектСобытия.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаУчтенныхАвансов.ОбъектСобытия КАК ОбъектСобытия,
		|	ТаблицаУчтенныхАвансов.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаУчтенныхАвансов.Контрагент КАК Контрагент,
		|	ТаблицаУчтенныхАвансов.ДатаПлатежа КАК ДатаПлатежа,
		|	ТаблицаУчтенныхАвансов.СуммаВзноса КАК СуммаВзноса,
		|	ТаблицаУчтенныхАвансов.ВидЛицевогоСчета КАК ВидЛицевогоСчета
		|ПОМЕСТИТЬ ТаблицаУчтенныхАвансовСОтбором
		|ИЗ
		|	ТаблицаУчтенныхАвансов КАК ТаблицаУчтенныхАвансов
		|ГДЕ
		|	ТаблицаУчтенныхАвансов.ВидЛицевогоСчета = &ВидЛицевогоСчета
		|	И ТаблицаУчтенныхАвансов.Контрагент В(&СегментКонтрагентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета КАК ЛицевойСчет,
		|	СУММА(ДенежныеСредстваНаЛицевыхСчетах.СуммаОстаток) КАК Остаток
		|ПОМЕСТИТЬ ТаблицаОстатковПоЛицевомуСчету
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Остатки(
		|			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		|			Контрагент В
		|					(ВЫБРАТЬ
		|						ТаблицаУчтенныхАвансовСОтбором.Контрагент
		|					ИЗ
		|						ТаблицаУчтенныхАвансовСОтбором)
		|				И ВидСчета В
		|					(ВЫБРАТЬ
		|						ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет
		|					ИЗ
		|						ТаблицаУчтенныхАвансовСОтбором)) КАК ДенежныеСредстваНаЛицевыхСчетах
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаУчтенныхАвансовСОтбором.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаУчтенныхАвансовСОтбором.ОбъектСобытия КАК ОбъектСобытия,
		|	ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет КАК ВидЛицевогоСчета,
		|	ТаблицаУчтенныхАвансовСОтбором.Контрагент КАК Контрагент,
		|	ТаблицаУчтенныхАвансовСОтбором.ДатаПлатежа КАК ДатаПлатежа,
		|	ТаблицаУчтенныхАвансовСОтбором.СуммаВзноса КАК СуммаВзноса,
		|	ЕСТЬNULL(ТаблицаОстатковПоЛицевомуСчету.Остаток, 0) КАК Остаток,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаУчтенныхАвансовСОтбором КАК ТаблицаУчтенныхАвансовСОтбором
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПоЛицевомуСчету КАК ТаблицаОстатковПоЛицевомуСчету
		|		ПО ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет = ТаблицаОстатковПоЛицевомуСчету.ЛицевойСчет";
	
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаУчтенныхАвансов.Контрагент В(&СегментКонтрагентов)",
					"ТаблицаУчтенныхАвансов.Контрагент В
	               |					(ВЫБРАТЬ
	               |						КонтрагентыСегмента.Контрагент
	               |					ИЗ
	               |						РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
	               |					ГДЕ
	               |						КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаУчтенныхАвансов.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидЛицевогоСчета) Тогда
			Запрос.УстановитьПараметр("ВидЛицевогоСчета", ДанныеТриггера.ВидЛицевогоСчета);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаУчтенныхАвансов.ВидЛицевогоСчета = &ВидЛицевогоСчета", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события лицевой счет списание
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЛицевойСчетСписание(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
		
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("СписаниеДенежныхСредств"		, ОбъектСобытия);
		Запрос.УстановитьПараметр("ТекущаяДата"					, ТекущаяДатаСеанса());

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеДенежныхСредств.Ссылка КАК ОбъектСобытия,
		|	СписаниеДенежныхСредств.ЛицевойСчетКонтрагента КАК ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА СписаниеДенежныхСредств.Контрагент ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(СписаниеДенежныхСредств.Контрагент КАК Справочник.Контрагенты)
		|		КОГДА СписаниеДенежныхСредств.Контрагент ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ВЫРАЗИТЬ(СписаниеДенежныхСредств.Контрагент КАК Справочник.Сотрудники).Контрагент
		|		ИНАЧЕ ВЫРАЗИТЬ(СписаниеДенежныхСредств.Контрагент КАК Справочник.Контрагенты)
		|	КОНЕЦ КАК Контрагент,
		|	СписаниеДенежныхСредств.Дата КАК ДатаПлатежа,
		|	СписаниеДенежныхСредств.ЛицевойСчетКонтрагента КАК ВидЛицевогоСчета,
		|	СписаниеДенежныхСредств.СуммаДокумента КАК СуммаСписания
		|ПОМЕСТИТЬ ТаблицаУчтенныхАвансов
		|ИЗ
		|	Документ.СписаниеДенежныхСредств КАК СписаниеДенежныхСредств
		|ГДЕ
		|	СписаниеДенежныхСредств.Ссылка = &СписаниеДенежныхСредств
		|	И СписаниеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
		|	И НАЧАЛОПЕРИОДА(СписаниеДенежныхСредств.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаУчтенныхАвансов.ОбъектСобытия.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаУчтенныхАвансов.ОбъектСобытия КАК ОбъектСобытия,
		|	ТаблицаУчтенныхАвансов.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаУчтенныхАвансов.Контрагент КАК Контрагент,
		|	ТаблицаУчтенныхАвансов.ДатаПлатежа КАК ДатаПлатежа,
		|	ТаблицаУчтенныхАвансов.СуммаСписания КАК СуммаСписания
		|ПОМЕСТИТЬ ТаблицаУчтенныхАвансовСОтбором
		|ИЗ
		|	ТаблицаУчтенныхАвансов КАК ТаблицаУчтенныхАвансов
		|ГДЕ
		|	ТаблицаУчтенныхАвансов.ВидЛицевогоСчета = &ВидЛицевогоСчета
		|	И ТаблицаУчтенныхАвансов.Контрагент В(&СегментКонтрагентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета КАК ЛицевойСчет,
		|	СУММА(ДенежныеСредстваНаЛицевыхСчетах.СуммаОстаток) КАК Остаток
		|ПОМЕСТИТЬ ТаблицаОстатковПоЛицевомуСчету
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Остатки(
		|			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		|			Контрагент В
		|					(ВЫБРАТЬ
		|						ТаблицаУчтенныхАвансовСОтбором.Контрагент
		|					ИЗ
		|						ТаблицаУчтенныхАвансовСОтбором)
		|				И ВидСчета В
		|					(ВЫБРАТЬ
		|						ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет
		|					ИЗ
		|						ТаблицаУчтенныхАвансовСОтбором)) КАК ДенежныеСредстваНаЛицевыхСчетах
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаУчтенныхАвансовСОтбором.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаУчтенныхАвансовСОтбором.ОбъектСобытия КАК ОбъектСобытия,
		|	ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет КАК ВидЛицевогоСчета,
		|	ТаблицаУчтенныхАвансовСОтбором.Контрагент КАК Контрагент,
		|	ТаблицаУчтенныхАвансовСОтбором.ДатаПлатежа КАК ДатаПлатежа,
		|	ТаблицаУчтенныхАвансовСОтбором.СуммаСписания КАК СуммаСписания,
		|	ЕСТЬNULL(ТаблицаОстатковПоЛицевомуСчету.Остаток, 0) КАК Остаток,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаУчтенныхАвансовСОтбором КАК ТаблицаУчтенныхАвансовСОтбором
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПоЛицевомуСчету КАК ТаблицаОстатковПоЛицевомуСчету
		|		ПО ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет = ТаблицаОстатковПоЛицевомуСчету.ЛицевойСчет";
	
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаУчтенныхАвансов.Контрагент В(&СегментКонтрагентов)",
					"ТаблицаУчтенныхАвансов.Контрагент В
	               |					(ВЫБРАТЬ
	               |						КонтрагентыСегмента.Контрагент
	               |					ИЗ
	               |						РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
	               |					ГДЕ
	               |						КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаУчтенныхАвансов.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидЛицевогоСчета) Тогда
			Запрос.УстановитьПараметр("ВидЛицевогоСчета", ДанныеТриггера.ВидЛицевогоСчета);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаУчтенныхАвансов.ВидЛицевогоСчета = &ВидЛицевогоСчета", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события лицевой счет критический остаток средств
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЛицевойСчетКритическийОстатокСредств(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
		
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Реализация"					, ОбъектСобытия);
		Запрос.УстановитьПараметр("МинимальноеЗначениеОстатка"	, ДанныеТриггера.ПараметрСобытия);
		Запрос.УстановитьПараметр("ТекущаяДата"					, ТекущаяДатаСеанса());

		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		               |	РеализацияУчтенныеАвансы.Ссылка КАК ОбъектСобытия,
		               |	РеализацияУчтенныеАвансы.Аванс КАК ЛицевойСчет,
		               |	ВЫБОР
		               |		КОГДА РеализацияУчтенныеАвансы.ВладелецАванса ССЫЛКА Справочник.Контрагенты
		               |			ТОГДА ВЫРАЗИТЬ(РеализацияУчтенныеАвансы.ВладелецАванса КАК Справочник.Контрагенты)
		               |		КОГДА РеализацияУчтенныеАвансы.ВладелецАванса ССЫЛКА Справочник.Сотрудники
		               |			ТОГДА ВЫРАЗИТЬ(РеализацияУчтенныеАвансы.ВладелецАванса КАК Справочник.Сотрудники).Контрагент
		               |		ИНАЧЕ ВЫРАЗИТЬ(РеализацияУчтенныеАвансы.ВладелецАванса КАК Справочник.Контрагенты)
		               |	КОНЕЦ КАК Контрагент,
		               |	РеализацияУчтенныеАвансы.ДатаПлатежа КАК ДатаПлатежа,
		               |	РеализацияУчтенныеАвансы.СуммаАванса КАК СуммаСписания,
		               |	РеализацияУчтенныеАвансы.Ссылка.Контрагент КАК КонтрагентРеализации
		               |ПОМЕСТИТЬ ТаблицаУчтенныхАвансов
		               |ИЗ
		               |	Документ.Реализация.УчтенныеАвансы КАК РеализацияУчтенныеАвансы
		               |ГДЕ
		               |	РеализацияУчтенныеАвансы.Ссылка = &Реализация
		               |	И НЕ РеализацияУчтенныеАвансы.ВладелецАванса ССЫЛКА Справочник.ПартииНоменклатуры
		               |	И НАЧАЛОПЕРИОДА(РеализацияУчтенныеАвансы.ДатаПлатежа, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		               |	И РеализацияУчтенныеАвансы.ТипАвансовыхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаУчтенныхАвансов.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаУчтенныхАвансов.ЛицевойСчет КАК ЛицевойСчет,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ТаблицаУчтенныхАвансов.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |			ТОГДА ТаблицаУчтенныхАвансов.КонтрагентРеализации
		               |		ИНАЧЕ ТаблицаУчтенныхАвансов.Контрагент
		               |	КОНЕЦ КАК Контрагент,
		               |	ТаблицаУчтенныхАвансов.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаУчтенныхАвансов.СуммаСписания КАК СуммаСписания
		               |ПОМЕСТИТЬ ТаблицаУчтенныхАвансовСОтбором
		               |ИЗ
		               |	ТаблицаУчтенныхАвансов КАК ТаблицаУчтенныхАвансов
		               |ГДЕ
		               |	ТаблицаУчтенныхАвансов.ЛицевойСчет.ВидЛицевогоСчета = &ВидЛицевогоСчета
		               |	И ВЫБОР
		               |			КОГДА ЕСТЬNULL(ТаблицаУчтенныхАвансов.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |				ТОГДА ТаблицаУчтенныхАвансов.КонтрагентРеализации В (&СегментКонтрагентов)
		               |			ИНАЧЕ ТаблицаУчтенныхАвансов.Контрагент В (&СегментКонтрагентов)
		               |		КОНЕЦ
		               |	И ВЫБОР
		               |			КОГДА ЕСТЬNULL(ТаблицаУчтенныхАвансов.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |				ТОГДА ТаблицаУчтенныхАвансов.КонтрагентРеализации.ОбезличенныйКлиент = ЛОЖЬ
		               |			ИНАЧЕ ТаблицаУчтенныхАвансов.Контрагент.ОбезличенныйКлиент = ЛОЖЬ
		               |		КОНЕЦ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РасчетыСПокупателямиОстаткиИОбороты.Основание КАК ЛицевойСчет,
		               |	СУММА(РасчетыСПокупателямиОстаткиИОбороты.СуммаОборот) КАК Остаток
		               |ПОМЕСТИТЬ ТаблицаОстатковПоЛицевомуСчету
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПокупателями.ОстаткиИОбороты(
		               |			,
		               |			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		               |			Запись,
		               |			,
		               |			Контрагент В
		               |					(ВЫБРАТЬ
		               |						ТаблицаУчтенныхАвансовСОтбором.Контрагент
		               |					ИЗ
		               |						ТаблицаУчтенныхАвансовСОтбором)
		               |				И Основание В
		               |					(ВЫБРАТЬ
		               |						ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет
		               |					ИЗ
		               |						ТаблицаУчтенныхАвансовСОтбором)
		               |				И ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.ЛицевойСчет)) КАК РасчетыСПокупателямиОстаткиИОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыСПокупателямиОстаткиИОбороты.Основание
		               |
		               |ИМЕЮЩИЕ
		               |	СУММА(РасчетыСПокупателямиОстаткиИОбороты.СуммаОборот) <= &МинимальноеЗначениеОстатка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаУчтенныхАвансовСОтбором.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет КАК ЛицевойСчет,
		               |	ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
		               |	ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет.ДатаОткрытия КАК ДатаОткрытия,
		               |	ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет.СрокДействияНачало КАК СрокДействияНачало,
		               |	ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет.СрокДействияКонец КАК СрокДействияКонец,
		               |	ТаблицаУчтенныхАвансовСОтбором.Контрагент КАК Контрагент,
		               |	ТаблицаУчтенныхАвансовСОтбором.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаУчтенныхАвансовСОтбором.СуммаСписания КАК СуммаСписания,
		               |	ТаблицаОстатковПоЛицевомуСчету.Остаток КАК Остаток,
		               |	ТаблицаУчтенныхАвансовСОтбором.ОбъектСобытия.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаУчтенныхАвансовСОтбором КАК ТаблицаУчтенныхАвансовСОтбором
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковПоЛицевомуСчету КАК ТаблицаОстатковПоЛицевомуСчету
		               |		ПО ТаблицаУчтенныхАвансовСОтбором.ЛицевойСчет = ТаблицаОстатковПоЛицевомуСчету.ЛицевойСчет";
	
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТаблицаУчтенныхАвансов.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ТаблицаУчтенныхАвансов.КонтрагентРеализации В (&СегментКонтрагентов)
	               |			ИНАЧЕ ТаблицаУчтенныхАвансов.Контрагент В (&СегментКонтрагентов)
	               |		КОНЕЦ",
					"ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТаблицаУчтенныхАвансов.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ТаблицаУчтенныхАвансов.КонтрагентРеализации В
	               |						(ВЫБРАТЬ
	               |							СоставСегментов.ОбъектСегмента
	               |						ИЗ
	               |							РегистрСведений.СоставСегментов КАК СоставСегментов
	               |						ГДЕ
	               |							СоставСегментов.Сегмент = &СегментКонтрагентов)
	               |			ИНАЧЕ ТаблицаУчтенныхАвансов.Контрагент В
	               |					(ВЫБРАТЬ
	               |						СоставСегментов.ОбъектСегмента
	               |					ИЗ
	               |						РегистрСведений.СоставСегментов КАК СоставСегментов
	               |					ГДЕ
	               |						СоставСегментов.Сегмент = &СегментКонтрагентов)
	               |		КОНЕЦ");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТаблицаУчтенныхАвансов.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ТаблицаУчтенныхАвансов.КонтрагентРеализации В (&СегментКонтрагентов)
	               |			ИНАЧЕ ТаблицаУчтенныхАвансов.Контрагент В (&СегментКонтрагентов)
	               |		КОНЕЦ", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидЛицевогоСчета) Тогда
			Запрос.УстановитьПараметр("ВидЛицевогоСчета", ДанныеТриггера.ВидЛицевогоСчета);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаУчтенныхАвансов.ЛицевойСчет.ВидЛицевогоСчета = &ВидЛицевогоСчета", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события лицевой счет окончание срока действия
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЛицевойСчетОкончаниеСрокаДействия(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ
		
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫРАЗИТЬ(ЛицевыеСчета.ВладелецЛицевогоСчета КАК Справочник.Контрагенты) КАК Контрагент,
		               |	ЛицевыеСчета.Ссылка КАК ОбъектСобытия,
		               |	ЛицевыеСчета.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
		               |	ЛицевыеСчета.ДатаОткрытия КАК ДатаОткрытия,
		               |	ЛицевыеСчета.СрокДействияНачало КАК СрокДействияНачало,
		               |	ЛицевыеСчета.СрокДействияКонец КАК СрокДействияКонец,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ПОМЕСТИТЬ ТаблицаКлиентовСИстекающимиЛицевымиСчетами
		               |ИЗ
		               |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		               |ГДЕ
		               |	ЛицевыеСчета.ПометкаУдаления = ЛОЖЬ
		               |	И ЛицевыеСчета.Архивный = ЛОЖЬ
		               |	И ЛицевыеСчета.ВидЛицевогоСчета = &ВидЛицевогоСчета
		               |	И НЕ ВЫРАЗИТЬ(ЛицевыеСчета.ВладелецЛицевогоСчета КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |	И ВЫБОР
		               |			КОГДА НЕ ВЫРАЗИТЬ(ЛицевыеСчета.ВладелецЛицевогоСчета КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |				ТОГДА ВЫРАЗИТЬ(ЛицевыеСчета.ВладелецЛицевогоСчета КАК Справочник.Контрагенты).ОбезличенныйКлиент = ЛОЖЬ
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И ЛицевыеСчета.ВладелецЛицевогоСчета В(&СегментКонтрагентов)
		               |	И ЛицевыеСчета.Закрыт = ЛОЖЬ
		               |	И НАЧАЛОПЕРИОДА(ЛицевыеСчета.СрокДействияКонец, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия
		               |ПОМЕСТИТЬ ТаблицаОтработанныхТриггеров
		               |ИЗ
		               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |ГДЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
		               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаКлиентовСИстекающимиЛицевымиСчетами.Контрагент
		               |			ИЗ
		               |				ТаблицаКлиентовСИстекающимиЛицевымиСчетами)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами.Контрагент КАК Контрагент,
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами.ДатаОткрытия КАК ДатаОткрытия,
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами.СрокДействияНачало КАК СрокДействияНачало,
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами.СрокДействияКонец КАК СрокДействияКонец,
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами.РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ПОМЕСТИТЬ ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам
		               |ИЗ
		               |	ТаблицаКлиентовСИстекающимиЛицевымиСчетами КАК ТаблицаКлиентовСИстекающимиЛицевымиСчетами
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
		               |		ПО ТаблицаКлиентовСИстекающимиЛицевымиСчетами.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
		               |			И ТаблицаКлиентовСИстекающимиЛицевымиСчетами.ОбъектСобытия = ТаблицаОтработанныхТриггеров.ОбъектСобытия
		               |ГДЕ
		               |	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
		               |ПОМЕСТИТЬ ТаблицаАктуальныхКлиентов
		               |ИЗ
		               |	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(
		               |			КОНЕЦПЕРИОДА(&ДатаТриггера, ДЕНЬ),
		               |			Контрагент В
		               |				(ВЫБРАТЬ
		               |					ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.Контрагент
		               |				ИЗ
		               |					ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам)) КАК СтатусыКонтрагентовСрезПоследних
		               |ГДЕ
		               |	СтатусыКонтрагентовСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.Контрагент КАК Контрагент,
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.ДатаОткрытия КАК ДатаОткрытия,
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.СрокДействияНачало КАК СрокДействияНачало,
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.СрокДействияКонец КАК СрокДействияКонец,
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.Контрагент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ПОМЕСТИТЬ ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов
		               |ИЗ
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам КАК ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам
		               |ГДЕ
		               |	ТаблицаНеОтработанныхКлиентовПоЛицевымСчетам.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаАктуальныхКлиентов.Контрагент
		               |			ИЗ
		               |				ТаблицаАктуальныхКлиентов)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РасчетыСПокупателямиОстаткиИОбороты.Основание КАК ЛицевойСчет,
		               |	СУММА(РасчетыСПокупателямиОстаткиИОбороты.СуммаОборот) КАК Остаток
		               |ПОМЕСТИТЬ ТаблицаОстатковПоЛицевомуСчету
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПокупателями.ОстаткиИОбороты(
		               |			,
		               |			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		               |			Запись,
		               |			,
		               |			Контрагент В
		               |					(ВЫБРАТЬ
		               |						ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.Контрагент
		               |					ИЗ
		               |						ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов)
		               |				И Основание В
		               |					(ВЫБРАТЬ
		               |						ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.ОбъектСобытия
		               |					ИЗ
		               |						ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов)
		               |				И ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.ЛицевойСчет)) КАК РасчетыСПокупателямиОстаткиИОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыСПокупателямиОстаткиИОбороты.Основание
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.Контрагент КАК Контрагент,
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.ОбъектСобытия КАК ОбъектСобытия,
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.ВидЛицевогоСчета КАК ВидЛицевогоСчета,
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.ДатаОткрытия КАК ДатаОткрытия,
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.СрокДействияНачало КАК СрокДействияНачало,
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.СрокДействияКонец КАК СрокДействияКонец,
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.РегистрацияЗапланированных КАК РегистрацияЗапланированных,
		               |	ТаблицаОстатковПоЛицевомуСчету.Остаток КАК Остаток
		               |ИЗ
		               |	ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов КАК ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПоЛицевомуСчету КАК ТаблицаОстатковПоЛицевомуСчету
		               |		ПО ИтоговаяТаблицаЗакрывающихсяЛицевыхСчетов.ОбъектСобытия = ТаблицаОстатковПоЛицевомуСчету.ЛицевойСчет";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЛицевыеСчета.ВладелецЛицевогоСчета В(&СегментКонтрагентов)",
			"ЛицевыеСчета.ВладелецЛицевогоСчета В
			|			(ВЫБРАТЬ
			|				СоставСегментов.ОбъектСегмента
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЛицевыеСчета.ВладелецЛицевогоСчета В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидЛицевогоСчета) Тогда
			Запрос.УстановитьПараметр("ВидЛицевогоСчета", ДанныеТриггера.ВидЛицевогоСчета);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЛицевыеСчета.ВидЛицевогоСчета = &ВидЛицевогоСчета", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события бонусный счет начисление
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_БонусныйСчетНачисление(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
		
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("ДокументНачисления"	, ОбъектСобытия);
		Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());

		Запрос.Текст = "ВЫБРАТЬ
		               |	БонусныеСчетаОбороты.Регистратор КАК ОбъектСобытия,
		               |	БонусныеСчетаОбороты.БонусныйСчет КАК БонусныйСчет,
		               |	БонусныеСчетаОбороты.Период КАК ДатаПлатежа,
		               |	ЕСТЬNULL(СУММА(БонусныеСчетаОбороты.СуммаПриход), 0) КАК СуммаНачисления
		               |ПОМЕСТИТЬ ТаблицаОперацийСБонуснымСчетом
		               |ИЗ
		               |	РегистрНакопления.БонусныеСчета.Обороты(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), Регистратор, ) КАК БонусныеСчетаОбороты
		               |ГДЕ
		               |	БонусныеСчетаОбороты.Регистратор = &ДокументНачисления
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	БонусныеСчетаОбороты.Регистратор,
		               |	БонусныеСчетаОбороты.БонусныйСчет,
		               |	БонусныеСчетаОбороты.Период
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОперацийСБонуснымСчетом.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаОперацийСБонуснымСчетом.БонусныйСчет КАК БонусныйСчет,
		               |	ВЫБОР
		               |		КОГДА ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.Именной
		               |			ТОГДА ВЫБОР
		               |					КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |						ТОГДА ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Контрагенты)
		               |					КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты) ЕСТЬ NULL
		               |						ТОГДА ВЫБОР
		               |								КОГДА НЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |									ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Контрагенты)
		               |								ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Сотрудники).Контрагент
		               |							КОНЕЦ
		               |					ИНАЧЕ НЕОПРЕДЕЛЕНО
		               |				КОНЕЦ
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.ОбъектСобытия КАК Документ.ОперацияПоБонусномуСчету) ЕСТЬ NULL
		               |					ТОГДА ВЫБОР
		               |							КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |								ТОГДА ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Контрагенты)
		               |							КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты) ЕСТЬ NULL
		               |								ТОГДА ВЫБОР
		               |										КОГДА НЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |											ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Контрагенты)
		               |										ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Сотрудники).Контрагент
		               |									КОНЕЦ
		               |							ИНАЧЕ НЕОПРЕДЕЛЕНО
		               |						КОНЕЦ
		               |				ИНАЧЕ ТаблицаОперацийСБонуснымСчетом.ОбъектСобытия.Контрагент
		               |			КОНЕЦ
		               |	КОНЕЦ КАК Контрагент,
		               |	ТаблицаОперацийСБонуснымСчетом.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаОперацийСБонуснымСчетом.СуммаНачисления КАК СуммаНачисления,
		               |	ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВидБонусногоСчета КАК ВидБонусногоСчета
		               |ПОМЕСТИТЬ ТаблицаОперацийСБонуснымСчетомКонтрагента
		               |ИЗ
		               |	ТаблицаОперацийСБонуснымСчетом КАК ТаблицаОперацийСБонуснымСчетом
		               |ГДЕ
		               |	ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВидБонусногоСчета = &ВидБонусногоСчета
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.БонусныйСчет КАК БонусныйСчет,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент КАК Контрагент,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.СуммаНачисления КАК СуммаНачисления,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.ВидБонусногоСчета КАК ВидБонусногоСчета
		               |ПОМЕСТИТЬ ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор
		               |ИЗ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента КАК ТаблицаОперацийСБонуснымСчетомКонтрагента
		               |ГДЕ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент <> НЕОПРЕДЕЛЕНО
		               |	И ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент В(&СегментКонтрагентов)
		               |	И ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент.ОбезличенныйКлиент = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
		               |	ЕСТЬNULL(СУММА(БонусныеСчетаОстатки.СуммаОстаток), 0) КАК СуммаОстаток
		               |ПОМЕСТИТЬ ТаблицаОстатковПоБонусномуСчету
		               |ИЗ
		               |	РегистрНакопления.БонусныеСчета.Остатки(
		               |			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		               |			БонусныйСчет В
		               |				(ВЫБРАТЬ
		               |					ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет
		               |				ИЗ
		               |					ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор)) КАК БонусныеСчетаОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	БонусныеСчетаОстатки.БонусныйСчет
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет КАК БонусныйСчет,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.ВидБонусногоСчета КАК ВидБонусногоСчета,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет.ДатаОткрытия КАК ДатаОткрытия,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет.СрокДействияНачало КАК СрокДействияНачало,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет.СрокДействияКонец КАК СрокДействияКонец,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.Контрагент КАК Контрагент,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.СуммаНачисления КАК СуммаНачисления,
		               |	ТаблицаОстатковПоБонусномуСчету.СуммаОстаток КАК Остаток,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.ОбъектСобытия.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор КАК ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПоБонусномуСчету КАК ТаблицаОстатковПоБонусномуСчету
		               |		ПО ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет = ТаблицаОстатковПоБонусномуСчету.БонусныйСчет";
	
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент В(&СегментКонтрагентов)",
					"ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент В
	               |					(ВЫБРАТЬ
	               |						СоставСегментов.ОбъектСегмента
	               |					ИЗ
	               |						РегистрСведений.СоставСегментов КАК СоставСегментов
	               |					ГДЕ
	               |						СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидБонусногоСчета) Тогда
			Запрос.УстановитьПараметр("ВидБонусногоСчета", ДанныеТриггера.ВидБонусногоСчета);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВидБонусногоСчета = &ВидБонусногоСчета", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события бонусный счет списание
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_БонусныйСчетСписание(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
		
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("ДокументСписания"	, ОбъектСобытия);
		Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());

		Запрос.Текст = "ВЫБРАТЬ
		               |	БонусныеСчетаОбороты.Регистратор КАК ОбъектСобытия,
		               |	БонусныеСчетаОбороты.БонусныйСчет КАК БонусныйСчет,
		               |	БонусныеСчетаОбороты.Период КАК ДатаПлатежа,
		               |	ЕСТЬNULL(СУММА(БонусныеСчетаОбороты.СуммаРасход), 0) КАК СуммаСписания
		               |ПОМЕСТИТЬ ТаблицаОперацийСБонуснымСчетом
		               |ИЗ
		               |	РегистрНакопления.БонусныеСчета.Обороты(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), Регистратор, ) КАК БонусныеСчетаОбороты
		               |ГДЕ
		               |	БонусныеСчетаОбороты.Регистратор = &ДокументСписания
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	БонусныеСчетаОбороты.Регистратор,
		               |	БонусныеСчетаОбороты.БонусныйСчет,
		               |	БонусныеСчетаОбороты.Период
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОперацийСБонуснымСчетом.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаОперацийСБонуснымСчетом.БонусныйСчет КАК БонусныйСчет,
		               |	ВЫБОР
		               |		КОГДА ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.Именной
		               |			ТОГДА ВЫБОР
		               |					КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |						ТОГДА ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Контрагенты)
		               |					КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты) ЕСТЬ NULL
		               |						ТОГДА ВЫБОР
		               |								КОГДА НЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |									ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Контрагенты)
		               |								ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Сотрудники).Контрагент
		               |							КОНЕЦ
		               |					ИНАЧЕ НЕОПРЕДЕЛЕНО
		               |				КОНЕЦ
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.ОбъектСобытия КАК Документ.ОперацияПоБонусномуСчету) ЕСТЬ NULL
		               |					ТОГДА ВЫБОР
		               |							КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |								ТОГДА ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Контрагенты)
		               |							КОГДА НЕ ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты) ЕСТЬ NULL
		               |								ТОГДА ВЫБОР
		               |										КОГДА НЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |											ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Контрагенты)
		               |										ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВладелецБонусногоСчета КАК Справочник.Карты).ВладелецКарты КАК Справочник.Сотрудники).Контрагент
		               |									КОНЕЦ
		               |							ИНАЧЕ НЕОПРЕДЕЛЕНО
		               |						КОНЕЦ
		               |				ИНАЧЕ ТаблицаОперацийСБонуснымСчетом.ОбъектСобытия.Контрагент
		               |			КОНЕЦ
		               |	КОНЕЦ КАК Контрагент,
		               |	ТаблицаОперацийСБонуснымСчетом.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаОперацийСБонуснымСчетом.СуммаСписания КАК СуммаСписания,
		               |	ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВидБонусногоСчета КАК ВидБонусногоСчета
		               |ПОМЕСТИТЬ ТаблицаОперацийСБонуснымСчетомКонтрагента
		               |ИЗ
		               |	ТаблицаОперацийСБонуснымСчетом КАК ТаблицаОперацийСБонуснымСчетом
		               |ГДЕ
		               |	ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВидБонусногоСчета = &ВидБонусногоСчета
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.БонусныйСчет КАК БонусныйСчет,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент КАК Контрагент,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.СуммаСписания КАК СуммаСписания,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.ВидБонусногоСчета КАК ВидБонусногоСчета
		               |ПОМЕСТИТЬ ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор
		               |ИЗ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента КАК ТаблицаОперацийСБонуснымСчетомКонтрагента
		               |ГДЕ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент <> НЕОПРЕДЕЛЕНО
		               |	И ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент В(&СегментКонтрагентов)
		               |	И ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент.ОбезличенныйКлиент = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
		               |	ЕСТЬNULL(СУММА(БонусныеСчетаОстатки.СуммаОстаток), 0) КАК СуммаОстаток
		               |ПОМЕСТИТЬ ТаблицаОстатковПоБонусномуСчету
		               |ИЗ
		               |	РегистрНакопления.БонусныеСчета.Остатки(
		               |			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		               |			БонусныйСчет В
		               |				(ВЫБРАТЬ
		               |					ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет
		               |				ИЗ
		               |					ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор)) КАК БонусныеСчетаОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	БонусныеСчетаОстатки.БонусныйСчет
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет КАК БонусныйСчет,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.ВидБонусногоСчета КАК ВидБонусногоСчета,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет.ДатаОткрытия КАК ДатаОткрытия,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет.СрокДействияНачало КАК СрокДействияНачало,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет.СрокДействияКонец КАК СрокДействияКонец,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.Контрагент КАК Контрагент,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.СуммаСписания КАК СуммаСписания,
		               |	ТаблицаОстатковПоБонусномуСчету.СуммаОстаток КАК Остаток,
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.ОбъектСобытия.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ИЗ
		               |	ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор КАК ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПоБонусномуСчету КАК ТаблицаОстатковПоБонусномуСчету
		               |		ПО ТаблицаОперацийСБонуснымСчетомКонтрагентаОтбор.БонусныйСчет = ТаблицаОстатковПоБонусномуСчету.БонусныйСчет";
	
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент В(&СегментКонтрагентов)",
					"ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент В
	               |					(ВЫБРАТЬ
	               |						СоставСегментов.ОбъектСегмента
	               |					ИЗ
	               |						РегистрСведений.СоставСегментов КАК СоставСегментов
	               |					ГДЕ
	               |						СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОперацийСБонуснымСчетомКонтрагента.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидБонусногоСчета) Тогда
			Запрос.УстановитьПараметр("ВидБонусногоСчета", ДанныеТриггера.ВидБонусногоСчета);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОперацийСБонуснымСчетом.БонусныйСчет.ВидБонусногоСчета = &ВидБонусногоСчета", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ

		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события бонусный счет окончание срока действия
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_БонусныйСчетОкончаниеСрокаДействия(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ
		
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫРАЗИТЬ(БонусныеСчета.ВладелецБонусногоСчета КАК Справочник.Контрагенты) КАК Контрагент,
		               |	БонусныеСчета.Ссылка КАК ОбъектСобытия,
		               |	БонусныеСчета.ВидБонусногоСчета КАК ВидБонусногоСчета,
		               |	БонусныеСчета.ДатаОткрытия КАК ДатаОткрытия,
		               |	БонусныеСчета.СрокДействияНачало КАК СрокДействияНачало,
		               |	БонусныеСчета.СрокДействияКонец КАК СрокДействияКонец,
		               |	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ПОМЕСТИТЬ ТаблицаКлиентовСИстекающимиБонуснымиСчетами
		               |ИЗ
		               |	Справочник.БонусныеСчета КАК БонусныеСчета
		               |ГДЕ
		               |	БонусныеСчета.ПометкаУдаления = ЛОЖЬ
		               |	И БонусныеСчета.ВидБонусногоСчета = &ВидБонусногоСчета
		               |	И НЕ ВЫРАЗИТЬ(БонусныеСчета.ВладелецБонусногоСчета КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |	И ВЫБОР
		               |			КОГДА НЕ ВЫРАЗИТЬ(БонусныеСчета.ВладелецБонусногоСчета КАК Справочник.Контрагенты) ЕСТЬ NULL
		               |				ТОГДА ВЫРАЗИТЬ(БонусныеСчета.ВладелецБонусногоСчета КАК Справочник.Контрагенты).ОбезличенныйКлиент = ЛОЖЬ
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И БонусныеСчета.ВладелецБонусногоСчета В(&СегментКонтрагентов)
		               |	И БонусныеСчета.Закрыт = ЛОЖЬ
		               |	И НАЧАЛОПЕРИОДА(БонусныеСчета.СрокДействияКонец, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		               |	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ОбъектСобытия
		               |ПОМЕСТИТЬ ТаблицаОтработанныхТриггеров
		               |ИЗ
		               |	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		               |ГДЕ
		               |	ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие
		               |	И ЖурналРегистрацииТриггерныхСобытий.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаКлиентовСИстекающимиБонуснымиСчетами.Контрагент
		               |			ИЗ
		               |				ТаблицаКлиентовСИстекающимиБонуснымиСчетами)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами.Контрагент КАК Контрагент,
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами.ВидБонусногоСчета КАК ВидБонусногоСчета,
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами.ДатаОткрытия КАК ДатаОткрытия,
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами.СрокДействияНачало КАК СрокДействияНачало,
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами.СрокДействияКонец КАК СрокДействияКонец,
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами.РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ПОМЕСТИТЬ ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам
		               |ИЗ
		               |	ТаблицаКлиентовСИстекающимиБонуснымиСчетами КАК ТаблицаКлиентовСИстекающимиБонуснымиСчетами
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхТриггеров КАК ТаблицаОтработанныхТриггеров
		               |		ПО ТаблицаКлиентовСИстекающимиБонуснымиСчетами.Контрагент = ТаблицаОтработанныхТриггеров.Контрагент
		               |			И ТаблицаКлиентовСИстекающимиБонуснымиСчетами.ОбъектСобытия = ТаблицаОтработанныхТриггеров.ОбъектСобытия
		               |ГДЕ
		               |	ТаблицаОтработанныхТриггеров.Контрагент ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
		               |ПОМЕСТИТЬ ТаблицаАктуальныхКлиентов
		               |ИЗ
		               |	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(
		               |			КОНЕЦПЕРИОДА(&ДатаТриггера, ДЕНЬ),
		               |			Контрагент В
		               |				(ВЫБРАТЬ
		               |					ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.Контрагент
		               |				ИЗ
		               |					ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам)) КАК СтатусыКонтрагентовСрезПоследних
		               |ГДЕ
		               |	СтатусыКонтрагентовСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.Контрагент КАК Контрагент,
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.ОбъектСобытия КАК ОбъектСобытия,
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.ВидБонусногоСчета КАК ВидБонусногоСчета,
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.ДатаОткрытия КАК ДатаОткрытия,
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.СрокДействияНачало КАК СрокДействияНачало,
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.СрокДействияКонец КАК СрокДействияКонец,
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.Контрагент.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.РегистрацияЗапланированных КАК РегистрацияЗапланированных
		               |ПОМЕСТИТЬ ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов
		               |ИЗ
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам КАК ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам
		               |ГДЕ
		               |	ТаблицаНеОтработанныхКлиентовПоБонуснымСчетам.Контрагент В
		               |			(ВЫБРАТЬ
		               |				ТаблицаАктуальныхКлиентов.Контрагент
		               |			ИЗ
		               |				ТаблицаАктуальныхКлиентов)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
		               |	ЕСТЬNULL(СУММА(БонусныеСчетаОстатки.СуммаОстаток), 0) КАК СуммаОстаток
		               |ПОМЕСТИТЬ ТаблицаОстатковПоБонусномуСчету
		               |ИЗ
		               |	РегистрНакопления.БонусныеСчета.Остатки(
		               |			КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ),
		               |			БонусныйСчет В
		               |				(ВЫБРАТЬ
		               |					ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.ОбъектСобытия
		               |				ИЗ
		               |					ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов)) КАК БонусныеСчетаОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	БонусныеСчетаОстатки.БонусныйСчет
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.Контрагент КАК Контрагент,
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.ОбъектСобытия КАК ОбъектСобытия,
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.ВидБонусногоСчета КАК ВидБонусногоСчета,
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.ДатаОткрытия КАК ДатаОткрытия,
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.СрокДействияНачало КАК СрокДействияНачало,
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.СрокДействияКонец КАК СрокДействияКонец,
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.РегистрацияЗапланированных КАК РегистрацияЗапланированных,
		               |	ТаблицаОстатковПоБонусномуСчету.СуммаОстаток КАК Остаток
		               |ИЗ
		               |	ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов КАК ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПоБонусномуСчету КАК ТаблицаОстатковПоБонусномуСчету
		               |		ПО ИтоговаяТаблицаЗакрывающихсяБонусныхСчетов.ОбъектСобытия = ТаблицаОстатковПоБонусномуСчету.БонусныйСчет";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БонусныеСчета.ВладелецБонусногоСчета В(&СегментКонтрагентов)",
			"БонусныеСчета.ВладелецБонусногоСчета В
			|			(ВЫБРАТЬ
			|				СоставСегментов.ОбъектСегмента
			|			ИЗ
			|				РегистрСведений.СоставСегментов КАК СоставСегментов
			|			ГДЕ
			|				СоставСегментов.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БонусныеСчета.ВладелецБонусногоСчета В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ВидБонусногоСчета) Тогда
			Запрос.УстановитьПараметр("ВидБонусногоСчета", ДанныеТриггера.ВидБонусногоСчета);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БонусныеСчета.ВидБонусногоСчета = &ВидБонусногоСчета", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события лист ожидания выписано направление
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЛистОжиданияВыписаноНаправление(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Направление.Период КАК Период,
		|	Направление.Контрагент КАК Контрагент,
		|	Направление.Сотрудник КАК Сотрудник,
		|	Направление.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Направление.ВидОсмотра КАК ВидОсмотра,
		|	Направление.ДатаЗапланированная КАК ДатаЗапланированная,
		|	Направление.Статус КАК Статус,
		|	Направление.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
		|	Направление.Прием КАК Прием,
		|	Направление.ПричинаНаправления КАК ПричинаНаправления,
		|	Направление.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ТаблицаНаправленийПоДате
		|ИЗ
		|	РегистрСведений.Профосмотры КАК Направление
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Направление.ДатаЗапланированная, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНаправленийПоДате.Период КАК Период,
		|	ТаблицаНаправленийПоДате.Контрагент КАК Контрагент,
		|	ТаблицаНаправленийПоДате.Сотрудник КАК Сотрудник,
		|	ТаблицаНаправленийПоДате.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаНаправленийПоДате.ВидОсмотра КАК ВидОсмотра,
		|	ТаблицаНаправленийПоДате.ДатаЗапланированная КАК ДатаЗапланированная,
		|	ТаблицаНаправленийПоДате.Статус КАК Статус,
		|	ТаблицаНаправленийПоДате.Прием КАК Прием,
		|	ТаблицаНаправленийПоДате.ПричинаНаправления КАК ПричинаНаправления,
		|	ТаблицаНаправленийПоДате.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ТаблицаНаправленийФильтрация
		|ИЗ
		|	ТаблицаНаправленийПоДате КАК ТаблицаНаправленийПоДате
		|ГДЕ
		|	ТаблицаНаправленийПоДате.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)
		|	И ТаблицаНаправленийПоДате.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Направление)
		|	И ТаблицаНаправленийПоДате.ДатаЗапланированная <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТаблицаНаправленийПоДате.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже))
		|	И ТаблицаНаправленийПоДате.ПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
		|	И ТаблицаНаправленийПоДате.Прием <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Сотрудник,
		|	ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия КАК Прием
		|ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
		|ИЗ
		|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНаправленийФильтрация КАК ТаблицаНаправленийФильтрация
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ЖурналРегистрацииТриггерныхСобытий.Контрагент = ТаблицаНаправленийФильтрация.Контрагент
		|			И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = ТаблицаНаправленийФильтрация.Сотрудник
		|			И ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия = ТаблицаНаправленийФильтрация.Прием
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия,
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
		|	ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНаправленийФильтрация.Период КАК ДатаВыпискиНаправления,
		|	ТаблицаНаправленийФильтрация.Контрагент КАК Контрагент,
		|	ТаблицаНаправленийФильтрация.Сотрудник КАК ОбъектСобытия,
		|	ТаблицаНаправленийФильтрация.Сотрудник КАК Сотрудник,
		|	ТаблицаНаправленийФильтрация.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаНаправленийФильтрация.ВидОсмотра КАК ВидОсмотра,
		|	ТаблицаНаправленийФильтрация.ДатаЗапланированная КАК ДатаЗапланированная,
		|	ТаблицаНаправленийФильтрация.Статус КАК Статус,
		|	ТаблицаНаправленийФильтрация.Прием КАК ИсточникСобытия,
		|	ТаблицаНаправленийФильтрация.ПричинаНаправления КАК ПричинаНаправления,
		|	ТаблицаНаправленийФильтрация.Комментарий КАК Комментарий,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаНаправленийФильтрация КАК ТаблицаНаправленийФильтрация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхКонтрагентов КАК ТаблицаОтработанныхКонтрагентов
		|		ПО ТаблицаНаправленийФильтрация.Контрагент = ТаблицаОтработанныхКонтрагентов.Контрагент
		|			И ТаблицаНаправленийФильтрация.Сотрудник = ТаблицаОтработанныхКонтрагентов.Сотрудник
		|			И ТаблицаНаправленийФильтрация.Прием = ТаблицаОтработанныхКонтрагентов.Прием
		|ГДЕ
		|	ТаблицаОтработанныхКонтрагентов.Контрагент ЕСТЬ NULL";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)",
			"ТаблицаНаправленийПоДате.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
						
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события лист ожидания очередь на запись
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЛистОжиданияОчередьНаЗапись(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТекущаяДата"			, ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Направление.Период КАК Период,
		|	Направление.Контрагент КАК Контрагент,
		|	Направление.Сотрудник КАК Сотрудник,
		|	Направление.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Направление.ВидОсмотра КАК ВидОсмотра,
		|	Направление.ДатаЗапланированная КАК ДатаЗапланированная,
		|	Направление.Статус КАК Статус,
		|	Направление.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
		|	Направление.Прием КАК Прием,
		|	Направление.ПричинаНаправления КАК ПричинаНаправления,
		|	Направление.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ТаблицаНаправленийПоДате
		|ИЗ
		|	РегистрСведений.Профосмотры.СрезПоследних(КОНЕЦПЕРИОДА(&ДатаТриггера, ДЕНЬ), ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.ОчередьНаЗапись)) КАК Направление
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Направление.ДатаЗапланированная, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНаправленийПоДате.Период КАК Период,
		|	ТаблицаНаправленийПоДате.Контрагент КАК Контрагент,
		|	ТаблицаНаправленийПоДате.Сотрудник КАК Сотрудник,
		|	ТаблицаНаправленийПоДате.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаНаправленийПоДате.ВидОсмотра КАК ВидОсмотра,
		|	ТаблицаНаправленийПоДате.ДатаЗапланированная КАК ДатаЗапланированная,
		|	ТаблицаНаправленийПоДате.Статус КАК Статус,
		|	ТаблицаНаправленийПоДате.Прием КАК Прием,
		|	ТаблицаНаправленийПоДате.ПричинаНаправления КАК ПричинаНаправления,
		|	ТаблицаНаправленийПоДате.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ТаблицаНаправленийФильтрация
		|ИЗ
		|	ТаблицаНаправленийПоДате КАК ТаблицаНаправленийПоДате
		|ГДЕ
		|	ТаблицаНаправленийПоДате.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)
		|	И ТаблицаНаправленийПоДате.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.ОчередьНаЗапись)
		|	И ТаблицаНаправленийПоДате.ДатаЗапланированная <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТаблицаНаправленийПоДате.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже))
		|	И ТаблицаНаправленийПоДате.ПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаблицаНаправленийФильтрация.Период) КАК Период,
		|	ТаблицаНаправленийФильтрация.Контрагент КАК Контрагент,
		|	ТаблицаНаправленийФильтрация.Сотрудник КАК Сотрудник,
		|	ТаблицаНаправленийФильтрация.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаПоследнихЗаписейВОчередь
		|ИЗ
		|	ТаблицаНаправленийФильтрация КАК ТаблицаНаправленийФильтрация
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНаправленийФильтрация.Контрагент,
		|	ТаблицаНаправленийФильтрация.Сотрудник,
		|	ТаблицаНаправленийФильтрация.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНаправленийФильтрация.Период КАК Период,
		|	ТаблицаНаправленийФильтрация.Контрагент КАК Контрагент,
		|	ТаблицаНаправленийФильтрация.Сотрудник КАК Сотрудник,
		|	ТаблицаНаправленийФильтрация.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаНаправленийФильтрация.ВидОсмотра КАК ВидОсмотра,
		|	ТаблицаНаправленийФильтрация.ДатаЗапланированная КАК ДатаЗапланированная,
		|	ТаблицаНаправленийФильтрация.Статус КАК Статус,
		|	ТаблицаНаправленийФильтрация.Прием КАК Прием,
		|	ТаблицаНаправленийФильтрация.ПричинаНаправления КАК ПричинаНаправления,
		|	ТаблицаНаправленийФильтрация.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ТаблицаАктуальныхЗаписейВОчередь
		|ИЗ
		|	ТаблицаПоследнихЗаписейВОчередь КАК ТаблицаПоследнихЗаписейВОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНаправленийФильтрация КАК ТаблицаНаправленийФильтрация
		|		ПО ТаблицаПоследнихЗаписейВОчередь.Период = ТаблицаНаправленийФильтрация.Период
		|			И ТаблицаПоследнихЗаписейВОчередь.Контрагент = ТаблицаНаправленийФильтрация.Контрагент
		|			И ТаблицаПоследнихЗаписейВОчередь.Сотрудник = ТаблицаНаправленийФильтрация.Сотрудник
		|			И ТаблицаПоследнихЗаписейВОчередь.СтруктурнаяЕдиница = ТаблицаНаправленийФильтрация.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Сотрудник,
		|	ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия КАК Прием
		|ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
		|ИЗ
		|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАктуальныхЗаписейВОчередь КАК ТаблицаАктуальныхЗаписейВОчередь
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И (НАЧАЛОПЕРИОДА(ЖурналРегистрацииТриггерныхСобытий.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ))
		|			И ЖурналРегистрацииТриггерныхСобытий.Контрагент = ТаблицаАктуальныхЗаписейВОчередь.Контрагент
		|			И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = ТаблицаАктуальныхЗаписейВОчередь.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия,
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
		|	ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАктуальныхЗаписейВОчередь.Период КАК ДатаПостановкиВОчередь,
		|	ТаблицаАктуальныхЗаписейВОчередь.Контрагент КАК Контрагент,
		|	ТаблицаАктуальныхЗаписейВОчередь.Сотрудник КАК ОбъектСобытия,
		|	ТаблицаАктуальныхЗаписейВОчередь.Сотрудник КАК Сотрудник,
		|	ТаблицаАктуальныхЗаписейВОчередь.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаАктуальныхЗаписейВОчередь.ВидОсмотра КАК ВидОсмотра,
		|	ТаблицаАктуальныхЗаписейВОчередь.ДатаЗапланированная КАК ДатаЗапланированная,
		|	ТаблицаАктуальныхЗаписейВОчередь.Статус КАК Статус,
		|	ТаблицаАктуальныхЗаписейВОчередь.ПричинаНаправления КАК ПричинаНаправления,
		|	ТаблицаАктуальныхЗаписейВОчередь.Комментарий КАК Комментарий,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаАктуальныхЗаписейВОчередь КАК ТаблицаАктуальныхЗаписейВОчередь
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхКонтрагентов КАК ТаблицаОтработанныхКонтрагентов
		|		ПО ТаблицаАктуальныхЗаписейВОчередь.Контрагент = ТаблицаОтработанныхКонтрагентов.Контрагент
		|			И ТаблицаАктуальныхЗаписейВОчередь.Сотрудник = ТаблицаОтработанныхКонтрагентов.Сотрудник
		|ГДЕ
		|	ТаблицаОтработанныхКонтрагентов.Контрагент ЕСТЬ NULL";		
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)",
			"ТаблицаНаправленийПоДате.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события лист ожидания профосмотр
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЛистОжиданияПрофосмотр(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Направление.Период КАК Период,
		|	Направление.Контрагент КАК Контрагент,
		|	Направление.Сотрудник КАК Сотрудник,
		|	Направление.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Направление.ВидОсмотра КАК ВидОсмотра,
		|	Направление.ДатаЗапланированная КАК ДатаЗапланированная,
		|	Направление.Статус КАК Статус,
		|	Направление.ПредварительнаяЗапись КАК ПредварительнаяЗапись,
		|	Направление.Прием КАК Прием,
		|	Направление.ПричинаНаправления КАК ПричинаНаправления,
		|	Направление.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ТаблицаНаправленийПоДате
		|ИЗ
		|	РегистрСведений.Профосмотры.СрезПоследних(КОНЕЦПЕРИОДА(&ДатаТриггера, ДЕНЬ), ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Профосмотр)) КАК Направление
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Направление.ДатаЗапланированная, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНаправленийПоДате.Период КАК Период,
		|	ТаблицаНаправленийПоДате.Контрагент КАК Контрагент,
		|	ТаблицаНаправленийПоДате.Сотрудник КАК Сотрудник,
		|	ТаблицаНаправленийПоДате.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаНаправленийПоДате.ВидОсмотра КАК ВидОсмотра,
		|	ТаблицаНаправленийПоДате.ДатаЗапланированная КАК ДатаЗапланированная,
		|	ТаблицаНаправленийПоДате.Статус КАК Статус,
		|	ТаблицаНаправленийПоДате.Прием КАК Прием,
		|	ТаблицаНаправленийПоДате.ПричинаНаправления КАК ПричинаНаправления,
		|	ТаблицаНаправленийПоДате.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ТаблицаНаправленийФильтрация
		|ИЗ
		|	ТаблицаНаправленийПоДате КАК ТаблицаНаправленийПоДате
		|ГДЕ
		|	ТаблицаНаправленийПоДате.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)
		|	И ТаблицаНаправленийПоДате.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОсмотров.Профосмотр)
		|	И ТаблицаНаправленийПоДате.ДатаЗапланированная <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТаблицаНаправленийПоДате.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже))
		|	И ТаблицаНаправленийПоДате.ПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
		|	И ТаблицаНаправленийПоДате.Прием <> ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Сотрудник,
		|	ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия КАК Прием
		|ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
		|ИЗ
		|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНаправленийФильтрация КАК ТаблицаНаправленийФильтрация
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ЖурналРегистрацииТриггерныхСобытий.Контрагент = ТаблицаНаправленийФильтрация.Контрагент
		|			И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = ТаблицаНаправленийФильтрация.Сотрудник
		|			И ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия = ТаблицаНаправленийФильтрация.Прием
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия,
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент,
		|	ЖурналРегистрацииТриггерныхСобытий.ИсточникСобытия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНаправленийФильтрация.Период КАК Период,
		|	ТаблицаНаправленийФильтрация.Контрагент КАК Контрагент,
		|	ТаблицаНаправленийФильтрация.Сотрудник КАК ОбъектСобытия,
		|	ТаблицаНаправленийФильтрация.Сотрудник КАК Сотрудник,
		|	ТаблицаНаправленийФильтрация.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаНаправленийФильтрация.ВидОсмотра КАК ВидОсмотра,
		|	ТаблицаНаправленийФильтрация.ДатаЗапланированная КАК ДатаЗапланированная,
		|	ТаблицаНаправленийФильтрация.Статус КАК Статус,
		|	ТаблицаНаправленийФильтрация.Прием КАК ИсточникСобытия,
		|	ТаблицаНаправленийФильтрация.ПричинаНаправления КАК ПричинаНаправления,
		|	ТаблицаНаправленийФильтрация.Комментарий КАК Комментарий,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаНаправленийФильтрация КАК ТаблицаНаправленийФильтрация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхКонтрагентов КАК ТаблицаОтработанныхКонтрагентов
		|		ПО ТаблицаНаправленийФильтрация.Контрагент = ТаблицаОтработанныхКонтрагентов.Контрагент
		|			И ТаблицаНаправленийФильтрация.Сотрудник = ТаблицаОтработанныхКонтрагентов.Сотрудник
		|			И ТаблицаНаправленийФильтрация.Прием = ТаблицаОтработанныхКонтрагентов.Прием
		|ГДЕ
		|	ТаблицаОтработанныхКонтрагентов.Контрагент ЕСТЬ NULL";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)",
			"ТаблицаНаправленийПоДате.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаНаправленийПоДате.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события запись клиента на занятие
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  РегистрацияПоПодписке	 - 	 - 
//  ОбъектСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЗаписьСозданиеЗаписиНаПрием(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Запись"				, ОбъектСобытия);
		Запрос.УстановитьПараметр("МассивКонтрагентов"	, ДанныеТриггера.МассивНеобработанныхКонтрагентов);		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредварительнаяЗапись.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПредварительнаяЗапись.Ссылка КАК Запись,
		|	ПредварительнаяЗапись.Контрагент КАК Контрагент,
		|	ПредварительнаяЗапись.Ссылка КАК ОбъектСобытия,
		|	ПредварительнаяЗапись.Врач КАК Сотрудник,
		|	ПредварительнаяЗапись.Статус КАК СтатусЗаписи,
		|	ПредварительнаяЗапись.Дата КАК ДатаВремяНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВремяОкончания,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	Документ.Событие КАК ПредварительнаяЗапись
		|ГДЕ
		|	ПредварительнаяЗапись.Ссылка = &Запись
		|	И ПредварительнаяЗапись.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена))
		|	И ПредварительнаяЗапись.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
		|	И ПредварительнаяЗапись.Контрагент В(&МассивКонтрагентов)
		|	И ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)
		|	И ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи
		|	И ПредварительнаяЗапись.Резерв = ЛОЖЬ";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)",
			"ПредварительнаяЗапись.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ИсточникЗаписи) И ТипЗнч(ДанныеТриггера.ИсточникЗаписи) = Тип("СправочникСсылка.ИсточникиЗаписей") Тогда
			Запрос.УстановитьПараметр("ИсточникЗаписи", ДанныеТриггера.ИсточникЗаписи);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
		//	Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ЗанятиеСоставЗанятия.Ссылка.Номенклатура = &СегментУслуг");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)",
		//		"ЗанятиеСоставЗанятия.Ссылка.Номенклатура В
		//		|			(ВЫБРАТЬ
		//		|				СоставСегментов.ОбъектСегмента
		//		|			ИЗ
		//		|				РегистрСведений.СоставСегментов КАК СоставСегментов
		//		|			ГДЕ
		//		|				СоставСегментов.Сегмент = &СегментУслуг)");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	КонецЕсли;	
		// Иначе 
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПредварительнаяЗапись.Ссылка КАК Запись,
		|	ПредварительнаяЗапись.Проведен КАК Проведен,
		|	ПредварительнаяЗапись.Дата КАК ДатаВремяНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВремяОкончания,
		|	ПредварительнаяЗапись.ДатаСоздания КАК ДатаЗаписи,
		|	ПредварительнаяЗапись.Контрагент КАК Контрагент,
		|	ПредварительнаяЗапись.Врач КАК Сотрудник,
		|	ПредварительнаяЗапись.Статус КАК СтатусЗаписи,
		|	ПредварительнаяЗапись.ТипСобытия КАК ТипСобытия,
		|	ПредварительнаяЗапись.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПредварительнаяЗапись.ИсточникЗаписи КАК ИсточникЗаписи,
		|	ПредварительнаяЗапись.Резерв КАК Резерв
		|ПОМЕСТИТЬ ТаблицаЗаписейПоДате
		|ИЗ
		|	Документ.Событие КАК ПредварительнаяЗапись
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПредварительнаяЗапись.ДатаСоздания, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗаписейПоДате.Запись КАК Запись,
		|	ТаблицаЗаписейПоДате.ДатаВремяНачала КАК ДатаВремяНачала,
		|	ТаблицаЗаписейПоДате.ДатаВремяОкончания КАК ДатаВремяОкончания,
		|	ТаблицаЗаписейПоДате.Контрагент КАК Контрагент,
		|	ТаблицаЗаписейПоДате.Сотрудник КАК Сотрудник,
		|	ТаблицаЗаписейПоДате.СтатусЗаписи КАК СтатусЗаписи,
		|	ТаблицаЗаписейПоДате.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаЗаписейФильтрация
		|ИЗ
		|	ТаблицаЗаписейПоДате КАК ТаблицаЗаписейПоДате
		|ГДЕ
		|	ТаблицаЗаписейПоДате.Проведен = ИСТИНА
		|	И ТаблицаЗаписейПоДате.Контрагент В(&СегментКонтрагентов)
		|	И ТаблицаЗаписейПоДате.СтатусЗаписи В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена))
		|	И ТаблицаЗаписейПоДате.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
		|	И ТаблицаЗаписейПоДате.ИсточникЗаписи = &ИсточникЗаписи
		|	И ТаблицаЗаписейПоДате.Резерв = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК Запись
		|ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
		|ИЗ
		|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЗаписейФильтрация КАК ТаблицаЗаписейФильтрация
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ЖурналРегистрацииТриггерныхСобытий.Контрагент = ТаблицаЗаписейФильтрация.Контрагент
		|			И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = ТаблицаЗаписейФильтрация.Запись
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия,
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗаписейФильтрация.Запись КАК Запись,
		|	ТаблицаЗаписейФильтрация.ДатаВремяНачала КАК ДатаВремяНачала,
		|	ТаблицаЗаписейФильтрация.ДатаВремяОкончания КАК ДатаВремяОкончания,
		|	ТаблицаЗаписейФильтрация.Контрагент КАК Контрагент,
		|	ТаблицаЗаписейФильтрация.Запись КАК ОбъектСобытия,
		|	ТаблицаЗаписейФильтрация.Сотрудник КАК Сотрудник,
		|	ТаблицаЗаписейФильтрация.СтатусЗаписи КАК СтатусЗаписи,
		|	ТаблицаЗаписейФильтрация.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаЗаписейФильтрация КАК ТаблицаЗаписейФильтрация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхКонтрагентов КАК ТаблицаОтработанныхКонтрагентов
		|		ПО ТаблицаЗаписейФильтрация.Запись = ТаблицаОтработанныхКонтрагентов.Запись
		|			И ТаблицаЗаписейФильтрация.Контрагент = ТаблицаОтработанныхКонтрагентов.Контрагент
		|ГДЕ
		|	ТаблицаОтработанныхКонтрагентов.Контрагент ЕСТЬ NULL";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаЗаписейПоДате.Контрагент В(&СегментКонтрагентов)",
			"ТаблицаЗаписейПоДате.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаЗаписейПоДате.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ИсточникЗаписи) И ТипЗнч(ДанныеТриггера.ИсточникЗаписи) = Тип("СправочникСсылка.ИсточникиЗаписей") Тогда
			Запрос.УстановитьПараметр("ИсточникЗаписи", ДанныеТриггера.ИсточникЗаписи);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаЗаписейПоДате.ИсточникЗаписи = &ИсточникЗаписи", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
		//	Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ЗанятиеСоставЗанятия.Ссылка.Номенклатура = &СегментУслуг");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)",
		//		"ЗанятиеСоставЗанятия.Ссылка.Номенклатура В
		//		|			(ВЫБРАТЬ
		//		|				СоставСегментов.ОбъектСегмента
		//		|			ИЗ
		//		|				РегистрСведений.СоставСегментов КАК СоставСегментов
		//		|			ГДЕ
		//		|				СоставСегментов.Сегмент = &СегментУслуг)");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	КонецЕсли;	
		// Иначе 
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
				
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события запись смена статуса сотрудником клиники
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЗаписьСменаСтатусаСотрудникомКлиники(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Запись"				, ОбъектСобытия);
		Запрос.УстановитьПараметр("МассивКонтрагентов"	, ДанныеТриггера.МассивНеобработанныхКонтрагентов);		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредварительнаяЗапись.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПредварительнаяЗапись.Ссылка КАК Запись,
		|	ПредварительнаяЗапись.Контрагент КАК Контрагент,
		|	ПредварительнаяЗапись.Ссылка КАК ОбъектСобытия,
		|	ПредварительнаяЗапись.Врач КАК Сотрудник,
		|	ПредварительнаяЗапись.Статус КАК СтатусЗаписи,
		|	ПредварительнаяЗапись.Дата КАК ДатаВремяНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВремяОкончания,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	Документ.Событие КАК ПредварительнаяЗапись
		|ГДЕ
		|	ПредварительнаяЗапись.Ссылка = &Запись
		|	И ПредварительнаяЗапись.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
		|	И ПредварительнаяЗапись.Контрагент В(&МассивКонтрагентов)
		|	И ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)
		|	И ПредварительнаяЗапись.Статус = &ПереходНаСтатус
		|	И ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи
		|	И ПредварительнаяЗапись.Резерв = ЛОЖЬ";		
			
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)",
			"ПредварительнаяЗапись.Контрагент В
			|			(ВЫБРАТЬ
			|				КонтрагентыСегмента.Контрагент
			|			ИЗ
			|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			|			ГДЕ
			|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ИсточникЗаписи) И ТипЗнч(ДанныеТриггера.ИсточникЗаписи) = Тип("СправочникСсылка.ИсточникиЗаписей") Тогда
			Запрос.УстановитьПараметр("ИсточникЗаписи", ДанныеТриггера.ИсточникЗаписи);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СтатусЗаписи) Тогда 
			Запрос.УстановитьПараметр("ПереходНаСтатус", ДанныеТриггера.СтатусЗаписи);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Статус = &ПереходНаСтатус", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
		//	Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ЗанятиеСоставЗанятия.Ссылка.Номенклатура = &СегментУслуг");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)",
		//		"ЗанятиеСоставЗанятия.Ссылка.Номенклатура В
		//		|			(ВЫБРАТЬ
		//		|				СоставСегментов.ОбъектСегмента
		//		|			ИЗ
		//		|				РегистрСведений.СоставСегментов КАК СоставСегментов
		//		|			ГДЕ
		//		|				СоставСегментов.Сегмент = &СегментУслуг)");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	КонецЕсли;	
		// Иначе 
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события запись смена статуса пациентом
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЗаписьСменаСтатусаПациентом(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Запись"				, ОбъектСобытия);
		Запрос.УстановитьПараметр("МассивКонтрагентов"	, ДанныеТриггера.МассивНеобработанныхКонтрагентов);		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредварительнаяЗапись.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПредварительнаяЗапись.Ссылка КАК Запись,
		|	ПредварительнаяЗапись.Контрагент КАК Контрагент,
		|	ПредварительнаяЗапись.Ссылка КАК ОбъектСобытия,
		|	ПредварительнаяЗапись.Врач КАК Сотрудник,
		|	ПредварительнаяЗапись.Статус КАК СтатусЗаписи,
		|	ПредварительнаяЗапись.Дата КАК ДатаВремяНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВремяОкончания,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	Документ.Событие КАК ПредварительнаяЗапись
		|ГДЕ
		|	ПредварительнаяЗапись.Ссылка = &Запись
		|	И ПредварительнаяЗапись.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
		|	И ПредварительнаяЗапись.Контрагент В(&МассивКонтрагентов)
		|	И ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)
		|	И ПредварительнаяЗапись.Статус = &ПереходНаСтатус
		|	И ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи
		|	И ПредварительнаяЗапись.Резерв = ЛОЖЬ";		
			
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)",
			"ПредварительнаяЗапись.Контрагент В
			|			(ВЫБРАТЬ
			|				КонтрагентыСегмента.Контрагент
			|			ИЗ
			|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			|			ГДЕ
			|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ИсточникЗаписи) И ТипЗнч(ДанныеТриггера.ИсточникЗаписи) = Тип("СправочникСсылка.ИсточникиЗаписей") Тогда
			Запрос.УстановитьПараметр("ИсточникЗаписи", ДанныеТриггера.ИсточникЗаписи);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СтатусЗаписи) Тогда 
			Запрос.УстановитьПараметр("ПереходНаСтатус", ДанныеТриггера.СтатусЗаписи);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Статус = &ПереходНаСтатус", "ИСТИНА");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
		//	Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ЗанятиеСоставЗанятия.Ссылка.Номенклатура = &СегментУслуг");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)",
		//		"ЗанятиеСоставЗанятия.Ссылка.Номенклатура В
		//		|			(ВЫБРАТЬ
		//		|				СоставСегментов.ОбъектСегмента
		//		|			ИЗ
		//		|				РегистрСведений.СоставСегментов КАК СоставСегментов
		//		|			ГДЕ
		//		|				СоставСегментов.Сегмент = &СегментУслуг)");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	КонецЕсли;	
		// Иначе 
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события занятие начало занятия
//
// Параметры:
//  ДанныеТриггера			 - 	 - 
//  РегистрацияПоПодписке	 - 	 - 
//  ОбъектСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ЗаписьНачалоПриема(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Запись"				, ОбъектСобытия);
		Запрос.УстановитьПараметр("МассивКонтрагентов"	, ДанныеТриггера.МассивНеобработанныхКонтрагентов);		
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредварительнаяЗапись.Ссылка КАК Запись,
		|	ПредварительнаяЗапись.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ТаблицаЗаписей
		|ИЗ
		|	Документ.Событие КАК ПредварительнаяЗапись
		|ГДЕ
		|	ПредварительнаяЗапись.Проведен = ИСТИНА
		|	И ПредварительнаяЗапись.Ссылка = &Запись
		|	И ПредварительнаяЗапись.Контрагент В(&МассивКонтрагентов)
		|	И ПредварительнаяЗапись.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
		|	И ПредварительнаяЗапись.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
		|	И ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)
		|	И ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи
		|	И ПредварительнаяЗапись.Резерв = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗаписей.Запись КАК Запись,
		|	ТаблицаЗаписей.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ИтоговаяТаблицаЗаписей
		|ИЗ
		|	ТаблицаЗаписей КАК ТаблицаЗаписей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ТаблицаЗаписей.Запись = ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		|			И ТаблицаЗаписей.Контрагент = ЖурналРегистрацииТриггерныхСобытий.Контрагент
		|			И (ВЫБОР
		|				КОГДА &РегистрацияЗапланированных
		|					ТОГДА ЖурналРегистрацииТриггерныхСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацииСобытий.Запланировано)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &РегистрацияЗапланированных
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЖурналРегистрацииТриггерныхСобытий.Контрагент ЕСТЬ NULL
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредварительнаяЗапись.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПредварительнаяЗапись.Ссылка КАК Запись,
		|	ПредварительнаяЗапись.Контрагент КАК Контрагент,
		|	ПредварительнаяЗапись.Ссылка КАК ОбъектСобытия,
		|	ПредварительнаяЗапись.Врач КАК Сотрудник,
		|	ПредварительнаяЗапись.Статус КАК СтатусЗаписи,
		|	ПредварительнаяЗапись.Дата КАК ДатаВремяНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВремяОкончания,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	Документ.Событие КАК ПредварительнаяЗапись
		|ГДЕ
		|	ПредварительнаяЗапись.Ссылка В
		|			(ВЫБРАТЬ
		|				ИтоговаяТаблицаЗаписей.Запись
		|			ИЗ
		|				ИтоговаяТаблицаЗаписей)
		|	И ПредварительнаяЗапись.Контрагент В
		|			(ВЫБРАТЬ
		|				ИтоговаяТаблицаЗаписей.Контрагент
		|			ИЗ
		|				ИтоговаяТаблицаЗаписей)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВремяНачала";
			
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)",
			"ПредварительнаяЗапись.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ДанныеТриггера.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия Тогда
			Если ЗначениеЗаполнено(ДанныеТриггера.СтатусЗаписи) Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)", "ПредварительнаяЗапись.Статус = &СтатусПредварительнойЗаписи");	
				Запрос.УстановитьПараметр("СтатусПредварительнойЗаписи", ДанныеТриггера.СтатусЗаписи);
			//Иначе 
			//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)", "ИСТИНА");	
			КонецЕсли;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ИсточникЗаписи) И ТипЗнч(ДанныеТриггера.ИсточникЗаписи) = Тип("СправочникСсылка.ИсточникиЗаписей") Тогда
			Запрос.УстановитьПараметр("ИсточникЗаписи", ДанныеТриггера.ИсточникЗаписи);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи", "ИСТИНА");
		КонецЕсли;
		
		// Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
		//	Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ЗанятиеСоставЗанятия.Ссылка.Номенклатура = &СегментУслуг");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)",
		//		"ЗанятиеСоставЗанятия.Ссылка.Номенклатура В
		//		|			(ВЫБРАТЬ
		//		|				СоставСегментов.ОбъектСегмента
		//		|			ИЗ
		//		|				РегистрСведений.СоставСегментов КАК СоставСегментов
		//		|			ГДЕ
		//		|				СоставСегментов.Сегмент = &СегментУслуг)");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	КонецЕсли;	
		// Иначе 
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		// КонецЕсли;
		//
		// Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧленствоПакетУслуг.Номенклатура В(&СегментЧленствПакетовУслуг)", "ИСТИНА");
		// Запрос.УстановитьПараметр("СегментЧленствПакетовУслуг", Неопределено);			
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		Запрос.УстановитьПараметр("ТриггерноеСобытие"	, ДанныеТриггера.ТриггерноеСобытие);
		Если ДанныеТриггера.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия Тогда
			
		Иначе 
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПредварительнаяЗапись.Ссылка КАК Запись,
			|	ПредварительнаяЗапись.Контрагент КАК Контрагент
			|ПОМЕСТИТЬ ТаблицаЗаписей
			|ИЗ
			|	Документ.Событие КАК ПредварительнаяЗапись
			|ГДЕ
			|	ПредварительнаяЗапись.Проведен = ИСТИНА
			|	И ПредварительнаяЗапись.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
			|	И ПредварительнаяЗапись.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
			|	И НАЧАЛОПЕРИОДА(ПредварительнаяЗапись.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
			|	И ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)
			|	И ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи
			|	И ПредварительнаяЗапись.Резерв = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаЗаписей.Запись КАК Запись,
			|	ТаблицаЗаписей.Контрагент КАК Контрагент
			|ПОМЕСТИТЬ ИтоговаяТаблицаЗаписей
			|ИЗ
			|	ТаблицаЗаписей КАК ТаблицаЗаписей
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
			|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
			|			И ТаблицаЗаписей.Запись = ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
			|			И ТаблицаЗаписей.Контрагент = ЖурналРегистрацииТриггерныхСобытий.Контрагент
			|ГДЕ
			|	ЖурналРегистрацииТриггерныхСобытий.Контрагент ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПредварительнаяЗапись.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	ПредварительнаяЗапись.Ссылка КАК Запись,
			|	ПредварительнаяЗапись.Контрагент КАК Контрагент,
			|	ПредварительнаяЗапись.Ссылка КАК ОбъектСобытия,
			|	ПредварительнаяЗапись.Врач КАК Сотрудник,
			|	ПредварительнаяЗапись.Статус КАК СтатусЗаписи,
			|	ПредварительнаяЗапись.Дата КАК ДатаВремяНачала,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВремяОкончания,
			|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
			|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
			|ИЗ
			|	Документ.Событие КАК ПредварительнаяЗапись
			|ГДЕ
			|	ПредварительнаяЗапись.Ссылка В
			|			(ВЫБРАТЬ
			|				ИтоговаяТаблицаЗаписей.Запись
			|			ИЗ
			|				ИтоговаяТаблицаЗаписей)
			|	И ПредварительнаяЗапись.Контрагент В
			|			(ВЫБРАТЬ
			|				ИтоговаяТаблицаЗаписей.Контрагент
			|			ИЗ
			|				ИтоговаяТаблицаЗаписей)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаВремяНачала";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)",
				"ПредварительнаяЗапись.Контрагент В
			|			(ВЫБРАТЬ
			|				КонтрагентыСегмента.Контрагент
			|			ИЗ
			|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			|			ГДЕ
			|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.ИсточникЗаписи) И ТипЗнч(ДанныеТриггера.ИсточникЗаписи) = Тип("СправочникСсылка.ИсточникиЗаписей") Тогда
			Запрос.УстановитьПараметр("ИсточникЗаписи", ДанныеТриггера.ИсточникЗаписи);
		Иначе 	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.ИсточникЗаписи = &ИсточникЗаписи", "ИСТИНА");
		КонецЕсли;
		
		Если ДанныеТриггера.МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия Тогда
			Если ЗначениеЗаполнено(ДанныеТриггера.СтатусЗаписи) Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)", "ПредварительнаяЗапись.Статус = &СтатусПредварительнойЗаписи");	
				Запрос.УстановитьПараметр("СтатусПредварительнойЗаписи", ДанныеТриггера.СтатусЗаписи);
			//Иначе 
			//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПредварительнаяЗапись.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)", "ИСТИНА");	
			КонецЕсли;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
		//	Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ЗанятиеСоставЗанятия.Ссылка.Номенклатура = &СегментУслуг");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)",
		//		"ЗанятиеСоставЗанятия.Ссылка.Номенклатура В
		//		|			(ВЫБРАТЬ
		//		|				СоставСегментов.ОбъектСегмента
		//		|			ИЗ
		//		|				РегистрСведений.СоставСегментов КАК СоставСегментов
		//		|			ГДЕ
		//		|				СоставСегментов.Сегмент = &СегментУслуг)");
		//		Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
		//	КонецЕсли;	
		// Иначе 
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗанятиеСоставЗанятия.Ссылка.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
		// Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧленствоПакетУслуг.Номенклатура В(&СегментЧленствПакетовУслуг)", "ИСТИНА");
		// Запрос.УстановитьПараметр("СегментЧленствПакетовУслуг", Неопределено);			
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события прием завершен продолжает лечение
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ПриемЗавершенПродолжаетЛечение(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	Запрос.УстановитьПараметр("ТриггерноеСобытие"			, ДанныеТриггера.ТриггерноеСобытие);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Прием"				, ОбъектСобытия);

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрием.Ссылка КАК Прием,
		|	ДокументПрием.Контрагент КАК Контрагент,
		|	ДокументПрием.Сотрудник КАК Сотрудник,
		|	ДокументПрием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаПриемов
		|ИЗ
		|	Документ.Прием КАК ДокументПрием
		|ГДЕ
		|	ДокументПрием.Проведен
		|	И ДокументПрием.Ссылка = &Прием
		|	И ДокументПрием.РезультатПриема = 2
		|	И ДокументПрием.Контрагент В(&СегментКонтрагентов)
		|	И ДокументПрием.СтатусПациента = &СтатусПациентаПриема
		|	И ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриемов.Прием КАК Прием,
		|	ТаблицаПриемов.Контрагент КАК Контрагент,
		|	ТаблицаПриемов.Сотрудник КАК Сотрудник,
		|	ТаблицаПриемов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаПриемовКРегистрации
		|ИЗ
		|	ТаблицаПриемов КАК ТаблицаПриемов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ТаблицаПриемов.Контрагент = ЖурналРегистрацииТриггерныхСобытий.Контрагент
		|			И ТаблицаПриемов.Прием = ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		|ГДЕ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриемовКРегистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаПриемовКРегистрации.Прием КАК Прием,
		|	ТаблицаПриемовКРегистрации.Контрагент КАК Контрагент,
		|	ТаблицаПриемовКРегистрации.Прием КАК ОбъектСобытия,
		|	ТаблицаПриемовКРегистрации.Сотрудник КАК Сотрудник,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаПриемовКРегистрации КАК ТаблицаПриемовКРегистрации
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриемовКРегистрации.СтруктурнаяЕдиница,
		|	ТаблицаПриемовКРегистрации.Контрагент,
		|	ТаблицаПриемовКРегистрации.Сотрудник,
		|	ТаблицаПриемовКРегистрации.Прием,
		|	ТаблицаПриемовКРегистрации.Прием";		
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Контрагент В(&СегментКонтрагентов)",
			"ДокументПрием.Контрагент В
			|			(ВЫБРАТЬ
			|				КонтрагентыСегмента.Контрагент
			|			ИЗ
			|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			|			ГДЕ
			|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СтатусПациентаПриема) Тогда 
			Запрос.УстановитьПараметр("СтатусПациентаПриема", ДанныеТриггера.СтатусПациентаПриема);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.СтатусПациента = &СтатусПациентаПриема", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
			Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)", "ДокументПрием.Лечение.Номенклатура = &СегментУслуг");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)",
				"ДокументПрием.Лечение.Номенклатура В
				|			(ВЫБРАТЬ
				|				НоменклатураСегмента.Номенклатура
				|			ИЗ
				|				РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				|			ГДЕ
				|				НоменклатураСегмента.Сегмент = &СегментУслуг)");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			КонецЕсли;	
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрием.Ссылка КАК Прием,
		|	ДокументПрием.Контрагент КАК Контрагент,
		|	ДокументПрием.Сотрудник КАК Сотрудник,
		|	ДокументПрием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаПриемов
		|ИЗ
		|	Документ.Прием КАК ДокументПрием
		|ГДЕ
		|	ДокументПрием.Проведен = ИСТИНА
		|	И НАЧАЛОПЕРИОДА(ДокументПрием.ВремяОкончанияПриема, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|	И ДокументПрием.РезультатПриема = 2
		|	И ДокументПрием.Контрагент В(&СегментКонтрагентов)
		|	И ДокументПрием.СтатусПациента = &СтатусПациентаПриема
		|	И (ЧАС(ДокументПрием.ВремяОкончанияПриема) <> 0
		|			ИЛИ МИНУТА(ДокументПрием.ВремяОкончанияПриема) <> 0)
		|	И ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриемов.Прием КАК Прием,
		|	ТаблицаПриемов.Контрагент КАК Контрагент,
		|	ТаблицаПриемов.Сотрудник КАК Сотрудник,
		|	ТаблицаПриемов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаПриемовКРегистрации
		|ИЗ
		|	ТаблицаПриемов КАК ТаблицаПриемов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ТаблицаПриемов.Контрагент = ЖурналРегистрацииТриггерныхСобытий.Контрагент
		|			И ТаблицаПриемов.Прием = ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		|ГДЕ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриемовКРегистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаПриемовКРегистрации.Прием КАК Прием,
		|	ТаблицаПриемовКРегистрации.Контрагент КАК Контрагент,
		|	ТаблицаПриемовКРегистрации.Прием КАК ОбъектСобытия,
		|	ТаблицаПриемовКРегистрации.Сотрудник КАК Сотрудник,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаПриемовКРегистрации КАК ТаблицаПриемовКРегистрации
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриемовКРегистрации.СтруктурнаяЕдиница,
		|	ТаблицаПриемовКРегистрации.Контрагент,
		|	ТаблицаПриемовКРегистрации.Сотрудник,
		|	ТаблицаПриемовКРегистрации.Прием,
		|	ТаблицаПриемовКРегистрации.Прием";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Контрагент В(&СегментКонтрагентов)",
			"ДокументПрием.Контрагент В
			|			(ВЫБРАТЬ
			|				КонтрагентыСегмента.Контрагент
			|			ИЗ
			|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			|			ГДЕ
			|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СтатусПациентаПриема) Тогда 
			Запрос.УстановитьПараметр("СтатусПациентаПриема", ДанныеТриггера.СтатусПациентаПриема);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.СтатусПациента = &СтатусПациентаПриема", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
			Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)", "ДокументПрием.Лечение.Номенклатура = &СегментУслуг");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)",
				"ДокументПрием.Лечение.Номенклатура В
				|			(ВЫБРАТЬ
				|				НоменклатураСегмента.Номенклатура
				|			ИЗ
				|				РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				|			ГДЕ
				|				НоменклатураСегмента.Сегмент = &СегментУслуг)");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			КонецЕсли;	
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
	
// Функция - Получить данные события завершен прием
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ПриемЗавершен(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	Запрос.УстановитьПараметр("ТриггерноеСобытие"			, ДанныеТриггера.ТриггерноеСобытие);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("Прием"				, ОбъектСобытия);

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрием.Ссылка КАК Прием,
		|	ДокументПрием.Ссылка КАК ОбъектСобытия,
		|	ДокументПрием.Контрагент КАК Контрагент,
		|	ДокументПрием.Сотрудник КАК Сотрудник,
		|	ДокументПрием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	Документ.Прием КАК ДокументПрием
		|ГДЕ
		|	ДокументПрием.Проведен
		|	И ДокументПрием.Ссылка = &Прием
		|	И ДокументПрием.РезультатПриема = &РезультатПриема
		|	И ДокументПрием.Контрагент В(&СегментКонтрагентов)
		|	И ДокументПрием.СтатусПациента = &СтатусПациентаПриема
		|	И ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументПрием.Ссылка,
		|	ДокументПрием.Контрагент,
		|	ДокументПрием.Сотрудник,
		|	ДокументПрием.СтруктурнаяЕдиница,
		|	ДокументПрием.Ссылка";		
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Контрагент В(&СегментКонтрагентов)",
			"ДокументПрием.Контрагент В
			|			(ВЫБРАТЬ
			|				КонтрагентыСегмента.Контрагент
			|			ИЗ
			|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			|			ГДЕ
			|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СтатусПациентаПриема) Тогда 
			Запрос.УстановитьПараметр("СтатусПациентаПриема", ДанныеТриггера.СтатусПациентаПриема);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.СтатусПациента = &СтатусПациентаПриема", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.РезультатПриема) Тогда 
			Запрос.УстановитьПараметр("РезультатПриема", ДанныеТриггера.РезультатПриема);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.РезультатПриема = &РезультатПриема", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
			Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)", "ДокументПрием.Лечение.Номенклатура = &СегментУслуг");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)",
				"ДокументПрием.Лечение.Номенклатура В
				|			(ВЫБРАТЬ
				|				НоменклатураСегмента.Номенклатура
				|			ИЗ
				|				РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				|			ГДЕ
				|				НоменклатураСегмента.Сегмент = &СегментУслуг)");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			КонецЕсли;	
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрием.Ссылка КАК Прием,
		|	ДокументПрием.Контрагент КАК Контрагент,
		|	ДокументПрием.Сотрудник КАК Сотрудник,
		|	ДокументПрием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаПриемов
		|ИЗ
		|	Документ.Прием КАК ДокументПрием
		|ГДЕ
		|	ДокументПрием.Проведен = ИСТИНА
		|	И НАЧАЛОПЕРИОДА(ДокументПрием.ВремяОкончанияПриема, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|	И ДокументПрием.РезультатПриема = &РезультатПриема
		|	И ДокументПрием.Контрагент В(&СегментКонтрагентов)
		|	И ДокументПрием.СтатусПациента = &СтатусПациентаПриема
		|	И (ЧАС(ДокументПрием.ВремяОкончанияПриема) <> 0
		|			ИЛИ МИНУТА(ДокументПрием.ВремяОкончанияПриема) <> 0)
		|	И ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриемов.Прием КАК Прием,
		|	ТаблицаПриемов.Контрагент КАК Контрагент,
		|	ТаблицаПриемов.Сотрудник КАК Сотрудник,
		|	ТаблицаПриемов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаПриемовКРегистрации
		|ИЗ
		|	ТаблицаПриемов КАК ТаблицаПриемов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ТаблицаПриемов.Контрагент = ЖурналРегистрацииТриггерныхСобытий.Контрагент
		|			И ТаблицаПриемов.Прием = ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		|ГДЕ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриемовКРегистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаПриемовКРегистрации.Прием КАК Прием,
		|	ТаблицаПриемовКРегистрации.Контрагент КАК Контрагент,
		|	ТаблицаПриемовКРегистрации.Прием КАК ОбъектСобытия,
		|	ТаблицаПриемовКРегистрации.Сотрудник КАК Сотрудник,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаПриемовКРегистрации КАК ТаблицаПриемовКРегистрации
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриемовКРегистрации.СтруктурнаяЕдиница,
		|	ТаблицаПриемовКРегистрации.Контрагент,
		|	ТаблицаПриемовКРегистрации.Сотрудник,
		|	ТаблицаПриемовКРегистрации.Прием,
		|	ТаблицаПриемовКРегистрации.Прием";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Контрагент В(&СегментКонтрагентов)",
			"ДокументПрием.Контрагент В
			|			(ВЫБРАТЬ
			|				КонтрагентыСегмента.Контрагент
			|			ИЗ
			|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
			|			ГДЕ
			|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СтатусПациентаПриема) Тогда 
			Запрос.УстановитьПараметр("СтатусПациентаПриема", ДанныеТриггера.СтатусПациентаПриема);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.СтатусПациента = &СтатусПациентаПриема", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.РезультатПриема) Тогда 
			Запрос.УстановитьПараметр("РезультатПриема", ДанныеТриггера.РезультатПриема);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.РезультатПриема = &РезультатПриема", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
			Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)", "ДокументПрием.Лечение.Номенклатура = &СегментУслуг");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)",
				"ДокументПрием.Лечение.Номенклатура В
				|			(ВЫБРАТЬ
				|				НоменклатураСегмента.Номенклатура
				|			ИЗ
				|				РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				|			ГДЕ
				|				НоменклатураСегмента.Сегмент = &СегментУслуг)");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			КонецЕсли;	
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПрием.Лечение.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Получить данные события план лечения создание плана лечения
//
// Параметры:
//  ДанныеТриггера				 - 	 - 
//  РегистрацияПоПодписке		 - 	 - 
//  РегистрацияЗапланированных	 - 	 - 
//  ОбъектСобытия				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСобытия_ПланЛеченияСозданиеПланаЛечения(ДанныеТриггера, РегистрацияПоПодписке = Ложь, РегистрацияЗапланированных = Ложь, ОбъектСобытия = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрацияПоПодписке"		, РегистрацияПоПодписке);
	Запрос.УстановитьПараметр("РегистрацияЗапланированных"	, РегистрацияЗапланированных);
	Запрос.УстановитьПараметр("ТриггерноеСобытие"			, ДанныеТриггера.ТриггерноеСобытие);
	
	Если РегистрацияПоПодписке ИЛИ РегистрацияЗапланированных Тогда 
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_ПОДПИСКЕ

		Запрос.УстановитьПараметр("ПланЛечения"			, ОбъектСобытия);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланЛечения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПланЛечения.Ссылка КАК ПланЛечения,
		|	ПланЛечения.Контрагент КАК Контрагент,
		|	ПланЛечения.Сотрудник КАК Сотрудник,
		|	ПланЛечения.Статус КАК СтатусПланаЛечения,
		|	ПланЛечения.Дата КАК Дата
		|ПОМЕСТИТЬ ТаблицаПлановЛечения
		|ИЗ
		|	Документ.ПланЛечения КАК ПланЛечения
		|ГДЕ
		|	ПланЛечения.Ссылка = &ПланЛечения
		|	И ПланЛечения.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Рассматривается), ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Принят), ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Закрыт))
		|	И ПланЛечения.Контрагент В(&СегментКонтрагентов)
		|	И ПланЛечения.Лечение.Номенклатура В(&СегментУслуг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПлановЛечения.ПланЛечения КАК ПланЛечения,
		|	ТаблицаПлановЛечения.Контрагент КАК Контрагент,
		|	ТаблицаПлановЛечения.Сотрудник КАК Сотрудник,
		|	ТаблицаПлановЛечения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаПлановЛечения.Дата КАК Дата
		|ПОМЕСТИТЬ ТаблицаПлановЛеченияКРегистрации
		|ИЗ
		|	ТаблицаПлановЛечения КАК ТаблицаПлановЛечения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ТаблицаПлановЛечения.Контрагент = ЖурналРегистрацииТриггерныхСобытий.Контрагент
		|			И ТаблицаПлановЛечения.ПланЛечения = ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия
		|ГДЕ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПлановЛеченияКРегистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаПлановЛеченияКРегистрации.ПланЛечения КАК ПланЛечения,
		|	ТаблицаПлановЛеченияКРегистрации.Контрагент КАК Контрагент,
		|	ТаблицаПлановЛеченияКРегистрации.ПланЛечения КАК ОбъектСобытия,
		|	ТаблицаПлановЛеченияКРегистрации.Сотрудник КАК Сотрудник,
		|	ТаблицаПлановЛеченияКРегистрации.Дата КАК Дата,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаПлановЛеченияКРегистрации КАК ТаблицаПлановЛеченияКРегистрации";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Контрагент В(&СегментКонтрагентов)",
			"ПланЛечения.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
				
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
			Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Лечение.Номенклатура В(&СегментУслуг)", "ПланЛечения.Лечение.Номенклатура = &СегментУслуг");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Лечение.Номенклатура В(&СегментУслуг)",
				"ПланЛечения.Лечение.Номенклатура В
				|			(ВЫБРАТЬ
				|				НоменклатураСегмента.Номенклатура
				|			ИЗ
				|				РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				|			ГДЕ
				|				НоменклатураСегмента.Сегмент = &СегментУслуг)");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			КонецЕсли;	
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Лечение.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
		
#КонецОбласти
		
	Иначе
		
#Область ПОЛУЧЕНИЕ_ДАННЫХ_ПРИ_РЕГИСТРАЦИИ_ПО_РЕГЛАМЕНТУ
		
		Запрос.УстановитьПараметр("ДатаТриггера"		, ПолучитьДатуТриггера(ДанныеТриггера));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланЛечения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПланЛечения.Ссылка КАК ПланЛечения,
		|	ПланЛечения.Контрагент КАК Контрагент,
		|	ПланЛечения.Сотрудник КАК Сотрудник,
		|	ПланЛечения.Статус КАК СтатусПланаЛечения,
		|	ПланЛечения.Дата КАК Дата
		|ПОМЕСТИТЬ ТаблицаПлановЛечения
		|ИЗ
		|	Документ.ПланЛечения КАК ПланЛечения
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПланЛечения.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаТриггера, ДЕНЬ)
		|	И ПланЛечения.Проведен = ИСТИНА
		|	И ПланЛечения.Контрагент В(&СегментКонтрагентов)
		|	И ПланЛечения.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Рассматривается), ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Принят), ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Закрыт))
		|	И ПланЛечения.Лечение.Номенклатура В(&СегментУслуг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент КАК Контрагент,
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия КАК ПланЛечения
		|ПОМЕСТИТЬ ТаблицаОтработанныхКонтрагентов
		|ИЗ
		|	РегистрСведений.ЖурналРегистрацииТриггерныхСобытий КАК ЖурналРегистрацииТриггерныхСобытий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПлановЛечения КАК ТаблицаПлановЛечения
		|		ПО (ЖурналРегистрацииТриггерныхСобытий.ТриггерноеСобытие = &ТриггерноеСобытие)
		|			И ЖурналРегистрацииТриггерныхСобытий.Контрагент = ТаблицаПлановЛечения.Контрагент
		|			И ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия = ТаблицаПлановЛечения.ПланЛечения
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналРегистрацииТриггерныхСобытий.ОбъектСобытия,
		|	ЖурналРегистрацииТриггерныхСобытий.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПлановЛечения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаПлановЛечения.ПланЛечения КАК ПланЛечения,
		|	ТаблицаПлановЛечения.Контрагент КАК Контрагент,
		|	ТаблицаПлановЛечения.ПланЛечения КАК ОбъектСобытия,
		|	ТаблицаПлановЛечения.Сотрудник КАК Сотрудник,
		|	ТаблицаПлановЛечения.СтатусПланаЛечения КАК СтатусПланаЛечения,
		|	ТаблицаПлановЛечения.Дата КАК Дата,
		|	&РегистрацияПоПодписке КАК РегистрацияПоПодписке,
		|	&РегистрацияЗапланированных КАК РегистрацияЗапланированных
		|ИЗ
		|	ТаблицаПлановЛечения КАК ТаблицаПлановЛечения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтработанныхКонтрагентов КАК ТаблицаОтработанныхКонтрагентов
		|		ПО ТаблицаПлановЛечения.ПланЛечения = ТаблицаОтработанныхКонтрагентов.ПланЛечения
		|			И ТаблицаПлановЛечения.Контрагент = ТаблицаОтработанныхКонтрагентов.Контрагент
		|ГДЕ
		|	ТаблицаОтработанныхКонтрагентов.Контрагент ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПлановЛечения.Дата,
		|	ТаблицаПлановЛечения.СтруктурнаяЕдиница,
		|	ТаблицаПлановЛечения.Контрагент,
		|	ТаблицаПлановЛечения.СтатусПланаЛечения,
		|	ТаблицаПлановЛечения.Сотрудник,
		|	ТаблицаПлановЛечения.ПланЛечения,
		|	ТаблицаПлановЛечения.ПланЛечения";
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментКонтрагентов) Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Контрагент В(&СегментКонтрагентов)",
			"ПланЛечения.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентыСегмента.Контрагент
		|			ИЗ
		|				РегистрСведений.КонтрагентыСегмента КАК КонтрагентыСегмента
		|			ГДЕ
		|				КонтрагентыСегмента.Сегмент = &СегментКонтрагентов)");
			Запрос.УстановитьПараметр("СегментКонтрагентов", ДанныеТриггера.СегментКонтрагентов);
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Контрагент В(&СегментКонтрагентов)", "ИСТИНА");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеТриггера.СегментУслуг) Тогда 
			Если ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.Номенклатура") Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Лечение.Номенклатура В(&СегментУслуг)", "ПланЛечения.Лечение.Номенклатура = &СегментУслуг");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			ИначеЕсли ТипЗнч(ДанныеТриггера.СегментУслуг) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Лечение.Номенклатура В(&СегментУслуг)",
				"ПланЛечения.Лечение.Номенклатура В
				|			(ВЫБРАТЬ
				|				НоменклатураСегмента.Номенклатура
				|			ИЗ
				|				РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				|			ГДЕ
				|				НоменклатураСегмента.Сегмент = &СегментУслуг)");
				Запрос.УстановитьПараметр("СегментУслуг", ДанныеТриггера.СегментУслуг);
			КонецЕсли;	
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланЛечения.Лечение.Номенклатура В(&СегментУслуг)", "ИСТИНА");
		КонецЕсли;
				
#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "");
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область _________ДИНАМИЧЕСКОЕ_ПОСТРОЕНИЕ_ДЕЙСТВИЙ_ТРИГГЕРНЫХ_СОБЫТИЙ________

Процедура ОбновитьОтображениеТаблицыДействий(Форма, СозданиеФормы = Ложь, ДобавитьЭлементВвода = Ложь, ВыводитьУдаленные = Ложь) Экспорт
	
	Если Форма.Объект.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь)).Количество() = 0 ИЛИ СозданиеФормы ИЛИ ДобавитьЭлементВвода Тогда 
		НоваяСтрока 						= Форма.Объект.Действия.Добавить();
		НоваяСтрока.ИдентификаторДействия 	= Новый УникальныйИдентификатор();
		// Если ДобавитьЭлементВвода Тогда 
		//	НоваяСтрока.Использование 			= Истина;
		// КонецЕсли; 
	КонецЕсли;
	
	// Определяем родительские группы
	ГруппаРазмещенияДействий		= Форма.Элементы.Найти("ГруппаДействий");
	ГруппаРазмещенияДействийШаблон 	= Форма.Элементы.Найти("ГруппаДействий_Шаблон_");
	
	// Инициализируем параметры
	ПараметрыОтображенияЭлементов = ИнициализироватьСтруктуруПараметровОтрисовки(Форма, ВыводитьУдаленные);
	
	// Обновим текущие действия
	Если НЕ ГруппаРазмещенияДействий = Неопределено Тогда 
		// Очищаем родительские группы					
		УдалитьЭлементыГруппы(Форма, ГруппаРазмещенияДействий);
		// Создаем элементы
		ОбновитьЭлементыНастроекНаФормеСогласноШаблона(Форма, ГруппаРазмещенияДействий, ГруппаРазмещенияДействийШаблон, , , ПараметрыОтображенияЭлементов);
		// Отключаем видимость у шаблона
		ГруппаРазмещенияДействийШаблон.Видимость = Ложь;
		// Форма.УстановитьСвойстваЭлементамДействий();
	КонецЕсли;

КонецПроцедуры

// Функция - Инициализировать структуру параметров отрисовки
//
// Параметры:
//  Объект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСтруктуруПараметровОтрисовки(Форма, ВыводитьУдаленные)
	
	ПараметрыОтрисовки = Форма.ИнициализироватьСтруктуруПараметровОтрисовки();
	
	// Помещаем сам объект
	ПараметрыОтрисовки.Вставить("Владелец"			, Форма.Объект);
	// Признак вывода удаленных
	ПараметрыОтрисовки.Вставить("ВыводитьУдаленные"	, ВыводитьУдаленные);
	
	Возврат ПараметрыОтрисовки;
	
КонецФункции

// Процедура - Удалить элементы группы
//
// Параметры:
//  Форма				 - 	 - 
//  РодительскаяГруппа	 - 	 - 
//
Процедура УдалитьЭлементыГруппы(Форма, РодительскаяГруппа) Экспорт
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ГруппаЭлементов Из Форма.Элементы[РодительскаяГруппа.Имя].ПодчиненныеЭлементы Цикл
		// Если ГруппаЭлементов.Имя = "ГруппаПланирования" Тогда 
		//	Продолжить;
		// КонецЕсли;	
		УдаляемыеЭлементы.Добавить(ГруппаЭлементов);
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Форма.Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Обновить элементы на форме согласно шаблона
//
// Параметры:
//  Форма				 - 	 - 
//  ГруппаДляРазмещения	 - 	 - 
//  ГруппаШаблон		 - 	 - 
//  БизнесПроцессСсылка	 - 	 - 
//  ИндексСтроки		 - 	 - 
//  СтрокаТаблицы		 - 	 - 
//
Процедура ОбновитьЭлементыНастроекНаФормеСогласноШаблона(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки = Неопределено, СтрокаТаблицы = Неопределено, ПараметрыОтображенияЭлементов = Неопределено)
	
	Если Форма.Объект.Действия.Количество() = 0 Тогда 
		СрисоватьСШаблонаНастроек(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки, СтрокаТаблицы);
	ИначеЕсли ГруппаШаблон.Имя = "ГруппаДляПолученияИнтервала_Шаблон_" Тогда
		МассивАктуальныхСтрок = ПараметрыОтображенияЭлементов.Владелец.Действия.НайтиСтроки(Новый Структура("Удалено", Ложь));		
		Для Каждого СтрокаТаблицы Из Форма.Объект.Действия Цикл
			Если НЕ ПараметрыОтображенияЭлементов.ВыводитьУдаленные И СтрокаТаблицы.Удалено Тогда 
				Продолжить;
			КонецЕсли;	
			ИндексСтроки = Форма.Объект.Действия.Индекс(СтрокаТаблицы);
			Если ТипЗнч(ПараметрыОтображенияЭлементов) = Тип("Структура") Тогда 
				ПараметрыОтображенияЭлементов.Вставить("ЭтоПерваяАктуальнаяСтрока", ?(МассивАктуальныхСтрок.Количество() = 0, Истина, ИндексСтроки = ПараметрыОтображенияЭлементов.Владелец.Действия.Индекс(МассивАктуальныхСтрок[0])));
			КонецЕсли;	
			СрисоватьСШаблонаНастроек(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		КонецЦикла;
	Иначе 
		СрисоватьСШаблонаНастроек(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	КонецЕсли;
		
КонецПроцедуры

// Процедура - Обновить элементы настроек каналов уведомлений на форме согласно шаблона
//
// Параметры:
//  Форма							 - 	 - 
//  ГруппаДляРазмещения				 - 	 - 
//  ГруппаШаблон					 - 	 - 
//  ИндексСтроки					 - 	 - 
//  СтрокаТаблицы					 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура ОбновитьЭлементыНастроекКаналовУведомленийНаФормеСогласноШаблона(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки = Неопределено, СтрокаТаблицы = Неопределено, ПараметрыОтображенияЭлементов = Неопределено) Экспорт
	
	Если Форма.МоделируемыеНастройкиКаналовУведомлений.Количество() = 0 Тогда 
		СрисоватьСШаблонаНастроекКаналов(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки, СтрокаТаблицы);
	ИначеЕсли ГруппаШаблон.Имя = "ГруппаДляПолученияИнтервала_Шаблон_" Тогда
		Для Каждого СтрокаТаблицы Из Форма.МоделируемыеНастройкиКаналовУведомлений Цикл
			Если НЕ Форма.ИдентификаторДействия = СтрокаТаблицы.ИдентификаторДействия Тогда 
				Продолжить;
			КонецЕсли;
			ИндексСтроки = Форма.МоделируемыеНастройкиКаналовУведомлений.Индекс(СтрокаТаблицы);
			//Если Форма.ИмяФормы = "Справочник.ТриггерныеСобытия.Форма.ФормаЭлемента" Тогда 
				Форма.ИнициализироватьСтруктуруПараметровОтрисовки(, ИндексСтроки);			
			//КонецЕсли;	
			СрисоватьСШаблонаНастроекКаналов(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		КонецЦикла;
	Иначе 
		СрисоватьСШаблонаНастроекКаналов(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	КонецЕсли;
		
КонецПроцедуры

// Процедура - Срисовать с шаблона
//
// Параметры:
//  Форма				 - 	 - 
//  ГруппаДляРазмещения	 - 	 - 
//  ГруппаШаблон		 - 	 - 
//  БизнесПроцессСсылка	 - 	 - 
//  ИндексСтроки		 - 	 - 
//  СтрокаТаблицы		 - 	 - 
//
Процедура СрисоватьСШаблонаНастроек(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки = Неопределено, СтрокаТаблицы = Неопределено, ПараметрыОтображенияЭлементов = Неопределено)
	
	Для Каждого ЭлементФормы Из ГруппаШаблон.ПодчиненныеЭлементы Цикл
		ИндексСтрокой = ?(ИндексСтроки = Неопределено, "", "_Индекс_" + Строка(ИндексСтроки));		
		Если ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") Тогда
			НовыйЭлемент = Форма.Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ГруппаФормы"), ГруппаДляРазмещения);
			НовыйЭлемент.Вид = ЭлементФормы.Вид;
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы, , ПолучитьСписокИсключенныхСвойств(ЭлементФормы.Вид));
			МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, НовыйЭлемент, , ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
			ОбновитьЭлементыНастроекНаФормеСогласноШаблона(Форма, НовыйЭлемент, ЭлементФормы, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") Тогда 
			НовыйЭлемент = Форма.Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ДекорацияФормы"), ГруппаДляРазмещения);
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы);
            МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, НовыйЭлемент, , ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
			УстановитьДействияДляЭлемента(НовыйЭлемент, ЭлементФормы, Тип("ДекорацияФормы"));
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда  
			НовыйЭлемент = Форма.Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ПолеФормы"), ГруппаДляРазмещения);
			НовыйЭлемент.Вид = ЭлементФормы.Вид;
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы, , ПолучитьСписокИсключенныхСвойств(ЭлементФормы.Вид));
			СкопироватьСписокВыбораЭлемента(НовыйЭлемент, ЭлементФормы, Тип("ПолеФормы"));
			МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, НовыйЭлемент, , ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
			УстановитьДействияДляЭлемента(НовыйЭлемент, ЭлементФормы, Тип("ПолеФормы"));			
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") Тогда
			// Если ЭлементФормы.Имя = "Кнопка_ДобавитьСервисныйЗвонок_Шаблон_" Тогда 
			//	ИндексСтрокой = "";
			// КонецЕсли;	
			НовыйЭлемент = Форма.Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("КнопкаФормы"), ГруппаДляРазмещения);
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы);				
			НоваяКоманда = Форма.Команды.Найти(СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + ИндексСтрокой);
			ШаблонКоманда = Форма.Команды.Найти(НовыйЭлемент.ИмяКоманды);
			Если НЕ НоваяКоманда = Неопределено Тогда 
				// Удалим команду
				Форма.Команды.Удалить(НоваяКоманда);
			КонецЕсли;
			// Создаем команду
			НоваяКоманда = Форма.Команды.Добавить(СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + ИндексСтрокой);
			ЗаполнитьЗначенияСвойств(НоваяКоманда, ШаблонКоманда);
			НоваяКоманда.Действие = "Подключаемый_" + СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + "_ВыполнитьКоманду";				
			НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;
			МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, НовыйЭлемент, НоваяКоманда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Срисовать с шаблона настроек каналов
//
// Параметры:
//  Форма							 - 	 - 
//  ГруппаДляРазмещения				 - 	 - 
//  ГруппаШаблон					 - 	 - 
//  ИндексСтроки					 - 	 - 
//  СтрокаТаблицы					 - 	 - 
//  ПараметрыОтображенияЭлементов	 - 	 - 
//
Процедура СрисоватьСШаблонаНастроекКаналов(Форма, ГруппаДляРазмещения, ГруппаШаблон, ИндексСтроки = Неопределено, СтрокаТаблицы = Неопределено, ПараметрыОтображенияЭлементов = Неопределено)
	
	Для Каждого ЭлементФормы Из ГруппаШаблон.ПодчиненныеЭлементы Цикл
		ИндексСтрокой = ?(ИндексСтроки = Неопределено, "", "_Индекс_" + Строка(ИндексСтроки));		
		Если ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") Тогда
			НовыйЭлемент = Форма.Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ГруппаФормы"), ГруппаДляРазмещения);
			НовыйЭлемент.Вид = ЭлементФормы.Вид;
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы, , ПолучитьСписокИсключенныхСвойств(ЭлементФормы.Вид));
			МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, НовыйЭлемент, , ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
			ОбновитьЭлементыНастроекКаналовУведомленийНаФормеСогласноШаблона(Форма, НовыйЭлемент, ЭлементФормы, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") Тогда 
			НовыйЭлемент = Форма.Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ДекорацияФормы"), ГруппаДляРазмещения);
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы);
            МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, НовыйЭлемент, , ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
			УстановитьДействияДляЭлемента(НовыйЭлемент, ЭлементФормы, Тип("ДекорацияФормы"));
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда  
			НовыйЭлемент = Форма.Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("ПолеФормы"), ГруппаДляРазмещения);
			НовыйЭлемент.Вид = ЭлементФормы.Вид;
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы, , ПолучитьСписокИсключенныхСвойств(ЭлементФормы.Вид));
			СкопироватьСписокВыбораЭлемента(НовыйЭлемент, ЭлементФормы, Тип("ПолеФормы"));
			МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, НовыйЭлемент, , ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
			УстановитьДействияДляЭлемента(НовыйЭлемент, ЭлементФормы, Тип("ПолеФормы"));			
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") Тогда
			// Если ЭлементФормы.Имя = "Кнопка_ДобавитьСервисныйЗвонок_Шаблон_" Тогда 
			//	ИндексСтрокой = "";
			// КонецЕсли;	
			НовыйЭлемент = Форма.Элементы.Добавить(СтрЗаменить(ЭлементФормы.Имя, "_Шаблон_", "") + ИндексСтрокой, Тип("КнопкаФормы"), ГруппаДляРазмещения);
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементФормы);				
			НоваяКоманда = Форма.Команды.Найти(СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + ИндексСтрокой);
			ШаблонКоманда = Форма.Команды.Найти(НовыйЭлемент.ИмяКоманды);
			Если НЕ НоваяКоманда = Неопределено Тогда 
				// Удалим команду
				Форма.Команды.Удалить(НоваяКоманда);
			КонецЕсли;
			// Создаем команду
			НоваяКоманда = Форма.Команды.Добавить(СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + ИндексСтрокой);
			ЗаполнитьЗначенияСвойств(НоваяКоманда, ШаблонКоманда);
			НоваяКоманда.Действие = "Подключаемый_" + СтрЗаменить(НовыйЭлемент.ИмяКоманды, "_Шаблон_", "") + "_ВыполнитьКоманду";				
			НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;
			МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, НовыйЭлемент, НоваяКоманда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Скопировать список выбора элемента
//
// Параметры:
//  НовыйЭлемент - 	 - 
//  ЭлементФормы - 	 - 
//  ТипЭлемента	 - 	 - 
//
Процедура СкопироватьСписокВыбораЭлемента(НовыйЭлемент, ЭлементФормы, ТипЭлемента)
	
	Если ТипЭлемента = Тип("ПолеФормы") И НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
		Если НовыйЭлемент.РежимВыбораИзСписка = Истина Тогда 
			Если ЗначениеЗаполнено(ЭлементФормы.СписокВыбора) Тогда 
				НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(ЭлементФормы.СписокВыбора.ВыгрузитьЗначения());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Модифицировать элемент для частного случая
//
// Параметры:
//  Элемент			 - 	 - 
//  Команда			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//
Процедура МодифицироватьЭлементНастройкиДляЧастногоСлучая(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	ПроверяемыйЭлемент = ?(Команда = Неопределено, Элемент, Команда);	
	Если НЕ ЗначениеЗаполнено(ПроверяемыйЭлемент.Подсказка) ИЛИ СтрНайти(ПроверяемыйЭлемент.Подсказка, "Процедура_") = 0 Тогда 
      	Возврат;
	КонецЕсли;
	
	ИмяОбработчика = СокрЛП(ПроверяемыйЭлемент.Подсказка);
	
	Если ИмяОбработчика = "Процедура_ОбработкаГруппаСтрока_ТЧ_Действия" Тогда 
		Процедура_ОбработкаГруппаСтрока_ТЧ_Действия(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);	
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_Использование" Тогда 
		Процедура_ОбработкаПоля_Использование(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ВидДействия" Тогда
		Процедура_ОбработкаПоля_ВидДействия(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппаОписаниеДействия" Тогда 
		Процедура_ОбработкаГруппаОписаниеДействия(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ОписаниеДействия" Тогда 
		Процедура_ОбработкаПоля_ОписаниеДействия(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаВсплывающаяГруппаПараметровДействия" Тогда 
		Процедура_ОбработкаВсплывающаяГруппаПараметровДействия(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		
	// Элементы настройки исполнителей задач			
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппа_ВыбораИсполнителяЗадачи" Тогда
		Процедура_ОбработкаГруппа_ВыбораИсполнителяЗадачи(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ВидИсполнителя" Тогда 
		Процедура_ОбработкаПоля_ВидИсполнителя(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);		
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ВидИсполнителяРезервный" Тогда 
		Процедура_ОбработкаПоля_ВидИсполнителяРезервный(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_Исполнитель" Тогда 
		Процедура_ОбработкаПоля_Исполнитель(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);	
		
	// Элементы настройки получателей сообщений	
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппа_ВыбораПолучателяСообщения" Тогда
		Процедура_ОбработкаГруппа_ВыбораПолучателяСообщения(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);		
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ВидПолучателя" Тогда 
		Процедура_ОбработкаПоля_ВидПолучателя(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);		
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_Получатель" Тогда 
		Процедура_ОбработкаПоля_Получатель(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ОтправкаPush" Тогда 
		Процедура_ОбработкаПоля_ОтправкаPush(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ОтправкаPushWallet" Тогда 
		Процедура_ОбработкаПоля_ОтправкаPushWallet(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ОтправкаMessenger" Тогда 
		Процедура_ОбработкаПоля_ОтправкаMessenger(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ОтправкаSMS" Тогда 
		Процедура_ОбработкаПоля_ОтправкаSMS(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппа_ВыбораАккаунтаОтправки" Тогда
		Процедура_ОбработкаГруппа_ВыбораАккаунтаОтправки(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппаОтправка_Messenger" Тогда
		Процедура_ОбработкаГруппаОтправка_Messenger(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппаОтправка_SMS" Тогда
		Процедура_ОбработкаГруппаОтправка_SMS(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);		
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппа_ВыбораАккаунтаОтправкиEmail" Тогда
		Процедура_ОбработкаГруппа_ВыбораАккаунтаОтправкиEmail(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_АккаунтСообщений" Тогда 
		Процедура_ОбработкаПоля_АккаунтСообщений(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_АккаунтСообщенийМессенджера" Тогда 
		Процедура_ОбработкаПоля_АккаунтСообщенийМессенджера(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);		
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_КаналСистемыСообщений" Тогда 
		Процедура_ОбработкаПоля_КаналСистемыСообщений(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		
	// Элементы настройки получателей Email		
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_АккаунтEmail" Тогда 
		Процедура_ОбработкаПоля_АккаунтEmail(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		
	// Элементы настройки действий по сделкам
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппа_НастроекДействийПоСделкам" Тогда
		Процедура_ОбработкаГруппа_НастроекДействийПоСделкам(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);			
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ВидСделки" Тогда 
		Процедура_ОбработкаПоля_ВидСделки(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ЭтапСделки" Тогда 
		Процедура_ОбработкаПоля_ЭтапСделки(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_СоздаватьСделку" Тогда 
		Процедура_ОбработкаПоля_СоздаватьСделку(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_КоличествоГенерацийСделок" Тогда 
		Процедура_ОбработкаПоля_КоличествоГенерацийСделок(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаДекорации_ИзмерениеКоличества" Тогда 
		Процедура_ОбработкаДекорации_ИзмерениеКоличества(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		
	// Элементы настройки действий по чат-ботам	
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппа_НастроекДействийПоСценариямЧатБота" Тогда
		Процедура_ОбработкаГруппа_НастроекДействийПоСценариямЧатБота(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);			
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_СценарийЧатБота" Тогда 
		Процедура_ОбработкаПоля_СценарийЧатБота(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
		
	// Элементы настройки шаблона сообщений и описания задач
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппа_ВыбораШаблона" Тогда
		Процедура_ОбработкаГруппа_ВыбораШаблона(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_ШаблонСообщения" Тогда 
		Процедура_ОбработкаПоля_ШаблонСообщения(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаКоманды_ОткрытьШаблонДействия" Тогда
		Процедура_ОбработкаКоманды_ОткрытьШаблонДействия(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
		
	// Кнопки дополнительной настройки каналов уведомлений
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийPush" Тогда
		Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийPush(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийPushWallet" Тогда
		Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийPushWallet(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийMessenger" Тогда
		Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийMessenger(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийSMS" Тогда
		Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийSMS(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
		
	// Поле Структурная единица
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаПоля_СтруктурнаяЕдиница" Тогда
		Процедура_ОбработкаПоля_СтруктурнаяЕдиница(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
		
	// Кнопка выбора режима напоминания по задачам
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаКоманды_ВзаимодействиеРежимНапоминания" Тогда
		Процедура_ОбработкаКоманды_ВзаимодействиеРежимНапоминания(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
		
	// Кнопка применить настройки
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаКоманды_ПрименитьПараметрыДействия" Тогда
		Процедура_ОбработкаКоманды_ПрименитьПараметрыДействия(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);				
	
	// Элементы удаления строк табличной части						
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаГруппа_Удаления_СтрокаТЧ" Тогда 
		Процедура_ОбработкаГруппа_Удаления_СтрокаТЧ(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);
	ИначеЕсли ИмяОбработчика = "Процедура_ОбработкаДекорацияФормы_Заглушка_УдалитьСтроку_ТЧ" Тогда 
		Процедура_ОбработкаДекорацияФормы_Заглушка_УдалитьСтроку_ТЧ(Форма, Элемент, Команда, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов);		
	КонецЕсли;
	
КонецПроцедуры

Процедура Процедура_ОбработкаГруппаСтрока_ТЧ_Действия(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамСтрокиДействий(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_Использование(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + Строка(ИндексСтроки) + "].Использование";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамСтрокиДействий(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.ПоложениеЗаголовка = ?(ПараметрыОтображенияЭлементов.ЭтоПерваяАктуальнаяСтрока, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
	Элемент.Подсказка = ?(СтрокаТаблицы.Использование = Истина, Нстр("ru = 'Выполняется'; en = 'Hold true'"), Нстр("ru = 'Не выполняется'; en = 'Not running'"));
	
КонецПроцедуры

Процедура Процедура_ОбработкаПоля_ВидДействия(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].ВидДействия";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамСтрокиДействий(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;						
	Элемент.ПоложениеЗаголовка 	= ?(ПараметрыОтображенияЭлементов.ЭтоПерваяАктуальнаяСтрока, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
	Элемент.Подсказка 			= Нстр("ru = 'Вариант инициируемого действия'; en = 'Option of the action to initiate'");
	
КонецПроцедуры	

Процедура Процедура_ОбработкаГруппаОписаниеДействия(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамСтрокиДействий(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_ОписаниеДействия(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + Строка(ИндексСтроки) + "].Описание";
	КонецЕсли;
	
	// Форма.УстановитьСвойстваЭлементамСтрокиДействий(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.ПоложениеЗаголовка 	= ?(ПараметрыОтображенияЭлементов.ЭтоПерваяАктуальнаяСтрока, ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Нет);
	Элемент.Подсказка 			= Нстр("ru = 'Здесь можно указать свое описание действия'; en = 'Here you can enter your own description of the action'");
	
КонецПроцедуры

Процедура Процедура_ОбработкаВсплывающаяГруппаПараметровДействия(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамСтрокиДействий(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

	// Элементы настройки исполнителей задач			

Процедура Процедура_ОбработкаГруппа_ВыбораИсполнителяЗадачи(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамИсполнителей(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_ВидИсполнителя(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].ВидАдресата";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамИсполнителей(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	Элемент.Подсказка 			= Нстр("ru = 'Укажите вид исполнителя задачи'; en = 'Specify the type of task performer'");
	
КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_ВидИсполнителяРезервный(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].ВидАдресатаРезервный";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамИсполнителей(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	Элемент.Подсказка 			= Нстр("ru = 'Укажите резервный вид исполнителя задачи'; en = 'Specify the backup type of the task performer'");
		
КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_Исполнитель(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].Адресат";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамИсполнителей(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
		
КонецПроцедуры	

	// Элементы настройки получателей сообщений	

Процедура Процедура_ОбработкаГруппа_ВыбораПолучателяСообщения(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамПолучателяСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_ВидПолучателя(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].ВидАдресата";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамПолучателяСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	Элемент.Подсказка 			= Нстр("ru = 'Укажите вид получателя сообщения'; en = 'Specify the type of message recipient'");
	
КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_Получатель(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].Адресат";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамПолучателяСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	
КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_ОтправкаPush(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		// Элемент.ПутьКДанным = "Объект.Действия[" + Строка(ИндексСтроки) + "].ОтправкаPush";
		ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, Элемент.ПутьКДанным, "ОтправкаPush");
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка = Нстр("ru = 'Push уведомления'; en = 'Push notifications'");
	
КонецПроцедуры

Процедура Процедура_ОбработкаПоля_ОтправкаPushWallet(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		// Элемент.ПутьКДанным = "Объект.Действия[" + Строка(ИндексСтроки) + "].ОтправкаPushWallet";
		ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, Элемент.ПутьКДанным, "ОтправкаPushWallet");
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка = Нстр("ru = 'Push(Wallet) уведомления'; en = 'Push (Wallet) notifications'");
	
КонецПроцедуры

Процедура Процедура_ОбработкаПоля_ОтправкаMessenger(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		// Элемент.ПутьКДанным = "Объект.Действия[" + Строка(ИндексСтроки) + "].ОтправкаMessenger";
		ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, Элемент.ПутьКДанным, "ОтправкаMessenger");		
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка = Нстр("ru = 'Уведомления в мессенджер'; en = 'Notifications in messenger'");
	
КонецПроцедуры

Процедура Процедура_ОбработкаПоля_ОтправкаSMS(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		// Элемент.ПутьКДанным = "Объект.Действия[" + Строка(ИндексСтроки) + "].ОтправкаSMS";
		ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, Элемент.ПутьКДанным, "ОтправкаSMS");				
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка = Нстр("ru = 'Уведомления по sms'; en = 'SMS notifications'");
	
КонецПроцедуры

Процедура Процедура_ОбработкаГруппа_ВыбораАккаунтаОтправки(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаГруппаОтправка_Messenger(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаГруппаОтправка_SMS(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаГруппа_ВыбораАккаунтаОтправкиEmail(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_АккаунтСообщений(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		// Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].АккаунтSMS";
		ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, Элемент.ПутьКДанным, "АккаунтСервисаРассылкиSMS");						
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	Элемент.Подсказка 			= Нстр("ru = 'Укажите аккаунт системы отправки сообщений'; en = 'Specify the account for the message sending system'");
	
КонецПроцедуры

Процедура Процедура_ОбработкаПоля_АккаунтСообщенийМессенджера(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		// Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].АккаунтВнешнейСистемы";
		ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, Элемент.ПутьКДанным, "АккаунтВнешнейСистемы");								
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	Элемент.Подсказка 			= Нстр("ru = 'Укажите аккаунт системы отправки сообщений'; en = 'Specify the account for the message sending system'");
	
КонецПроцедуры

Процедура Процедура_ОбработкаПоля_КаналСистемыСообщений(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		// Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].КаналСистемыСообщений";
		ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, Элемент.ПутьКДанным, "КаналСистемыСообщений");										
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка = Нстр("ru = 'Укажите канал системы сообщений'; en = 'Specify the channel for system messages'");
	
КонецПроцедуры	

	// Элементы настройки получателей Email		

Процедура Процедура_ОбработкаПоля_АккаунтEmail(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].АккаунтEmail";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка 			= Нстр("ru = 'Укажите аккаунт отправки электронной почты'; en = 'Specify the email sending account'");

КонецПроцедуры	

	// Элементы настройки действий по сделкам			

Процедура Процедура_ОбработкаГруппа_НастроекДействийПоСделкам(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамДействийПоСделкам(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	
	
Процедура Процедура_ОбработкаПоля_ВидСделки(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].ВидСделки";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамДействийПоСделкам(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	Элемент.Подсказка 			= Нстр("ru = 'Укажите вид сделки'; en = 'Specify the type of transaction'");

КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_ЭтапСделки(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].ЭтапСделки";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамДействийПоСделкам(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	Элемент.Подсказка 			= Нстр("ru = 'Укажите этап сделки'; en = 'Specify the stage of the transaction'");
	
КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_СоздаватьСделку(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].СоздаватьСделку";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамДействийПоСделкам(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка 			= Нстр("ru = 'Создавать новую сделку в случае отсутствия активной'; en = 'Create a new deal if there is no active one'");
	
КонецПроцедуры	

Процедура Процедура_ОбработкаПоля_КоличествоГенерацийСделок(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].КоличествоГенерацийСделок";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамДействийПоСделкам(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		
КонецПроцедуры	

Процедура Процедура_ОбработкаДекорации_ИзмерениеКоличества(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Форма.УстановитьСвойстваЭлементамДействийПоСделкам(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		
КонецПроцедуры	

	// Элементы настройки сценария чат-бота
	
Процедура Процедура_ОбработкаГруппа_НастроекДействийПоСценариямЧатБота(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамДействийПоЧатБотам(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	
	
Процедура Процедура_ОбработкаПоля_СценарийЧатБота(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].СценарийЧатБота";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамДействийПоЧатБотам(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;					
	Элемент.Подсказка 			= Нстр("ru = 'Укажите сценарий чат-бота'; en = 'Specify the chatbot scenario'");

КонецПроцедуры	

	// Элементы настройки шаблона сообщений и описания задач				

Процедура Процедура_ОбработкаГруппа_ВыбораШаблона(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Форма.УстановитьСвойстваЭлементамШаблона(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	
	
Процедура Процедура_ОбработкаПоля_ШаблонСообщения(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.ПутьКДанным = "Объект.Действия[" + ИндексСтроки + "].ШаблонСообщения";
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамШаблона(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка 			= Нстр("ru = 'Укажите шаблон для сообщения, email и/или описания задачи'; en = 'Specify a template for the message , email, and / or task description'");

КонецПроцедуры	

Процедура Процедура_ОбработкаКоманды_ОткрытьШаблонДействия(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Форма.УстановитьСвойстваЭлементамСтрокиДействий(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	// Вставим подсказку
	Команда.Подсказка 		= Нстр("ru = 'Открыть шаблон'; en = 'Open a template'");
	
КонецПроцедуры

	// Кнопки дополнительной настройки каналов уведомлений
	
Процедура Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийPush(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	// Вставим подсказку
	Команда.Подсказка 		= Нстр("ru = 'Настроить для всех клиник'; en = 'Customize for all clinics'");
	Элемент.Доступность 	= Форма.СписокАктуальныхСтруктурныхЕдиниц.Количество() > 1;
	
КонецПроцедуры

Процедура Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийPushWallet(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	// Вставим подсказку
	Команда.Подсказка 		= Нстр("ru = 'Настроить для всех клиник'; en = 'Customize for all clinics'");
	Элемент.Доступность 	= Форма.СписокАктуальныхСтруктурныхЕдиниц.Количество() > 1;
	
КонецПроцедуры

Процедура Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийMessenger(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	// Вставим подсказку
	Команда.Подсказка 		= Нстр("ru = 'Настроить для всех клиник'; en = 'Customize for all clinics'");
	Элемент.Доступность 	= Форма.СписокАктуальныхСтруктурныхЕдиниц.Количество() > 1;
	
КонецПроцедуры

Процедура Процедура_ОбработкаКоманды_ОткрытьНастройкиУведомленийSMS(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	// Вставим подсказку
	Команда.Подсказка 		= Нстр("ru = 'Настроить для всех клиник'; en = 'Customize for all clinics'");
	Элемент.Доступность 	= Форма.СписокАктуальныхСтруктурныхЕдиниц.Количество() > 1;
	
КонецПроцедуры

	// Поле Структурная Единица
	
Процедура Процедура_ОбработкаПоля_СтруктурнаяЕдиница(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, Элемент.ПутьКДанным, "СтруктурнаяЕдиница");								
	КонецЕсли;
	
	Форма.УстановитьСвойстваЭлементамАккаунтаСообщения(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
	
	Элемент.Подсказка 			= Нстр("ru = 'Клиника отправки сообщений'; en = 'Message Sending Clinic'");
	
КонецПроцедуры

	// Кнопка выбора режима напоминания по задачам				

Процедура Процедура_ОбработкаКоманды_ВзаимодействиеРежимНапоминания(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		ЭлементФормы = Форма.Элементы.Найти("ВзаимодействиеРежимНапоминания_Индекс_" + Строка(ИндексСтроки));
		Если НЕ ЭлементФормы = Неопределено Тогда
			Форма.УстановитьСвойстваЭлементамСтрокиДействий(ЭлементФормы, ИндексСтроки, ПараметрыОтображенияЭлементов);
		КонецЕсли;	
	КонецЕсли;	
	// Вставим подсказку
	Команда.Подсказка 		= Нстр("ru = 'Режим напоминания'; en = 'Reminder mode'");
	
КонецПроцедуры

	// Кнопка применить настройки				

Процедура Процедура_ОбработкаКоманды_ПрименитьПараметрыДействия(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	// Вставим подсказку
	Команда.Подсказка 		= Нстр("ru = 'Применить параметры действия'; en = 'To apply the action parameters'");
	
КонецПроцедуры

	// Элементы удаления строк табличной части						

Процедура Процедура_ОбработкаГруппа_Удаления_СтрокаТЧ(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		
		Форма.УстановитьСвойстваЭлементамСтрокиДействий(Элемент, ИндексСтроки, ПараметрыОтображенияЭлементов);
		
		Элемент.ВертикальноеПоложениеВГруппе 		= ?(ПараметрыОтображенияЭлементов.ЭтоПерваяАктуальнаяСтрока, ВертикальноеПоложениеЭлемента.Центр, ВертикальноеПоложениеЭлемента.Авто);
		Элемент.ВертикальноеПоложениеПодчиненных 	= ?(ПараметрыОтображенияЭлементов.ЭтоПерваяАктуальнаяСтрока, ВертикальноеПоложениеЭлемента.Центр, ВертикальноеПоложениеЭлемента.Авто);
		Элемент.Подсказка 							= Нстр("ru = 'Удалить действие'; en = 'To remove the effect'");
	КонецЕсли;

КонецПроцедуры	

Процедура Процедура_ОбработкаДекорацияФормы_Заглушка_УдалитьСтроку_ТЧ(Форма, Элемент, Команда = Неопределено, ИндексСтроки, СтрокаТаблицы, ПараметрыОтображенияЭлементов)
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Элемент.Шрифт = ?(ПараметрыОтображенияЭлементов.ЭтоПерваяАктуальнаяСтрока, Новый Шрифт("Arial", 1), Новый Шрифт("Arial", 2));
		Элемент.Подсказка = "";
	КонецЕсли;

КонецПроцедуры	

// Функция - Получить список исключенных свойств
//
// Параметры:
//  ВидЭлемента	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСписокИсключенныхСвойств(ВидЭлемента)
	
	СписокСвойств = "";
	
	Если ВидЭлемента = ВидПоляФормы.ПолеФлажка Тогда 
		СписокСвойств = "ПутьКДанным";
	ИначеЕсли ВидЭлемента = ВидПоляФормы.ПолеВвода Тогда 
		СписокСвойств = "ВыделенныйТекст, ПутьКДанным";
	ИначеЕсли ВидЭлемента = ВидГруппыФормы.ОбычнаяГруппа Тогда	
		СписокСвойств = "ПутьКДаннымЗаголовка";
	КонецЕсли;
	
	Возврат СписокСвойств;
	
КонецФункции

// Процедура - Установить действия для элемента
//
// Параметры:
//  НовыйЭлемент - 	 - 
//  ЭлементФормы - 	 - 
//  ТипЭлемента	 - 	 - 
//
Процедура УстановитьДействияДляЭлемента(НовыйЭлемент, ЭлементФормы, ТипЭлемента)
	
	Если ТипЭлемента = Тип("ДекорацияФормы") Тогда
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("Нажатие");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("Нажатие", ИмяОбработчикаСобытия);	
		КонецЕсли;
	ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда	
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("ПриИзменении");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("ПриИзменении", ИмяОбработчикаСобытия);	
		КонецЕсли;
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("НачалоВыбора");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", ИмяОбработчикаСобытия);	
		КонецЕсли;
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("НачалоВыбораИзСписка");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("НачалоВыбораИзСписка", ИмяОбработчикаСобытия);	
		КонецЕсли;		
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("Очистка");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("Очистка", ИмяОбработчикаСобытия);	
		КонецЕсли;
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("Открытие");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("Открытие", ИмяОбработчикаСобытия);	
		КонецЕсли;		
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("ОбработкаВыбора");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", ИмяОбработчикаСобытия);	
		КонецЕсли;		
		ИмяОбработчикаСобытия = ЭлементФормы.ПолучитьДействие("ОбработкаВыбора");
		Если НЕ ИмяОбработчикаСобытия = "" Тогда 
			НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", ИмяОбработчикаСобытия);	
		КонецЕсли;		
	КонецЕсли;
	        
КонецПроцедуры

// Процедура - Определить путь к данным настроек каналов
//
// Параметры:
//  Форма			 - 	 - 
//  ИндексСтроки	 - 	 - 
//  СтрокаТаблицы	 - 	 - 
//  ПутьКДанным		 - 	 - 
//  ИмяРеквизита	 - 	 - 
//
Процедура ОпределитьПутьКДаннымНастроекКаналов(Форма, ИндексСтроки, СтрокаТаблицы, ПутьКДанным, ИмяРеквизита)
	
	СтруктурнаяЕдиница = Неопределено;
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы.Свойство("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		СтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, Форма.ТекущаяСтруктурнаяЕдиница);
		МассивСтрокНастроекКаналов = Форма.МоделируемыеНастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", СтрокаТаблицы.ИдентификаторДействия, СтруктурнаяЕдиница));
		Если НЕ МассивСтрокНастроекКаналов.Количество() = 0 Тогда 
			ПутьКДанным = "МоделируемыеНастройкиКаналовУведомлений[" + Формат(Форма.МоделируемыеНастройкиКаналовУведомлений.Индекс(МассивСтрокНастроекКаналов[0]), "ЧГ=0") + "]." + ИмяРеквизита;
		КонецЕсли;	
	Иначе
		СтрокаТаблицыПлана = Форма.Объект.Действия.Получить(ИндексСтроки);
		МассивСтрокНастроекКаналов = Форма.МоделируемыеНастройкиКаналовУведомлений.НайтиСтроки(Новый Структура("ИдентификаторДействия, СтруктурнаяЕдиница", СтрокаТаблицыПлана.ИдентификаторДействия, Форма.ТекущаяСтруктурнаяЕдиница));
		Если НЕ МассивСтрокНастроекКаналов.Количество() = 0 Тогда 
			ПутьКДанным = "МоделируемыеНастройкиКаналовУведомлений[" + Формат(Форма.МоделируемыеНастройкиКаналовУведомлений.Индекс(МассивСтрокНастроекКаналов[0]), "ЧГ=0") + "]." + ИмяРеквизита;
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область _______________________ПРОЦЕДУРЫ_ОБНОВЛЕНИЯ_________________________

// Процедура - Выполнить переход на триггерную систему событий
//
Процедура ВыполнитьПереходНаТриггернуюСистемуСобытий() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ 				= Ложь;
	
	// Создание сегментов для триггерных событий
	ТаблицаСегментов 	= Неопределено;
	ИнициализироватьСегментыТриггеров(ТаблицаСегментов, Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ТаблицаТриггерныхСобытий = Неопределено;
	ТриггерКонтроляРассрочек = Неопределено;

	// Создание триггерных событий
	ГенерацияТриггерныхСобытий(ТаблицаСегментов, ТаблицаТриггерныхСобытий, ТриггерКонтроляРассрочек, Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	АктуализироватьВзаимодействияПоПродлениюЧленствПакетовУслуг(ТаблицаТриггерныхСобытий);
	
	АктуализироватьВзаимодействияПоПродажеДополнительныхУслуг(ТаблицаТриггерныхСобытий);
	
	АктуализироватьВзаимодействияПоКонтролюПлатежейПоРассрочкам(ТриггерКонтроляРассрочек);	
	
	АктуализироватьВзаимодействияПоПродажеЧленства();
	
	АктуализироватьВзаимодействияПростые();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Процедура - Инициализировать сегменты триггеров
//
// Параметры:
//  ТаблицаСегментов - 	 - 
//  Отказ			 - 	 - 
//
Процедура ИнициализироватьСегментыТриггеров(ТаблицаСегментов, Отказ = Ложь) Экспорт 

	// Создаем таблицу сегментов, где будем аккумулировать созданные сегменты
	ТаблицаСегментов = Новый ТаблицаЗначений;
	// ТаблицаСегментов.Колонки.Добавить("СтруктурнаяЕдиница"	, Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	ТаблицаСегментов.Колонки.Добавить("Сегмент"				, Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры"));
	ТаблицаСегментов.Колонки.Добавить("НастройкаБП"			, Новый ОписаниеТипов("СправочникСсылка.НастройкиБизнесПроцессов"));
	ТаблицаСегментов.Колонки.Добавить("Услуга"				, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	
	// Выбираем номенклатуру с активными настройками для формирования сегментов
	// + номенклатуру в текущих активных БП даже если в самой номенклатуре настройка уже не активна
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ВЫРАЗИТЬ(РеквизитыНоменклатуры.Значение КАК Справочник.НастройкиБизнесПроцессов) КАК НастройкаБП,
	             	  |	РеквизитыНоменклатуры.Номенклатура КАК Номенклатура
	             	  |ПОМЕСТИТЬ ТаблицаНоменклатуры
	             	  |ИЗ
	             	  |	РегистрСведений.РеквизитыНоменклатуры КАК РеквизитыНоменклатуры
	             	  |ГДЕ
	             	  |	РеквизитыНоменклатуры.Реквизит = ""ПродлениеЧленстваНастройка""
	             	  |	И РеквизитыНоменклатуры.Номенклатура В
	             	  |			(ВЫБРАТЬ
	             	  |				РеквизитыНоменклатуры.Номенклатура КАК Номенклатура
	             	  |			ИЗ
	             	  |				РегистрСведений.РеквизитыНоменклатуры КАК РеквизитыНоменклатуры
	             	  |			ГДЕ
	             	  |				РеквизитыНоменклатуры.Реквизит = ""ЗапуститьПроцессПродленияЧленстваПоНастройке""
	             	  |				И РеквизитыНоменклатуры.Значение = ИСТИНА)
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	РеквизитыНоменклатуры.Значение,
	             	  |	РеквизитыНоменклатуры.Номенклатура
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	ВЫРАЗИТЬ(РеквизитыНоменклатуры.Значение КАК Справочник.НастройкиБизнесПроцессов),
	             	  |	РеквизитыНоменклатуры.Номенклатура
	             	  |ИЗ
	             	  |	РегистрСведений.РеквизитыНоменклатуры КАК РеквизитыНоменклатуры
	             	  |ГДЕ
	             	  |	РеквизитыНоменклатуры.Реквизит = ""ПродлениеПакетаУслугНастройка""
	             	  |	И РеквизитыНоменклатуры.Номенклатура В
	             	  |			(ВЫБРАТЬ
	             	  |				РеквизитыНоменклатуры.Номенклатура КАК Номенклатура
	             	  |			ИЗ
	             	  |				РегистрСведений.РеквизитыНоменклатуры КАК РеквизитыНоменклатуры
	             	  |			ГДЕ
	             	  |				РеквизитыНоменклатуры.Реквизит = ""ЗапуститьПроцессПродленияПакетаУслугПоНастройке""
	             	  |				И РеквизитыНоменклатуры.Значение = ИСТИНА)
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	РеквизитыНоменклатуры.Значение,
	             	  |	РеквизитыНоменклатуры.Номенклатура
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ПродлениеЧленства_КОРП.НастройкаБизнесПроцесса КАК НастройкаБизнесПроцесса,
	             	  |	ПродлениеЧленства_КОРП.ЧленствоПакетУслуг.Номенклатура КАК ЧленствоПакетУслугНоменклатура
	             	  |ПОМЕСТИТЬ ТаблицаНастроекПоТекущимБП
	             	  |ИЗ
	             	  |	БизнесПроцесс.ПродлениеЧленства_КОРП КАК ПродлениеЧленства_КОРП
	             	  |ГДЕ
	             	  |	ПродлениеЧленства_КОРП.Стартован = ИСТИНА
	             	  |	И ПродлениеЧленства_КОРП.Завершен = ЛОЖЬ
	             	  |	И НЕ ПродлениеЧленства_КОРП.ЧленствоПакетУслуг.Номенклатура В
	             	  |				(ВЫБРАТЬ
	             	  |					ТаблицаНоменклатуры.Номенклатура
	             	  |				ИЗ
	             	  |					ТаблицаНоменклатуры)
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	ПродлениеПакетаУслуг_КОРП.НастройкаБизнесПроцесса,
	             	  |	ПродлениеПакетаУслуг_КОРП.ЧленствоПакетУслуг.Номенклатура
	             	  |ИЗ
	             	  |	БизнесПроцесс.ПродлениеПакетаУслуг_КОРП КАК ПродлениеПакетаУслуг_КОРП
	             	  |ГДЕ
	             	  |	ПродлениеПакетаУслуг_КОРП.Стартован = ИСТИНА
	             	  |	И ПродлениеПакетаУслуг_КОРП.Завершен = ЛОЖЬ
	             	  |	И НЕ ПродлениеПакетаУслуг_КОРП.ЧленствоПакетУслуг.Номенклатура В
	             	  |				(ВЫБРАТЬ
	             	  |					ТаблицаНоменклатуры.Номенклатура
	             	  |				ИЗ
	             	  |					ТаблицаНоменклатуры)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ВЫРАЗИТЬ(РеквизитыНоменклатуры.Значение КАК Справочник.НастройкиБизнесПроцессов) КАК НастройкаБП,
	             	  |	РеквизитыНоменклатуры.Номенклатура КАК Услуга
	             	  |ПОМЕСТИТЬ ТаблицаУслуг
	             	  |ИЗ
	             	  |	РегистрСведений.РеквизитыНоменклатуры КАК РеквизитыНоменклатуры
	             	  |ГДЕ
	             	  |	РеквизитыНоменклатуры.Реквизит = ""ЗаписьНаЗанятиеНастройка""
	             	  |	И РеквизитыНоменклатуры.Номенклатура В
	             	  |			(ВЫБРАТЬ
	             	  |				РеквизитыНоменклатуры.Номенклатура КАК Номенклатура
	             	  |			ИЗ
	             	  |				РегистрСведений.РеквизитыНоменклатуры КАК РеквизитыНоменклатуры
	             	  |			ГДЕ
	             	  |				РеквизитыНоменклатуры.Реквизит = ""ЗапуститьПроцессЗаписиНаЗанятиеПоНастройке""
	             	  |				И РеквизитыНоменклатуры.Значение = ИСТИНА)
	             	  |	И РеквизитыНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	             	  |	И РеквизитыНоменклатуры.Номенклатура.ВидУслуги <> ЗНАЧЕНИЕ(Перечисление.ВидыУслугНоменклатуры.УслугиСалона)
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	РеквизитыНоменклатуры.Значение,
	             	  |	РеквизитыНоменклатуры.Номенклатура
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ТаблицаУслуг.НастройкаБП КАК НастрокаБП,
	             	  |	ТаблицаУслуг.Услуга КАК Услуга,
	             	  |	НоменклатураЧленствоПакетУслугСоставУслуг.Ссылка КАК Членство
	             	  |ПОМЕСТИТЬ ТаблицаНоменклатурыДляДопПродаж
	             	  |ИЗ
	             	  |	ТаблицаУслуг КАК ТаблицаУслуг
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ЧленствоПакетУслугСоставУслуг КАК НоменклатураЧленствоПакетУслугСоставУслуг
	             	  |		ПО ТаблицаУслуг.Услуга = НоменклатураЧленствоПакетУслугСоставУслуг.УслугаСегмент
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ТаблицаНоменклатуры.НастройкаБП КАК НастройкаБП,
	             	  |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Услуга,
	             	  |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура
	             	  |ПОМЕСТИТЬ ТаблицаНастроекБП_И_Номенклатуры
	             	  |ИЗ
	             	  |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	ТаблицаНастроекПоТекущимБП.НастройкаБизнесПроцесса,
	             	  |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	             	  |	ТаблицаНастроекПоТекущимБП.ЧленствоПакетУслугНоменклатура
	             	  |ИЗ
	             	  |	ТаблицаНастроекПоТекущимБП КАК ТаблицаНастроекПоТекущимБП
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	ТаблицаНоменклатурыДляДопПродаж.НастрокаБП,
	             	  |	ТаблицаНоменклатурыДляДопПродаж.Услуга,
	             	  |	ТаблицаНоменклатурыДляДопПродаж.Членство
	             	  |ИЗ
	             	  |	ТаблицаНоменклатурыДляДопПродаж КАК ТаблицаНоменклатурыДляДопПродаж
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.НастройкаБП КАК НастройкаБП,
	             	  |	ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка) КАК Сегмент,
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.Номенклатура КАК ОбъектСегмента,
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.Услуга КАК Услуга,
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.НастройкаБП.ВидБизнесПроцесса КАК ВидБизнесПроцесса,
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.НастройкаБП.Код КАК НастройкаБПКод
	             	  |ИЗ
	             	  |	ТаблицаНастроекБП_И_Номенклатуры КАК ТаблицаНастроекБП_И_Номенклатуры
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.НастройкаБП,
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.Номенклатура,
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.Услуга,
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.НастройкаБП.ВидБизнесПроцесса,
	             	  |	ТаблицаНастроекБП_И_Номенклатуры.НастройкаБП.Код
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	СегментыНоменклатуры.Ссылка КАК Ссылка,
	             	  |	СегментыНоменклатуры.Наименование КАК Наименование,
	             	  |	СегментыНоменклатуры.Описание КАК Описание
	             	  |ИЗ
	             	  |	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	             	  |ГДЕ
	             	  |	СегментыНоменклатуры.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаНоменклатуры_И_НастроекБП = РезультатЗапроса[5].Выгрузить();	
	ТаблицаСегментовНоменклатуры	 = РезультатЗапроса[6].Выгрузить();	
	// МассивСтруктурныхЕдиниц			 = РезультатЗапроса[5].Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");	
	
	ГруппаРодительСегментов = ИнициализироватьГруппуСегментов();
	Если ГруппаРодительСегментов = Неопределено Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Для Каждого ЭлементСтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
	//	ТаблицаНастроекПоСтруктурнойЕдинице = ТаблицаНоменклатуры_И_НастроекБП.Скопировать(Новый Структура("СтруктурнаяЕдиница", ЭлементСтруктурнаяЕдиница));
		ТаблицаНастроекБП = ТаблицаНоменклатуры_И_НастроекБП.Скопировать(, "НастройкаБП, Услуга, ВидБизнесПроцесса, НастройкаБПКод");
		ТаблицаНастроекБП.Свернуть("НастройкаБП, Услуга, ВидБизнесПроцесса, НастройкаБПКод");
		
		Для Каждого СтрокаТЗНастрока Из ТаблицаНастроекБП Цикл
			Если СтрокаТЗНастрока.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродажаДополнительныхУслуг_КОРП Тогда 
				ОписаниеСегмента = "Сегмент членств сформирован автоматически для триггеров системы. В данный сегмент попала номенклатура, в составе которой есть услуга """ + СокрЛП(Строка(СтрокаТЗНастрока.Услуга)) + """ с активированной настройкой бизнес-процесса """ + СокрЛП(Строка(СтрокаТЗНастрока.НастройкаБП)) + """. Номер настройки - " + СтрокаТЗНастрока.НастройкаБПКод;
			Иначе 
				ОписаниеСегмента 									= "Сегмент " + ?(СтрокаТЗНастрока.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеПакетаУслуг_КОРП, "пакетов услуг", "членств") + " сформирован автоматически для триггеров системы. В данный сегмент попала номенклатура, которая учавствовала в сервисных звонках настройки бизнес-процесса """ + СокрЛП(Строка(СтрокаТЗНастрока.НастройкаБП)) + """. Номер настройки - " + СтрокаТЗНастрока.НастройкаБПКод;
			КонецЕсли;	
			МассивСегментов = ТаблицаСегментовНоменклатуры.НайтиСтроки(Новый Структура("Описание", ОписаниеСегмента));
			Если МассивСегментов.Количество() = 0 Тогда 
				СегментНоменклатуры_Объект 							= Справочники.СегментыНоменклатуры.СоздатьЭлемент();
				СегментНоменклатуры_Объект.Родитель 				= ГруппаРодительСегментов;
				// СегментНоменклатуры_Объект.СтруктурнаяЕдиница 		= ЭлементСтруктурнаяЕдиница;
				СегментНоменклатуры_Объект.Наименование 			= "Сегмент " + ?(СтрокаТЗНастрока.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеПакетаУслуг_КОРП, "пакетов услуг", "членств") + " с услугой """ + СокрЛП(Строка(СтрокаТЗНастрока.Услуга)) + """ в составе для настройки - " + СокрЛП(Строка(СтрокаТЗНастрока.НастройкаБП));// + " (" + СокрЛП(Строка(ЭлементСтруктурнаяЕдиница)) + ")";
				СегментНоменклатуры_Объект.СпособФормирования 		= Перечисления.СпособыФормированияСегментов.ФормироватьВручную;
				СегментНоменклатуры_Объект.ДатаСоздания 			= НачалоДня(ТекущаяДатаСеанса());
				СегментНоменклатуры_Объект.Описание 				= ОписаниеСегмента;
				СегментНоменклатуры_Объект.Автор 					= ПараметрыСеанса.ТекущийСотрудник;
				СегментНоменклатуры_Объект.УстановитьНовыйКод();										
				СегментНоменклатуры_Объект.ОбменДанными.Загрузка 	= Истина;
				Попытка
					// Сохраняем сегмент
					СегментНоменклатуры_Объект.Записать();
					Для Каждого СтрокаТЗ ИЗ ТаблицаНоменклатуры_И_НастроекБП Цикл 
						Если СтрокаТЗ.НастройкаБП = СтрокаТЗНастрока.НастройкаБП Тогда 
							СтрокаТЗ.Сегмент = СегментНоменклатуры_Объект.Ссылка;
						КонецЕсли;
					КонецЦикла;	
					// Наполняем номенклатурой
					НаборЗаписейСоставСегментов = РегистрыСведений.СоставСегментов.СоздатьНаборЗаписей();
					НаборЗаписейСоставСегментов.Отбор.Сегмент.Установить(СегментНоменклатуры_Объект.Ссылка);
					НаборЗаписейСоставСегментов.Загрузить(ТаблицаНоменклатуры_И_НастроекБП.Скопировать(Новый Структура("НастройкаБП, Услуга, Сегмент", СтрокаТЗНастрока.НастройкаБП, СтрокаТЗНастрока.Услуга, СегментНоменклатуры_Объект.Ссылка), "Сегмент, ОбъектСегмента"));		
					НаборЗаписейСоставСегментов.Записать(Ложь);
					// Формируем результирующую таблицу
					НоваяСтрока = ТаблицаСегментов.Добавить();
					// НоваяСтрока.СтруктурнаяЕдиница 	= ЭлементСтруктурнаяЕдиница;
					НоваяСтрока.Сегмент 			= СегментНоменклатуры_Объект.Ссылка;
					НоваяСтрока.НастройкаБП 		= СтрокаТЗНастрока.НастройкаБП;
					НоваяСтрока.Услуга	 			= СтрокаТЗНастрока.Услуга;					
				Исключение
					Отказ = Истина;
					ЗаписьЖурналаРегистрации("Ошибка создания сегмента номенклатуры!", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.СегментыНоменклатуры, , ОписаниеОшибки());			
					Прервать;
				КонецПопытки;
			Иначе 
				НоваяСтрока = ТаблицаСегментов.Добавить();
				// НоваяСтрока.СтруктурнаяЕдиница 	= ЭлементСтруктурнаяЕдиница;
				НоваяСтрока.Сегмент 			= МассивСегментов[0].Ссылка;
				НоваяСтрока.НастройкаБП 		= СтрокаТЗНастрока.НастройкаБП;
				НоваяСтрока.Услуга	 			= СтрокаТЗНастрока.Услуга;				
			КонецЕсли;
		КонецЦикла;
	//	Если Отказ Тогда Прервать; КонецЕсли;
	// КонецЦикла;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Инициализировать группу сегментов
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьГруппуСегментов()
	
	ГруппаСегментов = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", "Сегменты номенклатуры для триггеров" + "%");	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СегментыНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	               |ГДЕ
	               |	СегментыНоменклатуры.ЭтоГруппа = ИСТИНА
	               |	И СегментыНоменклатуры.Наименование ПОДОБНО &Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		ГруппаСегментовНоменклатуры							= Справочники.СегментыНоменклатуры.СоздатьГруппу();
		ГруппаСегментовНоменклатуры.Наименование 			= "Сегменты номенклатуры для триггеров";
		ГруппаСегментовНоменклатуры.УстановитьНовыйКод();							
		ГруппаСегментовНоменклатуры.ОбменДанными.Загрузка 	= Истина;
		Попытка
			ГруппаСегментовНоменклатуры.Записать();
			ГруппаСегментов = ГруппаСегментовНоменклатуры.Ссылка;
		Исключение
			// Запись в лог						
			ЗаписьЖурналаРегистрации("Ошибка создания группы сегментов номенклатуры!", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.СегментыНоменклатуры, , ОписаниеОшибки());			
		КонецПопытки;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда 
			ГруппаСегментов = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;

	Возврат ГруппаСегментов;
	
КонецФункции

// Функция - Инициализировать группу триггерного события
//
// Параметры:
//  СтрокаСервисныйЗвонок	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьГруппуТриггерногоСобытия(СтрокаСервисныйЗвонок)
	
	ГруппаТриггерногоСобытия = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", СокрЛП(СтрокаСервисныйЗвонок.Наименование));	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТриггерныеСобытия.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	               |ГДЕ
	               |	ТриггерныеСобытия.ЭтоГруппа = ИСТИНА
	               |	И ТриггерныеСобытия.Наименование ПОДОБНО &Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		ГруппаТриггерногоСобытия_Объект							= Справочники.ТриггерныеСобытия.СоздатьГруппу();
		ГруппаТриггерногоСобытия_Объект.Наименование 			= СокрЛП(СтрокаСервисныйЗвонок.Наименование);
		ГруппаТриггерногоСобытия_Объект.УстановитьНовыйКод();							
		ГруппаТриггерногоСобытия_Объект.ОбменДанными.Загрузка 	= Истина;
		Попытка
			ГруппаТриггерногоСобытия_Объект.Записать();
			ГруппаТриггерногоСобытия = ГруппаТриггерногоСобытия_Объект.Ссылка;
		Исключение
			// Запись в лог						
			ЗаписьЖурналаРегистрации("Ошибка создания группы триггерного события!", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТриггерныеСобытия, , ОписаниеОшибки());			
		КонецПопытки;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда 
			ГруппаТриггерногоСобытия = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;

	Возврат ГруппаТриггерногоСобытия;
	
КонецФункции

// Процедура - Генерация триггерных событий
//
// Параметры:
//  ТаблицаСегментов		 - 	 - 
//  ТаблицаТриггерныхСобытий - 	 - 
//  ТриггерКонтроляРассрочек - 	 - 
//  Отказ					 - 	 - 
//
Процедура ГенерацияТриггерныхСобытий(ТаблицаСегментов, ТаблицаТриггерныхСобытий = Неопределено, ТриггерКонтроляРассрочек, Отказ) Экспорт
	
	МассивВидовБизнесПроцессов = Новый Массив;
	МассивВидовБизнесПроцессов.Добавить(Перечисления.ВидыБизнесПроцессов.ПродлениеЧленства_КОРП);
	МассивВидовБизнесПроцессов.Добавить(Перечисления.ВидыБизнесПроцессов.ПродлениеПакетаУслуг_КОРП);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаСегментов, "ТаблицаСегментов");
	Запрос.УстановитьПараметр("МассивВидовБизнесПроцессов", МассивВидовБизнесПроцессов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка КАК СсылкаНастройкиБП,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.Наименование КАК Наименование,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ВидБизнесПроцесса КАК ВидБизнесПроцесса,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.НомерСтроки КАК НомерСтроки,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.УИД КАК УИД,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.МоментАктивации КАК МоментАктивации,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.ПериодАктивации КАК ПериодАктивации,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.ТипПериода КАК ТипПериода,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.КоличествоПовторений КАК КоличествоПовторений,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.КритическийОстаток КАК КритическийОстаток,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.СегментИсполнителей КАК СегментИсполнителей,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Тема КАК Тема,
	               |	ЛОЖЬ КАК КонтрольОстаткаПакета,
	               |	ЗНАЧЕНИЕ(Справочник.ТриггерныеСобытия.ПустаяСсылка) КАК ТриггерСсылка,
	               |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Услуга
	               |ИЗ
	               |	Справочник.НастройкиБизнесПроцессов.СервисныеЗвонки КАК НастройкиБизнесПроцессовСервисныеЗвонки
	               |ГДЕ
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ВидБизнесПроцесса В(&МассивВидовБизнесПроцессов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.Наименование,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ВидБизнесПроцесса,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ПометкаУдаления,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.НомерСтроки,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.УИД,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.МоментАктивации,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.ПериодАктивации,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.ТипПериода,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.КоличествоПовторений,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.КритическийОстаток,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.СегментИсполнителей,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Тема,
	               |	ИСТИНА,
	               |	ЗНАЧЕНИЕ(Справочник.ТриггерныеСобытия.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |ИЗ
	               |	Справочник.НастройкиБизнесПроцессов.СервисныеЗвонки КАК НастройкиБизнесПроцессовСервисныеЗвонки
	               |ГДЕ
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ВидБизнесПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыБизнесПроцессов.ПродлениеПакетаУслуг_КОРП)
	               |	И НастройкиБизнесПроцессовСервисныеЗвонки.МоментАктивации = ЗНАЧЕНИЕ(Перечисление.ВариантыАктивацииСервисныхЗвонков_Удалить.ДоОкончанияСрокаДействияЗа)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.Наименование,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ВидБизнесПроцесса,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ПометкаУдаления,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.НомерСтроки,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.УИД,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.МоментАктивации,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.ПериодАктивации,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.ТипПериода,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.КоличествоПовторений,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.КритическийОстаток,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.СегментИсполнителей,
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Тема,
	               |	ЛОЖЬ,
	               |	ЗНАЧЕНИЕ(Справочник.ТриггерныеСобытия.ПустаяСсылка),
	               |	ТаблицаСегментов.Услуга
	               |ИЗ
	               |	Справочник.НастройкиБизнесПроцессов.СервисныеЗвонки КАК НастройкиБизнесПроцессовСервисныеЗвонки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСегментов КАК ТаблицаСегментов
	               |		ПО НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка = ТаблицаСегментов.НастройкаБП
	               |ГДЕ
	               |	НастройкиБизнесПроцессовСервисныеЗвонки.Ссылка.ВидБизнесПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыБизнесПроцессов.ПродажаДополнительныхУслуг_КОРП)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШаблоныСообщений.Ссылка КАК Ссылка,
	               |	ШаблоныСообщений.Наименование КАК Наименование,
	               |	ШаблоныСообщений.ЗадачаОписание КАК ЗадачаОписание
	               |ИЗ
	               |	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	               |ГДЕ
	               |	ШаблоныСообщений.ЭтоГруппа = ЛОЖЬ
	               |	И ШаблоныСообщений.Предопределенный = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТриггерныеСобытия.Ссылка КАК Ссылка,
	               |	ТриггерныеСобытия.Наименование КАК Наименование,
	               |	ТриггерныеСобытия.КодСинхронизации КАК КодСинхронизации,
	               |	ТриггерныеСобытия.УсловиеСобытия КАК УсловиеСобытия
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	               |ГДЕ
	               |	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса 		= Запрос.ВыполнитьПакет();
	ТаблицаСервисныхЗвонков = РезультатЗапроса[0].Выгрузить();
	ТаблицаШаблонов 		= РезультатЗапроса[1].Выгрузить();
	ТаблицаТриггеров 		= РезультатЗапроса[2].Выгрузить();
	
	ДоступныеУчетныеЗаписи 	= УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(Истина);
	АккаунтEmail   			= ?(ДоступныеУчетныеЗаписи.Количество() > 0, ДоступныеУчетныеЗаписи[0].Ссылка, Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты);
	АккаунтSMS 				= Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	
	ГруппаШаблонов 			= ИнициализироватьГруппуШаблоновСообщений();
	Отказ 					= Ложь;
	
	// Создаем триггеры согласно настройкам продления членств/пакетов услуг	
	Для Каждого СтрокаСервисныйЗвонок Из ТаблицаСервисныхЗвонков Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаСервисныйЗвонок.МоментАктивации) Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивСегментов = ТаблицаСегментов.НайтиСтроки(Новый Структура("НастройкаБП, Услуга", СтрокаСервисныйЗвонок.СсылкаНастройкиБП, СтрокаСервисныйЗвонок.Услуга));
		Если МассивСегментов.Количество() = 0 Тогда 
			СегментНоменклатуры = Неопределено;
			Услуга 				= Неопределено;
		Иначе 
			СегментНоменклатуры = МассивСегментов[0].Сегмент;
			Услуга 				= МассивСегментов[0].Услуга;				
		КонецЕсли;
		СоздатьТриггерноеСобытие(СтрокаСервисныйЗвонок, ТаблицаТриггеров, СегментНоменклатуры, Услуга, АккаунтEmail, АккаунтSMS, ТаблицаШаблонов, ГруппаШаблонов, Отказ);
		Если Отказ = Истина Тогда 
			Прервать;			
		КонецЕсли;	
	КонецЦикла;
	
	УИД_ТриггераКонтроляПлатежей 	= Новый УникальныйИдентификатор("178266c8-7767-4b92-810a-5d41d5bf7275");
	ТриггерКонтроляПлатежей 		= Справочники.ТриггерныеСобытия.НайтиПоРеквизиту("КодСинхронизации", УИД_ТриггераКонтроляПлатежей);
	
	Если НЕ ЗначениеЗаполнено(ТриггерКонтроляПлатежей) Тогда 
		// Создаем триггер для контроля платежей по рассрочкам
		Триггер_Объект 									= Справочники.ТриггерныеСобытия.СоздатьЭлемент();
		Триггер_Объект.Наименование 					= "Напоминание о просроченном платеже по рассрочке";	
		Триггер_Объект.Активно 							= Истина;
		Триггер_Объект.УсловиеСобытия 					= Перечисления.ВариантыУсловийТриггерныхСобытий.ПродажаПлатежПоРассрочке;
		Триггер_Объект.МоментСобытия 					= Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;
		Триггер_Объект.ВремяСобытия 					= Дата(1, 1, 1, 23, 0, 0);
		// Триггер_Объект.ВидАдресата_Удалить 				= Перечисления.ВидыАдресатов.Куратор;
		// Триггер_Объект.Адресат_Удалить 					= Справочники.СегментыСотрудников.МенеджерыОтделаПродаж;
		// Триггер_Объект.АккаунтSMS_Удалить 				= АккаунтSMS;
		// Триггер_Объект.АккаунтEmail_Удалить 			= АккаунтEmail;
		// Триггер_Объект.ШаблонСообщения_Удалить 			= СгенерироватьШаблонДляТриггерногоСобытия(ТаблицаШаблонов, ГруппаШаблонов, , , Отказ);
		Триггер_Объект.КодСинхронизации 				= УИД_ТриггераКонтроляПлатежей;	
		Триггер_Объект.Описание 						= "Триггерное событие сформированно автоматически.";
		Триггер_Объект.УстановитьНовыйКод();		
		Триггер_Объект.ОбменДанными.Загрузка 			= Истина;
		Попытка
			Триггер_Объект.Записать();
			ТриггерКонтроляРассрочек = Триггер_Объект.Ссылка;
		Исключение
			Отказ = Истина;
			ЗаписьЖурналаРегистрации("Ошибка создания триггерного события! " + Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП) + " Код настройки: " + Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП.Код) + " Номер строки: " + Строка(СтрокаСервисныйЗвонок.НомерСтроки), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТриггерныеСобытия, , ОписаниеОшибки());			
		КонецПопытки;
	Иначе 
		ТриггерКонтроляРассрочек = ТриггерКонтроляПлатежей;
	КонецЕсли;

	Если НЕ ТаблицаТриггерныхСобытий = Неопределено Тогда 
		ТаблицаТриггерныхСобытий.Загрузить(ТаблицаСервисныхЗвонков);
	Иначе 
		ТаблицаТриггерныхСобытий = ТаблицаСервисныхЗвонков;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Создать триггерное событие
//
// Параметры:
//  СтрокаСервисныйЗвонок	 - 	 - 
//  ТаблицаТриггеров		 - 	 - 
//  СегментНоменклатуры		 - 	 - 
//  Услуга					 - 	 - 
//  АккаунтEmail			 - 	 - 
//  АккаунтSMS				 - 	 - 
//  ТаблицаШаблонов			 - 	 - 
//  ГруппаШаблонов			 - 	 - 
//  Отказ					 - 	 - 
//
Процедура СоздатьТриггерноеСобытие(СтрокаСервисныйЗвонок, ТаблицаТриггеров, СегментНоменклатуры, Услуга, АккаунтEmail, АккаунтSMS, ТаблицаШаблонов, ГруппаШаблонов, Отказ)
	
	// Поиск уже созданных
	МассивСтрокТриггера = ТаблицаТриггеров.НайтиСтроки(Новый Структура("КодСинхронизации", СтрокаСервисныйЗвонок.УИД));
	Если МассивСтрокТриггера.Количество() = 1 Тогда
		СтрокаСервисныйЗвонок.ТриггерСсылка 		= МассивСтрокТриггера[0].Ссылка;
		// Если НЕ ЗначениеЗаполнено(МассивСтрокТриггера[0].СегментЧленствПакетовУслуг) И ЗначениеЗаполнено(СегментНоменклатуры) Тогда 
		//	Триггер_Объект 							= МассивСтрокТриггера[0].Ссылка.ПолучитьОбъект();
		//	Триггер_Объект.СегментЧленствПакетовУслуг 		= СегментНоменклатуры;
		//	Триггер_Объект.ОбменДанными.Загрузка 	= Истина;
		//	Попытка
		//		Триггер_Объект.Записать();
		//	Исключение
		//		Отказ = Истина;
		//		ЗаписьЖурналаРегистрации("Ошибка редактирования триггерного события! " + Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП) + " Код настройки: " + Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП.Код) + " Номер строки: " + Строка(СтрокаСервисныйЗвонок.НомерСтроки), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТриггерныеСобытия, , ОписаниеОшибки());			
		//	КонецПопытки;
		// КонецЕсли;	
		Возврат; // Продолжить;		
	ИначеЕсли МассивСтрокТриггера.Количество() > 1 Тогда
		Для Каждого СтрокаМассива Из МассивСтрокТриггера Цикл
			ТриггерНайден = Ложь;			
			Если СтрокаСервисныйЗвонок.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродажаДополнительныхУслуг_КОРП И ЗначениеЗаполнено(Услуга) Тогда
				Если НЕ СтрНайти(СтрокаМассива.Наименование, СокрЛП(Строка(Услуга))) = 0 Тогда 
					СтрокаСервисныйЗвонок.ТриггерСсылка 	= СтрокаМассива.Ссылка;
					ТриггерНайден = Истина;
				КонецЕсли;	
			КонецЕсли;	
			// Если ТриггерНайден И НЕ ЗначениеЗаполнено(СтрокаМассива.СегментЧленствПакетовУслуг) И ЗначениеЗаполнено(СегментНоменклатуры) Тогда 
			//	Триггер_Объект 								= СтрокаМассива.Ссылка.ПолучитьОбъект();
			//	Триггер_Объект.СегментЧленствПакетовУслуг 	= СегментНоменклатуры;
			//	Триггер_Объект.ОбменДанными.Загрузка 		= Истина;
			//	Попытка
			//		Триггер_Объект.Записать();
			//	Исключение
			//		Отказ = Истина;
			//		ЗаписьЖурналаРегистрации("Ошибка редактирования триггерного события! " + Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП) + " Код настройки: " + Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП.Код) + " Номер строки: " + Строка(СтрокаСервисныйЗвонок.НомерСтроки), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТриггерныеСобытия, , ОписаниеОшибки());			
			//	КонецПопытки;
			// КонецЕсли;
		КонецЦикла;
		Возврат; // Продолжить;
	КонецЕсли;	
	
	// Если не нашли - создаем
	Триггер_Объект 										= Справочники.ТриггерныеСобытия.СоздатьЭлемент();
	Триггер_Объект.Родитель 							= ИнициализироватьГруппуТриггерногоСобытия(СтрокаСервисныйЗвонок);
	Если СтрокаСервисныйЗвонок.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродажаДополнительныхУслуг_КОРП Тогда
		Триггер_Объект.Наименование 					= "Звонок для записи клиента на пробное занятие """ + СокрЛП(Строка(Услуга)) + """";
	Иначе 	
		Триггер_Объект.Наименование 					= СокрЛП(СтрокаСервисныйЗвонок.Тема) + " (" + СокрЛП(Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП)) + ")";
	КонецЕсли;	
	Триггер_Объект.Активно 								= НЕ СтрокаСервисныйЗвонок.ПометкаУдаления И ЗначениеЗаполнено(СегментНоменклатуры);
	Триггер_Объект.УсловиеСобытия 						= ПолучитьУсловиеТриггерногоСобытия(СтрокаСервисныйЗвонок);
	Триггер_Объект.ПараметрСобытия 						= ПолучитьПараметрТриггерногоСобытия(СтрокаСервисныйЗвонок, Триггер_Объект.УсловиеСобытия);
	Триггер_Объект.МоментСобытия 						= ПолучитьМоментТриггерногоСобытия(СтрокаСервисныйЗвонок, Триггер_Объект.УсловиеСобытия);
	Триггер_Объект.ПериодСобытия 						= ПолучитьПериодТриггерногоСобытия(СтрокаСервисныйЗвонок, Триггер_Объект.УсловиеСобытия, Триггер_Объект.МоментСобытия);
	Триггер_Объект.ВремяСобытия 						= Дата(1, 1, 1, 1, 30, 0);
	// Триггер_Объект.ВидАдресата_Удалить 					= ПолучитьВидАдресатаДляЗадачи(СтрокаСервисныйЗвонок);
	// Триггер_Объект.Адресат_Удалить 						= ПолучитьАдресатаДляЗадачи(СтрокаСервисныйЗвонок, Триггер_Объект.ВидАдресата_Удалить);
	// Триггер_Объект.АккаунтSMS_Удалить 					= АккаунтSMS;
	// Триггер_Объект.АккаунтEmail_Удалить 				= АккаунтEmail;
	// Триггер_Объект.ШаблонСообщения_Удалить 				= СгенерироватьШаблонДляТриггерногоСобытия(ТаблицаШаблонов, ГруппаШаблонов, СтрокаСервисныйЗвонок, Услуга, Отказ);
	Триггер_Объект.КодСинхронизации 					= СтрокаСервисныйЗвонок.УИД;
	Если СтрокаСервисныйЗвонок.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродажаДополнительныхУслуг_КОРП Тогда
		Триггер_Объект.Описание 						= "Триггерное событие сформированно автоматически на основании настроек сервисных звонков." + Символы.ПС + "Настройка: " + СокрЛП(Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП)) + " Номер строки: " + Строка(СтрокаСервисныйЗвонок.НомерСтроки) + Символы.ПС + "Услуга: " + СокрЛП(Строка(Услуга));
	Иначе 	
		Триггер_Объект.Описание 						= "Триггерное событие сформированно автоматически на основании настроек сервисных звонков." + Символы.ПС + "Настройка продления: " + СокрЛП(Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП)) + " Номер строки: " + Строка(СтрокаСервисныйЗвонок.НомерСтроки);
	КонецЕсли;
	Триггер_Объект.УстановитьНовыйКод();		
	Триггер_Объект.ОбменДанными.Загрузка 				= Истина;
	Попытка
		Триггер_Объект.Записать();
		СтрокаСервисныйЗвонок.ТриггерСсылка 			= Триггер_Объект.Ссылка;
	Исключение
		Отказ = Истина;
		ЗаписьЖурналаРегистрации("Ошибка создания триггерного события! " + Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП) + " Код настройки: " + Строка(СтрокаСервисныйЗвонок.СсылкаНастройкиБП.Код) + " Номер строки: " + Строка(СтрокаСервисныйЗвонок.НомерСтроки), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТриггерныеСобытия, , ОписаниеОшибки());			
	КонецПопытки;

КонецПроцедуры

// Функция - Получить условие триггерного события
//
// Параметры:
//  СтрокаСервисныйЗвонок	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьУсловиеТриггерногоСобытия(СтрокаСервисныйЗвонок)
	
	УсловиеТриггерногоСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПустаяСсылка();
	
	Если СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ПослеПервогоПосещенияЧерез Тогда	
		УсловиеТриггерногоСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентПосещениеКлиники;
	ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ОтсутствиеКлиентаВКлиникеВТечении Тогда	
		УсловиеТриггерногоСобытия = Перечисления.ВариантыУсловийТриггерныхСобытий.ПациентНепосещениеКлиники;
	КонецЕсли;
	
	Возврат УсловиеТриггерногоСобытия;
	
КонецФункции	

// Функция - Получить параметр триггерного события
//
// Параметры:
//  СтрокаСервисныйЗвонок	 - 	 - 
//  УсловиеСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрТриггерногоСобытия(СтрокаСервисныйЗвонок, УсловиеСобытия)
	
	ПараметрТриггерногоСобытия 	= 0;
	ПериодАктивации 			= ?(СтрокаСервисныйЗвонок.ПериодАктивации < 1, 1, СтрокаСервисныйЗвонок.ПериодАктивации);
	Если СтрокаСервисныйЗвонок.ТипПериода = Перечисления.Периодичность.Месяц Тогда 
		ПериодАктивации = ПериодАктивации*30;
	КонецЕсли;	
	
	Если СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ПослеПервогоПосещенияЧерез Тогда	
		ПараметрТриггерногоСобытия = 1;
	ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ОтсутствиеКлиентаВКлиникеВТечении Тогда	
		ПараметрТриггерногоСобытия = ПериодАктивации;
	ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ЗанимаетсяРежеЧем1РазВ Тогда	
		ПараметрТриггерногоСобытия = ПериодАктивации;
	КонецЕсли;
	
	Возврат ПараметрТриггерногоСобытия;
	
КонецФункции	

// Функция - Получить момент триггерного события
//
// Параметры:
//  СтрокаСервисныйЗвонок	 - 	 - 
//  УсловиеСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМоментТриггерногоСобытия(СтрокаСервисныйЗвонок, УсловиеСобытия)
	
	МоментТриггерногоСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПустаяСсылка();
	
	Если СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ПослеАктивацииЧерез Тогда 
		МоментТриггерногоСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия;
	ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ПослеПервогоПосещенияЧерез Тогда	
		МоментТриггерногоСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия;
	ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ОтсутствиеКлиентаВКлиникеВТечении Тогда	
		МоментТриггерногоСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;
	ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ДоОкончанияСрокаДействияЗа И СтрокаСервисныйЗвонок.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеЧленства_КОРП Тогда
		МоментТриггерногоСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия;
	ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ДоОкончанияСрокаДействияЗа И СтрокаСервисныйЗвонок.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеПакетаУслуг_КОРП Тогда
		МоментТриггерногоСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;
	ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ЗанимаетсяРежеЧем1РазВ Тогда	
		МоментТриггерногоСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ВМоментСобытия;
	КонецЕсли;
	
	Возврат МоментТриггерногоСобытия;
	
КонецФункции	

// Функция - Получить период триггерного события
//
// Параметры:
//  СтрокаСервисныйЗвонок	 - 	 - 
//  УсловиеСобытия			 - 	 - 
//  МоментСобытия			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПериодТриггерногоСобытия(СтрокаСервисныйЗвонок, УсловиеСобытия, МоментСобытия)
	
	ПериодТриггерногоСобытия 	= 0;
	ПериодАктивации 			= ?(СтрокаСервисныйЗвонок.ПериодАктивации < 1, 1, СтрокаСервисныйЗвонок.ПериодАктивации);
	Если СтрокаСервисныйЗвонок.ТипПериода = Перечисления.Периодичность.Месяц Тогда 
		ПериодАктивации = ПериодАктивации*30;
	КонецЕсли;	
	
	Если МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ДоСобытия ИЛИ МоментСобытия = Перечисления.ВариантыМоментовАктивацииТриггерныхСобытий.ПослеСобытия Тогда 
		Если СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ПослеАктивацииЧерез Тогда 
			ПериодТриггерногоСобытия = ПериодАктивации;
		ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ПослеПервогоПосещенияЧерез Тогда	
			ПериодТриггерногоСобытия = ПериодАктивации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПериодТриггерногоСобытия;
	
КонецФункции	

// Функция - Получить вид адресата для задачи
//
// Параметры:
//  СтрокаСервисныйЗвонок	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВидАдресатаДляЗадачи(СтрокаСервисныйЗвонок)
	
	ВидАдресата = Перечисления.ВидыАдресатов.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(СтрокаСервисныйЗвонок.СегментИсполнителей) Тогда 
		Если ТипЗнч(СтрокаСервисныйЗвонок.СегментИсполнителей) = Тип("СправочникСсылка.СегментыСотрудников") Тогда 
			ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников;
		// ИначеЕсли СтрокаСервисныйЗвонок.СегментИсполнителей = Перечисления.РольПользователя.МенеджерОтделаПродаж Тогда
		Иначе 	
			ВидАдресата = Перечисления.ВидыАдресатов.Куратор;
		// ИначеЕсли СтрокаСервисныйЗвонок.СегментИсполнителей = Перечисления.РольПользователя.МенеджерОтделаСервиса Тогда 
		//	ВидАдресата = Перечисления.ВидыАдресатов.ОсновнойМенеджерОтделаСервиса;
		КонецЕсли;	
	Иначе 
		ВидАдресата = Перечисления.ВидыАдресатов.Куратор;
	КонецЕсли;	
	
	Возврат ВидАдресата;
	
КонецФункции	

// Функция - Получить адресата для задачи
//
// Параметры:
//  СтрокаСервисныйЗвонок	 - 	 - 
//  ВидАдресата				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьАдресатаДляЗадачи(СтрокаСервисныйЗвонок, ВидАдресата)
	
	Адресат = Неопределено;
	
	Если ВидАдресата = Перечисления.ВидыАдресатов.Сотрудник ИЛИ ВидАдресата = Перечисления.ВидыАдресатов.СегментСотрудников Тогда 
		Адресат = СтрокаСервисныйЗвонок.СегментИсполнителей;
	ИначеЕсли ВидАдресата = Перечисления.ВидыАдресатов.Куратор Тогда 
		Адресат = Справочники.СегментыСотрудников.МенеджерыОтделаПродаж;
	КонецЕсли;	
	
	Возврат Адресат;
	
КонецФункции	

// Функция - Сгенерировать шаблон для триггерного события
//
// Параметры:
//  ТаблицаШаблонов			 - 	 - 
//  ГруппаШаблонов			 - 	 - 
//  СтрокаСервисныйЗвонок	 - 	 - 
//  Услуга					 - 	 - 
//  Отказ					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СгенерироватьШаблонДляТриггерногоСобытия(ТаблицаШаблонов, ГруппаШаблонов, СтрокаСервисныйЗвонок = Неопределено, Услуга, Отказ)
	
	НаименованиеШаблона = "";
	ОписаниеЗадачи = "";
	
	Если СтрокаСервисныйЗвонок = Неопределено Тогда 
		НаименованиеШаблона = "Напоминание об платеже по рассрочке";
		ОписаниеЗадачи 		= "Необходимо проинформировать клиента о просроченном платеже по рассрочке" + "
		|Дата платежа: {ДатаПлановогоПлатежаПоРассрочке}" + "
		|Сумма платежа: {СуммаПлановогоПлатежаПоРассрочке} руб.";
	Иначе 	
		Если СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ПослеПервогоПосещенияЧерез Тогда 
			НаименованиеШаблона = "Звонок после первого посещения через " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации);
			ОписаниеЗадачи 		= "Клиент первый раз посетил клинику {ДатаПервогоПосещенияКонтрагента}" + "
			|Поинтересуйтесь впечатлениями от первого посещения, предложите записать его на тестирование";
		ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ПослеАктивацииЧерез Тогда
			Если СтрокаСервисныйЗвонок.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродажаДополнительныхУслуг_КОРП Тогда
				НаименованиеШаблона = "Звонок для записи клиента на пробное занятие """ + СокрЛП(Строка(Услуга)) + """";
				ОписаниеЗадачи 		= "Предложите клиенту записать его на пробное занятие """ + СокрЛП(Строка(Услуга)) + """, для последующей продажи ему дополнительных услуг.";
			Иначе 	
				НаименованиеШаблона = "Звонок после активации членства/пакета услуг через " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации);
				ОписаниеЗадачи 		= "Клиент прошел адаптационный период " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации) + "
				|Поинтересуйтесь регулярно ли он ходит, устраивает ли его качество проводимых тренировок";
			КонецЕсли;
		ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ОтсутствиеКлиентаВКлиникеВТечении Тогда 	
			НаименованиеШаблона = "Звонок в случае отсутсвия клиента в клинике в течении " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации, "Родительный");
			ОписаниеЗадачи 		= "Клиент не посещает клинику в течении " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации, "Родительный") + "
			|Необходимо поинтересоваться у клиента о причинах. Устраивает ли его качество услуг и тренировок?";
		ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ЗанимаетсяРежеЧем1РазВ Тогда 	
			НаименованиеШаблона = "Звонок при возникновении риска не использования пакета (при условии что клиент занимается 1 раз в " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации) + ")";
			ОписаниеЗадачи 		= "Срок действия пакета услуг заканчивается {ДатаОкончанияЧленства} Осталось: {КоличествоУслугВПакете}" + "
			|Существует вероятность того, что он не успеет их отходить. Постарайтесь вернуть клиента в клинику, запишите его на занятие";
		ИначеЕсли СтрокаСервисныйЗвонок.МоментАктивации = Перечисления.ВариантыАктивацииСервисныхЗвонков_Удалить.ДоОкончанияСрокаДействияЗа Тогда 	
			Если СтрокаСервисныйЗвонок.КонтрольОстаткаПакета = Ложь Тогда 
				Если СтрокаСервисныйЗвонок.ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПродлениеЧленства_КОРП Тогда 
					НаименованиеШаблона = "Звонок за " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации) + " до окончания срока действия членства";
					ОписаниеЗадачи 		= "Через " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации) + " у клиента закончится срок действия членства.
					|Постарайтесь узнать, настроен ли клиент на продление, все ли его устраивает. У вас еще есть время, что-то изменить";
				Иначе 
					НаименованиеШаблона = "Звонок за " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации) + " до окончания срока действия пакета услуг";
					ОписаниеЗадачи 		= "Срок действия пакета услуг заканчивается через " + Строка(СтрокаСервисныйЗвонок.ПериодАктивации) + " " + СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу(Строка(СтрокаСервисныйЗвонок.ТипПериода), СтрокаСервисныйЗвонок.ПериодАктивации) + ".
					|Предложите клиенту приобрести новый пакет";
					
				КонецЕсли;	
			Иначе 
				НаименованиеШаблона = "Информирование о малом количестве услуг в пакете (" + Строка(СтрокаСервисныйЗвонок.КритическийОстаток) + " услуг)";
				ОписаниеЗадачи 		= "Остаток услуг в пакете меньше или равен " + Строка(СтрокаСервисныйЗвонок.КритическийОстаток) + ".
				|Предложите клиенту приобрести новый пакет";
			КонецЕсли;						
		КонецЕсли;
	КонецЕсли;

	МассивШаблонов = ТаблицаШаблонов.НайтиСтроки(Новый Структура("Наименование, ЗадачаОписание", НаименованиеШаблона, ОписаниеЗадачи));
	Если МассивШаблонов.Количество() = 0 Тогда 
		ШаблонСообщения_Объект 							= Справочники.ШаблоныСообщений.СоздатьЭлемент();
		ШаблонСообщения_Объект.Заполнить(Неопределено);
		ШаблонСообщения_Объект.Родитель 				= ГруппаШаблонов; 
		ШаблонСообщения_Объект.Наименование 			= НаименованиеШаблона;
		ШаблонСообщения_Объект.ЗадачаВидВзаимодействия 	= Справочники.ВидыВзаимодействий.ЗвонокИсходящий;
		ШаблонСообщения_Объект.ЗадачаПериодВыполнения 	= 1;
		ШаблонСообщения_Объект.ЗадачаОписание 			= ОписаниеЗадачи;
		ШаблонСообщения_Объект.УстановитьНовыйКод();		
		ШаблонСообщения_Объект.ОбменДанными.Загрузка 	= Истина;
		Попытка
			ШаблонСообщения_Объект.Записать();
			НоваяСтрока 					= ТаблицаШаблонов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ШаблонСообщения_Объект);
			Возврат ШаблонСообщения_Объект.Ссылка;
		Исключение
			Отказ = Истина;
			ЗаписьЖурналаРегистрации("Ошибка создания шаблона сообщения! " + НаименованиеШаблона + Символы.ПС + ОписаниеЗадачи, УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ШаблоныСообщений, , ОписаниеОшибки());			
			Возврат Справочники.ШаблоныСообщений.ПустаяСсылка();
		КонецПопытки;
	Иначе 
		Возврат МассивШаблонов[0].Ссылка;
	КонецЕсли;
	
КонецФункции	

// Функция - Инициализировать группу шаблонов сообщений
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьГруппуШаблоновСообщений()
	
	ГруппаШаблонов = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", "Шаблоны сообщений для триггеров" + "%");	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныСообщений.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	               |ГДЕ
	               |	ШаблоныСообщений.ЭтоГруппа = ИСТИНА
	               |	И ШаблоныСообщений.Наименование ПОДОБНО &Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		ГруппаШаблонов_Объект						= Справочники.ШаблоныСообщений.СоздатьГруппу();
		ГруппаШаблонов_Объект.Наименование 			= "Шаблоны сообщений для триггеров";
		ГруппаШаблонов_Объект.УстановитьНовыйКод();							
		ГруппаШаблонов_Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			ГруппаШаблонов_Объект.Записать();
			ГруппаШаблонов = ГруппаШаблонов_Объект.Ссылка;
		Исключение
			// Запись в лог						
			ЗаписьЖурналаРегистрации("Ошибка создания группы шаблонов сообщений!", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ШаблоныСообщений, , ОписаниеОшибки());			
		КонецПопытки;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда 
			ГруппаШаблонов = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;

	Возврат ГруппаШаблонов;
	
КонецФункции

// Процедура - Актуализировать взаимодействия по продаже членства
//
Процедура АктуализироватьВзаимодействияПоПродажеЧленства() Экспорт
	
	// Подготавливаем данные для генерации сделок
	Отказ 		= Ложь;
	Запрос 		= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыСделок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыСделок КАК ВидыСделок
	               |ГДЕ
	               |	ВидыСделок.Предопределенный = ИСТИНА
	               |	И ВидыСделок.Ссылка = &ИмяПредопределенныхДанных";
	
	ВидСделок__ПродажаЧленства = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПродажаЧленства");
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ВидСделок__ПродажаЧленства);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ВидСделки = Выборка.Ссылка;
	Иначе 	
		ВидСделки_Объект 							= Справочники.ВидыСделок.СоздатьЭлемент();
		ВидСделки_Объект.Наименование 				= НСтр("ru = 'Новая продажа'; en = 'New sale'");
		ВидСделки_Объект.ИмяПредопределенныхДанных 	= "ПродажаЧленства";
		ВидСделки_Объект.ТипСделки 					= Перечисления.ТипыСделок.Продажа;
		ВидСделки_Объект.УстановитьНовыйКод();
		ВидСделки_Объект.ОбменДанными.Загрузка 		= Истина;
		Попытка
			ВидСделки_Объект.Записать();
			ВидСделки = ВидСделки_Объект.Ссылка;
		Исключение
			Отказ = Истина;
			ЗаписьЖурналаРегистрации("Ошибка создания вида сделки!", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ВидыСделок, , ОписаниеОшибки());			
		КонецПопытки;	
	КонецЕсли;
	
	Если Отказ = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	МассивТочекМаршрута = Новый Массив;
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродажаЧленства_КОРП.ТочкиМаршрута.ДействиеПервичныйКонтакт);
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродажаЧленства_КОРП.ТочкиМаршрута.ДействиеПрезентацияКлиники);
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродажаЧленства_КОРП.ТочкиМаршрута.ДействиеПробноеЗанятие);
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродажаЧленства_КОРП.ТочкиМаршрута.ДействиеОформлениеПродажи);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыСделок.Ссылка КАК Ссылка,
	               |	ЭтапыСделок.Наименование КАК Наименование,
	               |	ЭтапыСделок.ВидСделки КАК ВидСделки,
	               |	ЭтапыСделок.НомерЭтапа КАК НомерЭтапа,
	               |	ЗНАЧЕНИЕ(БизнесПроцесс.ПродажаЧленства_КОРП.ТочкаМаршрута.ПустаяСсылка) КАК ТочкаМаршрута
	               |ИЗ
	               |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	               |ГДЕ
	               |	ЭтапыСделок.ВидСделки = &ВидСделки
	               |	И НЕ ЭтапыСделок.Ссылка В(ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Успех), ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.Отказ))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерЭтапа";
	
	Запрос.УстановитьПараметр("ВидСделки", ВидСделки);
	ТаблицаЭтаповСделок = Запрос.Выполнить().Выгрузить();
	НомерЭтапа = 0;
	
	Для Каждого ТочкаМаршрута Из МассивТочекМаршрута Цикл
		НомерЭтапа = НомерЭтапа + 1;
		СтрокаЭтап = ТаблицаЭтаповСделок.Найти(ТочкаМаршрута.НаименованиеЗадачи, "Наименование");
		Если НЕ ЗначениеЗаполнено(СтрокаЭтап) Тогда
			ЭтапСделки_Объект 						= Справочники.ЭтапыСделок.СоздатьЭлемент();
			ЭтапСделки_Объект.Наименование 			= ТочкаМаршрута.НаименованиеЗадачи;
			ЭтапСделки_Объект.ВидСделки 			= ВидСделки;
			ЭтапСделки_Объект.НомерЭтапа 			= НомерЭтапа;
			Если НомерЭтапа = 1 Тогда 
				ЭтапСделки_Объект.ЦветЭтапа 		= ЗначениеВСтрокуВнутр(Новый Цвет(255, 254, 178));
			ИначеЕсли НомерЭтапа = 2 Тогда 
				ЭтапСделки_Объект.ЦветЭтапа 		= ЗначениеВСтрокуВнутр(Новый Цвет(255, 200, 200));
			ИначеЕсли НомерЭтапа = 3 Тогда 
				ЭтапСделки_Объект.ЦветЭтапа 		= ЗначениеВСтрокуВнутр(Новый Цвет(152, 203, 255));
			ИначеЕсли НомерЭтапа = 4 Тогда 
				ЭтапСделки_Объект.ЦветЭтапа 		= ЗначениеВСтрокуВнутр(Новый Цвет(222, 255, 129));
			КонецЕсли;	
			ЭтапСделки_Объект.УстановитьНовыйКод();
			ЭтапСделки_Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				ЭтапСделки_Объект.Записать();
				НоваяСтрокаЭтап 					= ТаблицаЭтаповСделок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЭтап, ЭтапСделки_Объект);
				НоваяСтрокаЭтап.ТочкаМаршрута 		= ТочкаМаршрута;
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации("Ошибка создания этапа сделки!", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ЭтапыСделок, , ОписаниеОшибки());			
			КонецПопытки;
		Иначе 
			СтрокаЭтап.ТочкаМаршрута 				= ТочкаМаршрута;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Справочники.ЭтапыСделок.Успех.ВидСделки = ВидСделки Тогда 
		Этап_Успех 							= Справочники.ЭтапыСделок.Успех.ПолучитьОбъект();
		// Этап_Успех.ВидСделки 				= ВидСделки;
		// Этап_Успех.НомерЭтапа 				= 5;
		Этап_Успех.ЦветЭтапа 				= ЗначениеВСтрокуВнутр(Новый Цвет(72, 193, 123));		
		Этап_Успех.ОбменДанными.Загрузка 	= Истина;
		Попытка
			Этап_Успех.Записать();
		Исключение
			Отказ = Истина;
			ЗаписьЖурналаРегистрации("Ошибка редактирования предопределнного этапа сделки!", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ЭтапыСделок, , ОписаниеОшибки());			
		КонецПопытки;	
	КонецЕсли;
	
	Если НЕ Справочники.ЭтапыСделок.Отказ.ВидСделки = ВидСделки Тогда 
		Этап_Отказ 							= Справочники.ЭтапыСделок.Отказ.ПолучитьОбъект();
		// Этап_Отказ.ВидСделки 				= ВидСделки;
		// Этап_Отказ.НомерЭтапа 				= 6;
		Этап_Отказ.ЦветЭтапа 				= ЗначениеВСтрокуВнутр(Новый Цвет(246, 110, 110));		
		Этап_Отказ.ОбменДанными.Загрузка 	= Истина;
		Попытка
			Этап_Отказ.Записать();
		Исключение
			Отказ = Истина;
			ЗаписьЖурналаРегистрации("Ошибка редактирования предопределнного этапа сделки!", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ЭтапыСделок, , ОписаниеОшибки());			
		КонецПопытки;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивТочекМаршрута"	, МассивТочекМаршрута);
	Запрос.УстановитьПараметр("ТекущаяДата"			, НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Комментарий"			, "Пометка удаления: Нет -> Да" + "%");

	Запрос.Текст = "ВЫБРАТЬ
	               |	ПричиныОтказов.Ссылка КАК Ссылка,
	               |	ПричиныОтказов.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ПричиныОтказов КАК ПричиныОтказов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажаЧленства_КОРП.Ссылка КАК БизнесПроцессСсылка,
	               |	ПродажаЧленства_КОРП.Дата КАК ДатаСделки,
	               |	ПродажаЧленства_КОРП.Завершен КАК Завершен,
	               |	ПродажаЧленства_КОРП.Стартован КАК Стартован,
	               |	ПродажаЧленства_КОРП.Автор КАК БизнесПроцессАвтор,
	               |	ПродажаЧленства_КОРП.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ПродажаЧленства_КОРП.Контрагент КАК Контрагент,
	               |	ПродажаЧленства_КОРП.ДокументПродажи.Сделка КАК ДокументПродажиСделка,
	               |	ПродажаЧленства_КОРП.Успех КАК Успех,
	               |	ПродажаЧленства_КОРП.ДатаЗавершения КАК ДатаЗавершения,
	               |	ПродажаЧленства_КОРП.ДокументПродажи КАК ДокументПродажи,
	               |	ПродажаЧленства_КОРП.ИсполнительМенеджерПоПродажам КАК ИсполнительМенеджерПоПродажам,
	               |	ПродажаЧленства_КОРП.ПричинаОтказа.Наименование КАК ПричинаОтказа,
	               |	ВЫБОР
	               |		КОГДА ПродажаЧленства_КОРП.Стартован
	               |				И ПродажаЧленства_КОРП.Завершен
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПродажаЧленства_КОРП.Успех
	               |							И ПродажаЧленства_КОРП.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.Реализация.ПустаяСсылка)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Успех)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.Отказ)
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	               |	КОНЕЦ КАК РезультатСделки,
	               |	ПродажаЧленства_КОРП.ПланируемаяСумма КАК СуммаСделки,
	               |	ПродажаЧленства_КОРП.ТекущаяТочка КАК ТекущаяТочка,
	               |	ПродажаЧленства_КОРП.КаналПривлечения КАК КаналПривлечения,
	               |	ПродажаЧленства_КОРП.ИсточникИнформации КАК ИсточникИнформации,
	               |	ПродажаЧленства_КОРП.ИсточникИнформацииЗначение КАК ИсточникИнформацииЗначение,
	               |	ЕСТЬNULL(Сделки.Ссылка, ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)) КАК СделкаСсылка,
	               |	ПродажаЧленства_КОРП.Номер КАК КодСинхронизацииБП
	               |ПОМЕСТИТЬ ТаблицаБППродажа
	               |ИЗ
	               |	БизнесПроцесс.ПродажаЧленства_КОРП КАК ПродажаЧленства_КОРП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сделки КАК Сделки
	               |		ПО ПродажаЧленства_КОРП.Номер = Сделки.КодСинхронизации
	               |ГДЕ
	               |	ПродажаЧленства_КОРП.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ ПродажаЧленства_КОРП.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЗадачаИсполнителя.Выполнена
	               |				ТОГДА ЗадачаИсполнителя.ДатаИсполнения
	               |			ИНАЧЕ ЗадачаИсполнителя.ЗадачаНазначеннаяДата
	               |		КОНЕЦ) КАК ДатаЗадачи
	               |ПОМЕСТИТЬ ТаблицаПоследнихЗадач
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |ГДЕ
	               |	ЗадачаИсполнителя.РегламентнаяЗадача = ЛОЖЬ
	               |	И ЗадачаИсполнителя.БизнесПроцесс В
	               |			(ВЫБРАТЬ
	               |				ТаблицаБППродажа.БизнесПроцессСсылка
	               |			ИЗ
	               |				ТаблицаБППродажа)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗадачаИсполнителя.БизнесПроцесс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаБППродажа.БизнесПроцессСсылка КАК БизнесПроцессСсылка,
	               |	ТаблицаБППродажа.ДатаСделки КАК ДатаСделки,
	               |	ТаблицаБППродажа.Завершен КАК Завершен,
	               |	ТаблицаБППродажа.Стартован КАК Стартован,
	               |	ТаблицаБППродажа.БизнесПроцессАвтор КАК БизнесПроцессАвтор,
	               |	ТаблицаБППродажа.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ТаблицаБППродажа.Контрагент КАК Контрагент,
	               |	ТаблицаБППродажа.ДокументПродажиСделка КАК ДокументПродажиСделка,
	               |	ТаблицаБППродажа.Успех КАК Успех,
	               |	ТаблицаБППродажа.ДатаЗавершения КАК ДатаЗавершения,
	               |	ЕСТЬNULL(ТаблицаПоследнихЗадач.ДатаЗадачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнейЗадачи,
	               |	ТаблицаБППродажа.ДокументПродажи КАК ДокументПродажи,
	               |	ТаблицаБППродажа.ИсполнительМенеджерПоПродажам КАК ИсполнительМенеджерПоПродажам,
	               |	ТаблицаБППродажа.ПричинаОтказа КАК ПричинаОтказа,
	               |	ТаблицаБППродажа.РезультатСделки КАК РезультатСделки,
	               |	ТаблицаБППродажа.СуммаСделки КАК СуммаСделки,
	               |	ТаблицаБППродажа.ТекущаяТочка КАК ТекущаяТочка,
	               |	ТаблицаБППродажа.КаналПривлечения КАК КаналПривлечения,
	               |	ТаблицаБППродажа.ИсточникИнформации КАК ИсточникИнформации,
	               |	ТаблицаБППродажа.ИсточникИнформацииЗначение КАК ИсточникИнформацииЗначение,
	               |	ТаблицаБППродажа.СделкаСсылка КАК СделкаСсылка,
	               |	ТаблицаБППродажа.КодСинхронизацииБП КАК КодСинхронизацииБП
	               |ПОМЕСТИТЬ ТаблицаБизнесПроцессовПродажа
	               |ИЗ
	               |	ТаблицаБППродажа КАК ТаблицаБППродажа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихЗадач КАК ТаблицаПоследнихЗадач
	               |		ПО ТаблицаБППродажа.БизнесПроцессСсылка = ТаблицаПоследнихЗадач.БизнесПроцесс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Реализация.Ссылка) КАК КоличествоРеализаций,
	               |	Реализация.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ ТаблицаКонтрагентовСРеализациями
	               |ИЗ
	               |	Документ.Реализация КАК Реализация
	               |ГДЕ
	               |	Реализация.Контрагент В
	               |			(ВЫБРАТЬ
	               |				ТаблицаБизнесПроцессовПродажа.Контрагент
	               |			ИЗ
	               |				ТаблицаБизнесПроцессовПродажа)
	               |	И Реализация.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Реализация.Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаБизнесПроцессовПродажа.ДатаСделки КАК ДатаСделки,
	               |	ТаблицаБизнесПроцессовПродажа.Завершен КАК Завершен,
	               |	ТаблицаБизнесПроцессовПродажа.Стартован КАК Стартован,
	               |	ТаблицаБизнесПроцессовПродажа.БизнесПроцессАвтор КАК БизнесПроцессАвтор,
	               |	ТаблицаБизнесПроцессовПродажа.СтруктурнаяЕдиница КАК БизнесПроцессСтруктурнаяЕдиница,
	               |	ТаблицаБизнесПроцессовПродажа.Контрагент КАК Контрагент,
	               |	ТаблицаБизнесПроцессовПродажа.Контрагент.ПометкаУдаления КАК КонтрагентПометкаУдаления,
	               |	ТаблицаБизнесПроцессовПродажа.ДатаЗавершения КАК ДатаЗавершенияСделки,
	               |	ТаблицаБизнесПроцессовПродажа.ДатаПоследнейЗадачи КАК ДатаПоследнейЗадачи,
	               |	ТаблицаБизнесПроцессовПродажа.ДокументПродажи КАК ДокументПродажи,
	               |	ТаблицаБизнесПроцессовПродажа.ИсполнительМенеджерПоПродажам КАК ИсполнительМенеджерПоПродажам,
	               |	ТаблицаБизнесПроцессовПродажа.ПричинаОтказа КАК ПричинаОтказа,
	               |	ТаблицаБизнесПроцессовПродажа.Успех КАК Успех,
	               |	ТаблицаБизнесПроцессовПродажа.РезультатСделки КАК РезультатСделки,
	               |	ТаблицаБизнесПроцессовПродажа.СуммаСделки КАК СуммаСделки,
	               |	ТаблицаБизнесПроцессовПродажа.ТекущаяТочка КАК ТекущаяТочка,
	               |	ТаблицаБизнесПроцессовПродажа.КаналПривлечения КАК КаналПривлечения,
	               |	ТаблицаБизнесПроцессовПродажа.ИсточникИнформации КАК ИсточникИнформации,
	               |	ТаблицаБизнесПроцессовПродажа.ИсточникИнформацииЗначение КАК ИсточникИнформацииЗначение,
	               |	ТаблицаБизнесПроцессовПродажа.СделкаСсылка КАК СделкаСсылка,
	               |	ТаблицаБизнесПроцессовПродажа.КодСинхронизацииБП КАК КодСинхронизацииБП,
	               |	ТаблицаБизнесПроцессовПродажа.ДокументПродажиСделка КАК ДокументПродажиСделка,
	               |	ЗадачаИсполнителя.Ссылка КАК ЗадачаСсылка,
	               |	ЗадачаИсполнителя.Дата КАК Дата,
	               |	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	               |	ЗадачаИсполнителя.ТочкаМаршрута КАК ТочкаМаршрута,
	               |	ЗадачаИсполнителя.Наименование КАК Наименование,
	               |	ЗадачаИсполнителя.Выполнена КАК Выполнена,
	               |	ЗадачаИсполнителя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ЗадачаИсполнителя.ВидВзаимодействия КАК ВидВзаимодействия,
	               |	ЗадачаИсполнителя.ВидВзаимодействияСправочник КАК ВидВзаимодействияСправочник,
	               |	ЗадачаИсполнителя.ВзаимодействиеСостоялось КАК ВзаимодействиеСостоялось,
	               |	ЗадачаИсполнителя.ЗадачаАвтор КАК ЗадачаАвтор,
	               |	ЗадачаИсполнителя.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата,
	               |	ЗадачаИсполнителя.ЗадачаОписание КАК ЗадачаОписание,
	               |	ЗадачаИсполнителя.ЗадачаПредмет КАК ЗадачаПредмет,
	               |	ЗадачаИсполнителя.ЗадачаТема КАК ЗадачаТема,
	               |	ЗадачаИсполнителя.ДатаИсполнения КАК ДатаИсполнения,
	               |	ЗадачаИсполнителя.НапоминаниеИспользовать КАК НапоминаниеИспользовать,
	               |	ЗадачаИсполнителя.НапоминаниеДатаНачала КАК НапоминаниеДатаНачала,
	               |	ЗадачаИсполнителя.ВариантНапоминания КАК ВариантНапоминания,
	               |	ЗадачаИсполнителя.Представление КАК Представление,
	               |	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	               |	ЗадачаИсполнителя.ИсполнительФактический КАК ИсполнительФактический,
	               |	ЗадачаИсполнителя.КоличествоПереносов КАК КоличествоПереносов,
	               |	ЕСТЬNULL(ЗадачаИсполнителя.Черновик, ИСТИНА) КАК Черновик,
	               |	ЕСТЬNULL(ЗадачаИсполнителя.ПометкаУдаления, ЛОЖЬ) КАК ПометкаУдаления,
	               |	ЕСТЬNULL(Взаимодействие.Ссылка, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ВзаимодействиеСсылка,
	               |	ЕСТЬNULL(ТаблицаКонтрагентовСРеализациями.КоличествоРеализаций, 0) КАК КоличествоРеализаций,
	               |	ЗадачаИсполнителя.Номер КАК КодСинхронизации
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Взаимодействие КАК Взаимодействие
	               |		ПО ЗадачаИсполнителя.Номер = Взаимодействие.КодСинхронизации
	               |			И ЗадачаИсполнителя.Дата = Взаимодействие.Дата
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаБизнесПроцессовПродажа КАК ТаблицаБизнесПроцессовПродажа
	               |		ПО ЗадачаИсполнителя.БизнесПроцесс = ТаблицаБизнесПроцессовПродажа.БизнесПроцессСсылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКонтрагентовСРеализациями КАК ТаблицаКонтрагентовСРеализациями
	               |		ПО (ТаблицаБизнесПроцессовПродажа.Контрагент = ТаблицаКонтрагентовСРеализациями.Контрагент)
	               |ГДЕ
	               |	ЗадачаИсполнителя.РегламентнаяЗадача = ЛОЖЬ
	               |	И ЗадачаИсполнителя.БизнесПроцесс В
	               |			(ВЫБРАТЬ
	               |				ТаблицаБизнесПроцессовПродажа.БизнесПроцессСсылка
	               |			ИЗ
	               |				ТаблицаБизнесПроцессовПродажа)
	               |	И ЗадачаИсполнителя.ТочкаМаршрута В(&МассивТочекМаршрута)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСделки,
	               |	Дата
	               |ИТОГИ
	               |	МАКСИМУМ(ДатаСделки),
	               |	МАКСИМУМ(Завершен),
	               |	МАКСИМУМ(Стартован),
	               |	МАКСИМУМ(БизнесПроцессАвтор),
	               |	МАКСИМУМ(БизнесПроцессСтруктурнаяЕдиница),
	               |	МАКСИМУМ(Контрагент),
	               |	МАКСИМУМ(КонтрагентПометкаУдаления),
	               |	МАКСИМУМ(ДатаЗавершенияСделки),
	               |	МАКСИМУМ(ДатаПоследнейЗадачи),
	               |	МАКСИМУМ(ДокументПродажи),
	               |	МАКСИМУМ(ИсполнительМенеджерПоПродажам),
	               |	МАКСИМУМ(ПричинаОтказа),
	               |	МАКСИМУМ(Успех),
	               |	МАКСИМУМ(РезультатСделки),
	               |	МАКСИМУМ(СуммаСделки),
	               |	МАКСИМУМ(ТекущаяТочка),
	               |	МАКСИМУМ(КаналПривлечения),
	               |	МАКСИМУМ(ИсточникИнформации),
	               |	МАКСИМУМ(ИсточникИнформацииЗначение),
	               |	МАКСИМУМ(СделкаСсылка),
	               |	МАКСИМУМ(КодСинхронизацииБП),
	               |	МАКСИМУМ(ДокументПродажиСделка),
	               |	МАКСИМУМ(КоличествоРеализаций)
	               |ПО
	               |	БизнесПроцесс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ТаблицаКонтрагентовПомеченныхНаУдаление
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ПометкаУдаления = ИСТИНА
	               |	И НЕ Контрагенты.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ТаблицаБизнесПроцессовПродажа.Контрагент
	               |				ИЗ
	               |					ТаблицаБизнесПроцессовПродажа)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(Обсуждения.Объект КАК Справочник.Контрагенты) КАК Контрагент,
	               |	МАКСИМУМ(Обсуждения.МоментВремени) КАК МоментВремени
	               |ПОМЕСТИТЬ ТаблицаМоментовПометкиНаУдаление
	               |ИЗ
	               |	РегистрСведений.Обсуждения КАК Обсуждения
	               |ГДЕ
	               |	Обсуждения.Объект ССЫЛКА Справочник.Контрагенты
	               |	И Обсуждения.Объект В
	               |			(ВЫБРАТЬ
	               |				ТаблицаКонтрагентовПомеченныхНаУдаление.Ссылка
	               |			ИЗ
	               |				ТаблицаКонтрагентовПомеченныхНаУдаление)
	               |	И Обсуждения.Комментарий ПОДОБНО &Комментарий
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(Обсуждения.Объект КАК Справочник.Контрагенты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаКонтрагентовПомеченныхНаУдаление.Ссылка КАК Контрагент,
	               |	ЕСТЬNULL(ТаблицаМоментовПометкиНаУдаление.МоментВремени, &ТекущаяДата) КАК Период,
	               |	ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ) КАК Статус
	               |ИЗ
	               |	ТаблицаКонтрагентовПомеченныхНаУдаление КАК ТаблицаКонтрагентовПомеченныхНаУдаление
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМоментовПометкиНаУдаление КАК ТаблицаМоментовПометкиНаУдаление
	               |		ПО ТаблицаКонтрагентовПомеченныхНаУдаление.Ссылка = ТаблицаМоментовПометкиНаУдаление.Контрагент";
	
	РезультатПакета 					= Запрос.ВыполнитьПакет();
	ТаблицаПричинОтказа 				= РезультатПакета[0].Выгрузить();
	ВыборкаБизнесПроцессов 				= РезультатПакета[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаКлиентовПомеченныхНаУдаление = РезультатПакета[8].Выгрузить();
	
	// Обход БП
	Пока ВыборкаБизнесПроцессов.Следующий() Цикл
		Отказ = Ложь;
		// Генерим сделку
		Если НЕ ЗначениеЗаполнено(ВыборкаБизнесПроцессов.СделкаСсылка) И ЗначениеЗаполнено(ВыборкаБизнесПроцессов.БизнесПроцесс) Тогда   
			Объект_Сделка = Справочники.Сделки.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(Объект_Сделка, ВыборкаБизнесПроцессов);
			Объект_Сделка.СтруктурнаяЕдиница 	= ВыборкаБизнесПроцессов.БизнесПроцессСтруктурнаяЕдиница;
			Объект_Сделка.ВидСделки 			= ВидСделки;
			Объект_Сделка.Автор 				= ?(ЗначениеЗаполнено(ВыборкаБизнесПроцессов.БизнесПроцессАвтор), ВыборкаБизнесПроцессов.БизнесПроцессАвтор, ВыборкаБизнесПроцессов.ИсполнительМенеджерПоПродажам);
			Объект_Сделка.Менеджер 				= ?(ЗначениеЗаполнено(ВыборкаБизнесПроцессов.ИсполнительМенеджерПоПродажам) И НЕ ТипЗнч(ВыборкаБизнесПроцессов.ИсполнительМенеджерПоПродажам) = Тип("СправочникСсылка.СегментыСотрудников"), ВыборкаБизнесПроцессов.ИсполнительМенеджерПоПродажам, ВыборкаБизнесПроцессов.БизнесПроцессАвтор);			
			Если ВыборкаБизнесПроцессов.Завершен Тогда 
				Если ВыборкаБизнесПроцессов.Успех И ЗначениеЗаполнено(ВыборкаБизнесПроцессов.ДокументПродажи) Тогда 
					Объект_Сделка.ЭтапСделки 	= Справочники.ЭтапыСделок.Успех;
					Объект_Сделка.Прием 	= ВыборкаБизнесПроцессов.ДокументПродажи;
					Если ВыборкаБизнесПроцессов.КонтрагентПометкаУдаления = Истина Тогда 
						// Проставляем клиенту статус - "Отказ"						
						СтруктураСтатуса = Новый Структура;
						СтруктураСтатуса.Вставить("Период"		, Макс(ВыборкаБизнесПроцессов.ДатаЗавершенияСделки, ВыборкаБизнесПроцессов.ДатаПоследнейЗадачи, КонецДня(ВыборкаБизнесПроцессов.ДатаСделки)));
						СтруктураСтатуса.Вставить("Контрагент"	, ВыборкаБизнесПроцессов.Контрагент);
						СтруктураСтатуса.Вставить("Статус"		, Перечисления.СтатусыКонтрагентов.Отказ);
						РегистрыСведений.СтатусыКонтрагентов.ЗаписатьАктуальныйСтатусКлиента(СтруктураСтатуса);
					КонецЕсли;	
				Иначе 	
					Объект_Сделка.ЭтапСделки 	= Справочники.ЭтапыСделок.Отказ;
					Если ВыборкаБизнесПроцессов.КоличествоРеализаций = 0 Тогда 
						// Проставляем клиенту статус - "Отказ"
						СтруктураСтатуса = Новый Структура;
						СтруктураСтатуса.Вставить("Период"		, Макс(ВыборкаБизнесПроцессов.ДатаЗавершенияСделки, ВыборкаБизнесПроцессов.ДатаПоследнейЗадачи, КонецДня(ВыборкаБизнесПроцессов.ДатаСделки)));
						СтруктураСтатуса.Вставить("Контрагент"	, ВыборкаБизнесПроцессов.Контрагент);
						СтруктураСтатуса.Вставить("Статус"		, Перечисления.СтатусыКонтрагентов.Отказ);
						РегистрыСведений.СтатусыКонтрагентов.ЗаписатьАктуальныйСтатусКлиента(СтруктураСтатуса);
					КонецЕсли;	
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Объект_Сделка.ДатаЗавершенияСделки) Тогда 
					Объект_Сделка.ДатаЗавершенияСделки = ВыборкаБизнесПроцессов.ДатаПоследнейЗадачи;
				КонецЕсли;	
			Иначе 	
				СтрокаЭтап = ТаблицаЭтаповСделок.Найти(ВыборкаБизнесПроцессов.ТекущаяТочка, "ТочкаМаршрута");
				Если СтрокаЭтап <> Неопределено Тогда 
					Объект_Сделка.ЭтапСделки 	= СтрокаЭтап.Ссылка;
				КонецЕсли;
			КонецЕсли;
			// Инициализируем причину отказа
			Если ЗначениеЗаполнено(ВыборкаБизнесПроцессов.ПричинаОтказа) Тогда
				СтрокаОтказа = ТаблицаПричинОтказа.Найти(СокрЛП(ВыборкаБизнесПроцессов.ПричинаОтказа), "Наименование");
				Если СтрокаОтказа = Неопределено Тогда 
					ПричинаОтказа_Объект 						= Справочники.ПричиныОтказов.СоздатьЭлемент();
					ПричинаОтказа_Объект.Наименование 			= СокрЛП(ВыборкаБизнесПроцессов.ПричинаОтказа);
					ПричинаОтказа_Объект.УстановитьНовыйКод();					
					ПричинаОтказа_Объект.ОбменДанными.Загрузка 	= Истина;
					Попытка
						ПричинаОтказа_Объект.Записать();
						ЗаполнитьЗначенияСвойств(ТаблицаПричинОтказа.Добавить(), ПричинаОтказа_Объект);
						Объект_Сделка.ПричинаОтказа = ПричинаОтказа_Объект.Ссылка;						
					Исключение
						ЗаписьЖурналаРегистрации("Ошибка создания причины отказа!" + Символы.ПС + Строка(ВыборкаБизнесПроцессов.Контрагент), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ПричиныОтказов, , ОписаниеОшибки());			
					КонецПопытки;	
				Иначе 
					Объект_Сделка.ПричинаОтказа = СтрокаОтказа.Ссылка;
				КонецЕсли;	
			КонецЕсли;	
			Объект_Сделка.КодСинхронизации 		= ВыборкаБизнесПроцессов.КодСинхронизацииБП;
			Объект_Сделка.ОбменДанными.Загрузка = Истина;
			// Код элемента устанавливается в модуле объекта
			Попытка
				Объект_Сделка.Записать();
				Сделка = Объект_Сделка.Ссылка;
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации("Ошибка создания сделки!" + Символы.ПС + Строка(ВыборкаБизнесПроцессов.Контрагент), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Сделки, , ОписаниеОшибки());			
			КонецПопытки;
		Иначе 
			Сделка = ВыборкаБизнесПроцессов.СделкаСсылка;
		КонецЕсли;
		
		Если Отказ = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		// Прописываем ссылку сделки в реализацию
		Если НЕ ЗначениеЗаполнено(ВыборкаБизнесПроцессов.ДокументПродажиСделка) И ЗначениеЗаполнено(ВыборкаБизнесПроцессов.ДокументПродажи) Тогда 
			Реализация_Объект 						= ВыборкаБизнесПроцессов.ДокументПродажи.ПолучитьОбъект();
			Реализация_Объект.Сделка 				= Сделка;
			Реализация_Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Реализация_Объект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации("Ошибка записи сделки в реализацию!" + Символы.ПС + Строка(ВыборкаБизнесПроцессов.Контрагент), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Реализация, , ОписаниеОшибки());			
			КонецПопытки;
		КонецЕсли;	
		
		// Обход задач
		ВыборкаЗадачи 	= ВыборкаБизнесПроцессов.Выбрать();
		ПоследняяЗадача = Задачи.ЗадачаИсполнителя.ПустаяСсылка();
		Пока ВыборкаЗадачи.Следующий() Цикл
			// Генерим взаимодействие (задачу)
			Если НЕ ЗначениеЗаполнено(ВыборкаЗадачи.ВзаимодействиеСсылка) И ЗначениеЗаполнено(ВыборкаЗадачи.ЗадачаСсылка) И ВыборкаЗадачи.Черновик = Ложь И ВыборкаЗадачи.ПометкаУдаления = Ложь Тогда 
				Взаимодействие_Объект 								= Задачи.Взаимодействие.СоздатьЗадачу();
				ЗаполнитьЗначенияСвойств(Взаимодействие_Объект, ВыборкаЗадачи, , "БизнесПроцесс, ТочкаМаршрута");
				Взаимодействие_Объект.Сделка 						= Сделка;
				Взаимодействие_Объект.Контрагент 					= ВыборкаБизнесПроцессов.Контрагент;
				Если ВыборкаБизнесПроцессов.Завершен = Истина И ВыборкаЗадачи.Выполнена = Ложь Тогда 
					Взаимодействие_Объект.Выполнена 				= ВыборкаБизнесПроцессов.Завершен;
					Взаимодействие_Объект.ВзаимодействиеСостоялось 	= Ложь;
					Взаимодействие_Объект.ДатаИсполнения 			= ?(ЗначениеЗаполнено(ВыборкаБизнесПроцессов.ДатаЗавершенияСделки), ВыборкаБизнесПроцессов.ДатаЗавершенияСделки, ВыборкаБизнесПроцессов.ДатаПоследнейЗадачи);
				КонецЕсли;
				Взаимодействие_Объект.УстановитьНовыйНомер();
				Взаимодействие_Объект.ДополнительныеСвойства.Вставить("ЭтоОбновлениеИнформационнойБазы", Истина);
				Взаимодействие_Объект.ОбменДанными.Загрузка = Истина;
				Попытка
					Взаимодействие_Объект.Записать();
				Исключение
					Отказ = Истина;
					ЗаписьЖурналаРегистрации("Ошибка создания взаимодействия! " + Строка(ВыборкаЗадачи.ЗадачаСсылка) + Символы.ПС + "Контрагент: " + Строка(ВыборкаБизнесПроцессов.Контрагент), УровеньЖурналаРегистрации.Ошибка, Метаданные.Задачи.Взаимодействие, , ОписаниеОшибки());			
				КонецПопытки;
				Если ВыборкаЗадачи.Выполнена Тогда 
					Если ВыборкаЗадачи.ДатаИсполнения > ?(ПоследняяЗадача.Выполнена, ПоследняяЗадача.ДатаИсполнения, ПоследняяЗадача.ЗадачаНазначеннаяДата) Тогда 
						ПоследняяЗадача = ВыборкаЗадачи.ЗадачаСсылка;
					КонецЕсли;	
				Иначе 
					Если ВыборкаЗадачи.ЗадачаНазначеннаяДата > ?(ПоследняяЗадача.Выполнена, ПоследняяЗадача.ДатаИсполнения, ПоследняяЗадача.ЗадачаНазначеннаяДата) Тогда 
						ПоследняяЗадача = ВыборкаЗадачи.ЗадачаСсылка;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(ПоследняяЗадача) И Сделка.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда 
			СтрокаЭтап = ТаблицаЭтаповСделок.Найти(ПоследняяЗадача.ТочкаМаршрута, "ТочкаМаршрута");
			Если СтрокаЭтап <> Неопределено Тогда
				Объект_Сделка 						= Сделка.ПолучитьОбъект();
				Объект_Сделка.ЭтапОтказа 			= СтрокаЭтап.Ссылка;
				Объект_Сделка.ОбменДанными.Загрузка = Истина;
				Попытка
					Объект_Сделка.Записать();
					Сделка = Объект_Сделка.Ссылка;
				Исключение
					// Отказ = Истина;
					// ЗаписьЖурналаРегистрации("Ошибка создания сделки!" + Символы.ПС + Строка(ВыборкаБизнесПроцессов.Контрагент), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Сделки, , ОписаниеОшибки());			
				КонецПопытки;
				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого СтрокаКлиент Из ТаблицаКлиентовПомеченныхНаУдаление Цикл 
		РегистрыСведений.СтатусыКонтрагентов.ЗаписатьАктуальныйСтатусКлиента(СтрокаКлиент);		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Актуализировать взаимодействия по продлению членств пакетов услуг
//
// Параметры:
//  ТаблицаТриггерныхСобытий - 	 - 
//
Процедура АктуализироватьВзаимодействияПоПродлениюЧленствПакетовУслуг(Знач ТаблицаТриггерныхСобытий) Экспорт
	
	Если ТипЗнч(ТаблицаТриггерныхСобытий) = Тип("ДанныеФормыКоллекция") Тогда 
		ТаблицаТриггерныхСобытий = ТаблицаТриггерныхСобытий.Выгрузить();
	КонецЕсли;	
	
	МассивТочекМаршрута = Новый Массив;
	// Для БП Продление членства
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродлениеЧленства_КОРП.ТочкиМаршрута.ДействиеЗвонокПриНепосещении);
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродлениеЧленства_КОРП.ТочкиМаршрута.ДействиеЗвонокПослеПервогоПосещения);
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродлениеЧленства_КОРП.ТочкиМаршрута.ДействиеЗвонокПослеАдаптационногоПериода);
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродлениеЧленства_КОРП.ТочкиМаршрута.ДействиеЗвонокПередПродлением);
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродлениеЧленства_КОРП.ТочкиМаршрута.ДействиеПродление);
	// Для БП Продление пакета
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродлениеПакетаУслуг_КОРП.ТочкиМаршрута.ДействиеПредупреждениеОРискеНеиспользованияПакета);
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродлениеПакетаУслуг_КОРП.ТочкиМаршрута.ДействиеПродление);
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивТочекМаршрута", МассивТочекМаршрута);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	               |	ЗадачаИсполнителя.Номер КАК КодСинхронизации,
	               |	ЗадачаИсполнителя.Дата КАК Дата,
	               |	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) = ТИП(БизнесПроцесс.ПродлениеЧленства_КОРП)
	               |			ТОГДА ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродлениеЧленства_КОРП).НастройкаБизнесПроцесса
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) = ТИП(БизнесПроцесс.ПродлениеПакетаУслуг_КОРП)
	               |			ТОГДА ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродлениеЧленства_КОРП).НастройкаБизнесПроцесса
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК НастройкаБизнесПроцесса,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродлениеЧленства_КОРП).Завершен КАК БизнесПроцессЗавершен,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродлениеЧленства_КОРП).ДатаЗавершения КАК БизнесПроцессДатаЗавершения,
	               |	ЗадачаИсполнителя.ТочкаМаршрута КАК ТочкаМаршрута,
	               |	ЗадачаИсполнителя.Наименование КАК Наименование,
	               |	ЗадачаИсполнителя.Выполнена КАК Выполнена,
	               |	ЗадачаИсполнителя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ЗадачаИсполнителя.ВидВзаимодействия КАК ВидВзаимодействия,
	               |	ЗадачаИсполнителя.ВидВзаимодействияСправочник КАК ВидВзаимодействияСправочник,
	               |	ЗадачаИсполнителя.ВзаимодействиеСостоялось КАК ВзаимодействиеСостоялось,
	               |	ЗадачаИсполнителя.ЗадачаАвтор КАК ЗадачаАвтор,
	               |	ЗадачаИсполнителя.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата,
	               |	ЗадачаИсполнителя.ЗадачаОписание КАК ЗадачаОписание,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.ЗадачаПредмет) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ЗадачаИсполнителя.ЗадачаПредмет
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.ЗадачаПредмет) = ТИП(Документ.ЧленствоПакетУслуг)
	               |			ТОГДА ЗадачаИсполнителя.ЗадачаПредмет.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ КАК Контрагент,
	               |	ЗадачаИсполнителя.ЗадачаПредмет КАК ЗадачаПредмет,
	               |	ЗадачаИсполнителя.ЗадачаТема КАК ЗадачаТема,
	               |	ЗадачаИсполнителя.ДатаИсполнения КАК ДатаИсполнения,
	               |	ЗадачаИсполнителя.НапоминаниеИспользовать КАК НапоминаниеИспользовать,
	               |	ЗадачаИсполнителя.НапоминаниеДатаНачала КАК НапоминаниеДатаНачала,
	               |	ЗадачаИсполнителя.ВариантНапоминания КАК ВариантНапоминания,
	               |	ЗадачаИсполнителя.Представление КАК Представление,
	               |	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	               |	ЗадачаИсполнителя.ИсполнительФактический КАК ИсполнительФактический,
	               |	ЗадачаИсполнителя.КоличествоПереносов КАК КоличествоПереносов,
	               |	ЕСТЬNULL(ПланАктивацииСервисныхЗвонков.УИДПараметра, НЕОПРЕДЕЛЕНО) КАК УИДПараметра,
	               |	ЕСТЬNULL(Взаимодействие.Ссылка, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ВзаимодействиеСсылка
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланАктивацииСервисныхЗвонков КАК ПланАктивацииСервисныхЗвонков
	               |		ПО ЗадачаИсполнителя.Ссылка = ПланАктивацииСервисныхЗвонков.Задача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Взаимодействие КАК Взаимодействие
	               |		ПО ЗадачаИсполнителя.Номер = Взаимодействие.КодСинхронизации
	               |			И ЗадачаИсполнителя.Дата = Взаимодействие.Дата
	               |ГДЕ
	               |	ЗадачаИсполнителя.ПометкаУдаления = ЛОЖЬ
	               |	И ЗадачаИсполнителя.РегламентнаяЗадача = ЛОЖЬ
	               |	И ЗадачаИсполнителя.Черновик = ЛОЖЬ
	               |	И ЗадачаИсполнителя.БизнесПроцесс ССЫЛКА БизнесПроцесс.ПродлениеЧленства_КОРП
	               |	И ЗадачаИсполнителя.ТочкаМаршрута В(&МассивТочекМаршрута)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗадачаИсполнителя.Ссылка,
	               |	ЗадачаИсполнителя.Номер,
	               |	ЗадачаИсполнителя.Дата,
	               |	ЗадачаИсполнителя.БизнесПроцесс,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) = ТИП(БизнесПроцесс.ПродлениеЧленства_КОРП)
	               |			ТОГДА ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродлениеПакетаУслуг_КОРП).НастройкаБизнесПроцесса
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) = ТИП(БизнесПроцесс.ПродлениеПакетаУслуг_КОРП)
	               |			ТОГДА ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродлениеПакетаУслуг_КОРП).НастройкаБизнесПроцесса
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродлениеПакетаУслуг_КОРП).Завершен,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродлениеПакетаУслуг_КОРП).ДатаЗавершения,
	               |	ЗадачаИсполнителя.ТочкаМаршрута,
	               |	ЗадачаИсполнителя.Наименование,
	               |	ЗадачаИсполнителя.Выполнена,
	               |	ЗадачаИсполнителя.СтруктурнаяЕдиница,
	               |	ЗадачаИсполнителя.ВидВзаимодействия,
	               |	ЗадачаИсполнителя.ВидВзаимодействияСправочник,
	               |	ЗадачаИсполнителя.ВзаимодействиеСостоялось,
	               |	ЗадачаИсполнителя.ЗадачаАвтор,
	               |	ЗадачаИсполнителя.ЗадачаНазначеннаяДата,
	               |	ЗадачаИсполнителя.ЗадачаОписание,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.ЗадачаПредмет) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ЗадачаИсполнителя.ЗадачаПредмет
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.ЗадачаПредмет) = ТИП(Документ.ЧленствоПакетУслуг)
	               |			ТОГДА ЗадачаИсполнителя.ЗадачаПредмет.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ЗадачаИсполнителя.ЗадачаПредмет,
	               |	ЗадачаИсполнителя.ЗадачаТема,
	               |	ЗадачаИсполнителя.ДатаИсполнения,
	               |	ЗадачаИсполнителя.НапоминаниеИспользовать,
	               |	ЗадачаИсполнителя.НапоминаниеДатаНачала,
	               |	ЗадачаИсполнителя.ВариантНапоминания,
	               |	ЗадачаИсполнителя.Представление,
	               |	ЗадачаИсполнителя.Исполнитель,
	               |	ЗадачаИсполнителя.ИсполнительФактический,
	               |	ЗадачаИсполнителя.КоличествоПереносов,
	               |	ЕСТЬNULL(ПланАктивацииСервисныхЗвонков.УИДПараметра, НЕОПРЕДЕЛЕНО),
	               |	ЕСТЬNULL(Взаимодействие.Ссылка, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка))
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланАктивацииСервисныхЗвонков КАК ПланАктивацииСервисныхЗвонков
	               |		ПО ЗадачаИсполнителя.Ссылка = ПланАктивацииСервисныхЗвонков.Задача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Взаимодействие КАК Взаимодействие
	               |		ПО ЗадачаИсполнителя.Номер = Взаимодействие.КодСинхронизации
	               |			И ЗадачаИсполнителя.Дата = Взаимодействие.Дата
	               |ГДЕ
	               |	ЗадачаИсполнителя.ПометкаУдаления = ЛОЖЬ
	               |	И ЗадачаИсполнителя.РегламентнаяЗадача = ЛОЖЬ
	               |	И ЗадачаИсполнителя.Черновик = ЛОЖЬ
	               |	И ЗадачаИсполнителя.БизнесПроцесс ССЫЛКА БизнесПроцесс.ПродлениеПакетаУслуг_КОРП
	               |	И ЗадачаИсполнителя.ТочкаМаршрута В(&МассивТочекМаршрута)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродлениеЧленства_КОРП.Ссылка КАК БизнесПроцессСсылка,
	               |	ПродлениеЧленства_КОРП.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	               |	ПродлениеЧленства_КОРП.Продлено КАК Продлено,
	               |	ЕСТЬNULL(ПродлениеЧленства_КОРП.ПричинаОтказа.Наименование, """") КАК ПричинаОтказа
	               |ИЗ
	               |	БизнесПроцесс.ПродлениеЧленства_КОРП КАК ПродлениеЧленства_КОРП
	               |ГДЕ
	               |	ПродлениеЧленства_КОРП.ЧленствоПакетУслуг <> ЗНАЧЕНИЕ(Документ.ЧленствоПакетУслуг.ПустаяСсылка)
	               |	И (ПродлениеЧленства_КОРП.Завершен = ИСТИНА
	               |			ИЛИ ПродлениеЧленства_КОРП.ПричинаОтказа <> ЗНАЧЕНИЕ(Справочник.РезультатыВыполненияЗадач.ПустаяСсылка))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПродлениеПакетаУслуг_КОРП.Ссылка,
	               |	ПродлениеПакетаУслуг_КОРП.ЧленствоПакетУслуг,
	               |	ПродлениеПакетаУслуг_КОРП.Продлено,
	               |	ЕСТЬNULL(ПродлениеПакетаУслуг_КОРП.ПричинаОтказа.Наименование, """")
	               |ИЗ
	               |	БизнесПроцесс.ПродлениеПакетаУслуг_КОРП КАК ПродлениеПакетаУслуг_КОРП
	               |ГДЕ
	               |	ПродлениеПакетаУслуг_КОРП.ЧленствоПакетУслуг <> ЗНАЧЕНИЕ(Документ.ЧленствоПакетУслуг.ПустаяСсылка)
	               |	И (ПродлениеПакетаУслуг_КОРП.Завершен = ИСТИНА
	               |			ИЛИ ПродлениеПакетаУслуг_КОРП.ПричинаОтказа <> ЗНАЧЕНИЕ(Справочник.РезультатыВыполненияЗадач.ПустаяСсылка))";
	
	РезультатПакета 					= Запрос.ВыполнитьПакет();
	ТаблицаЗадачаИсполнителя 			= РезультатПакета[0].Выгрузить();
	ТаблицаБизнесПроцессов	 			= РезультатПакета[1].Выгрузить();
	
	Для Каждого СтрокаЗадача Из ТаблицаЗадачаИсполнителя Цикл 
		Взаимодействие_Объект = Неопределено;
		Если НЕ ЗначениеЗаполнено(СтрокаЗадача.ВзаимодействиеСсылка) Тогда
			ТриггерСсылка = Справочники.ТриггерныеСобытия.ПустаяСсылка();
			Если НЕ СтрокаЗадача.УИДПараметра = Неопределено Тогда
				// Ищем строку триггера по УИДу
				СтрокаТриггерноеСобытие = ТаблицаТриггерныхСобытий.Найти(СтрокаЗадача.УИДПараметра, "УИД");
				Если НЕ СтрокаТриггерноеСобытие = Неопределено Тогда
					ТриггерСсылка = СтрокаТриггерноеСобытие.ТриггерСсылка;
				КонецЕсли;	
			КонецЕсли;
			Взаимодействие_Объект = Задачи.Взаимодействие.СоздатьЗадачу();
			ЗаполнитьЗначенияСвойств(Взаимодействие_Объект, СтрокаЗадача, , "Ссылка, БизнесПроцесс, ТочкаМаршрута");
			Если ЗначениеЗаполнено(ТриггерСсылка) Тогда 
				Взаимодействие_Объект.ТриггерноеСобытие = СтрокаТриггерноеСобытие.ТриггерСсылка;
			КонецЕсли;	
			Если СтрокаЗадача.БизнесПроцессЗавершен = Истина И СтрокаЗадача.Выполнена = Ложь Тогда 
				Взаимодействие_Объект.Выполнена 				= СтрокаЗадача.БизнесПроцессЗавершен;
				Взаимодействие_Объект.ВзаимодействиеСостоялось 	= Ложь;
				Взаимодействие_Объект.ДатаИсполнения 			= СтрокаЗадача.БизнесПроцессДатаЗавершения;
			КонецЕсли;	
		КонецЕсли;
		
		Если НЕ Взаимодействие_Объект = Неопределено Тогда
			Взаимодействие_Объект.УстановитьНовыйНомер();
			Взаимодействие_Объект.ДополнительныеСвойства.Вставить("ЭтоОбновлениеИнформационнойБазы", Истина);
			Взаимодействие_Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Взаимодействие_Объект.Записать();
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации("Ошибка создания взаимодействия! " + Строка(СтрокаЗадача.Ссылка) + Символы.ПС + "Контрагент: " + Строка(СтрокаЗадача.Контрагент) + Символы.ПС + "Настройка: " + Строка(СтрокаЗадача.НастройкаБизнесПроцесса) + " Номер строки: " + Строка(СтрокаТриггерноеСобытие.НомерСтроки), УровеньЖурналаРегистрации.Ошибка, Метаданные.Задачи.Взаимодействие, , ОписаниеОшибки());			
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;
	
	// Сохраняем информацию которая агрегировалась в сущности - БизнесПроцесс
	Для Каждого СтрокаБизнесПроцесс Из ТаблицаБизнесПроцессов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаБизнесПроцесс.ЧленствоПакетУслуг) Тогда 
			Продолжить;
		КонецЕсли;
		// Добавим статус членства в итоговый регистр
		Если СтрокаБизнесПроцесс.Продлено Тогда 
			МенеджерЗаписиИтогов 					= РегистрыСведений.ЧленстваПакетыУслугИтоги.СоздатьМенеджерЗаписи();
			МенеджерЗаписиИтогов.ЧленствоПакетУслуг = СтрокаБизнесПроцесс.ЧленствоПакетУслуг;
			МенеджерЗаписиИтогов.Прочитать();
			Если МенеджерЗаписиИтогов.Выбран() Тогда
				МенеджерЗаписиИтогов.СтатусПродления = ?(СтрокаБизнесПроцесс.Продлено, Перечисления.СтатусыПродленияЧленствПакетовУслуг.Продлено, Перечисления.СтатусыПродленияЧленствПакетовУслуг.НеПродлено);
				МенеджерЗаписиИтогов.Записать();
			КонецЕсли;
		КонецЕсли;
		// Запишим причину отказа от продления членства
		Если СтрокаБизнесПроцесс.Продлено = Ложь И ЗначениеЗаполнено(СтрокаБизнесПроцесс.ПричинаОтказа) Тогда 
			Документ_Объект 							= СтрокаБизнесПроцесс.ЧленствоПакетУслуг.ПолучитьОбъект();
			Документ_Объект.ПричинаОтказаОтПродления 	= СтрокаБизнесПроцесс.ПричинаОтказа;
			Документ_Объект.ОбменДанными.Загрузка 		= Истина;
			Попытка
				Документ_Объект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ЗаписьЖурналаРегистрации("Ошибка записи причины отказа продления членства! " + Строка(СтрокаБизнесПроцесс.ЧленствоПакетУслуг), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЧленствоПакетУслуг, , ОписаниеОшибки());			
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Актуализировать взаимодействия по продаже дополнительных услуг
//
// Параметры:
//  ТаблицаТриггерныхСобытий - 	 - 
//
Процедура АктуализироватьВзаимодействияПоПродажеДополнительныхУслуг(Знач ТаблицаТриггерныхСобытий) Экспорт
	
	Если ТипЗнч(ТаблицаТриггерныхСобытий) = Тип("ДанныеФормыКоллекция") Тогда 
		ТаблицаТриггерныхСобытий = ТаблицаТриггерныхСобытий.Выгрузить();
	КонецЕсли;	
	
	МассивТочекМаршрута = Новый Массив;
	МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродажаДополнительныхУслуг_КОРП.ТочкиМаршрута.ДействиеЗаписьНаЗанятие);
	// МассивТочекМаршрута.Добавить(БизнесПроцессы.ПродажаДополнительныхУслуг_КОРП.ТочкиМаршрута.ДействиеПродажа);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивТочекМаршрута", МассивТочекМаршрута);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	               |	ЗадачаИсполнителя.Номер КАК КодСинхронизации,
	               |	ЗадачаИсполнителя.Дата КАК Дата,
	               |	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродажаДополнительныхУслуг_КОРП).НастройкаБизнесПроцесса КАК НастройкаБизнесПроцесса,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродажаДополнительныхУслуг_КОРП).Завершен КАК БизнесПроцессЗавершен,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродажаДополнительныхУслуг_КОРП).ДатаЗавершения КАК БизнесПроцессДатаЗавершения,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродажаДополнительныхУслуг_КОРП).Контрагент КАК Контрагент,
	               |	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.ПродажаДополнительныхУслуг_КОРП).ЧленствоПакетУслуг КАК ЗадачаПредмет,				   
	               |	ЗадачаИсполнителя.ТочкаМаршрута КАК ТочкаМаршрута,
	               |	ЗадачаИсполнителя.Наименование КАК Наименование,
	               |	ЗадачаИсполнителя.Выполнена КАК Выполнена,
	               |	ЗадачаИсполнителя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ЗадачаИсполнителя.ВидВзаимодействия КАК ВидВзаимодействия,
	               |	ЗадачаИсполнителя.ВидВзаимодействияСправочник КАК ВидВзаимодействияСправочник,
	               |	ЗадачаИсполнителя.ВзаимодействиеСостоялось КАК ВзаимодействиеСостоялось,
	               |	ЗадачаИсполнителя.ЗадачаАвтор КАК ЗадачаАвтор,
	               |	ЗадачаИсполнителя.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата,
	               |	ЗадачаИсполнителя.ЗадачаОписание КАК ЗадачаОписание,
	               |	ЗадачаИсполнителя.ЗадачаПредмет КАК ЗадачаУслуга,
	               |	ЗадачаИсполнителя.ЗадачаТема КАК ЗадачаТема,
	               |	ЗадачаИсполнителя.ДатаИсполнения КАК ДатаИсполнения,
	               |	ЗадачаИсполнителя.НапоминаниеИспользовать КАК НапоминаниеИспользовать,
	               |	ЗадачаИсполнителя.НапоминаниеДатаНачала КАК НапоминаниеДатаНачала,
	               |	ЗадачаИсполнителя.ВариантНапоминания КАК ВариантНапоминания,
	               |	ЗадачаИсполнителя.Представление КАК Представление,
	               |	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	               |	ЗадачаИсполнителя.ИсполнительФактический КАК ИсполнительФактический,
	               |	ЗадачаИсполнителя.КоличествоПереносов КАК КоличествоПереносов,
	               |	ЕСТЬNULL(ПланАктивацииСервисныхЗвонков.УИДПараметра, НЕОПРЕДЕЛЕНО) КАК УИДПараметра,
	               |	ЕСТЬNULL(Взаимодействие.Ссылка, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ВзаимодействиеСсылка
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланАктивацииСервисныхЗвонков КАК ПланАктивацииСервисныхЗвонков
	               |		ПО ЗадачаИсполнителя.Ссылка = ПланАктивацииСервисныхЗвонков.Задача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Взаимодействие КАК Взаимодействие
	               |		ПО ЗадачаИсполнителя.Номер = Взаимодействие.КодСинхронизации
	               |			И ЗадачаИсполнителя.Дата = Взаимодействие.Дата
	               |ГДЕ
	               |	ЗадачаИсполнителя.ПометкаУдаления = ЛОЖЬ
	               |	И ЗадачаИсполнителя.РегламентнаяЗадача = ЛОЖЬ
	               |	И ЗадачаИсполнителя.Черновик = ЛОЖЬ
	               |	И ЗадачаИсполнителя.БизнесПроцесс ССЫЛКА БизнесПроцесс.ПродажаДополнительныхУслуг_КОРП
	               |	И ЗадачаИсполнителя.ТочкаМаршрута В(&МассивТочекМаршрута)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажаДополнительныхУслуг_КОРП.Ссылка КАК БизнесПроцессСсылка,
	               |	ПродажаДополнительныхУслуг_КОРП.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг,
	               |	ПродажаДополнительныхУслуг_КОРП.Успех КАК Успех,
	               |	ЕСТЬNULL(ПродажаДополнительныхУслуг_КОРП.ПричинаОтказа.Наименование, """") КАК ПричинаОтказа
	               |ИЗ
	               |	БизнесПроцесс.ПродажаДополнительныхУслуг_КОРП КАК ПродажаДополнительныхУслуг_КОРП
	               |ГДЕ
	               |	ПродажаДополнительныхУслуг_КОРП.ЧленствоПакетУслуг <> ЗНАЧЕНИЕ(Документ.ЧленствоПакетУслуг.ПустаяСсылка)";
	
	РезультатПакета 					= Запрос.ВыполнитьПакет();
	ТаблицаЗадачаИсполнителя 			= РезультатПакета[0].Выгрузить();
	ТаблицаБизнесПроцессов	 			= РезультатПакета[1].Выгрузить();
	
	Для Каждого СтрокаЗадача Из ТаблицаЗадачаИсполнителя Цикл 
		Взаимодействие_Объект = Неопределено;
		Если НЕ ЗначениеЗаполнено(СтрокаЗадача.ВзаимодействиеСсылка) Тогда 
			Если НЕ СтрокаЗадача.УИДПараметра = Неопределено Тогда
				МассивСтрокТриггерногоСобытия = ТаблицаТриггерныхСобытий.НайтиСтроки(Новый Структура("СсылкаНастройкиБП, УИД, Услуга", СтрокаЗадача.НастройкаБизнесПроцесса, СтрокаЗадача.УИДПараметра, СтрокаЗадача.ЗадачаУслуга));
			Иначе 
				МассивСтрокТриггерногоСобытия = ТаблицаТриггерныхСобытий.НайтиСтроки(Новый Структура("СсылкаНастройкиБП, Услуга", СтрокаЗадача.НастройкаБизнесПроцесса, СтрокаЗадача.ЗадачаУслуга));
			КонецЕсли;
			Если НЕ МассивСтрокТриггерногоСобытия.Количество() = 0 Тогда
				Если ЗначениеЗаполнено(МассивСтрокТриггерногоСобытия[0].ТриггерСсылка) Тогда 
					Взаимодействие_Объект = Задачи.Взаимодействие.СоздатьЗадачу();
					ЗаполнитьЗначенияСвойств(Взаимодействие_Объект, СтрокаЗадача, , "Ссылка, БизнесПроцесс, ТочкаМаршрута");
					Взаимодействие_Объект.ТриггерноеСобытие = МассивСтрокТриггерногоСобытия[0].ТриггерСсылка;
					Если СтрокаЗадача.БизнесПроцессЗавершен = Истина И СтрокаЗадача.Выполнена = Ложь Тогда 
						Взаимодействие_Объект.Выполнена 				= СтрокаЗадача.БизнесПроцессЗавершен;
						Взаимодействие_Объект.ВзаимодействиеСостоялось 	= Ложь;
						Взаимодействие_Объект.ДатаИсполнения 			= СтрокаЗадача.БизнесПроцессДатаЗавершения;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Взаимодействие_Объект = Неопределено Тогда
			Взаимодействие_Объект.УстановитьНовыйНомер();
			Взаимодействие_Объект.ДополнительныеСвойства.Вставить("ЭтоОбновлениеИнформационнойБазы", Истина);
			Взаимодействие_Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Взаимодействие_Объект.Записать();
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации("Ошибка создания взаимодействия! " + Строка(СтрокаЗадача.Ссылка) + Символы.ПС + "Контрагент: " + Строка(СтрокаЗадача.Контрагент) + Символы.ПС + "Настройка: " + Строка(СтрокаЗадача.НастройкаБизнесПроцесса) + " Номер строки: " + Строка(МассивСтрокТриггерногоСобытия[0].НомерСтроки), УровеньЖурналаРегистрации.Ошибка, Метаданные.Задачи.Взаимодействие, , ОписаниеОшибки());			
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Актуализировать взаимодействия по контролю платежей по рассрочкам
//
// Параметры:
//  ТриггерКонтроляРассрочек - 	 - 
//
Процедура АктуализироватьВзаимодействияПоКонтролюПлатежейПоРассрочкам(ТриггерКонтроляРассрочек) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	               |	ЗадачаИсполнителя.Номер КАК КодСинхронизации,
	               |	ЗадачаИсполнителя.Дата КАК Дата,
	               |	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	               |	ЗадачаИсполнителя.ТочкаМаршрута КАК ТочкаМаршрута,
	               |	ЗадачаИсполнителя.Наименование КАК Наименование,
	               |	ЗадачаИсполнителя.Выполнена КАК Выполнена,
	               |	ЗадачаИсполнителя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ЗадачаИсполнителя.ВидВзаимодействия КАК ВидВзаимодействия,
	               |	ЗадачаИсполнителя.ВзаимодействиеСостоялось КАК ВзаимодействиеСостоялось,
	               |	ЗадачаИсполнителя.ЗадачаАвтор КАК ЗадачаАвтор,
	               |	ЗадачаИсполнителя.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.ЗадачаПредмет) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ЗадачаИсполнителя.ЗадачаПредмет
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.ЗадачаПредмет) = ТИП(Документ.Реализация)
	               |			ТОГДА ЗадачаИсполнителя.ЗадачаПредмет.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ КАК Контрагент,
	               |	ЗадачаИсполнителя.ЗадачаПредмет КАК ЗадачаПредмет,
	               |	ЗадачаИсполнителя.ЗадачаОписание КАК ЗадачаОписание,
	               |	ЗадачаИсполнителя.ЗадачаТема КАК ЗадачаТема,
	               |	ЗадачаИсполнителя.ДатаИсполнения КАК ДатаИсполнения,
	               |	ЗадачаИсполнителя.ИсполнительФактический КАК ИсполнительФактический,
	               |	ЗадачаИсполнителя.НапоминаниеИспользовать КАК НапоминаниеИспользовать,
	               |	ЗадачаИсполнителя.НапоминаниеДатаНачала КАК НапоминаниеДатаНачала,
	               |	ЗадачаИсполнителя.ВариантНапоминания КАК ВариантНапоминания,
	               |	ЗадачаИсполнителя.КоличествоПереносов КАК КоличествоПереносов,
	               |	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	               |	ЕСТЬNULL(Взаимодействие.Ссылка, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ВзаимодействиеСсылка
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Взаимодействие КАК Взаимодействие
	               |		ПО ЗадачаИсполнителя.Номер = Взаимодействие.КодСинхронизации
	               |			И ЗадачаИсполнителя.Дата = Взаимодействие.Дата
	               |ГДЕ
	               |	ЗадачаИсполнителя.ПометкаУдаления = ЛОЖЬ
	               |	И ЗадачаИсполнителя.РегламентнаяЗадача = ЛОЖЬ
	               |	И ЗадачаИсполнителя.Черновик = ЛОЖЬ
	               |	И ЗадачаИсполнителя.БизнесПроцесс ССЫЛКА БизнесПроцесс.КонтрольПлатежейПоРассрочкам_КОРП
	               |	И ЗадачаИсполнителя.ТочкаМаршрута = ЗНАЧЕНИЕ(БизнесПроцесс.КонтрольПлатежейПоРассрочкам_КОРП.ТочкаМаршрута.ДействиеЗвонокДолжнику)";
	
	ТаблицаЗадачаИсполнителя = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаЗадача Из ТаблицаЗадачаИсполнителя Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаЗадача.ВзаимодействиеСсылка) Тогда 
			Взаимодействие_Объект = Задачи.Взаимодействие.СоздатьЗадачу();
			ЗаполнитьЗначенияСвойств(Взаимодействие_Объект, СтрокаЗадача, , "Ссылка, БизнесПроцесс, ТочкаМаршрута");
			Взаимодействие_Объект.ТриггерноеСобытие = ТриггерКонтроляРассрочек;
			Взаимодействие_Объект.УстановитьНовыйНомер();			
			Взаимодействие_Объект.ДополнительныеСвойства.Вставить("ЭтоОбновлениеИнформационнойБазы", Истина);
			Взаимодействие_Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Взаимодействие_Объект.Записать();
			Исключение
				Отказ = Истина;
				ЗаписьЖурналаРегистрации("Ошибка создания взаимодействия! " + Строка(СтрокаЗадача.Ссылка) + Символы.ПС + "Контрагент: " + Строка(СтрокаЗадача.Контрагент), УровеньЖурналаРегистрации.Ошибка, Метаданные.Задачи.Взаимодействие, , ОписаниеОшибки());			
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Актуализировать взаимодействия простые
//
Процедура АктуализироватьВзаимодействияПростые() Экспорт
	
	Порция = 5000; 
	
	Пока Порция > 0 Цикл  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ " + Формат(Порция, "ЧН=0; ЧГ=0") + "
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
		|	ЗадачаИсполнителя.Номер КАК КодСинхронизации,
		|	ЗадачаИсполнителя.Дата КАК Дата,
		|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
		|	ЗадачаИсполнителя.ТочкаМаршрута КАК ТочкаМаршрута,
		|	ЗадачаИсполнителя.Наименование КАК Наименование,
		|	ЗадачаИсполнителя.Выполнена КАК Выполнена,
		|	ЗадачаИсполнителя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗадачаИсполнителя.ВидВзаимодействия КАК ВидВзаимодействия,
		|	ЗадачаИсполнителя.ВзаимодействиеСостоялось КАК ВзаимодействиеСостоялось,
		|	ЗадачаИсполнителя.ЗадачаАвтор КАК ЗадачаАвтор,
		|	ЗадачаИсполнителя.ЗадачаНазначеннаяДата КАК ЗадачаНазначеннаяДата,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.ЗадачаПредмет) = ТИП(Справочник.Контрагенты)
		|			ТОГДА ЗадачаИсполнителя.ЗадачаПредмет
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.ЗадачаПредмет) = ТИП(Документ.Реализация)
		|			ТОГДА ЗадачаИсполнителя.ЗадачаПредмет.Контрагент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Контрагент,
		|	ЗадачаИсполнителя.ЗадачаПредмет КАК ЗадачаПредмет,
		|	ЗадачаИсполнителя.ЗадачаОписание КАК ЗадачаОписание,
		|	ЗадачаИсполнителя.ЗадачаТема КАК ЗадачаТема,
		|	ЗадачаИсполнителя.ДатаИсполнения КАК ДатаИсполнения,
		|	ЗадачаИсполнителя.ИсполнительФактический КАК ИсполнительФактический,
		|	ЗадачаИсполнителя.НапоминаниеИспользовать КАК НапоминаниеИспользовать,
		|	ЗадачаИсполнителя.НапоминаниеДатаНачала КАК НапоминаниеДатаНачала,
		|	ЗадачаИсполнителя.ВариантНапоминания КАК ВариантНапоминания,
		|	ЗадачаИсполнителя.КоличествоПереносов КАК КоличествоПереносов,
		|	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
		|	ЕСТЬNULL(Взаимодействие.Ссылка, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ВзаимодействиеСсылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Взаимодействие КАК Взаимодействие
		|		ПО ЗадачаИсполнителя.Номер = Взаимодействие.КодСинхронизации
		|			И ЗадачаИсполнителя.Дата = Взаимодействие.Дата
		|ГДЕ
		|	ЗадачаИсполнителя.ПометкаУдаления = ЛОЖЬ
		|	И ЗадачаИсполнителя.РегламентнаяЗадача = ЛОЖЬ
		|	И ЗадачаИсполнителя.Черновик = ЛОЖЬ
		|	И ЗадачаИсполнителя.БизнесПроцесс = НЕОПРЕДЕЛЕНО
		|	И ЗадачаИсполнителя.Дата >= &ДатаОтбора
		|	И Взаимодействие.Ссылка ЕСТЬ NULL";		
		
		Запрос.УстановитьПараметр("ДатаОтбора", Дата(2020, 01, 01));
		ТаблицаЗадачаИсполнителя = Запрос.Выполнить().Выгрузить();
		Порция = ТаблицаЗадачаИсполнителя.Количество();
		
		Для Каждого СтрокаЗадача Из ТаблицаЗадачаИсполнителя Цикл 
			Если НЕ ЗначениеЗаполнено(СтрокаЗадача.ВзаимодействиеСсылка) Тогда 		
				Взаимодействие_Объект = Задачи.Взаимодействие.СоздатьЗадачу();
				ЗаполнитьЗначенияСвойств(Взаимодействие_Объект, СтрокаЗадача, , "Ссылка, БизнесПроцесс, ТочкаМаршрута");
				Взаимодействие_Объект.УстановитьНовыйНомер();			
				Взаимодействие_Объект.ДополнительныеСвойства.Вставить("ЭтоОбновлениеИнформационнойБазы", Истина);
				Взаимодействие_Объект.ОбменДанными.Загрузка = Истина;
				
				ЗадачаИсполнителя_Объект = СтрокаЗадача.Ссылка.ПолучитьОбъект();
				Если ЗадачаИсполнителя_Объект = Неопределено Тогда 
					Порция = Порция - 1;
					Продолжить;
				КонецЕсли;	
				НачатьТранзакцию();
				Попытка
					Взаимодействие_Объект.Записать();
					ЗадачаИсполнителя_Объект.УстановитьПометкуУдаления(Истина);
					ЗафиксироватьТранзакцию();					
				Исключение
					Отказ = Истина;
					ЗаписьЖурналаРегистрации("Ошибка создания взаимодействия! " + Строка(СтрокаЗадача.Ссылка) + Символы.ПС + "Контрагент: " + Строка(СтрокаЗадача.Контрагент), УровеньЖурналаРегистрации.Ошибка, Метаданные.Задачи.Взаимодействие, , ОписаниеОшибки());			
					ОтменитьТранзакцию();
					Порция = Порция - 1;															
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры	

// Процедура - Обновить настройки каналов уведомлений
//
Процедура ОбновитьНастройкиКаналовУведомлений() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияПовтИсп.ЭтоВерсияКОРП() Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Действия.Ссылка КАК ТриггерСсылка,
	|	Действия.ИдентификаторДействия КАК ИдентификаторДействия,
	|	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница,
	|	Действия.Использование КАК Использование,
	|	Действия.ОтправкаPush КАК ОтправкаPush,
	|	Действия.ОтправкаPushWallet КАК ОтправкаPushWallet,
	|	Действия.ОтправкаMessenger КАК ОтправкаMessenger,
	|	Действия.ОтправкаSMS КАК ОтправкаSMS,
	|	Действия.АккаунтВнешнейСистемы КАК АккаунтВнешнейСистемы,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Действия.АккаунтSMS, СтруктурныеЕдиницы.СервисSMSРассылки) = ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)
	|				ИЛИ ЕСТЬNULL(Действия.АккаунтSMS, СтруктурныеЕдиницы.СервисSMSРассылки) = НЕОПРЕДЕЛЕНО
	|			ТОГДА СервисSMSРассылкиПоУмолчанию.Значение
	|		ИНАЧЕ ЕСТЬNULL(Действия.АккаунтSMS, СтруктурныеЕдиницы.СервисSMSРассылки)
	|	КОНЕЦ КАК АккаунтSMS,
	|	Действия.КаналСистемыСообщений КАК КаналСистемыСообщений
	|ПОМЕСТИТЬ МоделируемыеНастройкиКаналовУведомлений
	|ИЗ
	|	Справочник.ТриггерныеСобытия.Действия КАК Действия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО (ИСТИНА),
	|	Константа.СервисSMSРассылкиПоУмолчанию КАК СервисSMSРассылкиПоУмолчанию
	|ГДЕ
	|	Действия.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И Действия.ВидДействия = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение)
	|	И Действия.Удалено = ЛОЖЬ
	|	И СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	|	И СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МоделируемыеНастройкиКаналовУведомлений.ТриггерСсылка КАК ТриггерСсылка,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ИдентификаторДействия, МоделируемыеНастройкиКаналовУведомлений.ИдентификаторДействия) КАК ИдентификаторДействия,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.СтруктурнаяЕдиница, МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.СтруктурнаяЕдиница, МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница)) КАК ПредставлениеСтруктурнойЕдиницы,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.СтруктурнаяЕдиница.Наименование, МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница.Наименование) КАК НаименованиеСтруктурнойЕдиницы,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ОтправкаPush, МоделируемыеНастройкиКаналовУведомлений.ОтправкаPush) КАК ОтправкаPush,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ОтправкаPushWallet, МоделируемыеНастройкиКаналовУведомлений.ОтправкаPushWallet) КАК ОтправкаPushWallet,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ОтправкаMessenger, МоделируемыеНастройкиКаналовУведомлений.ОтправкаMessenger) КАК ОтправкаMessenger,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.ОтправкаSMS, МоделируемыеНастройкиКаналовУведомлений.ОтправкаSMS) КАК ОтправкаSMS,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, МоделируемыеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы) КАК АккаунтВнешнейСистемы,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы, МоделируемыеНастройкиКаналовУведомлений.АккаунтВнешнейСистемы)) КАК ПредставлениеАккаунтаВнешнейСистемы,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS, МоделируемыеНастройкиКаналовУведомлений.АккаунтSMS) = ЗНАЧЕНИЕ(Справочник.СервисыРассылки.ПустаяСсылка)
	|			ТОГДА МоделируемыеНастройкиКаналовУведомлений.АккаунтSMS
	|		ИНАЧЕ ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS, МоделируемыеНастройкиКаналовУведомлений.АккаунтSMS)
	|	КОНЕЦ КАК АккаунтСервисаРассылкиSMS,
	|	ЕСТЬNULL(ТекущиеНастройкиКаналовУведомлений.КаналСистемыСообщений, МоделируемыеНастройкиКаналовУведомлений.КаналСистемыСообщений) КАК КаналСистемыСообщений
	|ПОМЕСТИТЬ НастройкиКаналовУведомлений
	|ИЗ
	|	МоделируемыеНастройкиКаналовУведомлений КАК МоделируемыеНастройкиКаналовУведомлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТриггерныеСобытия.НастройкиКаналовУведомлений КАК ТекущиеНастройкиКаналовУведомлений
	|		ПО МоделируемыеНастройкиКаналовУведомлений.ИдентификаторДействия = ТекущиеНастройкиКаналовУведомлений.ИдентификаторДействия
	|			И МоделируемыеНастройкиКаналовУведомлений.СтруктурнаяЕдиница = ТекущиеНастройкиКаналовУведомлений.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВнешниеСистемы.Ссылка) КАК ВнешняяСистема,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ТаблицаВнешнихСистем
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ПометкаУдаления = ЛОЖЬ
	|	И ВнешниеСистемы.Используется = ИСТИНА
	|	И ВнешниеСистемы.ТипВнешнейСистемы В (ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi), ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Chat2Desk))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВнешниеСистемы.ТипВнешнейСистемы,
	|	ВнешниеСистемы.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВнешнихСистем.ВнешняяСистема КАК ВнешняяСистема,
	|	ТаблицаВнешнихСистем.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ТаблицаВнешнихСистем.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиКаналовУведомлений.ТриггерСсылка КАК ТриггерСсылка,
	|	НастройкиКаналовУведомлений.ИдентификаторДействия КАК ИдентификаторДействия,
	|	НастройкиКаналовУведомлений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НастройкиКаналовУведомлений.ОтправкаPush КАК ОтправкаPush,
	|	НастройкиКаналовУведомлений.ОтправкаPushWallet КАК ОтправкаPushWallet,
	|	НастройкиКаналовУведомлений.ОтправкаMessenger КАК ОтправкаMessenger,
	|	НастройкиКаналовУведомлений.ОтправкаSMS КАК ОтправкаSMS,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаКорректныхВнешнихСистем.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаКорректныхВнешнихСистем.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемПоСтруктурнойЕдинице.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемПоСтруктурнойЕдинице.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемПоЛюбойСтруктурнойЕдинице.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемПоЛюбойСтруктурнойЕдинице.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ КАК АккаунтВнешнейСистемы,
	|	НастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS КАК АккаунтСервисаРассылкиSMS,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаКорректныхВнешнихСистем.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА НастройкиКаналовУведомлений.КаналСистемыСообщений
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КаналСистемыСообщений
	|ИЗ
	|	НастройкиКаналовУведомлений КАК НастройкиКаналовУведомлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаКорректныхВнешнихСистем
	|		ПО НастройкиКаналовУведомлений.АккаунтВнешнейСистемы = ТаблицаКорректныхВнешнихСистем.ВнешняяСистема
	|			И (НастройкиКаналовУведомлений.СтруктурнаяЕдиница = ТаблицаКорректныхВнешнихСистем.СтруктурнаяЕдиница
	|				ИЛИ ТаблицаКорректныхВнешнихСистем.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистемПоСтруктурнойЕдинице
	|		ПО НастройкиКаналовУведомлений.СтруктурнаяЕдиница = ТаблицаВнешнихСистемПоСтруктурнойЕдинице.СтруктурнаяЕдиница
	|			И НастройкиКаналовУведомлений.АккаунтВнешнейСистемы.ТипВнешнейСистемы = ТаблицаВнешнихСистемПоСтруктурнойЕдинице.ТипВнешнейСистемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихСистем КАК ТаблицаВнешнихСистемПоЛюбойСтруктурнойЕдинице
	|		ПО (ТаблицаВнешнихСистемПоЛюбойСтруктурнойЕдинице.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|			И НастройкиКаналовУведомлений.АккаунтВнешнейСистемы.ТипВнешнейСистемы = ТаблицаВнешнихСистемПоЛюбойСтруктурнойЕдинице.ТипВнешнейСистемы
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиКаналовУведомлений.АккаунтСервисаРассылкиSMS,
	|	НастройкиКаналовУведомлений.ИдентификаторДействия,
	|	НастройкиКаналовУведомлений.СтруктурнаяЕдиница,
	|	НастройкиКаналовУведомлений.ОтправкаPush,
	|	НастройкиКаналовУведомлений.ОтправкаPushWallet,
	|	НастройкиКаналовУведомлений.ОтправкаMessenger,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаКорректныхВнешнихСистем.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаКорректныхВнешнихСистем.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемПоСтруктурнойЕдинице.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемПоСтруктурнойЕдинице.ВнешняяСистема
	|		КОГДА НЕ ТаблицаВнешнихСистемПоЛюбойСтруктурнойЕдинице.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА ТаблицаВнешнихСистемПоЛюбойСтруктурнойЕдинице.ВнешняяСистема
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаКорректныхВнешнихСистем.ВнешняяСистема ЕСТЬ NULL
	|			ТОГДА НастройкиКаналовУведомлений.КаналСистемыСообщений
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	НастройкиКаналовУведомлений.ОтправкаSMS,
	|	НастройкиКаналовУведомлений.ТриггерСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТриггерСсылка,
	|	ИдентификаторДействия,
	|	НастройкиКаналовУведомлений.СтруктурнаяЕдиница.Наименование";			
	
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаВнешнихСистем 				= РезультатПакетаЗапросов[3].Выгрузить();
	ТаблицаНастроекКаналовУведомлений 	= РезультатПакетаЗапросов[4].Выгрузить();
	
	Если НЕ ЗначениеЗаполнено(ТаблицаНастроекКаналовУведомлений) Тогда
		Возврат;
	КонецЕсли;	
	
	// --------------Выключаем регламент пока обновляем настройки------------
	ЗаданиеНашли = Истина;
	// Ищем задание по наименованию.
	Отбор = Новый Структура();
	Отбор.Вставить("Метаданные", "РегистрацияТриггерныхСобытий");
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	// Проверяем, что задание найдено.
	Если Задания.Количество() <> 1 Тогда
		// Запись в журнал ошибки опущена.
		ЗаданиеНашли = Ложь;
	КонецЕсли;
	
	Если ЗаданиеНашли = Истина Тогда 
		// Выключаем найденное задание.
		НашеЗадание = Задания[0];
		Параметры = Новый Структура();
		Параметры.Вставить("Использование", Ложь);
		РегламентныеЗаданияСервер.ИзменитьЗадание(НашеЗадание.УникальныйИдентификатор, Параметры);
	КонецЕсли;
	// --------------Выключаем регламент пока обновляем настройки------------

	ТаблицаТриггеров = ТаблицаНастроекКаналовУведомлений.Скопировать(, "ТриггерСсылка");
	ТаблицаТриггеров.Свернуть("ТриггерСсылка");
	
	Для Каждого СтрокаТриггер Из ТаблицаТриггеров Цикл
		Триггер_Объект = СтрокаТриггер.ТриггерСсылка.ПолучитьОбъект();
		Триггер_Объект.НастройкиКаналовУведомлений.Очистить();
		МассивСтрокНастроек = ТаблицаНастроекКаналовУведомлений.НайтиСтроки(Новый Структура("ТриггерСсылка", СтрокаТриггер.ТриггерСсылка));
		Для Каждого СтрокаНастройкаКанала Из МассивСтрокНастроек Цикл
			// Актуализируем пуши
			ОтправкаPush 								= СтрокаНастройкаКанала.ОтправкаPush;
			СтрокаНастройкаКанала.ОтправкаPush 			= Ложь;
			ОтправкаPushWallet 							= СтрокаНастройкаКанала.ОтправкаPushWallet;
			СтрокаНастройкаКанала.ОтправкаPushWallet 	= Ложь;
			Для Каждого СтрокаВнешняяСистема Из ТаблицаВнешнихСистем Цикл
				Если ОтправкаPush Тогда 
					СтрокаНастройкаКанала.ОтправкаPush 			= Макс(СтрокаНастройкаКанала.ОтправкаPush		, (СтрокаВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.МобильноеПриложениеКлиента И (СтрокаНастройкаКанала.СтруктурнаяЕдиница = СтрокаВнешняяСистема.СтруктурнаяЕдиница ИЛИ НЕ ЗначениеЗаполнено(СтрокаВнешняяСистема.СтруктурнаяЕдиница))));
				Иначе 
					СтрокаНастройкаКанала.ОтправкаPush 			= Мин(СтрокаНастройкаКанала.ОтправкаPush		, (СтрокаВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.МобильноеПриложениеКлиента И (СтрокаНастройкаКанала.СтруктурнаяЕдиница = СтрокаВнешняяСистема.СтруктурнаяЕдиница ИЛИ НЕ ЗначениеЗаполнено(СтрокаВнешняяСистема.СтруктурнаяЕдиница))));
				КонецЕсли;
				Если ОтправкаPushWallet Тогда 
					СтрокаНастройкаКанала.ОтправкаPushWallet 	= Макс(СтрокаНастройкаКанала.ОтправкаPushWallet	, (СтрокаВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet И (СтрокаНастройкаКанала.СтруктурнаяЕдиница = СтрокаВнешняяСистема.СтруктурнаяЕдиница ИЛИ НЕ ЗначениеЗаполнено(СтрокаВнешняяСистема.СтруктурнаяЕдиница))));
				Иначе 
					СтрокаНастройкаКанала.ОтправкаPushWallet 	= Мин(СтрокаНастройкаКанала.ОтправкаPushWallet	, (СтрокаВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Wallet И (СтрокаНастройкаКанала.СтруктурнаяЕдиница = СтрокаВнешняяСистема.СтруктурнаяЕдиница ИЛИ НЕ ЗначениеЗаполнено(СтрокаВнешняяСистема.СтруктурнаяЕдиница))));
				КонецЕсли;
				
				Если НЕ СтрокаНастройкаКанала.ОтправкаMessenger Тогда 
					АккаунтВнешнейСистемы = Справочники.ВнешниеСистемы.ПустаяСсылка();
					КаналСистемыСообщений = "";
					Продолжить;
				КонецЕсли;	
			КонецЦикла;
			// Актуализируем мессенджеры
			Если НЕ ЗначениеЗаполнено(СтрокаНастройкаКанала.АккаунтВнешнейСистемы) Тогда 
				СтрокаНастройкаКанала.ОтправкаMessenger = Ложь;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Триггер_Объект.НастройкиКаналовУведомлений.Добавить(), СтрокаНастройкаКанала);
		КонецЦикла;
		
		Для Каждого СтрокаДействие Из Триггер_Объект.Действия Цикл 
			// Если НЕ СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ОтправитьСообщение Тогда
			//	Продолжить;
			// КонецЕсли;
			СтрокаДействие.ОтправкаPush 			= Ложь;
			СтрокаДействие.ОтправкаPushWallet 		= Ложь;
			СтрокаДействие.ОтправкаMessenger 		= Ложь;
			СтрокаДействие.ОтправкаSMS 				= Ложь;
			СтрокаДействие.АккаунтВнешнейСистемы 	= Справочники.ВнешниеСистемы.ПустаяСсылка();
			СтрокаДействие.АккаунтSMS 				= Неопределено;
		КонецЦикла;	
		
		Если Триггер_Объект.НастройкиКаналовУведомлений.Количество() <> 0 Тогда 
			Попытка
				// Триггер_Объект.Записать();
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Триггер_Объект);
			Исключение
				СообщениеОбОшибке = "Ошибка при обновлении настроек каналов уведомлений триггерного события:" + Символы.ПС + Символы.ПС + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("РегистрацияТриггерныхСобытий.ОбновлениеНастройкиКаналовУведомлений", УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.ТриггерныеСобытия, СтрокаТриггер.ТриггерСсылка, СообщениеОбОшибке + Символы.ПС + "Фиксация: " + Строка(ТекущаяДатаСеанса()) + Символы.ПС + "Триггерное событие: " + Строка(СтрокаТриггер.ТриггерСсылка));									
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	
	ЗаданиеНашли = Истина;	
	// Ищем задание по наименованию.
	Отбор = Новый Структура();
	Отбор.Вставить("Метаданные", "РегистрацияТриггерныхСобытий");
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	// Проверяем, что задание найдено.
	Если Задания.Количество() <> 1 Тогда
		// Запись в журнал ошибки опущена.
		ЗаданиеНашли = Ложь;
	КонецЕсли;
	
	Если ЗаданиеНашли = Истина Тогда 	
		// Включаем найденное задание.
		НашеЗадание = Задания[0];
		Параметры = Новый Структура();
		Параметры.Вставить("Использование", Истина);
		РегламентныеЗаданияСервер.ИзменитьЗадание(НашеЗадание.УникальныйИдентификатор, Параметры);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецОбласти