#Область СлужебныеПроцедурыИФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументЗатрат, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ТаблицаЗатрат.Ссылка КАК Документ,
	|	ТаблицаЗатрат.Ссылка.СтруктурнаяЕдиница,
	|	ТаблицаЗатрат.НомерСтроки,
	|	ТаблицаЗатрат.Период,
	|	ТаблицаЗатрат.СтатьяЗатрат,
	|	ТаблицаЗатрат.Сотрудник,
	|	ТаблицаЗатрат.Контрагент,
	|	ТаблицаЗатрат.Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаЗатрат
	|ИЗ
	|	Документ.Затраты.СтатьиЗатрат КАК ТаблицаЗатрат
	|ГДЕ
	|	ТаблицаЗатрат.Ссылка = &ДокументЗатрат";
	
	
	Запрос.УстановитьПараметр("ДокументЗатрат", ДокументЗатрат);
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицуЗатрат(ДокументЗатрат, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуЗатрат(ДокументЗатрат, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ВременнаяТаблицаЗатрат.НомерСтроки) КАК НомерСтроки,
	|	ВременнаяТаблицаЗатрат.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗатрат.Период,
	|	ВременнаяТаблицаЗатрат.СтатьяЗатрат,
	|	ВременнаяТаблицаЗатрат.Сотрудник,
	|	ВременнаяТаблицаЗатрат.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	СУММА(ВременнаяТаблицаЗатрат.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗатрат КАК ВременнаяТаблицаЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаЗатрат.Период,
	|	ВременнаяТаблицаЗатрат.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗатрат.СтатьяЗатрат,
	|	ВременнаяТаблицаЗатрат.Сотрудник,
	|	ВременнаяТаблицаЗатрат.Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗатраты", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти