
#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//Если ДанныеЗаполнения = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если ДанныеЗаполнения <> Неопределено И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		
		Дата = ТекущаяДата();
		
		ДокументОснование = ДанныеЗаполнения;
		СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
		АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
		СтатьиЗатрат.Очистить();
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поступление") Тогда
			
			Для Каждого СтрокаПоступления Из ДанныеЗаполнения.Запасы Цикл
				
				СтрокаЗатрат = СтатьиЗатрат.Добавить();
				
				СтрокаЗатрат.Период 		= Дата;
				СтрокаЗатрат.Контрагент 	= ДанныеЗаполнения.Контрагент;
				СтрокаЗатрат.Сумма 			= СтрокаПоступления.Сумма;
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
			
			Для Каждого СтрокаПлатежа Из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
				
				СтрокаЗатрат = СтатьиЗатрат.Добавить();
				
				СтрокаЗатрат.Период 	= Дата;
				СтрокаЗатрат.Контрагент = ДанныеЗаполнения.Контрагент;
				Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты Тогда
				     СтрокаЗатрат.Сотрудник = СтрокаПлатежа.Сотрудник;
				КонецЕсли;
				СтрокаЗатрат.Контрагент =  ДанныеЗаполнения.Контрагент;
				СтрокаЗатрат.Сумма 		= СтрокаПлатежа.Сумма;
				
			КонецЦикла;
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = СтатьиЗатрат.Итог("Сумма");
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.Затраты.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Движения по регистрам
	ДвиженияДокументовСервер.Затраты(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры


#КонецОбласти

