#Если Не ВебКлиент Тогда  
	
#Область СлужебныйПрограммныйИнтерфейс
		
// Выполняет файл с использованием настроек замены
// Параметры:Файл - ссылка на заполняемый файл
//			МассивДанныхДляАвтоЗамен - массив настроек замен
//			ОбновитьВерсиюЗаполненнымФайлом - необходимость обновить версию файла после заполнения файла данными. Если Истина, то 
//					после автозаполнения в текущую версию файла запишется измененный файл. Если Ложь, то
//					после автозаполнения текущая версия файла не изменяется, функция вернет только 
//					путь к измененному (заполненному) файлу на диске.
// Возвращает:Если СохранятьВерсию = Истина, то ПустаяСтрока
//			 Если СохранятьВерсию = Ложь, то путь к измененному файлу на диске
Функция ВыполнитьАвтоЗаполнениеШаблона(ВладелецФайла, Шаблон = Неопределено, ФайлСсылка = Неопределено) Экспорт
	
	НастройкиАвтозаполнения = АвтозаполнениеШаблоновФайловСервер.ПолучитьНастройкиАвтозаполненияШаблоновФайлов(ФайлСсылка, Шаблон, ВладелецФайла);

	ДвоичныеДанныеФайла = НастройкиАвтозаполнения.ДвоичныеДанныеФайла;
	МассивЗамен = НастройкиАвтозаполнения.МассивЗамен; 
	РасширениеФайла = НастройкиАвтозаполнения.РасширениеФайла;
	
	Если РасширениеФайла = "doc" ИЛИ РасширениеФайла = "dot" ИЛИ РасширениеФайла = "docx" ИЛИ РасширениеФайла = "dotx"  Тогда
		ДвоичныеДанныеЗаполненногоФайла = ЗаполнитьФайлMSWordПоДвоичнымДанным(ДвоичныеДанныеФайла, РасширениеФайла, МассивЗамен);
	ИначеЕсли РасширениеФайла = "txt" ИЛИ РасширениеФайла = "html" ИЛИ РасширениеФайла = "htm" Тогда 
		ДвоичныеДанныеЗаполненногоФайла = ЗаполнитьТекстовыйФайл(ДвоичныеДанныеФайла, РасширениеФайла, МассивЗамен);
	ИначеЕсли РасширениеФайла = "odt" Тогда
		ДвоичныеДанныеЗаполненногоФайла = ЗаполнитьФайлOpenOfficeWriter(ДвоичныеДанныеФайла, РасширениеФайла, МассивЗамен);
	ИначеЕсли ЗначениеЗаполнено(РасширениеФайла) Тогда
		ДвоичныеДанныеЗаполненногоФайла = "Неподдерживаемое расширение файла: """ + РасширениеФайла + """";
	Иначе
		ДвоичныеДанныеЗаполненногоФайла = "Поле ""Шаблон файла"" не заполнено";
	КонецЕсли;

	ДанныеВозврата = Новый Структура;
	Если ТипЗнч(ДвоичныеДанныеЗаполненногоФайла) = Тип("ДвоичныеДанные") Тогда
		ДанныеВозврата.Вставить("Результат", Истина);
		ДанныеВозврата.Вставить("РасширениеФайла", РасширениеФайла);
		ДанныеВозврата.Вставить("ДвоичныеДанныеЗаполненногоФайла", ДвоичныеДанныеЗаполненногоФайла);
	Иначе
		ДанныеВозврата.Вставить("Результат", Ложь);
		ДанныеВозврата.Вставить("ОписаниеОшибки", ДвоичныеДанныеЗаполненногоФайла);
	КонецЕсли;
	
	Возврат ДанныеВозврата;
	
КонецФункции

// Заполняет документ MSWord с использованием настроек автозаполнения
// Параметры:Расширение - расширение файла ("doc" и т.п.)
//			НастройкиЗамены - массив настроек замены
//			ПутьКФайлуНаДиске - путь на компьютере, куда выгружена текущая версия файла
// Возвращает:Путь на диске компьютера, куда сохранена заполненная версия файла
Функция ЗаполнитьФайлMSWordПоДвоичнымДанным(ДвоичныеДанныеФайла, ТекущаяВерсияРасширение, НастройкиЗамены) Экспорт
	
	ПутьКФайлуНаДиске = ПолучитьИмяВременногоФайла(ТекущаяВерсияРасширение);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлуНаДиске);

	Попытка
		СисИнфо = Новый СистемнаяИнформация;
		Если СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
			WordApp = Новый COMОбъект("Word.Application");
		Иначе
			Возврат НСтр("ru = 'Автозаполнение файлов Microsoft Word возможно только в Windows. Обратитесь к администратору.'");
		КонецЕсли;
	Исключение
		ВызватьИсключение(НСтр("ru = 'Ошибка работы с приложением MS Word. Необходимо проверить правильность установки приложения.'"));
	КонецПопытки;

	Док = WordApp.Documents.Add(ПутьКФайлуНаДиске);
	Для Каждого НастройкаЗамены Из НастройкиЗамены Цикл
		Попытка
			Если НастройкаЗамены.ТипЗаменяемойСтроки = Истина Тогда
				Док.FormFields(НастройкаЗамены.ЗаменяемоеЗначение).Result = НастройкаЗамены.ЗначениеЗамены;
			ИначеЕсли НастройкаЗамены.ТипЗаменяемойСтроки = Ложь Тогда
				Док.Content.Find.Execute(НастройкаЗамены.ЗаменяемоеЗначение, , , , , , , , , НастройкаЗамены.ЗначениеЗамены, 2);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла; 	 
	
	Если ТекущаяВерсияРасширение = "docx" Тогда
		Док.SaveAs(ПутьКФайлуНаДиске, 12);                        
	Иначе
		Док.SaveAs(ПутьКФайлуНаДиске, 1);
	КонецЕсли;
	Док.Close(); 
	WordApp.Quit();	
	
	ДвоичныеДанныеЗаполненногоФайла = Новый ДвоичныеДанные(ПутьКФайлуНаДиске);
	УдалитьФайлы(ПутьКФайлуНаДиске);	
	
	Возврат ДвоичныеДанныеЗаполненногоФайла;
	
КонецФункции

// Выполняет замену данных в документе OpenOffice Writer
// Параметры:СтарыйПутьКФайлу - путь на диске, по которому выгружена текущая версия файла
//			ТекущаяВерсияРасширение - расширение файла
//			Файл - ссылка на объект файл, в котором следует выполнить замену
//			МассивДанныхДляАвтоЗамен - массив настроек для заполнения файла данными
// Возвращает:Путь на диске к заполненному файлу
Функция ЗаполнитьФайлOpenOfficeWriter(ДвоичныеДанныеФайла, ТекущаяВерсияРасширение, МассивДанныхДляАвтоЗамен) Экспорт
	
	СтарыйПутьКФайлу = ПолучитьИмяВременногоФайла(ТекущаяВерсияРасширение);
	ДвоичныеДанныеФайла.Записать(СтарыйПутьКФайлу);
	НовыйПутьКФайлу = ПолучитьИмяВременногоФайла(ТекущаяВерсияРасширение);
	
	КопироватьФайл(СтарыйПутьКФайлу, СтрЗаменить(СтарыйПутьКФайлу, ТекущаяВерсияРасширение, "zip"));
	ИмяФайлаСПутемZIP = СтрЗаменить(СтарыйПутьКФайлу, ТекущаяВерсияРасширение, "zip");

	ВременнаяПапкаДляРазархивирования = ПолучитьИмяВременногоФайла("");
	ВременныйZIPФайл = ПолучитьИмяВременногоФайла("zip"); 

	Архив = Новый ЧтениеZipФайла();
	Архив.Открыть(ИмяФайлаСПутемZIP);
	Архив.ИзвлечьВсе(ВременнаяПапкаДляРазархивирования, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	Архив.Закрыть();

	// Заполнение полей в теле документа
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/content.xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/content_update.xml");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
		
	ВыполнитьЗаменуПолейИСтрокВДокументеOpenOfficeWriter(ЧтениеXML, ЗаписьXML, МассивДанныхДляАвтоЗамен);
	ЧтениеXML.Закрыть();
	ЗаписьXML.Закрыть();

	ПереместитьФайл(ВременнаяПапкаДляРазархивирования + "/content_update.xml", ВременнаяПапкаДляРазархивирования + "/content.xml");
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования + "/content_update.xml");

	// заполнение полей в колонтитулах
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/styles.xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/styles_update.xml");
	ЗаписьXML.ЗаписатьОбъявлениеXML(); 

	ВыполнитьЗаменуПолейИСтрокВДокументеOpenOfficeWriter(ЧтениеXML, ЗаписьXML, МассивДанныхДляАвтоЗамен);
	
	ЧтениеXML.Закрыть();
	ЗаписьXML.Закрыть();
	
	ПереместитьФайл(ВременнаяПапкаДляРазархивирования + "/styles_update.xml", ВременнаяПапкаДляРазархивирования + "/styles.xml");
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования + "/styles_update.xml");
	
	Архиватор = Новый ЗаписьZipФайла(ВременныйZIPФайл, "", "");
	Архиватор.Добавить(ВременнаяПапкаДляРазархивирования + "\*.*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	Архиватор.Записать();

	ПереместитьФайл(ВременныйZIPФайл, НовыйПутьКФайлу);
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);	
	
	ДвоичныеДанныеЗаполненногоФайла = Новый ДвоичныеДанные(НовыйПутьКФайлу);
	УдалитьФайлы(СтарыйПутьКФайлу);
	УдалитьФайлы(НовыйПутьКФайлу);
	
	Возврат ДвоичныеДанныеЗаполненногоФайла;
	
КонецФункции

// Осуществляет замену строк в текстовом документе
// Параметры:СтарыйПутьКФайлу - путь к выгруженной версии файла, в котором осуществляется замена
//			ТекущаяВерсияРасширение - расширение файла, в котором производится замена
//			МассивДанныхДляАвтоЗамен - массив данных для замены. Получается функцией ПолучитьМассивАвтозаполненийШаблона
// Возвращает:Путь к измененному файлу, если замена прошла успешно
//			 ПустаяСтрока, если содержимое исходного файла не удалось прочитать
Функция ЗаполнитьТекстовыйФайл(ДвоичныеДанныеФайла, ТекущаяВерсияРасширение, МассивДанныхДляАвтоЗамен) Экспорт
	
	СтарыйПутьКФайлу = ПолучитьИмяВременногоФайла(ТекущаяВерсияРасширение);
	ДвоичныеДанныеФайла.Записать(СтарыйПутьКФайлу);
	НовыйПутьКФайлу = ПолучитьИмяВременногоФайла(ТекущаяВерсияРасширение);
	
	Текст = Новый ЧтениеТекста(СтарыйПутьКФайлу);
	Стр = Текст.Прочитать();
	Текст.Закрыть();
	Если Стр <> Неопределено И НЕ ПустаяСтрока(Стр) Тогда 
		
		Для Каждого НастройкаЗамены Из МассивДанныхДляАвтоЗамен Цикл
			Стр = СтрЗаменить(Стр, НастройкаЗамены.ЗаменяемоеЗначение, НастройкаЗамены.ЗначениеЗамены);
		КонецЦикла;
		
		РезультатЗамены = Новый ЗаписьТекста(НовыйПутьКФайлу);
		РезультатЗамены.Записать(Стр);
		РезультатЗамены.Закрыть();
		
		ДвоичныеДанныеЗаполненногоФайлам = Новый ДвоичныеДанные(НовыйПутьКФайлу);
		УдалитьФайлы(СтарыйПутьКФайлу);
		УдалитьФайлы(НовыйПутьКФайлу);
		Возврат ДвоичныеДанныеЗаполненногоФайлам;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Выполняет замену полей и строк в документе OpenOffice Writer
// Параметры:ЧтениеXML - объект ЧтениеXML, содержащий в себе файл, составляющий OpenOffice документ
//			ЗаписьXML - объект ЧтениеXML, содержащий в себе файл с измененными данными, составляющий OpenOffice документ
//			МассивДанныхДляАвтоЗамен - массив настроек для заполнения файла данными
Процедура ВыполнитьЗаменуПолейИСтрокВДокументеOpenOfficeWriter(ЧтениеXML,ЗаписьXML,МассивДанныхДляАвтоЗамен) Экспорт
	
	ФлагНайденоПоле = Ложь;
	ФлагНайденаСтрока = Ложь;
	СтрЗамены = "";
	СтрПоиска = "";
	ТекстБылЗаписан = Ложь;
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "text:variable-set" Тогда
				ФлагНайденоПоле = Истина;
			ИначеЕсли ЧтениеXML.Имя = "text:p" Тогда
				ФлагНайденаСтрока = Истина;
			ИначеЕсли ЧтениеXML.Имя = "text:span" Тогда
				ФлагНайденаСтрока = Истина;				
			КонецЕсли;

			ЗаписьXML.ЗаписатьНачалоЭлемента(ЧтениеXML.Имя);

			Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					Если ФлагНайденоПоле И ЧтениеXML.Имя = "text:name" Тогда
						СтрПоиска = ЧтениеXML.Значение;
					КонецЕсли;
					ЗаписьXML.ЗаписатьАтрибут(ЧтениеXML.Имя,ЧтениеXML.Значение); 
				КонецЦикла
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если ФлагНайденоПоле Тогда
				Для Каждого НастройкаЗамены Из МассивДанныхДляАвтоЗамен Цикл
					Если НастройкаЗамены.ЗаменяемоеЗначение = СтрПоиска Тогда
						СтрЗамены = НастройкаЗамены.ЗначениеЗамены;
					КонецЕсли;
				КонецЦикла;
				
				Если НЕ ПустаяСтрока(СтрЗамены) Тогда
					ЗаписьXML.ЗаписатьТекст(СтрЗамены);
					ТекстБылЗаписан = Истина;
				Иначе
					ЗаписьXML.ЗаписатьТекст(ЧтениеXML.Значение);
					ТекстБылЗаписан = Истина;
				КонецЕсли;
			ИначеЕсли ФлагНайденаСтрока Тогда
				СтрЗамены = ЧтениеXML.Значение;
				Для Каждого НастройкаЗамены Из МассивДанныхДляАвтоЗамен Цикл
					СтрЗамены = СтрЗаменить(СтрЗамены, НастройкаЗамены.ЗаменяемоеЗначение, НастройкаЗамены.ЗначениеЗамены);
				КонецЦикла;
				ЗаписьXML.ЗаписатьТекст(СтрЗамены);
			Иначе
				ЗаписьXML.ЗаписатьТекст(ЧтениеXML.Значение);
			КонецЕсли;  
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если НЕ ТекстБылЗаписан И ФлагНайденоПоле Тогда
				Для Каждого НастройкаЗамены Из МассивДанныхДляАвтоЗамен Цикл
					Если НастройкаЗамены.ЗаменяемоеЗначение = СтрПоиска Тогда
						СтрЗамены = НастройкаЗамены.ЗначениеЗамены;
					КонецЕсли;
				КонецЦикла;
				ЗаписьXML.ЗаписатьТекст(СтрЗамены);	
			КонецЕсли;
			ЗаписьXML.ЗаписатьКонецЭлемента();
			Если ФлагНайденоПоле Тогда
				ФлагНайденоПоле = Ложь;
				ТекстБылЗаписан = Ложь;
				СтрЗамены = "";
			КонецЕсли;
			Если ФлагНайденаСтрока Тогда
				ФлагНайденаСтрока = Ложь;
				СтрЗамены = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Осуществляет выборку всех полей в файле MSWord
// Параметры:Расширение - расширение файла ("doc" и т.п.)
//			ДвоичныеДанныеФайла - двоичные данные файла
// Возвращает:Массив наименований полей. Массив пустой, если в файле нет полей.
Функция НайтиВсеПоляВФайлеMSWord(Расширение, ДвоичныеДанныеФайла) Экспорт
	
	РезультатПоиска = Новый Массив();
	
	Попытка
		WordApp = Новый COMОбъект("Word.Application");
	Исключение
		Сообщение = НСтр("ru = 'Ошибка работы с приложением MS Word. Необходимо проверить правильность установки приложения.'");
		ВызватьИсключение(Сообщение);
	КонецПопытки;

	ИмяФайлаСПутем = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанныеФайла.Записать(ИмяФайлаСПутем);
	
	Док = WordApp.Documents.Add(ИмяФайлаСПутем);
	Для Каждого Field Из Док.FormFields Цикл
		РезультатПоиска.Добавить(Field.Name);
	КонецЦикла;
	
	Док.Close(); 
	WordApp.Quit(); 
	
	Возврат РезультатПоиска;
	
КонецФункции

// Осуществляет поиск в файле MSWord полей и строк, которые указаны в массиве автозамен
// Параметры:Расширение - расширение файла ("doc" и т.п.)
//			НастройкиЗамены - массив автозамен в файле
//			ДвоичныеДанныеФайла - ДвоичныеДанные последней версии файла
// Возвращает:Текст сообщения об ошибке с использованием НСтр() с 
// Перечислением отсутствующих полей и строк, если какое-либо поле 
// Или строка не найдена
//			 ПустаяСтрока, если все поля и строки присутствуют в файле
Функция ПроверитьНаличиеПолейИСтрокВФайлеMSWord(Расширение, НастройкиЗамены, ДвоичныеДанныеФайла) Экспорт
	
	Попытка
		WordApp = Новый COMОбъект("Word.Application");    
	Исключение
		Возврат НСтр("ru = 'Ошибка работы с приложением MS Word. Необходимо проверить правильность установки приложения.'");
	КонецПопытки;

	ИмяФайлаСПутем = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанныеФайла.Записать(ИмяФайлаСПутем);
		
	Док = WordApp.Documents.Add(ИмяФайлаСПутем); 
	
	МассивПолейШаблона = Новый Массив;
	Для Каждого Field из Док.FormFields Цикл
		МассивПолейШаблона.Добавить(Field.Name);
	КонецЦикла;

	Для Каждого НастройкаЗамены Из НастройкиЗамены Цикл
		
		Если ПустаяСтрока(НастройкаЗамены.ЗаменяемоеЗначение) Тогда
			Возврат НСтр("ru = 'Необходимо указать строку или поле для замены'");
		КонецЕсли;
		
		Если НастройкаЗамены.ТипЗаменяемойСтроки = Истина Тогда
			Если МассивПолейШаблона.Найти(НастройкаЗамены.ЗаменяемоеЗначение) = Неопределено Тогда 
				ОписаниеОшибкиПоля = ОписаниеОшибкиПоля + НастройкаЗамены.ЗаменяемоеЗначение + Символы.ВК;
			КонецЕсли;
		ИначеЕсли НастройкаЗамены.ТипЗаменяемойСтроки = Ложь Тогда
			Если НЕ WordApp.Selection.Find.Execute(НастройкаЗамены.ЗаменяемоеЗначение,,,,,,Истина)
				И НЕ WordApp.Selection.Find.Execute(НастройкаЗамены.ЗаменяемоеЗначение,,,,,,Ложь) Тогда
				ОписаниеОшибкиСтроки = ОписаниеОшибкиСтроки + НастройкаЗамены.ЗаменяемоеЗначение + Символы.ВК;
			Иначе 
				WordApp.Selection.Collapse();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

	Идентификатор = Новый УникальныйИдентификатор();
	Док.Close(); 
	WordApp.Quit(); 

	УдалитьФайлы(ИмяФайлаСПутем);
	
	Если ЗначениеЗаполнено(ОписаниеОшибкиПоля) Тогда
		Возврат НСтр("ru = '" + "Следующие поля отсутствуют в шаблоне:" + Символы.ВК + ОписаниеОшибкиПоля + "'");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОписаниеОшибкиСтроки) Тогда
		Возврат НСтр("ru = '" + "Следующие строки отсутствуют в шаблоне:" + Символы.ВК + ОписаниеОшибкиСтроки + "'");
	КонецЕсли;
	Возврат "";
	
КонецФункции

// Осуществляет выборку всех полей в файле MSWord
// Параметры:Расширение - расширение файла ("doc" и т.п.)
//			ДвоичныеДанныеФайла - двоичные данные файла
// Возвращает:Массив наименований полей. Массив пустой, если в файле нет полей.
Функция НайтиВсеПоляВФайлеOpenOfficeWriter(Расширение, ДвоичныеДанныеФайла) Экспорт
	
	СписокПолей = Новый Массив();

	ИмяФайлаСПутем = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанныеФайла.Записать(ИмяФайлаСПутем);

	КопироватьФайл(ИмяФайлаСПутем, СтрЗаменить(ИмяФайлаСПутем, Расширение, "zip"));
	ИмяФайлаСПутемZIP = СтрЗаменить(ИмяФайлаСПутем, Расширение, "zip");

	ВременнаяПапкаДляРазархивирования = ПолучитьИмяВременногоФайла("");
	ВременныйZIPФайл = ПолучитьИмяВременногоФайла("zip"); 

	Архив = Новый ЧтениеZipФайла();
	Архив.Открыть(ИмяФайлаСПутемZIP);
	Архив.ИзвлечьВсе(ВременнаяПапкаДляРазархивирования, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	Архив.Закрыть();
	ЧтениеXML = Новый ЧтениеXML(); 
	
	// Поиск полей в теле шаблона
	ЧтениеXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/content.xml");
	РезультатПроверки = НайтиПоляВФайлеOpenOfficeWriter(ЧтениеXML);
	ЧтениеXML.Закрыть();
	Для Каждого Элемент Из РезультатПроверки Цикл
		Если СписокПолей.Найти(Элемент) = Неопределено Тогда
			СписокПолей.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	// Поиск полей в колонтитулах шаблона
	ЧтениеXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/styles.xml");
	РезультатПроверки = НайтиПоляВФайлеOpenOfficeWriter(ЧтениеXML);
	ЧтениеXML.Закрыть();
	Для Каждого Элемент Из РезультатПроверки Цикл
		Если СписокПолей.Найти(Элемент) = Неопределено Тогда
			СписокПолей.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);
	УдалитьФайлы(ИмяФайлаСПутемZIP);	
	
	Возврат СписокПолей;
	
КонецФункции

// Осуществляет поиск полей (переменных) в файле OpenOfficeWriter
// Параметры:ЧтениеXML - объект типа ЧтениеXML, в который загружена часть файла OpenOffice.
//						content.xml - тело файла
//						styles.xml - верхний и нижний колонтитулы
// Возвращает:Массив наименований полей в указанной части файла. Массив пустой, если полей не найдено.
Функция НайтиПоляВФайлеOpenOfficeWriter(ЧтениеXML) Экспорт
	
	ДанныеДляВозврата = Новый Массив();
	ФлагНайденоПоле = Ложь;
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "text:variable-set" Тогда
				ФлагНайденоПоле = Истина;
			КонецЕсли;
			Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					Если ФлагНайденоПоле И ЧтениеXML.Имя = "text:name" Тогда
						ДанныеДляВозврата.Добавить(ЧтениеXML.Значение);
					КонецЕсли;
				КонецЦикла
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если ФлагНайденоПоле Тогда
				ФлагНайденоПоле = Ложь;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеДляВозврата;
	
КонецФункции

// Функция, ищет данные в файле.
//  Параметры:
//   ПутьКФайлу - строка, путь к файлу;
//   ИскомыеДанные - что ищем;
//   ТипИскомыхДанных - тип данных
// Возвращаемое значение:
//   Найдено - булево, признак найденных данных.
//        
Функция НайтиДанныеВФайлеOpenOfficeWriter(ПутьКФайлу, ИскомыеДанные, ТипИскомыхДанных) Экспорт
	
	КопироватьФайл(ПутьКФайлу, СтрЗаменить(НРег(ПутьКФайлу), "odt", "zip"));
	ИмяФайлаСПутемZIP = СтрЗаменить(НРег(ПутьКФайлу), "odt", "zip");

	ВременнаяПапкаДляРазархивирования = ПолучитьИмяВременногоФайла("");
	ВременныйZIPФайл = ПолучитьИмяВременногоФайла("zip"); 

	Архив = Новый ЧтениеZipФайла();
	Архив.Открыть(ИмяФайлаСПутемZIP);
	Архив.ИзвлечьВсе(ВременнаяПапкаДляРазархивирования, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	Архив.Закрыть();
	ЧтениеXML = Новый ЧтениеXML();
	
	ЧтениеXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/content.xml");
	РезультатПроверкиТела = ПроверитьНаличиеПолейИСтрокВФайлеOpenOfficeWriter(ЧтениеXML, ИскомыеДанные, ТипИскомыхДанных);
	ЧтениеXML.Закрыть();
	
	ЧтениеXML.ОткрытьФайл(ВременнаяПапкаДляРазархивирования + "/Styles.xml");
	РезультатПроверкиКолонтитулы = ПроверитьНаличиеПолейИСтрокВФайлеOpenOfficeWriter(ЧтениеXML, ИскомыеДанные, ТипИскомыхДанных);
	ЧтениеXML.Закрыть();
	
	Если ПустаяСтрока(РезультатПроверкиТела)
		ИЛИ ПустаяСтрока(РезультатПроверкиКолонтитулы) Тогда
		Найдено = Истина;
	Иначе
		Найдено = Ложь;
	КонецЕсли;
	
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);
	УдалитьФайлы(ИмяФайлаСПутемZIP);	
	
	Возврат Найдено;
	
КонецФункции

// Проверяет наличие полей для ввода и текстовых строк в OpenOffice Writer документе
// Параметры:ЧтениеXML - объект ЧтениеXML, содержащий в себе файл, составляющий OpenOffice документ
//			ПолеДляПоиска - имя искомого поля либо искомая строка
//			РежимПоиска - режим поиска. Допустимые значения - "Поле" и "Строка"
// Возвращает:ПустаяСтрока, если искомое поле или строка найдены
//			 Значение параметра ПолеДляПоиска, если искомые данные не найдены
Функция ПроверитьНаличиеПолейИСтрокВФайлеOpenOfficeWriter(ЧтениеXML, ПолеДляПоиска, РежимПоиска) Экспорт
	
	ФлагНайденоПоле = Ложь;
	ФлагНайденаСтрока = Ложь;
	СтрПоиска = "";

	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если РежимПоиска = "Поле" Тогда
				Если ЧтениеXML.Имя = "text:variable-set" Тогда
					ФлагНайденоПоле = Истина;
				КонецЕсли;
			ИначеЕсли РежимПоиска = "Строка" Тогда
				Если ЧтениеXML.Имя = "text:p" Тогда
					ФлагНайденаСтрока = Истина;
				КонецЕсли;
			КонецЕсли;

			Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					Если ФлагНайденоПоле И ЧтениеXML.Имя = "text:name" Тогда
						СтрПоиска = ЧтениеXML.Значение;
						Если ПолеДляПоиска = СтрПоиска И ФлагНайденоПоле Тогда
							Возврат "";
						КонецЕсли;
					КонецЕсли;
				КонецЦикла
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если ФлагНайденоПоле Тогда
				Если ПолеДляПоиска = СтрПоиска Тогда
					Возврат "";
				КонецЕсли;
			КонецЕсли;
			Если ФлагНайденаСтрока Тогда
				Если СтрЧислоВхождений(ЧтениеXML.Значение, ПолеДляПоиска) > 0 Тогда
					Возврат "";
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если ФлагНайденоПоле И ЧтениеXML.Имя = "text:variable-set" Тогда
				ФлагНайденоПоле = Ложь;
			КонецЕсли; 
			Если ФлагНайденаСтрока И ЧтениеXML.Имя = "text:p" Тогда
				ФлагНайденаСтрока = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПолеДляПоиска;
	
КонецФункции

#КонецОбласти 

#КонецЕсли	
