
#Область СлужебныйПрограммныйИнтерфейс

// Получить текущие напоминания текущего пользователя.Если передать ссылку на клиента
// будет произведено получение задач и по посещениям
Процедура ПроверитьТекущиеНапоминанияСтоматология() Экспорт
	
	// Получить задачи по времени выполнения
	ЗадачиПользователя = ПользователиСтоматология.ПолучитьТекущиеЗадачиПользователяПоВремени();
	Если ЗадачиПользователя.Количество() > 0 Тогда

		ПараметрыОткрытия = Новый Структура("Задачи", ЗадачиПользователя);
		КлючУникальности = "НапоминанияПользователюОЗадачах";		
		ФормаНапоминания = ПолучитьФорму("Задача.ЗадачаПользователей.Форма.ФормаНапоминания", ПараметрыОткрытия,, КлючУникальности);
		
		Если ФормаНапоминания.Открыта() Тогда
			ФормаНапоминания.ЗагрузитьЗадачи(ЗадачиПользователя);
		Иначе 
			ФормаНапоминания.Открыть();
		КонецЕсли;

		// ПоказатьОповещениеПользователя(НСтр("ru = 'Резервное копирование'"), "e1cib/app/Обработка.НастройкаРезервногоКопированияИБ", 
		//		ТекстПояснения, БиблиотекаКартинок.Предупреждение32);

	КонецЕсли;
	
КонецПроцедуры

// Получить текущие напоминания текущего пользователя.Если передать ссылку на клиента
// будет произведено получение задач и по посещениям
Процедура ПроверитьТекущиеНапоминанияПоПосещениямСтоматология(Клиент) Экспорт
	
	// Получить задачи по посещению клиента
	ЗадачиПоПосещениям = ПользователиСтоматология.ПолучитьТекущиеЗадачиПользователяПоПосещениюКлиента(Клиент);
	ФормаНапоминания = ПолучитьФорму("Задача.ЗадачаПользователей.Форма.ФормаНапоминания", Новый Структура("Задачи", ЗадачиПоПосещениям), , "НапоминанияПользователюОЗадачахПоПосещению");
	Если ЗадачиПоПосещениям.Количество() > 0 Тогда
		Если ФормаНапоминания.Открыта() Тогда
			ФормаНапоминания.ЗагрузитьЗадачи(ЗадачиПоПосещениям);
		Иначе 
			ФормаНапоминания.Открыть();
		КонецЕсли;
	ИначеЕсли ЗадачиПоПосещениям.Количество() = 0 И ФормаНапоминания.Открыта() Тогда
		ФормаНапоминания.Закрыть();
	КонецЕсли;
		
КонецПроцедуры 

#КонецОбласти