
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор(); 
	
	СотрудникОтбораПомещений = Неопределено;
	Параметры.Свойство("СотрудникОтбораПомещений", СотрудникОтбораПомещений);	
	СотрудникОтбораПомещений = ?(ЗначениеЗаполнено(СотрудникОтбораПомещений), СотрудникОтбораПомещений, ПараметрыСеанса.ТекущийСотрудник);
	
	МассивСтруктурныхЕдиниц = Справочники.Сотрудники.ПолучитьМестаРаботыСотрудника(СотрудникОтбораПомещений, "Массив",,, Ложь);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", МассивСтруктурныхЕдиниц, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
		
	УстановитьУсловноеОформление(МассивСтруктурныхЕдиниц);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Установить условное оформление.
//
Процедура УстановитьУсловноеОформление(МассивСтруктурныхЕдиниц)

	Список.УсловноеОформление.Элементы.Очистить();
	ЭлементУФ = Список.УсловноеОформление.Элементы.Добавить();
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Видимость" , Ложь);
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Отображать" , Ложь);
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	Если НЕ ТипЗнч(МассивСтруктурныхЕдиниц) = Тип("Массив")
		ИЛИ НЕ ТипЗнч(МассивСтруктурныхЕдиниц) = Тип("СписокЗначений") Тогда
		
		МассивСтруктурныхЕдиниц = Новый_Массив(МассивСтруктурныхЕдиниц);			
	КонецЕсли;
	
	ЭлементОтбора                = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение = МассивСтруктурныхЕдиниц; 
	ЭлементОтбора.Использование  = Истина;
	
КонецПроцедуры

#КонецОбласти
