
#Область СлужебныйПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура - Перед записью
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если ПустаяСтрока(Запись.Поле) 
			И НЕ Запись.СложныйАлгоритм Тогда  
			//И НЕ ТипЗнч(Запись.Вариант)=Тип("СправочникСсылка.ВариантыДополнительныхОтчетов") Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено поле привязки'"),,,, Отказ);
			Возврат;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти