
#Область ОбработчикиКомандФормы

// Процедура обработчик команды "КомандаОК"
//
&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(ПоместитьВХранилище());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура помещает данные серийных номеров во временное хранилище 
//
&НаСервере
Функция ПоместитьВХранилище()
	
 Возврат  ?(Объект.СерийныеНомера.Количество() > 0, ПоместитьВоВременноеХранилище(Объект.СерийныеНомера.Выгрузить()), Неопределено);	
	
КонецФункции

&НаСервере
// Функция, выполняет конроль срока действия сертификата
//
Функция СертификатДействителен(СерийныйНомер)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Сертификаты.Период КАК ДатаПродажи
	                      |ИЗ
	                      |	РегистрНакопления.Сертификаты КАК Сертификаты
	                      |ГДЕ
	                      |	Сертификаты.Сертификат = &Сертификат
	                      |	И Сертификаты.СерийныйНомер = &СерийныйНомер
	                      |	И Сертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	Запрос.УстановитьПараметр("Сертификат",    Объект.Номенклатура);
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Объект.Номенклатура.Периодичность = Перечисления.Периодичность.Месяц Тогда
			ДатаПродажи = ДобавитьМесяц(Выборка.ДатаПродажи, Объект.Номенклатура.КоличествоПериодовДействия);
		Иначе
			ДатаПродажи = Выборка.ДатаПродажи + (Объект.Номенклатура.КоличествоПериодовДействия * 86400);
		КонецЕсли;
		
		Если Дата > ДатаПродажи Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(""+Объект.Номенклатура+" просрочен!");
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаНомеровПриНачале

// Процедура обработчик события "ПриНачалеРедактирования"
//
&НаКлиенте
Процедура ТаблицаНомеровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элемент.ТекущиеДанные.КлючСтроки = Объект.НомерСтрокиТабличнойЧасти;
	
КонецПроцедуры

// Процедура обработчик события "ПриИзмененении"
//
&НаКлиенте
Процедура ТаблицаНомеровСерийныйНомерПриИзменении(Элемент)
	
	ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("СерийныйНомер", Элементы.ТаблицаНомеров.ТекущиеДанные.СерийныйНомер);
	НайденныеСтроки = Объект.СерийныеНомера.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество()>1 Тогда		
		Элементы.ТаблицаНомеров.ТекущиеДанные.СерийныйНомер = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Серийный номер уже был указан в документе!");		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ТаблицаНомеровСерийныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыВыбораСписка = Новый Структура;
	
	ПараметрыФормы  = Новый Структура;
	ПараметрыФормы.Вставить("Владелец"             ,Объект.Номенклатура);
	ПараметрыФормы.Вставить("ОтборСерииСертификата",Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаНомеровСерийныйНомерНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПартииНоменклатуры.Форма.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Таблица номеров серийный номер начало выбора завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ТаблицаНомеровСерийныйНомерНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Если ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Номенклатура, "ТипСрокаДействия") = ПредопределенноеЗначение("Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи") Тогда
			Если СертификатДействителен(Результат) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;		
		Элементы.ТаблицаНомеров.ТекущиеДанные.СерийныйНомер = Результат.СерийныйНомер;
		Элементы.ТаблицаНомеров.ТекущиеДанные.КлючСтроки = Объект.НомерСтрокиТабличнойЧасти;
	КонецЕсли;	
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СерийныйНомер", Элементы.ТаблицаНомеров.ТекущиеДанные.СерийныйНомер);
	НайденныеСтроки = Объект.СерийныеНомера.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество()>1 Тогда		
		// Элементы.ТаблицаНомеров.ТекущиеДанные.СерийныйНомер = Неопределено;
		Объект.СерийныеНомера.Удалить(Элементы.ТаблицаНомеров.ТекущаяСтрока);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Серийный номер уже был указан в документе!");		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


