
#Область СлужебныеПроцедурыИФункции

// Функция, возвращает представление расширенной цены.
//
Функция ПолучитьПредставленияРасширенногоЦенообразования(ДеньНедели, ВремяС, ВремяПо) Экспорт
	
	СписокДнейНедели = Новый Соответствие;
	СписокДнейНедели.Вставить(0, Нстр("ru = 'Ежедневно'; en = 'Daily'"));
	СписокДнейНедели.Вставить(1, Нстр("ru = 'Понедельник'; en = 'Monday'"));
	СписокДнейНедели.Вставить(2, Нстр("ru = 'Вторник'; en = 'Tuesday'"));
	СписокДнейНедели.Вставить(3, Нстр("ru = 'Среда'; en = 'Wednesday'"));
	СписокДнейНедели.Вставить(4, Нстр("ru = 'Четверг'; en = 'Thursday'"));
	СписокДнейНедели.Вставить(5, Нстр("ru = 'Пятница'; en = 'Friday'"));
	СписокДнейНедели.Вставить(6, Нстр("ru = 'Суббота'; en = 'Saturday'"));
	СписокДнейНедели.Вставить(7, Нстр("ru = 'Воскресенье'; en = 'Sunday'"));
	СписокДнейНедели.Вставить(8, Нстр("ru = 'Рабочие дни'; en = 'Working days'"));
	СписокДнейНедели.Вставить(9, Нстр("ru = 'Выходные дни'; en = 'Weekend'"));
	
	НачалоПериодаДействия 	 = ?(ЗначениеЗаполнено(ВремяС), Нстр("ru = ' с '; en = ' from '") + Формат(ВремяС, "ДФ=HH:mm"), "");
	ОкончаниеПериодаДействия = ?(ЗначениеЗаполнено(ВремяПо), Нстр("ru = ' по '; en = ' to '") + Формат(ВремяПо, "ДФ=HH:mm"), "");
	
	Возврат СписокДнейНедели[ДеньНедели] + НачалоПериодаДействия + ОкончаниеПериодаДействия;
	
КонецФункции
// Функция, возвращает цены номенклатуры.
//
Функция ПолучитьЦеныНомеклатуры(Номенклатура,
								СтруктурнаяЕдиница 	 	   = Неопределено,
								ВидЦен 				 	   = Неопределено,
								Знач ПериодНачало 	 	   = Неопределено,
								Знач ПериодОкончание 	   = Неопределено,
								РасширенноеЦенообразование = Истина,
								Упаковка                   = Неопределено) Экспорт
	
	СтруктурнаяЕдиница 		   = ?(СтруктурнаяЕдиница = Неопределено, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, СтруктурнаяЕдиница);
	ИспользоватьОтборПоВремени = ?(РасширенноеЦенообразование, ПериодНачало <> Неопределено, Ложь);
	ДатаПериод 				   = ПериодНачало;
	ДобавитьДень			   = ИспользоватьОтборПоВремени И ЗначениеЗаполнено(ПериодОкончание) И День(ПериодНачало) <> День(ПериодОкончание);
	ПериодНачалоТолькоВремя    = Дата(1,1,1) + ?(ЗначениеЗаполнено(ПериодНачало), (ПериодНачало - НачалоДня(ПериодНачало)), 0);
	ПериодОкончаниеТолькоВремя = Дата(1,1,1) + ?(ЗначениеЗаполнено(ПериодОкончание), (ПериодОкончание - НачалоДня(ПериодОкончание)), 0) + ?(ДобавитьДень, 86400, 0);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
	|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныНоменклатурыСрезПоследних.ДеньНедели КАК ДеньНедели,
	|	ЦеныНоменклатурыСрезПоследних.ВремяНачала КАК ВремяНачала,
	|	ЦеныНоменклатурыСрезПоследних.ВремяОкончания КАК ВремяОкончания,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаПериод,
	|			Номенклатура = &Номенклатура
	|				И Актуальность
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И &ВидЦен
	|				И &ИспользоватьОтборПоВремени
	|				И &Упаковка) КАК ЦеныНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Упаковка,
	|	ДеньНедели,
	|	ВремяНачала");
	
	Запрос.УстановитьПараметр("Номенклатура"	  		  , Номенклатура);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		  , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ВидЦен"			  		  , ВидЦен);  
	Запрос.УстановитьПараметр("Упаковка"		          , Упаковка);
	Запрос.УстановитьПараметр("ДатаПериод"			  	  , ДатаПериод);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВремени", ИспользоватьОтборПоВремени);
	Запрос.УстановитьПараметр("ПериодНачалоТолькоВремя"	  , ПериодНачалоТолькоВремя);
	Запрос.УстановитьПараметр("ПериодОкончаниеТолькоВремя", ПериодОкончаниеТолькоВремя);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидЦен", ?(ВидЦен = Неопределено, "Истина", "ВидЦен = &ВидЦен"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаПериод", ?(ДатаПериод = Неопределено, "", "&ДатаПериод"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Упаковка"  , ?(Упаковка   = Неопределено , "Истина", "Упаковка = &Упаковка"));
	
	Если ИспользоватьОтборПоВремени Тогда
		
		УсловиеОтбораПоВремени =
		"И ВЫБОР
		|	КОГДА Номенклатура.РасширенноеВременноеЦенообразование = ИСТИНА
		|		ТОГДА (ДеньНедели = ДЕНЬНЕДЕЛИ(&ДатаПериод)
		|				ИЛИ ДеньНедели = 0
		|				ИЛИ ДеньНедели = 8 И ДЕНЬНЕДЕЛИ(&ДатаПериод) Между 1 И 5
		|				ИЛИ ДеньНедели = 9 И ДЕНЬНЕДЕЛИ(&ДатаПериод) Между 6 И 7)
		|				И &УсловиеПериодОкончания
		|				И (ВремяОкончания > &ПериодНачалоТолькоВремя
		|					ИЛИ ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	ИНАЧЕ ИСТИНА
		|КОНЕЦ";
		
		УсловиеПериодОкончания = ?(ЗначениеЗаполнено(ПериодОкончание), "И (ВремяНачала < &ПериодОкончаниеТолькоВремя ИЛИ ВремяНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))", "");
		УсловиеОтбораПоВремени = СтрЗаменить(УсловиеОтбораПоВремени, "И &УсловиеПериодОкончания", УсловиеПериодОкончания);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ИспользоватьОтборПоВремени", УсловиеОтбораПоВремени);
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ИспользоватьОтборПоВремени", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти