
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, обраотчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Отбор.Номенклатура.Значение) и ЭтотОбъект.Отбор.Номенклатура.Значение.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для данного типа номенклатуры цены не указываются!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	НаборЗаписей = ОбщегоНазначенияСтоматология.ПолучитьСтарыйНаборПередЗаписьюРегистра(ЭтотОбъект, Замещение);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("НаборПередЗаписьюРегистра", НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти