
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(Параметры.Основание) Тогда
		Параметры.Основание.Свойство("ОкрытИзСписка", ОткрытаИзСписка);
	КонецЕсли;
	Элементы.ПодчиненРеквизиту.Видимость = НЕ ОткрытаИзСписка;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры 

&НаКлиенте
// Обработчик перед записью на клиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	
	Объект.Наименование = Объект.ТекстШаблона;//?(СтрДлина(Объект.ТекстШаблона) > 25,Лев(Объект.ТекстШаблона,20) + "...",Объект.ТекстШаблона);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

 &НаСервере
// Функция скрывает не основные элементы
//
Процедура СкрытьНеОсновныеЭлементы() Экспорт  
	
	Элементы.Родитель.Видимость          = Ложь;
	Элементы.ПодчиненРеквизиту.Видимость = Ложь;
	Элементы.ПодчиненДиагнозу.Видимость  = Ложь;  
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодчиненДиагнозуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ФормаШаблоновТекстовыхРеквизитов", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыборДиагноза", ЭтотОбъект);	
	ОткрытьФорму("Справочник.Диагнозы.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

 &НаКлиенте
Процедура НачатьВыборДиагноза(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПодчиненДиагнозу = Результат;  
 	
КонецПроцедуры


#КонецОбласти




