
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	АктивироватьПапкуКлиентаПоУмолчанию();	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список,,,,, Ложь);		
	ИмяКлючаОбъекта = СтрЗаменить(ИмяФормы, ".", "");
  	СохраненноеЗначениеЭлектроннаяКарта = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + "_ОтборЭлектроннаяКарта");	
	Если ЗначениеЗаполнено(СохраненноеЗначениеЭлектроннаяКарта) Тогда 
		ОтборЭлектроннаяКарта = СохраненноеЗначениеЭлектроннаяКарта;
	КонецЕсли;
	
	ПредставлениеДатаРегистрации = РаботаСОтборами.ОбновитьПредставлениеПериода(ОтборДатаРегистрации, "Дата регистрации: ");
	ПредставлениеДатаПриема      = РаботаСОтборами.ОбновитьПредставлениеПериода(ОтборДатаПриема, "Дата приема: ");

	Элементы.ОтборТелефон.СписокВыбора.Добавить("Заполнен телефон"   , "Заполнен телефон");
	Элементы.ОтборТелефон.СписокВыбора.Добавить("Не заполнен телефон", "Не заполнен телефон");	
	ТекущаяСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ОтборыЗаполнены = (ДанныеМеток.Количество() <> 0
		Или ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаРегистрации.ДатаНачала) 
		Или ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаРегистрации.ДатаОкончания) 
		Или ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастОт)
		Или ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастДо)
		Или ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаНачала)
		Или ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаОкончания)
		Или ЗначениеЗаполнено(ЭтотОбъект.ОтборТелефон)
		Или ЭтотОбъект.ОтборЭлектроннаяКарта = Истина);
		
	УстановитьЗапросДинамическогоСписка(ОтборыЗаполнены);  
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Справочники.Контрагенты, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды "ИзменитьВыделенные"
//
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточника(Команда)
	
	ПоказатьПомощникЗагрузкиДанныхИзВнешнегоИсточника();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработка выбора фильтра "Салон" 
//
Процедура СалонОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	

	УстановитьМеткуИПараметрСписка("ОтборСалон", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура СтатусОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИПараметрСписка("ОтборСтатус", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ПолОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИПараметрСписка("ОтборПол", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура МеткаОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИПараметрСписка("ОтборМетка", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры


&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ОтборРекламныйИсточникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИПараметрСписка("ОтборРекламныйИсточник", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ОтборТелефонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ПометкаВыбора = (ВыбранноеЗначение = "Не заполнен телефон");
	
	УстановитьМеткуИПараметрСписка("НеЗаполненТелефон", Элемент.Родитель.Имя, ПометкаВыбора, ВыбранноеЗначение);
	
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ОтборСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИПараметрСписка("ОтборЛичныйВрач", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОтборЭлектроннаяКартаПриИзменении".
//
Процедура ОтборЭлектроннаяКартаПриИзменении(Элемент)
	
	УстановитьЗапросДинамическогоСписка();

	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор возраст от окончание ввода текста.
//
Процедура ОтборВозрастОтОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Возраст = Число(Текст);
	
	Если ЗначениеЗаполнено(Возраст)
		И ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастДо) 
		И Возраст > ЭтотОбъект.ОтборВозрастДо Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не верно введен отбор Возраст: значение должено быть меньше либо равно " + ЭтотОбъект.ОтборВозрастДо);
		// Неявный вызов перезаписи значения.
		ЭтотОбъект.ОтборВозрастОт = ЭтотОбъект.ОтборВозрастОт;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор возраст от при изменении.
//
Процедура ОтборВозрастОтПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастДо) 
		И ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастОт) Тогда
		
		ЭтотОбъект.ОтборВозрастДо = 99;
		
	КонецЕсли;
	
	УстановитьЗапросДинамическогоСписка();

	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор возраст до окончание ввода текста.
//
Процедура ОтборВозрастДоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Возраст = Число(Текст);
	
	Если ЗначениеЗаполнено(Возраст)
		И ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастОт)
		И Возраст < ЭтотОбъект.ОтборВозрастОт Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не верно введен отбор Возраст: значение должено быть больше либо равно " + ЭтотОбъект.ОтборВозрастОт);
		// Неявный вызов перезаписи значения.
		ЭтотОбъект.ОтборВозрастДо = ЭтотОбъект.ОтборВозрастДо;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор возраст до при изменении.
//
Процедура ОтборВозрастДоПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастДо) Тогда
		ЭтотОбъект.ОтборВозрастОт = 0;
	КонецЕсли;
	
	УстановитьЗапросДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ОтборУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоГруппа = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "ЭтоГруппа");
	Если ЭтоГруппа = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Группа недоступна для отбора.");
		ВыбранноеЗначение = Неопределено;
		Возврат;
    КонецЕсли;	
	УстановитьМеткуИПараметрСписка("ОтборУслуга", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура ПредставлениДатаРегистрацииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ОтборДатаРегистрации;
	Оповещение = Новый ОписаниеОповещения("ПредставлениДатаРегистрацииПриИзмененииЗавершение", ЭтотОбъект);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения процедуры "ПредставлениДатаРегистрацииНажатие".
//
Процедура ПредставлениДатаРегистрацииПриИзмененииЗавершение(НовыйПериод, Параметры) Экспорт
	
	Если НовыйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НовыйПериод)=Тип("СтандартныйПериод") Тогда
		ОтборДатаРегистрации = НовыйПериод;
	ИначеЕсли ТипЗнч(НовыйПериод)=Тип("Дата") Тогда
		ОтборДатаРегистрации.ДатаОкончания = НовыйПериод;
	КонецЕсли;
	
	ПредставлениеДатаРегистрации = РаботаСОтборами.ОбновитьПредставлениеПериода(ОтборДатаРегистрации, "Дата регистрации: ");
	
	#Если ВебКлиент Тогда
		ОбновитьОтображениеДанных();
	#КонецЕсли 
	
	УстановитьЗапросДинамическогоСписка();
	
КонецПроцедуры

&НаСервере
// Процедура - Установить метку и параметр списка.
//
Процедура УстановитьМеткуИПараметрСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения = "")
	
	Если Не ЗначениеЗаполнено(ПредставлениеЗначения) Тогда
		ПредставлениеЗначения = Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения,, ИмяПоляОтбораСписка);
	
	УстановитьЗапросДинамическогоСписка();
	
КонецПроцедуры

// Процедура - Установить запрос динамического списка
//
&НаСервере
Процедура УстановитьЗапросДинамическогоСписка(ОтборыЗаполнены = Истина, ОтборСтатусы = Неопределено)
		
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникКонтрагенты.Ссылка КАК Ссылка,
	|	СправочникКонтрагенты.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникКонтрагенты.Родитель КАК Родитель,
	|	СправочникКонтрагенты.ЭтоГруппа КАК ЭтоГруппа,
	|	СправочникКонтрагенты.Код КАК Код,
	|	СправочникКонтрагенты.Наименование КАК Наименование,
	|	СправочникКонтрагенты.БанковскийСчетПоУмолчанию КАК БанковскийСчетПоУмолчанию,
	|	СправочникКонтрагенты.ВидЦен_Удалить КАК ВидЦен_Удалить,
	|	СправочникКонтрагенты.ДатаРегистрации КАК ДатаРегистрации,
	|	СправочникКонтрагенты.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
	|	СправочникКонтрагенты.Имя КАК Имя,
	|	СправочникКонтрагенты.ИНН КАК ИНН,
	|	СправочникКонтрагенты.ИсточникИнформации КАК ИсточникИнформации,
	|	СправочникКонтрагенты.КодПоОКПО КАК КодПоОКПО,
	|	СправочникКонтрагенты.КодСинхронизации КАК КодСинхронизации,
	|	СправочникКонтрагенты.КПП КАК КПП,
	|	СправочникКонтрагенты.Куратор КАК Куратор,
	|	СправочникКонтрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	СправочникКонтрагенты.Отчество КАК Отчество,
	|	СправочникКонтрагенты.ПолКлиента КАК ПолКлиента,
	|	СправочникКонтрагенты.Профессия КАК Профессия,
	|	СправочникКонтрагенты.РеестровыйНомерОМС КАК РеестровыйНомерОМС,
	|	СправочникКонтрагенты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СправочникКонтрагенты.ТекущаяМедицинскаяКарта.КодБезНулей КАК ТекущаяМедицинскаяКарта,
	|	СправочникКонтрагенты.ТипКонтрагента КАК ТипКонтрагента,
	|	СправочникКонтрагенты.Фамилия КАК Фамилия,
	|	СправочникКонтрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
	|	СправочникКонтрагенты.Предопределенный КАК Предопределенный,
	|	СправочникКонтрагенты.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ЛОЖЬ КАК НеЗаполненТелефон,
	|	КонтрагентыСведенияДляСписка.ДатаПоследнегоПриема КАК ДатаПоследнегоПриема,
	|	КонтрагентыСведенияДляСписка.ДатаПервогоПриема КАК ДатаПервогоПриема,
	|	КонтрагентыСведенияДляСписка.ДатаСледующегоПриема КАК ДатаСледующегоПриема,
	|	КонтрагентыСведенияДляСписка.КоличествоПриемов КАК КоличествоПриемов,
	|	ВЫБОР
	|		КОГДА СправочникКонтрагенты.ДатаРожденияКлиента <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ДЕНЬГОДА(&ТекущаяДата) > ДЕНЬГОДА(СправочникКонтрагенты.ДатаРожденияКлиента)
	|						ТОГДА РАЗНОСТЬДАТ(СправочникКонтрагенты.ДатаРожденияКлиента, &ТекущаяДата, ГОД)
	|					ИНАЧЕ (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(СправочникКонтрагенты.ДатаРожденияКлиента, &ТекущаяДата, ГОД) КАК ЧИСЛО)) - 1
	|				КОНЕЦ
	|	КОНЕЦ КАК Возраст,
	|	ВЫБОР
	|		КОГДА СправочникКонтрагенты.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СправочникКонтрагенты.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВариантКартинки,
	|	СправочникКонтрагенты.Телефон КАК Телефон,
	|	КонтрагентыСведенияДляСписка.Статус КАК СтатусПациента
	|ИЗ
	|	Справочник.Контрагенты КАК СправочникКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|		ПО СправочникКонтрагенты.Ссылка = КонтрагентыСведенияДляСписка.Контрагент
	|ГДЕ
	|	СправочникКонтрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
	|	И НЕ СправочникКонтрагенты.ЭтоГруппа
	|	И &УсловиеОтборРегистрацияДатаНачала
	|	И &УсловиеОтборРегистрацияДатаОкончания
	|	И &УсловиеОтборСалон
	|	И &УсловиеОтборПолКлиента
	|	И &УсловиеОтборРекламныйИсточник
	|	И &УсловиеОтборТелефон
	|	И &УсловиеОтборВозрастОт
	|	И &УсловиеОтборВозрастДо
	|	И &УсловиеОтборСтатус
	|	И &УсловиеОтборЛичныйВрач
	|	И &УсловиеОтборУслуга
	|	И &УсловиеОтборДатаПоследнегоПриема
	|	И &УсловиеОтборЭлектроннаяКарта
	|	И &УсловиеОтборМетки";
	
	МодифицироватьТекстЗапроса(ТекстЗапроса, Истина,, ОтборыЗаполнены, ОтборСтатусы);

КонецПроцедуры

&НаСервере
// Функция - Модифицировать текст запроса
//
Функция МодифицироватьТекстЗапроса(ТекстЗапроса, ЗапросСписка, Запрос = Неопределено, ОтборыЗаполнены = Истина, ОтборСтатусы = Неопределено)
	
	Если ОтборыЗаполнены = Истина Тогда
			
		УсловиеОтборРегистрацияДатаНачала    = "И СправочникКонтрагенты.ДатаРегистрации >= &ОтборРегистрацияДатаНачала";
		УсловиеОтборРегистрацияДатаОкончания = "И СправочникКонтрагенты.ДатаРегистрации <= &ОтборРегистрацияДатаОкончания";
		УсловиеОтборСалон                    = "И СправочникКонтрагенты.СтруктурнаяЕдиница В(&ОтборСалон)";
		Если ЗапросСписка = Истина Тогда
			УсловиеОтборСтатус = "И СправочникКонтрагенты.Ссылка В 
			|			(ВЫБРАТЬ
			|			    СтатусыКонтрагентов.Контрагент 
			|			ИЗ
			|	            РегистрСведений.СтатусыКонтрагентов.СрезПоследних(, ) КАК СтатусыКонтрагентов
			|	        ГДЕ Статус В(&ОтборСтатус))";
			
		Иначе
			УсловиеОтборСтатус               = "И СтатусыКонтрагентов.Статус В(&ОтборСтатус)";
		КонецЕсли;
		УсловиеОтборПолКлиента	             = "И СправочникКонтрагенты.ПолКлиента В(&ОтборПолКлиента)";
		УсловиеОтборРекламныйИсточник        = "И СправочникКонтрагенты.ИсточникИнформации В(&ОтборРекламныйИсточник)";
		
		УсловиеОтборВозрастОт = "И СправочникКонтрагенты.ДатаРожденияКлиента <> ДАТАВРЕМЯ(1, 1, 1)
		|	И СправочникКонтрагенты.ДатаРожденияКлиента <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ГОД, - &ОтборВозрастОт)";
		УсловиеОтборВозрастДо = "И СправочникКонтрагенты.ДатаРожденияКлиента <> ДАТАВРЕМЯ(1, 1, 1)
		|	И СправочникКонтрагенты.ДатаРожденияКлиента >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ГОД, - &ОтборВозрастДо)";
		
	
		УсловиеОтборПрием = "И СправочникКонтрагенты.Ссылка В
		|			(ВЫБРАТЬ
		|				Прием.Контрагент
		|			ИЗ
		|				Документ.Прием КАК Прием
		|			ГДЕ
		|				Прием.ВремяНачалаПриема Между &ОтборПриемДатаНачала И &ОтборПриемДатаОкончания
		|				И Прием.ПометкаУдаления = Ложь)";
		
		УсловиеОтборУслуга = "И СправочникКонтрагенты.Ссылка В
		|			(ВЫБРАТЬ
		|				ПриемЛечение.Ссылка.Контрагент
		|			ИЗ
		|				Документ.Прием.Лечение КАК ПриемЛечение
		|			ГДЕ
		|				ПриемЛечение.Номенклатура В(&ОтборУслуга)
		|				И ПриемЛечение.Ссылка.ПометкаУдаления = Ложь)"; 
		
		УсловиеОтборДатаПоследнегоПриема = "И КонтрагентыСведенияДляСписка.ДатаПоследнегоПриема Между &ОтборПриемДатаНачала И &ОтборПриемДатаОкончания";
		
		УсловиеОтборМетка = "И СправочникКонтрагенты.Ссылка В (ВЫБРАТЬ
		|							МеткиКлиентовСрезПоследних.Клиент КАК Клиент
		|					ИЗ
		|							РегистрСведений.МеткиКлиентов.СрезПоследних(&ТекущаяДата, Метка.ИспользоватьДляПациентов = ИСТИНА И Метка В (&ОтборМетка)) КАК МеткиКлиентовСрезПоследних)";
		
		МассивСалонов                   = ПолучитьМассивПараметров("ОтборСалон");
		МассивСтатусов                  = ?(ОтборСтатусы = Неопределено, ПолучитьМассивПараметров("ОтборСтатус"), ОтборСтатусы);
		МассивПоловКлиента              = ПолучитьМассивПараметров("ОтборПол");
		МассивРекламныйИсточник         = ПолучитьМассивПараметров("ОтборРекламныйИсточник");
		МассивОтборНаличиеТелефона      = ПолучитьМассивПараметров("НеЗаполненТелефон");
		МассивУслуг                     = ПолучитьМассивПараметров("ОтборУслуга");
		МассивЛичныйВрач   				= ПолучитьМассивПараметров("ОтборЛичныйВрач");	
		МассивМетка					    = ПолучитьМассивПараметров("ОтборМетка"); 
		
		Если ЗначениеЗаполнено(МассивОтборНаличиеТелефона) Тогда
			
			// Истина - телефон не заполнен
			Если МассивОтборНаличиеТелефона.Найти(Истина) <> Неопределено И МассивОтборНаличиеТелефона.Найти(Ложь) <> Неопределено Тогда
				УсловиеОтборТелефон = "";
			Иначе
					
				Если МассивОтборНаличиеТелефона.Найти(Истина) <> Неопределено Тогда 
					УсловиеОтборТелефон = "И НЕ СправочникКонтрагенты.Ссылка В(ВЫБРАТЬ
					|КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
					|ИЗ
					|Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
					|ГДЕ
					|КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента))";
					
				Иначе
					УсловиеОтборТелефон = "И СправочникКонтрагенты.Ссылка В(ВЫБРАТЬ
					|КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
					|ИЗ
					|Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
					|ГДЕ
					|КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента))";
					
				КонецЕсли;
							
			КонецЕсли;
			
		Иначе
			УсловиеОтборТелефон = "";
		КонецЕсли; 
		
		Если ОтборЭлектроннаяКарта Тогда
			
			УсловиеОтборЭлектроннаяКарта = "И СправочникКонтрагенты.Ссылка В
			|(ВЫБРАТЬ
			|	Карты.ВладелецКарты КАК ВладелецКарты
			|ИЗ
			|	Справочник.Карты КАК Карты
			|ГДЕ
			|	НЕ Карты.ПометкаУдаления
			|	И НЕ Карты.Заблокирована
			|	И Карты.ВладелецКарты ССЫЛКА Справочник.Контрагенты)";	
			
		Иначе
			
			УсловиеОтборЭлектроннаяКарта = "";
			
		КонецЕсли;
		
		УсловиеОтборЛичныйВрач                    = "И СправочникКонтрагенты.Куратор В(&ОтборЛичныйВрач)";
		// Если ЗначениеЗаполнено(МассивСотрудников) Тогда
		//	УсловиеОтборСотрудник =  "И СправочникКонтрагенты.Ссылка В
		//		|			(ВЫБРАТЬ
		//		|				ПредпочтенияКлиентовПоМастерам.Контрагент
		//		|			ИЗ
		//		|				РегистрСведений.ПредпочтенияКлиентовПоМастерам КАК ПредпочтенияКлиентовПоМастерам
		//		|			ГДЕ
		//		|				ПредпочтенияКлиентовПоМастерам.Сотрудник В (&ОтборСотрудник))";
		// Иначе
		//	УсловиеОтборСотрудник = "";
		// КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборРегистрацияДатаНачала"   , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаРегистрации.ДатаНачала), УсловиеОтборРегистрацияДатаНачала, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборРегистрацияДатаОкончания", ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаРегистрации.ДатаОкончания), УсловиеОтборРегистрацияДатаОкончания, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборСалон"                   , ?(ЗначениеЗаполнено(МассивСалонов), УсловиеОтборСалон, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборСтатус"                  , ?(ЗначениеЗаполнено(МассивСтатусов), УсловиеОтборСтатус, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборПолКлиента"              , ?(ЗначениеЗаполнено(МассивПоловКлиента), УсловиеОтборПолКлиента, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборРекламныйИсточник"       , ?(ЗначениеЗаполнено(МассивРекламныйИсточник), УсловиеОтборРекламныйИсточник, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборВозрастОт"               , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастОт), УсловиеОтборВозрастОт, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборВозрастДо"               , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастДо), УсловиеОтборВозрастДо, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборЭлектроннаяКарта"        , УсловиеОтборЭлектроннаяКарта);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборТелефон"                 , УсловиеОтборТелефон);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборЛичныйВрач"              , ?(ЗначениеЗаполнено(МассивЛичныйВрач), УсловиеОтборЛичныйВрач, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборПрием"                   , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаНачала) Или ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаОкончания), УсловиеОтборПрием, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборУслуга"                  , ?(ЗначениеЗаполнено(МассивУслуг), УсловиеОтборУслуга, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборДатаПоследнегоПриема"    , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаНачала) Или ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаОкончания), УсловиеОтборДатаПоследнегоПриема, ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборМетки"    				  , ?(ЗначениеЗаполнено(МассивМетка), УсловиеОтборМетка, ""));
		
		Если ЗапросСписка = Ложь Тогда 
			
			Запрос.Текст = ТекстЗапроса;
			
			Запрос.УстановитьПараметр("ОтборРегистрацияДатаНачала"   , ЭтотОбъект.ОтборДатаРегистрации.ДатаНачала);
			Запрос.УстановитьПараметр("ОтборРегистрацияДатаОкончания", ЭтотОбъект.ОтборДатаРегистрации.ДатаОкончания);
			Запрос.УстановитьПараметр("ОтборСалон"                   , МассивСалонов);
			Запрос.УстановитьПараметр("ОтборСтатус"                  , МассивСтатусов);
			Запрос.УстановитьПараметр("ОтборПолКлиента"              , МассивПоловКлиента);
			Запрос.УстановитьПараметр("ОтборРекламныйИсточник"       , МассивРекламныйИсточник);
			Запрос.УстановитьПараметр("ОтборВозрастОт"               , ЭтотОбъект.ОтборВозрастОт);
			Запрос.УстановитьПараметр("ОтборВозрастДо"               , ЭтотОбъект.ОтборВозрастДо);
			Запрос.УстановитьПараметр("ТекущаяДата"                  , ТекущаяДатаСеанса());
			Запрос.УстановитьПараметр("ОтборСотрудник"               , МассивЛичныйВрач);
			Запрос.УстановитьПараметр("ОтборПриемДатаНачала"         , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаНачала), ЭтотОбъект.ОтборДатаПриема.ДатаНачала, Дата(1,1,1)));
			Запрос.УстановитьПараметр("ОтборПриемДатаОкончания"      , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаОкончания), ЭтотОбъект.ОтборДатаПриема.ДатаОкончания, Дата(3999,12,31)));
			Запрос.УстановитьПараметр("ОтборУслуга"                  , МассивУслуг);
			Запрос.УстановитьПараметр("ОтборМетка"                   , МассивМетка);
						
		Иначе
			
			Список.ТекстЗапроса = ТекстЗапроса;	
			
			Если ЗначениеЗаполнено(МассивСтатусов) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборСтатус"                  , МассивСтатусов);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаРегистрации.ДатаНачала) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборРегистрацияДатаНачала"   , ЭтотОбъект.ОтборДатаРегистрации.ДатаНачала);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаРегистрации.ДатаОкончания) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборРегистрацияДатаОкончания", ЭтотОбъект.ОтборДатаРегистрации.ДатаОкончания);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(МассивСалонов) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборСалон"                   , МассивСалонов);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(МассивПоловКлиента) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборПолКлиента"              , МассивПоловКлиента);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(МассивРекламныйИсточник) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборРекламныйИсточник"       , МассивРекламныйИсточник);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастОт) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборВозрастОт"               , ЭтотОбъект.ОтборВозрастОт);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастДо) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборВозрастДо"               , ЭтотОбъект.ОтборВозрастДо);
			КонецЕсли;
			
			// Если ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастОт) Или ЗначениеЗаполнено(ЭтотОбъект.ОтборВозрастДо) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
			// КонецЕсли;
			
			Если ЗначениеЗаполнено(МассивЛичныйВрач) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборЛичныйВрач"               , МассивЛичныйВрач);
			КонецЕсли;

			Если ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаНачала) 
				Или ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаОкончания) Тогда
			   Список.Параметры.УстановитьЗначениеПараметра("ОтборПриемДатаНачала"             , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаНачала), ЭтотОбъект.ОтборДатаПриема.ДатаНачала, Дата(1,1,1)));
			   Список.Параметры.УстановитьЗначениеПараметра("ОтборПриемДатаОкончания"          , ?(ЗначениеЗаполнено(ЭтотОбъект.ОтборДатаПриема.ДатаОкончания), ЭтотОбъект.ОтборДатаПриема.ДатаОкончания, Дата(3999,12,31)));
			КонецЕсли;

			Если ЗначениеЗаполнено(МассивУслуг) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборУслуга", МассивУслуг);
			КонецЕсли; 	 
			
			Если ЗначениеЗаполнено(МассивМетка) Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборМетка", МассивМетка);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборРегистрацияДатаНачала"   , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборРегистрацияДатаОкончания", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборСалон"                   , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборСтатус"                  , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборПолКлиента"              , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборРекламныйИсточник"       , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборВозрастОт"               , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборВозрастДо"               , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборЭлектроннаяКарта"        , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборТелефон"                 , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборЛичныйВрач"              , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборПрием"                   , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборУслуга"                  , "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборДатаПоследнегоПриема"    , "");  
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтборМетки"    , "");
		
		Если ЗапросСписка = Ложь Тогда 		
			Запрос.Текст = ТекстЗапроса;
		Иначе	
			Список.ТекстЗапроса = ТекстЗапроса;	
			Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());

		КонецЕсли;
		
	КонецЕсли;

КонецФункции

&НаСервере
// Функция - Получить представление.
//
Функция ПолучитьПредставление(Заголовок, Количество, Цвет = Неопределено)
	
	ЭлементЗаголовок  = Новый ФорматированнаяСтрока(Заголовок, Новый Шрифт(, 11));
	// ЭлементКоличество = Новый ФорматированнаяСтрока(Строка(Количество), Новый Шрифт(, 12, Истина), ?(Цвет <> Неопределено, Цвет, Новый Цвет(77, 77, 77)));
	ЭлементКоличество = Новый ФорматированнаяСтрока(Строка(Количество), Новый Шрифт(, 12, Ложь), ?(Цвет <> Неопределено, Цвет, Новый Цвет(77, 77, 77)));
	
	ЭлементыСтроки = Новый Массив;
	ЭлементыСтроки.Добавить(ЭлементЗаголовок);
	ЭлементыСтроки.Добавить(ЭлементКоличество);
	
	Результат = Новый ФорматированнаяСтрока(ЭлементыСтроки);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
// Функция - Получить массив параметров.
//
Функция ПолучитьМассивПараметров(ИмяПоляОтбора)
	
	МассивОтбора = Новый Массив;
	
	СтрокиЗначенийОтбора = ЭтотОбъект.ДанныеМеток.НайтиСтроки(Новый Структура("ИмяПоляОтбора", ИмяПоляОтбора));
	
	Для Каждого СтрокаОтбора Из СтрокиЗначенийОтбора Цикл
		
		Если ТипЗнч(СтрокаОтбора.Метка) = Тип("СписокЗначений") Тогда
			Для Каждого ЗначениеСписка Из СтрокаОтбора.Метка Цикл
				МассивОтбора.Добавить(ЗначениеСписка.Значение);
			КонецЦикла;
		Иначе	
			МассивОтбора.Добавить(СтрокаОтбора.Метка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивОтбора;
	
КонецФункции

&НаСервере
// Процедура расскрывает папку клиента по умолччанию
//
Процедура АктивироватьПапкуКлиентаПоУмолчанию()
	
	ПапкаКлиента = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, "ГруппаКлиентов");
	Элементы.Список.ТекущаяСтрока = ?(Не ЗначениеЗаполнено(ПапкаКлиента), Справочники.Контрагенты.ПустаяСсылка(), ПапкаКлиента);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
// Процедура - Подключаемый метка обработка навигационной ссылки
//
// Параметры:
//  Элемент									 - 	 - 
//  НавигационнаяСсылкаФорматированнойСтроки - 	 - 
//  СтандартнаяОбработка					 - 	 - 
//
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Декорация_Картинка_Метки_")+1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить метку отбора.
//
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД, , Ложь);
	
	УстановитьЗапросДинамическогоСписка();
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить метку отбора.
//
Процедура УдалитьМеткиОтборов(МассивИндексов)
	
	Для Каждого Индекс Из МассивИндексов Цикл
		РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, Индекс, , Ложь);
	КонецЦикла;
	
	УстановитьЗапросДинамическогоСписка();
	
КонецПроцедуры

&НаСервере
// Процедура - Сохранить настройки отборов
//
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура ПредставлениеДатаПриемаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ОтборДатаПриема;
	Оповещение = Новый ОписаниеОповещения("ПредставлениеДатаПриемаПриИзмененииЗавершение", ЭтотОбъект);
	Диалог.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения процедуры "ПредставлениеДатаВизитаНажатие".
//
Процедура ПредставлениеДатаПриемаПриИзмененииЗавершение(НовыйПериод, Параметры) Экспорт
	
	Если НовыйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НовыйПериод)=Тип("СтандартныйПериод") Тогда
		ОтборДатаПриема = НовыйПериод;
	ИначеЕсли ТипЗнч(НовыйПериод)=Тип("Дата") Тогда
		ОтборДатаПриема.ДатаОкончания = НовыйПериод;
	КонецЕсли;
	
	ПредставлениеДатаПриема = РаботаСОтборами.ОбновитьПредставлениеПериода(ОтборДатаПриема, "Дата приема: ");
	
	#Если ВебКлиент Тогда
		ОбновитьОтображениеДанных();
	#КонецЕсли 
	
	УстановитьЗапросДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриИзменении
//
Процедура РасширенныйПоискПриИзменении(Элемент)
	
	Если РасширенныйПоиск <> "" Тогда
		
		Если Элементы.Список.Отображение <> ОтображениеТаблицы.Список Тогда
			Результат = Неопределено;

			ПоказатьВопрос(Новый ОписаниеОповещения("РасширенныйПоискПриИзмененииЗавершение", ЭтотОбъект), 
			НСтр("ru='Рекомендуется включить режим отображения списком. Включить отображения списком?'"), РежимДиалогаВопрос.ДаНет);
			Возврат;
			
		КонецЕсли;
		
		ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(РасширенныйПоиск, , Истина,,,,,, Истина);
		
		// установить отбор по списку найденных партнеров
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ЭтаФорма.Список, "Ссылка", ДанныеВыбора, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
		
	Иначе
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка");		
	КонецЕсли;
	
	Элементы.Список.Обновить();	
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенныйПоискПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Результат = РезультатВопроса; 
	Если Результат = КодВозвратаДиалога.Да Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
	ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(РасширенныйПоиск, , Истина,,,,,, Истина);
	
	// установить отбор по списку найденных партнеров
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ЭтаФорма.Список, "Ссылка", ДанныеВыбора, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
	
	Элементы.Список.Обновить();	
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
&НаКлиенте
Процедура ПоказатьПомощникЗагрузкиДанныхИзВнешнегоИсточника()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном", "ЗагрузкаИзФайла");
	НастройкиЗагрузкиДанных.Вставить("ОписаниеСтрокиВыбора", Новый Структура("ПолноеИмяОбъектаМетаданных, Тип", "Контрагенты", "ПрикладнаяЗагрузка"));
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
	
		ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
		ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
		
	ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
		
		ДлительнаяОперация = ЗапуститьОбработкуПодготовленныхДанных(РезультатЗагрузки);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		
		ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru='Контрагенты'");
		ПараметрыОжидания.ОповещениеПользователя.Пояснение = НСтр("ru='Загрузка данных завершена.'");
		ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = Окно.ПолучитьНавигационнуюСсылку();
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Новый ОписаниеОповещения("ЗавершениеОбработкиПодготовленныхДанных", ЭтотОбъект), ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьОбработкуПодготовленныхДанных(РезультатЗагрузки)
	
	ИмяПроцедуры = "Справочники.Контрагенты.ОбработатьПодготовленныеДанные";
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НастройкиЗагрузкиДанных", РезультатЗагрузки.НастройкиЗагрузкиДанных);
	ПараметрыПроцедуры.Вставить("ТаблицаСопоставленияДанных", ДанныеФормыВЗначение(РезультатЗагрузки.ТаблицаСопоставленияДанных, Тип("ТаблицаЗначений")));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Подсистема ЗагрузкаДанныхИзВнешнегоИсточника: Выполнение серверного метода загрузки результата'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеОбработкиПодготовленныхДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
 
#КонецОбласти
