
#Область ОбработчикиСобытий

// Процедура, Обработчик события "ПриКопировании"
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Организация        = Неопределено;
	СтруктурнаяЕдиница = Неопределено;
	Наименование       = "";
	КодСинхронизации   = "";
	
КонецПроцедуры

// Обработчик заполнения объекта внешними данными
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	ЭтотОбъект.ТипКассы = Перечисления.ТипыКасс.ОперационнаяКасса;    
				
	Если ЭтоНовый() Тогда			
		// Заполнение ТБ доступных видов оплат чека ККМ
		ЗапросВидовОплат = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТипыОплат.Ссылка КАК ВидОплаты,
		|	ВЫБОР
		|		КОГДА ТипыОплат.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
		|				ИЛИ ТипыОплат.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПодарочныйСертификат)
		|				ИЛИ ТипыОплат.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Аванс)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПробиватьНефискальныйЧек
		|ИЗ
		|	Перечисление.ТипыДенежныхСредств КАК ТипыОплат
		|ГДЕ
		|	ТипыОплат.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.Безналичные)
		|	И ТипыОплат.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.ПереводыВПути)
		|	И ТипыОплат.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.СистемаБыстрыхПлатежей)");
		
		ЭтотОбъект.ВидыОплат.Загрузить(ЗапросВидовОплат.Выполнить().Выгрузить());		
		
		ЭтотОбъект.ВыемкаИзКассы = Перечисления.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия;
	КонецЕсли;          
	
КонецПроцедуры

// Обработчик перед записью объекта на сервер
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВнешнееОборудование)
		И ИспользоватьБезПодключенияОборудования = Ложь Тогда
		
		ИспользоватьБезПодключенияОборудования = Истина;
	КонецЕсли;
	
	МассивСтрокТЧ = ЭквайринговыеТерминалы.НайтиСтроки(Новый Структура("ЭквайринговыйТерминал", Справочники.ЭквайринговыеТерминалы.ПустаяСсылка()));	
	Для Каждого СтрокаТЧ Из МассивСтрокТЧ Цикл
		ЭквайринговыеТерминалы.Удалить(СтрокаТЧ);							
	КонецЦикла;
	
	СтрокаТЧ = Неопределено;
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда				
		
		СтрокаТЧ = ЭквайринговыеТерминалы.Найти(ЭквайринговыйТерминал);	
		
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = ЭквайринговыеТерминалы.Добавить();
			СтрокаТЧ.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
		КонецЕсли;
		
		Для Каждого СтрокаТ Из ЭквайринговыеТерминалы Цикл // Переопределяем признак основной всем эквайринговым терминалам на всякий случай
			СтрокаТ.Основной = СтрокаТ = СтрокаТЧ;
		КонецЦикла;
		
	Иначе
		
		ОсновнойЭТ = ЭквайринговыеТерминалы.Найти(Истина, "Основной");
		
		Если ОсновнойЭТ = Неопределено Тогда
			Для Каждого СтрокаТ Из ЭквайринговыеТерминалы Цикл
				Если СтрокаТ.ЭквайринговыйТерминал.ТипЭквайринга = Перечисления.ТипыЭквайринговыхТерминалов.Торговый Тогда
					СтрокаТ.Основной = Истина;
					ЭквайринговыйТерминал = СтрокаТ.ЭквайринговыйТерминал;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЭквайринговыйТерминал = ОсновнойЭТ.ЭквайринговыйТерминал;	
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

// Обработчик проверки заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)           
	
	Если ЭтоГруппа = Ложь И ТипКассы = Перечисления.ТипыКасс.КассаПредприятия Тогда
		
		 ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склад"));

	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
