
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция, возвращает канал привлечения.
//
Функция ПолучитьКаналПривлечения(Наименование) Экспорт
	
	КаналПривлечения = КаналПривлеченияПоНаименованию(Наименование);
	
	Если Не ЗначениеЗаполнено(КаналПривлечения) Тогда
		КаналПривлечения = СоздатьКаналПривлечения(Наименование);
	КонецЕсли;
	
	Возврат КаналПривлечения;
	
КонецФункции

// Функция, находит канал привлечения по наименованию.
//
Функция КаналПривлеченияПоНаименованию(Наименование)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КаналыПривлечения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КаналыПривлечения КАК КаналыПривлечения
	|ГДЕ
	|	НЕ КаналыПривлечения.ПометкаУдаления
	|	И КаналыПривлечения.Наименование ПОДОБНО ""%"" + &Наименование + ""%""");
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Функция, создает канал привлечения.
//
Функция СоздатьКаналПривлечения(Наименование) Экспорт
		
	КаналПривлеченияОбъект              = Справочники.КаналыПривлечения.СоздатьЭлемент();
	КаналПривлеченияОбъект.Наименование = Наименование;
	
	КаналПривлеченияОбъект.Записать();
	
	Возврат КаналПривлеченияОбъект.Ссылка;
	
КонецФункции

// Процедура - Обработка получения представления.
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ПользователиСлужебныйПовтИсп.ЯзыкИнтерфейсаАнглийский() Тогда
		
		Если Данные.Ссылка = Справочники.КаналыПривлечения.ВходящийЗвонок Тогда
			Представление = "Incoming call";
		ИначеЕсли Данные.Ссылка = Справочники.КаналыПривлечения.ГостевойВизит Тогда
			Представление = "Guest visit";
		ИначеЕсли Данные.Ссылка = Справочники.КаналыПривлечения.ИсходящийЗвонок Тогда
			Представление = "Outgoing call";
		ИначеЕсли Данные.Ссылка = Справочники.КаналыПривлечения.ЛидФорма Тогда
			Представление = "Lead-form";
		ИначеЕсли Данные.Ссылка = Справочники.КаналыПривлечения.ЛовецЛидов Тогда
			Представление = "Catcher leads";
		ИначеЕсли Данные.Ссылка = Справочники.КаналыПривлечения.ПрезентацияВстреча Тогда
			Представление = "Presentation - meeting";
		ИначеЕсли Данные.Ссылка = Справочники.КаналыПривлечения.РегистрацияНаСайте Тогда
			Представление = "Registration on the website";
		ИначеЕсли Данные.Ссылка = Справочники.КаналыПривлечения.ЧатСКлиентом Тогда
			Представление = "Chat with client";
		КонецЕсли;
		       
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
