
#Область ПрограммныйИнтерфейс

// Процедура - При начале работы системы
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Если (ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных())
		ИЛИ НЕ КассовыйСерверПовтИсп.ЗапускПриНачалеРаботыСистемыРазрешен() Тогда
		
		Возврат;
	КонецЕсли;
		
	Если КассовыйСерверПовтИсп.ВТекущемСеансеРазрешенЗапускКассовогоСервера() = Истина
		И КассовыйСерверПовтИсп.КассовыСерверРаботаетВРежимеСеансПользователя() = Истина Тогда	
		
		ОткрытьФормуКассовогоСервер(Неопределено);
		
		ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверитьОчередьКассовогоСервера", 10, Истина);		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Открыть форму кассового сервер
//
Процедура ОткрытьФормуКассовогоСервер(ДопПараметры) Экспорт
	
	ОткрытьФорму("Обработка.КассовыйСервер.Форма");
	
КонецПроцедуры

#КонецОбласти
