
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, проверяет подключение к системе взаимодействия.
//
Процедура ПриНачалаРаботыСистемы(ПараметрыРаботыКлиента) Экспорт
	
	Если НЕ ПараметрыРаботыКлиента.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда 
			// Регистрация в системе взаимодействия.
			РегистрацияВСистемеВзаимодействия();
		КонецЕсли;
		
		Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
			ПодключитьОбработчикОжидания("ПроверитьАктивныеОповещенияКлиента", 5);
			Возврат;		
		КонецЕсли;
		
		ОтказСистемыВзаимодействия = Ложь;
		
		ПодключаемоеОбсуждение = ОбсужденияСистемыВзаимодействия.ПолучитьОбсуждениеСотрудника(, ОтказСистемыВзаимодействия);
		
		Если ОтказСистемыВзаимодействия = Истина Тогда
			ПодключитьОбработчикОжидания("ПроверитьАктивныеОповещенияКлиента", 5);
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодключаемоеОбсуждение) Тогда
			ПодключитьОбработчикОжидания("ПодключитьОбработчикНовыхСообщений", 10, Истина); 
		Иначе
			ПодключитьОбработчикОжидания("СоздатьОбсуждение", 10, Истина);
		КонецЕсли;
	
	Исключение 
		
		ПодключитьОбработчикОжидания("ПроверитьАктивныеОповещенияКлиента", 5);
		Возврат;				
		
	КонецПопытки;
	
	ОбсужденияСистемыВзаимодействия.ПолучитьПараметрыТекущегоПользователяДляОповещения(ДанныеКлиентаСистемыВзаимодействия);
	
КонецПроцедуры

// Процедура, обработчик обсуждения, в системе взаимодействия.
//
Процедура ОбработчикНовогоСообщения(Сообщение, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() = Истина
		И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Попытка	
		ДанныеОповещения = Сообщение.Данные;	
	Исключение	
		ОбсужденияСистемыВзаимодействия.ЗаписатьДанныеОбОшибкеВЖурналРегистрации(ОписаниеОшибки(), Сообщение.Текст);	
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ДанныеОповещения) Тогда
		Возврат;	
	КонецЕсли;

	Если ДанныеОповещения.Свойство("СтруктурнаяЕдиница") И ЗначениеЗаполнено(ДанныеОповещения.СтруктурнаяЕдиница)
		И ДанныеКлиентаСистемыВзаимодействия.ТекущаяСтруктурнаяЕдиница <> ДанныеОповещения.СтруктурнаяЕдиница Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ПроверитьАктуальностьСообщения(Сообщение.Дата, ДанныеОповещения.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеОповещения.Ключ = "IPТелефония_ВходящийЗвонок" Тогда
		
		Если ДанныеОповещения.Свойство("ДатаНачалаЗвонка")
			И ЗначениеЗаполнено(ДанныеОповещения.ДатаНачалаЗвонка)
			И ДанныеКлиентаСистемыВзаимодействия.Свойство("ДатаНачалаСеанса")
			И ДанныеКлиентаСистемыВзаимодействия.ДатаНачалаСеанса > ДанныеОповещения.ДатаНачалаЗвонка Тогда
			
			Возврат;
		КонецЕсли; 
		
		КлючУникальностиОповещения = "IPТелефония_Звонок_" + ДанныеОповещения.НомерТелефонаFrom;
		
		Если СтрНайти(ДанныеОповещения.СообщениеОповещения, "Открыть карточку клиента") > 0 Тогда
			ОписаниеОповещения = ПолучитьНавигационнуюСсылку(ДанныеОповещения.Контрагент);
		ИначеЕсли СтрНайти(ДанныеОповещения.СообщениеОповещения, "Создать нового клиента") > 0 Тогда
			ПараметрыОповещения = Новый Структура("НомерТелефона", ДанныеОповещения.НомерТелефонаFrom);
			ОписаниеОповещения  = Новый ОписаниеОповещения("СоздатьНовогоКлиентаОповещение", IPТелефонияКлиент, ПараметрыОповещения); 
		ИначеЕсли СтрНайти(ДанныеОповещения.СообщениеОповещения, "Открыть заявку клиента") > 0 Тогда
			ОписаниеОповещения = ПолучитьНавигационнуюСсылку(ДанныеОповещения.Контрагент);				
		ИначеЕсли СтрНайти(ДанныеОповещения.СообщениеОповещения, "Создать потенциального клиента") > 0 Тогда
			ПараметрыОповещения = Новый Структура("НомерТелефона", ДанныеОповещения.НомерТелефонаFrom);
			ОписаниеОповещения  = Новый ОписаниеОповещения("СоздатьПотенциальногоКлиентаОповещение", IPТелефонияКлиент, ПараметрыОповещения);
		ИначеЕсли СтрНайти(ДанныеОповещения.СообщениеОповещения, "Открыть форму звонка") > 0 Тогда
			
			Если ЗначениеЗаполнено(ДанныеОповещения.IPТелефония) И ЗначениеЗаполнено(ДанныеОповещения.IDЗвонка) Тогда
				ПараметрыОповещения = Новый Структура("ПОIPТелефонии, IDЗвонка, IDПлеча, СНомерТелефона, НаНомерТелефона", ДанныеОповещения.IPТелефония, 
				ДанныеОповещения.IDЗвонка, ДанныеОповещения.IDПлеча, ДанныеОповещения.НомерТелефонаFrom, ДанныеОповещения.НомерТелефонаTo);
				ОписаниеОповещения  = Новый ОписаниеОповещения("ОткрытьФормуЗвонкаОповещение", IPТелефонияКлиент, ПараметрыОповещения);
			КонецЕсли;
			
		Иначе	  
			ОписаниеОповещения = Неопределено; 
		КонецЕсли;
		
		ПараметрыОповещенияОЗвонке = Новый Структура;
		ПараметрыОповещенияОЗвонке.Вставить("КлючУникальностиОповещения"	, КлючУникальностиОповещения);
		ПараметрыОповещенияОЗвонке.Вставить("Заголовок"						, ДанныеОповещения.Заголовок);
		ПараметрыОповещенияОЗвонке.Вставить("ОписаниеОповещения"			, ОписаниеОповещения);
		ПараметрыОповещенияОЗвонке.Вставить("СообщениеОповещения"			, ДанныеОповещения.СообщениеОповещения);
		
		ПоказатьОповещениеПользователя(ДанныеОповещения.Заголовок,
									   ОписаниеОповещения, 
									   ДанныеОповещения.СообщениеОповещения,
									   БиблиотекаКартинок.Телефон32,,
									   КлючУникальностиОповещения);
		
		ПодключитьОбработчикОжидания("ОповеститьОВходящемЗвонке", 6, Истина);
		
	ИначеЕсли ДанныеОповещения.Ключ = "IPТелефония_ОткрытьФормуВзаимодействияСКлиентом" Тогда
		
		Если ДанныеОповещения.Свойство("ДатаНачалаЗвонка")
			И ЗначениеЗаполнено(ДанныеОповещения.ДатаНачалаЗвонка)
			И ДанныеКлиентаСистемыВзаимодействия.Свойство("ДатаНачалаСеанса")
			И ДанныеКлиентаСистемыВзаимодействия.ДатаНачалаСеанса > ДанныеОповещения.ДатаНачалаЗвонка Тогда
			
			Возврат;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ДанныеОповещения.IPТелефония) И ЗначениеЗаполнено(ДанныеОповещения.IDЗвонка) Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ПоIPТелефонии"	, ДанныеОповещения.IPТелефония);
			ПараметрыОткрытия.Вставить("IDЗвонка"	  	, ДанныеОповещения.IDЗвонка);
			ПараметрыОткрытия.Вставить("IDПлеча"	  	, ДанныеОповещения.IDПлеча);
			ПараметрыОткрытия.Вставить("СНомерТелефона" , ДанныеОповещения.НомерТелефонаFrom);
			ПараметрыОткрытия.Вставить("НаНомерТелефона", ДанныеОповещения.НомерТелефонаTo);
			
			ОткрытьФорму("РегистрСведений.ИсторияВызовов.Форма.ФормаЗвонокКлиента", ПараметрыОткрытия,, ДанныеОповещения.IDЗвонка);
		КонецЕсли;	
		
	ИначеЕсли ДанныеОповещения.Ключ = "IPТелефония_ПокзатьУведомлениеОПропущенном_" + ?(ДанныеОповещения.Свойство("Пользователь"),ДанныеОповещения.Пользователь, "") Тогда
		
		ПараметрыСпискаНеОбработанных 	= Новый Структура;
		ПараметрыСпискаНеОбработанных.Вставить("ТелефонныйАппарат"		, ДанныеОповещения.ТелефонныйАппарат);
		ПараметрыСпискаНеОбработанных.Вставить("ВнутреннийНомер"		, ДанныеОповещения.ВнутреннийНомер);
		ПараметрыСпискаНеОбработанных.Вставить("ВнутреннийНомерРодителя", ДанныеОповещения.ВнутреннийНомерРодителя);
		ПараметрыСпискаНеОбработанных.Вставить("КлючОповещения"			, ДанныеОповещения.КлючОповещения);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьСписокПропущенныхЗвонков", IPТелефонияКлиент, ПараметрыСпискаНеОбработанных);
		
		ПоказатьОповещениеПользователя(ДанныеОповещения.ЗаголовокСообщения,
									   ОписаниеОповещения,
									   ДанныеОповещения.Сообщение,
									   БиблиотекаКартинок.ТелефонныйЗвонокПропущенныйБольшой,
									   СтатусОповещенияПользователя.Важное,
									   ДанныеОповещения.КлючОповещения);
		
		Оповестить("ОБНОВИТЬ_КОЛИЧЕСТВО_НЕ_ОБРАБОТАННЫХ", ДанныеОповещения.КлючОповещения);
		
		
	ИначеЕсли ДанныеОповещения.Ключ = "ПоказатьОповещениеПользователяСчетНеОплачен" Тогда
		
		ПоказатьОповещениеПользователя("Неоплаченный счет",,
									   ДанныеОповещения.ПредставлениеСчетНаОплату,
									   БиблиотекаКартинок.Информация32,
									   СтатусОповещенияПользователя.Важное,
									   ДанныеОповещения.ПредставлениеСчетНаОплату);										   
		
	ИначеЕсли ДанныеОповещения.Ключ = "ОбновлениеРабочегоСтола" Тогда
		
		Оповестить(ДанныеОповещения.Ключ, ДанныеОповещения, Неопределено);
		
	ИначеЕсли ДанныеОповещения.Ключ = "ПоказатьОповещениеУслугиНаСогласование" Тогда
		
		ПоказатьОповещениеПользователя(
		"Новая услуга на согласование",,,
		БиблиотекаКартинок.Информация32,
		СтатусОповещенияПользователя.Важное,
		Строка(ДанныеОповещения.Ключ));
		
		Оповестить("ПоказатьОповещениеУслугиНаСогласование");
		
	ИначеЕсли СтрНачинаетсяС(ДанныеОповещения.Ключ, "ОбновитьСогласованияСтраховыхУслуг") Тогда
		
		Оповестить("ОбновитьСогласованияСтраховыхУслуг", ДанныеОповещения.ПараметрыОповещения);
		
	ИначеЕсли ДанныеОповещения.Ключ = "ДобавленаОнлайнЗапись" Тогда
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Событие"			 , ДанныеОповещения.Событие);
		ПараметрыОповещения.Вставить("СтруктурнаяЕдиница", ДанныеОповещения.СтруктурнаяЕдиница);
		ПараметрыОповещения.Вставить("Ключ"				 , ДанныеОповещения.Ключ);
		
		ПояснениеОповещения = ?(ДанныеОповещения.Свойство("Сообщение"), ДанныеОповещения.Сообщение, Строка(ДанныеОповещения.Визит));
		ОписаниеОповещения  = Новый ОписаниеОповещения("ДобавленаОнлайнЗаписьЗавершение", ОбщегоНазначенияКлиент, ПараметрыОповещения); 
		
		ПоказатьОповещениеПользователя("Добавлена онлайн-запись",
									   ОписаниеОповещения,
									   ПояснениеОповещения,
									   БиблиотекаКартинок.Информация32,
									   СтатусОповещенияПользователя.Важное,
									   Строка(ДанныеОповещения.Событие));	
									   
		Оповестить("ОбновлениеРабочегоСтола", ДанныеОповещения, Неопределено);
		
	ИначеЕсли ДанныеОповещения.Ключ = "ОбновленСтатусЗаявки" Тогда
		Оповестить(ДанныеОповещения.Ключ, ДанныеОповещения);
		
	ИначеЕсли ДанныеОповещения.Ключ = "ОповещениеОНовыхЗаявках" Тогда
		
		Если ДанныеОповещения.Свойство("ОнлайнЗаявка") Тогда
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Заявка"			 , ДанныеОповещения.Заявка);
			ПараметрыОповещения.Вставить("СтруктурнаяЕдиница", ДанныеОповещения.СтруктурнаяЕдиница);
			ПараметрыОповещения.Вставить("Ключ"				 , ДанныеОповещения.Ключ);
			
			Оповещение = Новый ОписаниеОповещения("ДобавленоОнлайнОбращениеЗавершение", ОбщегоНазначенияКлиент, ПараметрыОповещения);
			
			ПоказатьОповещениеПользователя(НСтр("ru = 'У вас новое обращение '; en = 'You have a new application '"),
				Оповещение,,
				БиблиотекаКартинок.Информация32,
				СтатусОповещенияПользователя.Важное,
				Строка(ДанныеОповещения.Заявка));
			
		Иначе
			Оповестить(ДанныеОповещения.Ключ, ДанныеОповещения);
		КонецЕсли;
	
	ИначеЕсли ДанныеОповещения.Ключ = "ИзмененЭтапСделки" Или ДанныеОповещения.Ключ = "ДобавленаСделка" Тогда
		Оповестить(ДанныеОповещения.Ключ, ДанныеОповещения);
		
	ИначеЕсли ДанныеОповещения.Ключ = "НеобходимоОбновитьКешНастроекПоОповещениямВзаимодействий" Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	ИначеЕсли ДанныеОповещения.Ключ = "ЗакрытьФормуЗвонкаПациенту" Тогда
		
		Оповестить("ЗакрытьФормуЗвонкаПациенту", ДанныеОповещения);
		
	ИначеЕсли ДанныеОповещения.Ключ = "ОбновитьЗадачуКанбан" Тогда
		
		Оповестить(ДанныеОповещения.Ключ, ДанныеОповещения);
		
	ИначеЕсли ДанныеОповещения.Ключ = "СБП_УспешнаяОплата" Тогда
									  
		ОповеститьПриПолученииОплатыСБП(ДанныеОповещения);
		
	ИначеЕсли ДанныеОповещения.Ключ = "СБП_ВозвратОплаты" Тогда
		
		ОповеститьПриВозвратеОплатыСБП(ДанныеОповещения);
		
	ИначеЕсли ДанныеОповещения.Ключ = "НовоеСообщениеКонтурСтрохование" Тогда
		
		ПараметрыОповещения = Новый Структура("НомерСписка, СтруктурнаяЕдиница, Ключ, mediId, eventId, eventPointer, eventDateTime", 
												ДанныеОповещения.КлючЗаписи, 
												ДанныеОповещения.СтруктурнаяЕдиница, 
												ДанныеОповещения.Ключ,
												ДанныеОповещения.mediId,
												ДанныеОповещения.eventId,
												ДанныеОповещения.eventPointer,
												ДанныеОповещения.eventDateTime);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НовоеСообщениеКонтурСтрохование", ОбщегоНазначенияКлиент, ПараметрыОповещения);
		Если ДанныеОповещения.ТипСообщения = 1 Тогда
			ЗаголовокОповещения = "Поступил новый список прикрепления.";
		ИначеЕсли ДанныеОповещения.ТипСообщения = 2 Тогда
			ЗаголовокОповещения = "Поступил новый список открепления.";
		ИначеЕсли ДанныеОповещения.ТипСообщения = 3 Тогда
        	ЗаголовокОповещения = "Поступил новый список изменения персональных данных.";
		КонецЕсли;
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, 	
		ОписаниеОповещения, 
		ДанныеОповещения.КлючЗаписи,  
		БиблиотекаКартинок.Информация32,
		СтатусОповещенияПользователя.Важное);
		
	ИначеЕсли ДанныеОповещения.Ключ = "ПредварительнаяЗаписьОтменена" Тогда
		
		ПараметрыОповещения = Новый Структура("Ключ, СтруктурнаяЕдиница, Сотрудник, ДатаСобытия",
												ДанныеОповещения.Ключ,
												ДанныеОповещения.СтруктурнаяЕдиница,
												ДанныеОповещения.Сотрудник,
												ДанныеОповещения.ДатаСобытия);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПредварительнаяЗаписьОтмененаЗавершение", ОбщегоНазначенияКлиент, ПараметрыОповещения);
		
	    ПоказатьОповещениеПользователя(
		ДанныеОповещения.ЗаголовокОповещения,
		ОписаниеОповещения, 
		ДанныеОповещения.Сообщение,  
		БиблиотекаКартинок.Информация32,
		СтатусОповещенияПользователя.Важное);
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура, регистрирует информационную базу в системе взаимодействия.
//
Процедура РегистрацияВСистемеВзаимодействия() Экспорт
	
	Если ОбсужденияСистемыВзаимодействия.ПроверитьВозможностьРегистрацииСистемыВзаимодействия() Тогда
		
		ЭтоОблачнаяБаза = Ложь;
		Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
			И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
			
			ЭтоОблачнаяБаза   = Истина;
			ДанныеРегистрации = ОбсужденияСистемыВзаимодействия.ДанныеДляРегистрацииСистемыВзаимодействия(ЭтоОблачнаяБаза);
			
		ИначеЕсли НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено()
			И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных()
			И ОбсужденияСистемыВзаимодействия.РегистрироватьСистемуВзаимодействияПриПервомВходе() = Истина Тогда
			
			ДанныеРегистрации = ОбсужденияСистемыВзаимодействия.ДанныеДляРегистрацииСистемыВзаимодействия(ЭтоОблачнаяБаза);										
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеРегистрации) Тогда
			
			ПараметрыВзаимодействия = Новый ПараметрыРегистрацииИнформационнойБазыСистемыВзаимодействия();
			ПараметрыВзаимодействия.АдресСервера		  = ДанныеРегистрации.Сервер;
			ПараметрыВзаимодействия.АдресЭлектроннойПочты = ДанныеРегистрации.АдресЭлектроннойПочты;
			ПараметрыВзаимодействия.ИмяИнформационнойБазы = ДанныеРегистрации.ИмяИнформационнойБазы;
			ПараметрыВзаимодействия.КодАктивации 		  = ДанныеРегистрации.КодРегистрации;
			
			Оповещение = Новый ОписаниеОповещения("РегистрацияВыполнена", ЭтотОбъект);
			
			Попытка
				СистемаВзаимодействия.НачатьРегистрациюИнформационнойБазы(Оповещение, ПараметрыВзаимодействия);
				
				Если ЭтоОблачнаяБаза = Ложь Тогда
					ОбсужденияСистемыВзаимодействия.ЗначениеКонстантыРегистрироватьСистемуВзаимодействия(Ложь);
				КонецЕсли;
			Исключение
			КонецПопытки; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Принудительная регистрация в системе взаимодействия
// 
// Возвращаемое значение:
//   - 
//
Процедура ПринудительнаяРегистрацияВСистемеВзаимодействия() Экспорт
	
	Если ОбсужденияСистемыВзаимодействия.ПроверитьВозможностьРегистрацииСистемыВзаимодействия() Тогда
		
		ЭтоОблачнаяБаза = Ложь;
		Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
			И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
			
			ЭтоОблачнаяБаза = Истина;
		КонецЕсли; 
		
		ДанныеРегистрации = ОбсужденияСистемыВзаимодействия.ДанныеДляРегистрацииСистемыВзаимодействия(ЭтоОблачнаяБаза);	
		Если ЗначениеЗаполнено(ДанныеРегистрации) Тогда
			
			ПараметрыВзаимодействия = Новый ПараметрыРегистрацииИнформационнойБазыСистемыВзаимодействия();
			ПараметрыВзаимодействия.АдресСервера			= ДанныеРегистрации.Сервер;
			ПараметрыВзаимодействия.АдресЭлектроннойПочты 	= ДанныеРегистрации.АдресЭлектроннойПочты;
			ПараметрыВзаимодействия.ИмяИнформационнойБазы 	= ДанныеРегистрации.ИмяИнформационнойБазы;
			ПараметрыВзаимодействия.КодАктивации 			= ДанныеРегистрации.КодРегистрации;
			
			Оповещение = Новый ОписаниеОповещения("РегистрацияВыполненаПринудительно", ЭтотОбъект,, "РегистрацияНеВыполнена", ЭтотОбъект);
			
			Попытка
				СистемаВзаимодействия.НачатьРегистрациюИнформационнойБазы(Оповещение, ПараметрыВзаимодействия);
				
				Если ЭтоОблачнаяБаза = Ложь Тогда
					ОбсужденияСистемыВзаимодействия.ЗначениеКонстантыРегистрироватьСистемуВзаимодействия(Ложь);
				КонецЕсли;
	
			Исключение
				Инф = ИнформацияОбОшибке();
				Сообщение = "При регистрации произошли ошибки. " + Инф;
			КонецПопытки; 
			
		КонецЕсли;
		
	Иначе
		Сообщение = "У текущего пользователя недостаточно прав для регистрации в системе взаимодействия"; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	КонецЕсли;
		
КонецПроцедуры

// Функция - Отмена регистрации в системе взаимодействия
// 
// Возвращаемое значение:
//   - 
//
Процедура ОтменаРегистрацииВСистемеВзаимодействия() Экспорт
	
	Попытка
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтменаРегистрацииВыполнена", ЭтотОбъект); 
		СистемаВзаимодействия.НачатьОтменуРегистрацииИнформационнойБазы(ОписаниеОповещения);
		
	Исключение
		Возврат;
	КонецПопытки;

КонецПроцедуры

// Процедура - Показать подключение
//
// Параметры:
//  ОписаниеЗавершения	 - 	 - 
//
Процедура ПоказатьПодключение(ОписаниеЗавершения = Неопределено) Экспорт
	
	ОткрытьФорму("Обработка.РегистрацияВСистемеВзаимодействия.Форма",,,,,, ОписаниеЗавершения);

КонецПроцедуры

// Процедура - Показать отключение
//
Процедура ПоказатьОтключение() Экспорт
	
	Если Не ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена() Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Подключение обсуждений не выполнено.'"));
		Возврат;
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Отключить", НСтр("ru = 'Отключить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет);
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбОтключении", ЭтотОбъект);
	
	ПоказатьВопрос(
			Оповещение, 
			НСтр("ru = 'Отключить обсуждения?'"),
			Кнопки,, 
			КодВозвратаДиалога.Нет
		);
	
КонецПроцедуры

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции

// Процедура - Регистрация выполнена принудительно
//
// Параметры:
//  Результат		 - 	 - 
//  ТекстСообщения	 - 	 - 
//  ДопПараметры	 - 	 - 
//
Процедура РегистрацияВыполненаПринудительно(Результат, ТекстСообщения, ДопПараметры) Экспорт
	
	ОбсужденияСистемыВзаимодействия.УстановитьЗначениеКонстанте(Истина);
	
	Сообщение = "Регистрация выполнена успешно."; 
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
	
КонецПроцедуры

// Процедура, обработчик оповещения "РегистрацияНеВыполнена".  
// Параметры:  
//  Результат - результат
//  ТекстСообщения - текст сообщения
//  ДопПараметры - Дополнительные параметры
//
Процедура РегистрацияНеВыполнена(Результат, ТекстСообщения, ДопПараметры) Экспорт
	ОбсужденияСистемыВзаимодействия.УстановитьЗначениеКонстанте(Ложь); 	
КонецПроцедуры

// Процедура - Отмена регистрации выполнена
//
// Параметры:
//  ДопПараметры - 	 - 
//
Процедура ОтменаРегистрацииВыполнена(ДопПараметры) Экспорт
	ОбсужденияСистемыВзаимодействия.УстановитьЗначениеКонстанте(Ложь);
КонецПроцедуры

// Процедура, обработчик оповещения "РегистрацияВыполнена".  
// Параметры:  
//  Результат - результат
//  ТекстСообщения - текст сообщения
//  ДопПараметры - Дополнительные параметры
//
Процедура РегистрацияВыполнена(Результат, ТекстСообщения, ДопПараметры) Экспорт
	ОбсужденияСистемыВзаимодействия.УстановитьЗначениеКонстанте(Истина);
КонецПроцедуры

// Процедура - Открыть форму звонка оповещение
//
Процедура ОповеститьОВходящемЗвонкеКлиента() Экспорт	
	
	ПоказатьОповещениеПользователя(ПараметрыОповещенияОЗвонке.Заголовок, 
		ПараметрыОповещенияОЗвонке.ОписаниеОповещения, 
		ПараметрыОповещенияОЗвонке.СообщениеОповещения,
		БиблиотекаКартинок.Телефон32,,
		ПараметрыОповещенияОЗвонке.КлючУникальностиОповещения);
	
КонецПроцедуры

// Процедура - После ответа на вопрос об отключении
//
// Параметры:
//  КодВозврата	 - 	 - 
//  Контекст	 - 	 - 
//
Процедура ПослеОтветаНаВопросОбОтключении(КодВозврата, Контекст) Экспорт
	
	Если КодВозврата = "Отключить" Тогда 
		ПриОтключении();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - При отключении
//
Процедура ПриОтключении()
	
	Попытка
		Оповещение = Новый ОписаниеОповещения("ПослеУспешногоОтключения", ЭтотОбъект,, "ПриОбработкеОшибкиОтключения", ЭтотОбъект);
		СистемаВзаимодействия.НачатьОтменуРегистрацииИнформационнойБазы(Оповещение);
	Исключение
		Возврат;
	КонецПопытки;

КонецПроцедуры

// Процедура - После успешного отключения
//
// Параметры:
//  Контекст - 	 - 
//
Процедура ПослеУспешногоОтключения(Контекст) Экспорт
	
	Оповестить("ОбсужденияПодключены", Ложь);
	ОбсужденияСистемыВзаимодействия.УстановитьЗначениеКонстанте(Ложь);
	
КонецПроцедуры

// Процедура - При обработке ошибки отключения
//
// Параметры:
//  ИнформацияОбОшибке	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//  Контекст			 - 	 - 
//
Процедура ПриОбработкеОшибкиОтключения(ИнформацияОбОшибке, СтандартнаяОбработка, Контекст) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке);
	
КонецПроцедуры

// Функция - Проверить актуальность сообщения
//
// Параметры:
//  ДатаСообщения	 - 	 - 
//  КлючОбсуждения	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьАктуальностьСообщения(ДатаСообщения, КлючОбсуждения)

	Если ЗначениеЗаполнено(ДатаСообщения) 
		И (СтрНачинаетсяС(КлючОбсуждения, "ОбновитьСогласованияСтраховыхУслуг")
		ИЛИ КлючОбсуждения = "ОбновленСтатусЗаявки"
		ИЛИ КлючОбсуждения = "ИзмененЭтапСделки" 
		ИЛИ КлючОбсуждения = "ДобавленаСделка" 
		ИЛИ КлючОбсуждения = "НеобходимоОбновитьКешНастроекПоОповещениямВзаимодействий" 
		ИЛИ КлючОбсуждения = "ЗакрытьФормуЗвонкаПациенту" 
		ИЛИ КлючОбсуждения = "ОбновитьЗадачуКанбан"
		ИЛИ КлючОбсуждения = "ОбновлениеРабочегоСтола") Тогда    
		
		//ПараметрыПользователя  = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента(); 
		//ПоправкаКВремениСеанса = ?(ПараметрыПользователя.Свойство("ПоправкаКВремениСеанса"), ПараметрыПользователя.ПоправкаКВремениСеанса, 0);
		
		ВремяПроверки = ТекущаяДата() - 5*60;
		
		Возврат ДатаСообщения < ВремяПроверки;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область СБП

// Процедура - Оповестить при получении оплаты СБП
//
Процедура ОповеститьПриПолученииОплатыСБП(ДанныеОповещения) Экспорт 
	
	Оповестить("СБП_УспешнаяОплата", ДанныеОповещения);
	
КонецПроцедуры

// Процедура - Оповестить при возврате оплаты СБП
//
// Параметры:
//  ДанныеОповещения - 	 - 
//
Процедура ОповеститьПриВозвратеОплатыСБП(ДанныеОповещения) Экспорт 
	
	Оповестить("СБП_ВозвратОплаты", ДанныеОповещения);
	ПоказатьОповещениеПользователя("Система быстрых платежей", ПолучитьНавигационнуюСсылку(ДанныеОповещения.ОснованиеОплаты), "Возврат оплаты по СБП успешно проведен",,, "СБП_ВозвратОплаты" + ДанныеОповещения.transaction_id);	
	
КонецПроцедуры

// Процедура - Обработка оповещения об успешности оплаты
//
// Параметры:
//  ЭтаФорма	 - 	 - 
//  Параметры	 - 	 - 
//  Объект		 - 	 - 
//
Процедура ОбработкаОповещенияОбУспешностиОплатыСБП(ЭтаФорма, Параметры, ЭтоВозврат = Ложь) Экспорт
	
	ОповеститьПользователя = Ложь;
	Если ТипЗнч(Параметры) <> Тип("Структура") ИЛИ Не Параметры.Свойство("ОснованиеОплаты") ИЛИ Не ЗначениеЗаполнено(Параметры.ОснованиеОплаты) ИЛИ ЭтаФорма.Открыта() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если (ЭтаФорма.ИмяФормы = "Обработка.ПомощникПроведенияОплаты.Форма.ФормаОплаты" 
		ИЛИ ЭтаФорма.ИмяФормы = "Обработка.ПомощникПроведенияОплаты.Форма.ДиалогВзносаНаЛицевойСчет") 
		И ЭтаФорма.Контрагент = Параметры.Контрагент Тогда
		
		ЭтаФорма.Закрыть();
		ОповеститьПользователя = Истина;						
		
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "Объект")
		И (ТипЗнч(ЭтаФорма.Объект.Ссылка) = Тип("ДокументСсылка.Реализация") 
		ИЛИ ТипЗнч(ЭтаФорма.Объект.Ссылка) = Тип("ДокументСсылка.ВозвратОтПокупателя")
		ИЛИ ТипЗнч(ЭтаФорма.Объект.Ссылка) = Тип("ДокументСсылка.Прием")
		ИЛИ ТипЗнч(ЭтаФорма.Объект.Ссылка) = Тип("ДокументСсылка.ПланЛечения")
		ИЛИ ТипЗнч(ЭтаФорма.Объект.Ссылка) = Тип("ДокументСсылка.НарядЗаказ"))
		И СтрРазделить(Параметры.СтрокаОснований, ",", Ложь).Найти(Строка(ЭтаФорма.Объект.Ссылка.УникальныйИдентификатор())) <> Неопределено Тогда
		
		ЭтаФорма.Закрыть();					
		
	КонецЕсли;
	
	Если ОповеститьПользователя И ЭтоВозврат = Ложь Тогда		
		ПоказатьОповещениеПользователя("Система быстрых платежей", ПолучитьНавигационнуюСсылку(Параметры.ОснованиеОплаты), "Оплата по СБП успешно проведена",,, "СБП_УспешнаяОплата" + Параметры.transaction_id);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти