
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор 			  = ПолучитьИзВременногоХранилища(Параметры.Отбор);
	ИмяКоманды 		  = Параметры.ИмяКоманды;
	ВыбранноеЗначение = Параметры.ВыбранноеЗначение;
	
	Параметры.Свойство("ИспользоватьОграничениеФильтров", ЭтотОбъект.ИспользоватьОграничениеФильтров);
	
	Если Параметры.Свойство("ИсключаемыеФильтры") И ЗначениеЗаполнено(Параметры.ИсключаемыеФильтры) Тогда
		ОбработатьИсключениеФильтров(Параметры.ИсключаемыеФильтры);
	КонецЕсли;
	
	// Создание динамических элементов с параметрами отбора.
	ИнициализироватьМеханизмФильтрацииДанных(Отбор);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, ИмяКоманды, , Неопределено);
	Если РезультатОбновления.Свойство("ДействиеЭлемента") И РезультатОбновления.ДействиеЭлемента = "ОбработкаВыбора" Тогда 
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
			СтандартнаяОбработка = Ложь;
			//ВыбранноеЗначение = Неопределено;
			//ЭлементФормы.ОбновитьТекстРедактирования(); 			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ____________________ОБРАБОТЧИКИ_МЕХАНИЗМА_ФИЛЬТРАЦИИ_ДАННЫХ________________________

&НаСервере
// Процедура, обрабатывает исключение переданных фильтров из общего механизма.
//
Процедура ОбработатьИсключениеФильтров(ИсключаемыеФильтры)
	
	// Скрываем элементы фильтров.
	Для Каждого ИмяФильтра Из ИсключаемыеФильтры Цикл
		Элементы["Фильтр_" + ИмяФильтра].Видимость					 = Ложь;
		Элементы["Страница_Значения_Фильтр_" + ИмяФильтра].Видимость = Ложь;
	КонецЦикла;
	
	// Устанавливаем текущей первую не скрытую страницу.
	Для Каждого Элемент Из Элементы.СтраницыЗначенийФильтров.ПодчиненныеЭлементы Цикл
		Если Элемент.Видимость = Истина Тогда
			Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область __________________ИНИЦИАЛИЗАЦИЯ_МЕХАНИЗМА_ФИЛЬТРАЦИИ______________________

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ИнициализироватьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено)
		
	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов();	
	
	// Отбор статус.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусов");	
	ОбновитьДинамическоеМенюФильтрации_Статус(РезультатПакетногоЗапроса[0].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусов_ВариантОтбора"), ПараметрыОтбора.МассивСтатусов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов, Истина,,,ВариантОтбора);		
	КонецЕсли;
	
	// Отбор структурная единица.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц");	
	ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтруктурныхЕдиниц_ВариантОтбора"), ПараметрыОтбора.МассивСтруктурныхЕдиниц_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтруктурнаяЕдиница", ПараметрыОтбора.МассивСтруктурныхЕдиниц, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	// Отбор сотрудника регистрации.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСотрудниковРегистрации");
	ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(РезультатПакетногоЗапроса[4].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСотрудниковРегистрации_ВариантОтбора"), ПараметрыОтбора.МассивСотрудниковРегистрации_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СотрудникРегистрации", ПараметрыОтбора.МассивСотрудниковРегистрации, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор рекламного источника.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивРекламныхИсточников");
	ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(РезультатПакетногоЗапроса[3].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивРекламныхИсточников_ВариантОтбора"), ПараметрыОтбора.МассивРекламныхИсточников_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_РекламныйИсточник", ПараметрыОтбора.МассивРекламныхИсточников, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор канал привлечения.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивКаналовПривлечения");
	ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(РезультатПакетногоЗапроса[5].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивКаналовПривлечения_ВариантОтбора"), ПараметрыОтбора.МассивКаналовПривлечения_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_КаналПривлечения", ПараметрыОтбора.МассивКаналовПривлечения, Истина,,, ВариантОтбора);	
	КонецЕсли;
	
	// Отбор пометка удаления.         
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления"); 
	ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияЗаявки(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("СписокСтатусовПометокУдаления_ВариантОтбора"), ПараметрыОтбора.СписокСтатусовПометокУдаления_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ПометкаУдаленияЗаявки", ПараметрыОтбора.СписокСтатусовПометокУдаления, Истина,,, ВариантОтбора);				
	КонецЕсли;
	
	// Отбор менеджеров.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивМенеджеров"); 
	ОбновитьДинамическоеМенюФильтрации_Менеджер(РезультатПакетногоЗапроса[2].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивМенеджеров_ВариантОтбора"), ПараметрыОтбора.МассивМенеджеров_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Менеджер", ПараметрыОтбора.МассивМенеджеров, Истина, НСтр("ru = '<не указан>'; en = '<not specified>'"),, ВариантОтбора);
	КонецЕсли;	
	
	// Отбор дата создания.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодСозданияСделки");
	ОбновитьДинамическоеМенюФильтрации_СозданаПериод(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СозданаПериод", ПараметрыОтбора.ПериодСозданияСделки);	
	КонецЕсли;	
	
	// Отбор дата обработки.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ПериодОбработки");
	ОбновитьДинамическоеМенюФильтрации_ДатаОбработки(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ДатаОбработки", ПараметрыОтбора.ПериодОбработки);	
	КонецЕсли;	
	
	// Отбор статус пациента.	
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусовПациента");
	ОбновитьДинамическоеМенюФильтрации_СтатусПациента(, УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусовПациента_ВариантОтбора"), ПараметрыОтбора.МассивСтатусовПациента_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_СтатусПациента", ПараметрыОтбора.МассивСтатусовПациента,,,, ВариантОтбора);	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр статус.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Статус(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра	
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус'; en = 'Status'"));	
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗаявок"));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра	
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																														
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр структурная единица.
//
// Параметры:
//  ТаблицаСтруктурныхЕдиниц - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СтруктурнаяЕдиница(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Клиника'; en = 'Clinics'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СтруктурнаяЕдиница");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), НСтр("ru = '<не указана>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр сотрудник регистрации.
//
// Параметры:
//  ТаблицаСтатусов			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СотрудникРегистрации(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Кем создан'; en = 'Who created'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СотрудникРегистрации");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Пользователи"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Пользователи.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр сотрудник регистрации.
//
// Параметры:
//  ТаблицаСтатусов			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СтатусПациента(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус пациента'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СтатусПациента");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКонтрагентов"));	

	// Формируем коллекцию значений.
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКонтрагентов"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Перечисления.СтатусыКонтрагентов.Первичный, НСтр("ru= 'Новый'")));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Перечисления.СтатусыКонтрагентов.Постоянный, НСтр("ru= 'Постоянный'")));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр рекламный источник.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_РекламныйИсточник(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Источник'; en = 'Source'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_РекламныйИсточник");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.РекламныеИсточники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.РекламныеИсточники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр рекламный источник.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_КаналПривлечения(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Рекламная площадка'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_КаналПривлечения");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.КаналыПривлечения"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.КаналыПривлечения.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																													
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр менеджер.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Менеджер(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Куратор'; en = 'Curator'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Менеджер");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));	

	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не указан>'; en = '<not specified>'"), , Истина);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить динамическое меню фильтрации пометка удаления заявки.
//
// Параметры:
//  КоллекцияЗначений		 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ПометкаУдаленияЗаявки(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	// Инициализируем параметры текущего фильтра
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Пометка удаления'; en = 'Delete mark'"));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ПометкаУдаленияЗаявки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Булево"));	
	СтруктураФильтра.Вставить("ВариантОтбора"							, Ложь);
	
	// Формируем коллекцию сами
	КоллекцияЗначений = Новый ТаблицаЗначений;
	КоллекцияЗначений.Колонки.Добавить("Ссылка"			, Новый ОписаниеТипов("Булево"));
	КоллекцияЗначений.Колонки.Добавить("Представление"	, Новый ОписаниеТипов("Строка"));
	ЗаполнитьЗначенияСвойств(КоллекцияЗначений.Добавить(), Новый Структура("Ссылка, Представление", Истина, НСтр("ru= 'Удалено'; en='Deleted'") ));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр период создана.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_СозданаПериод(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Дата создания'; en = 'Created by'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_СозданаПериод");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры 

&НаСервере
// Процедура, инициализировать фильтр период создана.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ДатаОбработки(ДанныеПериода = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Дата обработки'; en = 'Created by'"));
	СтруктураФильтра.Вставить("РеквизитДата"							, НачалоДня(ТекущаяДатаСеанса()));
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ДатаОбработки");
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СтандартныйПериод"));
	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, , Новый СтандартныйПериод, НСтр("ru = 'За весь период'; en = 'For all period'"));
																												
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																												
		
КонецПроцедуры 

&НаСервере
// Функция, возвращает структуру отборов формы.
//
Функция ПолучитьСтруктуруЗначенийОтбора()
	
	// Метод "ПолучитьЗначенияФильтра" возвращает список активированных значений фильтра.
	// У полученного списка значений есть свойство "ДоступныеЗначения", в котором хранится список всех значений.
	// Таким образом мы одним методом за одну итерацию получаем 2 списка значений(с активированными значениями и всеми значениями).
	// Вариант отбора передается в свойстве "ДоступныеЗначения" в представлении у любого элемента списка.
	
	СтруктураОтборов = Новый Структура();
	СтруктураОтборов.Вставить("ОтборСтатус"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус"));
	СтруктураОтборов.Вставить("ОтборСтруктурнаяЕдиница"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтруктурнаяЕдиница"));
	СтруктураОтборов.Вставить("ОтборМенеджер"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Менеджер"));		
	СтруктураОтборов.Вставить("ОтборВидСделки"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ВидСделки"));	
	СтруктураОтборов.Вставить("ОтборЭтап"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Этап"));
	СтруктураОтборов.Вставить("ОтборСотрудникРегистрации"	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СотрудникРегистрации"));
	СтруктураОтборов.Вставить("ОтборРекламныйИсточник"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_РекламныйИсточник"));
	СтруктураОтборов.Вставить("ОтборТег"					, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Тег"));
	СтруктураОтборов.Вставить("ОтборИнтерес"	 			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Интерес"));
	СтруктураОтборов.Вставить("ОтборЗадача"	 				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Задача"));	
	СтруктураОтборов.Вставить("ОтборКаналПривлечения"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_КаналПривлечения"));	
	СтруктураОтборов.Вставить("ОтборЗавершена"				, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПризнакВыполненияСделки"));
	СтруктураОтборов.Вставить("ОтборДатаСоздания"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СозданаПериод"));
	СтруктураОтборов.Вставить("ОтборДатаОбработки"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ДатаОбработки"));
	СтруктураОтборов.Вставить("ОтборПометкаУдаления"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ПометкаУдаленияЗаявки"));
	СтруктураОтборов.Вставить("ОтборСтатусПациента"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_СтатусПациента"));
		
	Возврат СтруктураОтборов;
	
КонецФункции	

&НаСервереБезКонтекста
// Функция, возвращает пакет запроса с элементами для создания отборов.
//
Функция ПолучитьПакетЗапросаЗначенийДляОтборов()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЗаявок.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыЗаявок.Ссылка) КАК Представление
	|ИЗ
	|	Перечисление.СтатусыЗаявок КАК СтатусыЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка,
	|	СтруктурныеЕдиницы.Представление КАК Представление
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Заявки.ОсновнойМенеджер КАК Ссылка,
	|	Заявки.ОсновнойМенеджер.Представление КАК Представление
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.ОсновнойМенеджер.ПометкаУдаления
	|	И Заявки.ОсновнойМенеджер <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Заявки.РекламныйИсточник КАК Ссылка,
	|	Заявки.РекламныйИсточник.Представление КАК Представление
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.РекламныйИсточник.ПометкаУдаления
	|	И Заявки.РекламныйИсточник <> ЗНАЧЕНИЕ(Справочник.РекламныеИсточники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Заявки.Автор КАК Ссылка,
	|	Заявки.Автор.Представление КАК Представление
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.Автор.ПометкаУдаления
	|	И Заявки.Автор <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Заявки.КаналПривлечения КАК Ссылка,
	|	Заявки.КаналПривлечения.Представление КАК Представление
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.КаналПривлечения.ПометкаУдаления
	|	И Заявки.КаналПривлечения <> ЗНАЧЕНИЕ(Справочник.КаналыПривлечения.ПустаяСсылка)");
	
	Возврат Запрос.ВыполнитьПакет();
		
КонецФункции

#КонецОбласти

#Область ___________________ОБРАБОТЧИКИ_МЕХАНИЗМА_ФИЛЬТРАЦИИ_______________________

&НаСервере
// Процедура - Применить механизм фильтрации данных.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ПрименитьМеханизмФильтрацииДанных(ДанныеЭлементаФильтрации, ЗакрытиеФормы = Неопределено) Экспорт
		
	МассивСтрокОбрабатываемыхФильтров = ТаблицаФильтров.НайтиСтроки(Новый Структура("Применен", Ложь));
	Для Каждого СтрокаФильтра ИЗ МассивСтрокОбрабатываемыхФильтров Цикл
		УправлениеИнтерфейсамиСервер.ОбновитьГруппуАктивированныхЗначенийФильтра(ЭтаФорма, СтрокаФильтра);
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия элемента фильтрации данных.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатияЭлементаФильтрацииДанных(Команда, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, Команда.Имя, , ВыбранноеЗначение);
	Если РезультатОбновления.Свойство("ДействиеЭлемента") И РезультатОбновления.ДействиеЭлемента = "ОбработкаВыбора" Тогда 
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
			СтандартнаяОбработка = Ложь;			
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		
		Если Команда.Имя = "ПрименитьНастройкиФильтрации" Тогда			
			ПараметрыОтбора = ПараметрыВыбранныхФильтров(Новый Структура);
			Закрыть(ПараметрыОтбора);			
		КонецЕсли;
		
	Исключение      // В ЖР ошибка "обращение к недействительному объекту" когда мы обращаемся к элементу формы,		                   
	КонецПопытки;   // а он был удален, но в переменной остался. Временно в попытку
	
КонецПроцедуры

&НаСервере
// Функция - Данные выбранных фильтров.
//
Функция ПараметрыВыбранныхФильтров(ПараметрыОтбора)
	
	Для каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбора(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусов"			   				  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусов_ВариантОтбора"				  , Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СтруктурнаяЕдиница" Тогда
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц"					  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтруктурныхЕдиниц_ВариантОтбора"	  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Менеджер" Тогда
				ПараметрыОтбора.Вставить("МассивМенеджеров"				 			  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивМенеджеров_ВариантОтбора"			  , Строка.ВариантОтбора);
 
			ИначеЕсли Строка.Наименование = "Фильтр_СотрудникРегистрации" Тогда
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации"				  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСотрудниковРегистрации_ВариантОтбора" , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_РекламныйИсточник" Тогда
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников"			  	  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивРекламныхИсточников_ВариантОтбора"	  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_КаналПривлечения" Тогда
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения"				 	  , МассивДанных);
				ПараметрыОтбора.Вставить("МассивКаналовПривлечения_ВариантОтбора"	  , Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_ПометкаУдаленияЗаявки" Тогда
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления"			  , МассивДанных);
				ПараметрыОтбора.Вставить("СписокСтатусовПометокУдаления_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_СтатусПациента" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусовПациента"				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусовПациента_ВариантОтбора"	, Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_СозданаПериод" Тогда
				ПараметрыОтбора.Вставить("ПериодСозданияСделки", МассивДанных);

			ИначеЕсли Строка.Наименование = "Фильтр_ДатаОбработки" Тогда
				ПараметрыОтбора.Вставить("ПериодОбработки", МассивДанных);

			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыОтбора, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбора(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если НаименованиеФильтра = "Фильтр_СозданаПериод" Или НаименованиеФильтра = "Фильтр_ДатаОбработки" Тогда
		Если СписокЗначений.Количество() > 0 Тогда
			ЗаданноеЗначение = СписокЗначений.Получить(0).Значение; 
			Массив.Добавить(ЗаданноеЗначение.ЗначениеФильтра);
		КонецЕсли;
	Иначе
		Если СписокЗначений.Количество() > 0 Тогда
			Для каждого Значение из СписокЗначений Цикл
				Если Значение.Значение.Выбран = Истина Тогда
					Массив.Добавить(Значение.Значение.ЗначениеФильтра);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
// Процедура - Обновить свойства разделов фильтра.
//
// Параметры:
//  АктуализироватьФлаги - 	 - 
//
Процедура ОбновитьСвойстваРазделовФильтра(АктуализироватьФлаги = Ложь, ИмяСтраницыЗначенийФильтра = Неопределено) Экспорт
	
	Если ИмяСтраницыЗначенийФильтра <> Неопределено Тогда 
		Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница = Элементы[ИмяСтраницыЗначенийФильтра];
	КонецЕсли;		
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваРазделовФильтра(ЭтаФорма, АктуализироватьФлаги);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить группу значений фильтра.
//
// Параметры:
//  ИдентификаторСтрокиФильтра	 - 	 - 
//
Процедура ОбновитьГруппуЗначенийФильтра(ИдентификаторСтрокиФильтра, ИнициализироватьВыбранноеЗначение = Ложь, ВыбранноеЗначение = Неопределено) Экспорт
	
	СтрокаФильтра = ТаблицаФильтров.НайтиПоИдентификатору(ИдентификаторСтрокиФильтра);
	УправлениеИнтерфейсамиСервер.ОбновитьГруппуЗначенийФильтра(ЭтаФорма, СтрокаФильтра, ИнициализироватьВыбранноеЗначение, ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства элемента значения.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ОбновитьСвойстваЭлементаЗначения(ДанныеЭлементаФильтрации) Экспорт
	
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваЭлементаЗначения(ЭтаФорма, , , ДанныеЭлементаФильтрации);
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет группу активированных значений фильтра.
//
Процедура ОбновитьГруппуАктивированныхЗначенийФильтра(ИдентификаторСтрокиФильтра) Экспорт
	
	СтрокаФильтра = ТаблицаФильтров.НайтиПоИдентификатору(ИдентификаторСтрокиФильтра);
	УправлениеИнтерфейсамиСервер.ОбновитьГруппуАктивированныхЗначенийФильтра(ЭтотОбъект, СтрокаФильтра);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор стандартного периода.
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборСтандартногоПериода(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ РезультатВыбора = Неопределено И НЕ ДополнительныеПараметры = Неопределено Тогда
		ЭлементВариантСтандартногоПериода = ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.НайтиПоЗначению(РезультатВыбора.Значение);
		Если НЕ ЭлементВариантСтандартногоПериода = Неопределено Тогда
			ДополнительныеПараметры.Вставить("ИдентификаторЗначения", ЭлементВариантСтандартногоПериода.ПолучитьИдентификатор());
			ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);
			ЭлементВариантСтандартногоПериода.Пометка = Истина;
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, "УстановитьСтандартныйПериод_ЗначениеФильтра_Идентификатор_" + ДополнительныеПараметры.ИдентификаторФильтра, ДополнительныеПараметры);
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецОбласти

