
#Область ОбработчикиКомандФормы

&НаКлиенте
//Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "НарядЗаказ");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораДокументаПечати", ЭтотОбъект, Структура);									

	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Обработка выбора документа печати
//
Процедура ОбработкаВыбораДокументаПечати(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат.Значение = "ПФ_MXL_ГарантийныйТалон" 
		ИЛИ Результат.Значение = "ПФ_MXL_Квитанция" Тогда
		
		 Параметры.ИмяДокумента = "Прием";
		
	КонецЕсли;
	
	УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(Результат, Параметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Получить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.НарядЗаказ.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти
