
 
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновкиДанных = Документы.РассылкаСообщений.ПолучитьМакет("ОтборПолучателей");
	
	// Добавим дополнительные реквизиты
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.ОтборПолучателей.Запрос;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДополнительныеРеквизитыИСведения.Наименование УБЫВ";
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	КонецЦикла;

	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	ОтборПолучателей.Инициализировать(ИсточникНастроек);
	ОтборПолучателей.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Если Параметры.Свойство("ТаблицаПолучателей") = Истина Тогда
		ТаблицаПолучателей.Загрузить(Параметры.ТаблицаПолучателей.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "Обновить"
//
Процедура Обновить(Команда)
	
	ВыполнитьОтбор();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗавершитьПодбор"
//
Процедура ЗавершитьПодбор(Команда)
	
	МассивПолучаетелей = Новый Массив;
	
	Для Каждого ДанныеПолучателя Из ЭтотОбъект.ТаблицаПолучателей Цикл
		МассивПолучаетелей.Добавить(ДанныеПолучателя.Получатель);
	КонецЦикла;
	
	Закрыть(МассивПолучаетелей);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "КомандаЗакрыть"
//
Процедура КомандаЗакрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ОтборИнвентаризацииНастройкиОтборПриИзменении(Элемент)
	
	ВыполнитьОтбор();
	
КонецПроцедуры

&НаСервере
// Процедура, выполняющая отбор контрагентов по заданным условиям
//
Процедура ВыполнитьОтбор()
	
	СхемаКомпоновки = Документы.РассылкаСообщений.ПолучитьМакет("ОтборПолучателей");
	МакетКомпоновки = ОбщегоНазначенияСтоматология.ПолучитьМакетКомпоновки(СхемаКомпоновки, ОтборПолучателей.Настройки);
	Запрос = ОбщегоНазначенияСтоматология.ПолучитьЗапросИзМакетаКомпоновки(МакетКомпоновки, "ОтборПолучателей");
	
	Запрос.УстановитьПараметр("СтруктурныеЕдиницы", Новый_Массив(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ТипыВнешнихСистем", Справочники.ВнешниеСистемы.ПолучитьМассивТиповВнешнихСистемМессенджера());
	
	ТаблицаПолучателей.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


#КонецОбласти
