
#Область ОбработчикиСобытийФормы

&НаСервере    
// Процедура При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (Параметры.Свойство("Промокод") И ЗначениеЗаполнено(Параметры.Промокод)) 
		ИЛИ Параметры.Свойство("ВыборПромокода", Истина) Тогда
		
		Элементы.Вид.Видимость		 = Ложь;
		Элементы.Активен.Видимость	 = Ложь;
		КоманднаяПанель.Видимость    = Ложь;
		Элементы.Владелец.Заголовок	 = "Распространитель";
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Параметры.Промокод;
	
	КонецЕсли;     	
	
КонецПроцедуры

&НаКлиенте       
// Процедура Обработка оповещения.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленыПромокоды" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, обработчик события "ПередУдалением".
//
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Изменить выделенное
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ИзменитьВыделенное(Команда)
		
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

#КонецОбласти
