
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	спсНаборов = ?(Параметры.Свойство("спсНаборов"), Параметры.спсНаборов, Новый СписокЗначений);
	Группы     = ?(Параметры.Свойство("Группы"), Параметры.Группы, Новый СписокЗначений);

	ПолучитьСписокГруппДляВыбора(спсНаборов, Группы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура Завершить(Команда)
	
	СписокВыбранныхГрупп.Очистить();
	Для Каждого ЭлементДерева Из ДеревоГрупп.ПолучитьЭлементы() Цикл
		
		Для Каждого Строка Из ЭлементДерева.ПолучитьЭлементы() Цикл
			
			Если Строка.Выбран Тогда
				СписокВыбранныхГрупп.Добавить(Строка.Группа);
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	Закрыть(СписокВыбранныхГрупп);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаСервере
Функция ПолучитьСписокГруппДляВыбора(спсНаборов, Группы)
	
	СписокДоступныхТипов = Новый СписокЗначений;
	
	// 1. Получение списка необходимых типов справочников
	Для Каждого ЭлементСписка Из спсНаборов Цикл
		
		Если ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_Договоры Тогда
			 СписокДоступныхТипов.Добавить("Справочник.Договоры");
		ИначеЕсли ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_Контрагенты
			 Или ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_Клиенты Тогда
			 СписокДоступныхТипов.Добавить("Справочник.Контрагенты");
		ИначеЕсли ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_Номенклатура Тогда
			 СписокДоступныхТипов.Добавить("Справочник.Номенклатура");
		ИначеЕсли ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_Организации Тогда
			 СписокДоступныхТипов.Добавить("Справочник.Организации");
		ИначеЕсли ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_ПапкиФайлов Тогда
			 СписокДоступныхТипов.Добавить("Справочник.ПапкиФайлов");
		ИначеЕсли ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_ПартииНоменклатуры Тогда
			 СписокДоступныхТипов.Добавить("Справочник.ПартииНоменклатуры");
		ИначеЕсли ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_СтруктурныеЕдиницы Тогда
			 СписокДоступныхТипов.Добавить("Справочник.СтруктурныеЕдиницы");
		ИначеЕсли ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_Сотрудники Тогда
			 СписокДоступныхТипов.Добавить("Справочник.Сотрудники");
		ИначеЕсли ЭлементСписка.Значение = Справочники.НаборыСвойств.Справочник_Файлы Тогда
			 СписокДоступныхТипов.Добавить("Справочник.Файлы");
		КонецЕсли;
		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	
	// Формирование текста запроса
	Текст = "";
	Для Каждого ЭлементСписка Из СписокДоступныхТипов Цикл
		
		ИмяСправочника = СтрЗаменить(ЭлементСписка, "Справочник.", "");
		
		Текст = Текст + ?(ЗначениеЗаполнено(Текст), " ОБЪЕДИНИТЬ ВСЕ ", "") + 
			"ВЫБРАТЬ
			|	Таблица.Ссылка КАК Группа,
			|   """ + ИмяСправочника + """ КАК ИмяСправочника,
			|   Таблица.Наименование КАК Наименование
			|ИЗ " + ЭлементСписка + " КАК Таблица
			|ГДЕ
			|	Таблица.ЭтоГруппа
			|	И Таблица.Родитель = ЗНАЧЕНИЕ(" + ЭлементСписка + ".ПустаяСсылка)
			|	И НЕ Таблица.ПометкаУдаления";
			
			Если ЭлементСписка.Значение = "Справочник.Номенклатура" Тогда
				
				Текст = СтрЗаменить(Текст, "Таблица.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)", "ИСТИНА");
				
			КонецЕсли;
		
	КонецЦикла;
		
	Если ЗначениеЗаполнено(Текст) Тогда
		
		Запрос.Текст = Текст + 
			" УПОРЯДОЧИТЬ ПО
			|	Наименование
			|ИТОГИ ПО
			|	ИмяСправочника";
				
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ДеревоГруппПеременная = Новый ДеревоЗначений;
		ДеревоГруппПеременная.Колонки.Добавить("Группа");
		ДеревоГруппПеременная.Колонки.Добавить("Выбран");
		ДеревоГруппПеременная.Колонки.Добавить("ЭтоГруппа");

		Пока Выборка.Следующий() Цикл
			
			НоваяСтрокаДерева = ДеревоГруппПеременная.Строки.Добавить();
			Если Выборка.ИмяСправочника = "СтруктурныеЕдиницы" Тогда
				ИмяСправочника = "Структурные единицы";
			Иначе
				ИмяСправочника = Выборка.ИмяСправочника;
			КонецЕсли;
		
			НоваяСтрокаДерева.Группа = ИмяСправочника;
			
			ВыборкаГруппы = Выборка.Выбрать();
			
			Пока ВыборкаГруппы.Следующий() Цикл
				
				НоваяСтрока        = НоваяСтрокаДерева.Строки.Добавить();
				НоваяСтрока.Группа = ВыборкаГруппы.Группа;
				НайденныеСтроки    = Группы.НайтиСтроки(Новый Структура("Группа", ВыборкаГруппы.Группа));
				НоваяСтрока.Выбран = (НайденныеСтроки.Количество() <> 0);

			КонецЦикла;	
			
		КонецЦикла;

		ЗначениеВРеквизитФормы(ДеревоГруппПеременная, "ДеревоГрупп");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
