
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ И КОМАНД

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = ТекущаяДата();
	Объект.Период = ТекущаяДата();
	Объект.ВидЦен = Справочники.ВидыЦен.Розничная;
	Объект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	СтруктурнаяЕдиницаЗаполненияЦен = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ПорядокОкругления = Объект.ВидЦен.ПорядокОкругления;
	ОкруглятьВБольшуюСторону = Объект.ВидЦен.ОкруглятьВБольшуюСторону;
	
	Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	Элементы.ГруппаИзмененияЦен.Видимость = Ложь;
	
	КэшРеквизитов = Новый Структура;
	КэшРеквизитов.Вставить("ПорядокОкругления", Объект.ВидЦен.ПорядокОкругления);
	КэшРеквизитов.Вставить("ОкруглятьВБольшуюСторону", Объект.ВидЦен.ОкруглятьВБольшуюСторону);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
Процедура ЦеныНоменлатурыКартинкаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЦеныНоменлатуры.ТекущиеДанные;
    СтрокаТабличнойЧасти.Пометка = Истина;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
Процедура ЦеныНоменлатурыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.ЦеныНоменлатуры.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "ЦеныНоменлатурыНоменклатура"
//
Процедура ЦеныНоменлатурыНоменклатураПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.ЦеныНоменлатуры.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Упаковка) Тогда	
		СтрокаТаблицы.Упаковка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТаблицы.Номенклатура, "УпаковкаПоумолчанию");
	КонецЕсли;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ДРУГИЕ ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
// Функция возвращает таблицу номенклутары из Таблицы ЦеныНоменклатуры.
//
Функция ПолучитьТаблицуНоменклатуры(Кратко = Ложь)

	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
       
    Массив = Новый Массив;
	
	Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	Массив.Очистить();
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", ОписаниеТипов);
	
	Если НЕ Кратко Тогда
	
		Массив.Добавить(Тип("Булево"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
		Массив.Очистить();
		ТаблицаНоменклатуры.Колонки.Добавить("Пометка", ОписаниеТипов);
		
		Массив.Добавить(Тип("СправочникСсылка.УпаковкиНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
		Массив.Очистить();
		ТаблицаНоменклатуры.Колонки.Добавить("Упаковка", ОписаниеТипов);
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив.Добавить(Тип("Число"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , , КЧ);
		ТаблицаНоменклатуры.Колонки.Добавить("Цена", ОписаниеТипов);
		
		Массив.Добавить(Тип("Число"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , );
		ТаблицаНоменклатуры.Колонки.Добавить("Коэффициент", ОписаниеТипов);	
	
	КонецЕсли; 
	
	Для каждого СтрокаТЧ Из ЦеныНоменлатуры Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Продолжить;		
		КонецЕсли; 
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		Если НЕ Кратко Тогда
			Если СтрокаТЧ.Упаковка.Пустая() Тогда
				НоваяСтрока.Коэффициент = 1;
			Иначе
				НоваяСтрока.Коэффициент = СтрокаТЧ.Упаковка.Коэффициент;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ТаблицаНоменклатуры;

КонецФункции // ПолучитьТаблицуНоменклатуры()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Процедура - обработчик команды "ПоказатьСтраницуРедактированияЦен".
//
Процедура ПоказатьСтраницуРедактированияЦен(Команда)
	
	Если Команда.Имя = "ПоказатьСтраницуЗаполнитьПоЦенам" Тогда		
		Элементы.ГруппаИзмененияЦен.Заголовок="Заполнение цен по клинике и виду цен" ;
		Элементы.ПараметрыСтраницы.ТекущаяСтраница = Элементы.СтраницаЗаполнитьПоЦенам;
		ВидЦен = Объект.ВидЦен;
		Период = ТекущаяДата();
	ИначеЕсли Команда.Имя = "ПоказатьСтраницуЗаполнитьПоДокументу" Тогда	
		Элементы.ГруппаИзмененияЦен.Заголовок="Заполнение цен по документу поступления запасов" ;
		Элементы.ПараметрыСтраницы.ТекущаяСтраница = Элементы.СтраницаЗаполнитьПоДокументу;
	ИначеЕсли Команда.Имя = "ПоказатьСтраницуИзменитьНаПроцент" Тогда		
		Элементы.ГруппаИзмененияЦен.Заголовок="Изменение текущих цен на процент" ;
		Элементы.ПараметрыСтраницы.ТекущаяСтраница = Элементы.СтраницаИзменитьНаПроцент;
		ПлюсМинус = "+";
	ИначеЕсли Команда.Имя = "ПоказатьСтраницуИзменитьНаСумму" Тогда		
		Элементы.ГруппаИзмененияЦен.Заголовок="Изменение текущих цен на сумму" ;
		Элементы.ПараметрыСтраницы.ТекущаяСтраница = Элементы.СтраницаИзменитьНаСумму;
		ПлюсМинус = "+";
	ИначеЕсли Команда.Имя = "ПоказатьСтраницуОкруглить" Тогда		
		Элементы.ГруппаИзмененияЦен.Заголовок="Округление текущих цен" ;
		Элементы.ПараметрыСтраницы.ТекущаяСтраница = Элементы.СтраницаОкруглить;
	КонецЕсли;
	
	Элементы.ГруппаИзмененияЦен.Видимость = Истина;
	
КонецПроцедуры


&НаКлиенте
// Процедура - обработчик команды "ЗаполнитьНоменклатуруПоГруппамНоменклатуры".
//
Процедура ЗаполнитьНоменклатуруПоГруппамНоменклатуры(Команда)
	
	ОчищатьТЧ = Истина;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОбОчисткеЦен", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), "При заполнении номенклатуры таблица цен будет очищена, продолжить ?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеЦен(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	Если ЦеныНоменлатуры.Количество() > 0 И РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат
	КонецЕсли;
	
	МассивВыбранныхГрупп = Неопределено;
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", Новый Структура("МножественныйВыбор", Истина), ЭтаФорма,,,, Новый ОписаниеОповещения("ЗаполнитьНоменклатуруПоГруппамНоменклатурыЗавершение", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоГруппамНоменклатурыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	МассивВыбранныхГрупп = Результат;
	
	ЗаполнитьНоменклатуруПоГруппамНоменклатурыНаСервере(МассивВыбранныхГрупп, ОчищатьТЧ);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ЗаполнитьНоменклатуруПоДокументу".
//
Процедура ЗаполнитьНоменклатуруПоДокументу(Команда)
	
	ОчищатьТЧ = Истина;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНоменклатуруПоДокументуЗавершение1", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), "При заполнении номенклатуры таблица цен будет очищена, продолжить ?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоДокументуЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	
	Если ЦеныНоменлатуры.Количество() > 0 И РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат
	КонецЕсли;
	
	МассивВыбранныхГрупп = Неопределено;
	
	
	ОткрытьФорму("Документ.Поступление.ФормаВыбора", , ЭтаФорма,,,, Новый ОписаниеОповещения("ЗаполнитьНоменклатуруПоДокументуЗавершение", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоДокументуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	
	МассивВыбранныхГрупп = Результат;
	
	ЗаполнитьНоменклатуруПоДокументуНаСервере(МассивВыбранныхГрупп, ОчищатьТЧ);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ЗаполнитьНоменклатуруПоВидуЦен".
//
Процедура ЗаполнитьНоменклатуруПоВидуЦен(Команда)
	
	ОчищатьТЧ = Истина;	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНоменклатуруПоВидуЦенЗавершение1", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), "При заполнении номенклатуры таблица цен будет очищена, продолжить ?", РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоВидуЦенЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	Если ЦеныНоменлатуры.Количество() > 0 И РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыЗаполнения = Неопределено;
	
	
	ОткрытьФорму("Обработка.ФормированиеЦен.Форма.ФормаВыбораПараметров", Новый Структура("ВидЦен", Объект.ВидЦен), ЭтаФорма,,,, Новый ОписаниеОповещения("ЗаполнитьНоменклатуруПоВидуЦенЗавершение", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоВидуЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	
	ПараметрыЗаполнения = Результат;
	
	Если ТипЗнч(ПараметрыЗаполнения) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыЗаполнения.ВидЦен) Тогда	
		ЗаполнитьНоменклатуруПоВидуЦенНаСервере(ПараметрыЗаполнения, ОчищатьТЧ);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ДобавитьНоменклатуруПоГруппамНоменклатуры".
//
Процедура ДобавитьНоменклатуруПоГруппамНоменклатуры(Команда)
	
	ОчищатьТЧ = Ложь;
	
	МассивВыбранныхГрупп = Неопределено;
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", Новый Структура("МножественныйВыбор", Истина), ЭтаФорма,,,, Новый ОписаниеОповещения("ДобавитьНоменклатуруПоГруппамНоменклатурыЗавершение", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруПоГруппамНоменклатурыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	
	МассивВыбранныхГрупп = Результат;
	
	ЗаполнитьНоменклатуруПоГруппамНоменклатурыНаСервере(МассивВыбранныхГрупп, ОчищатьТЧ);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ДобавитьНоменклатуруПоДокументу".
//
Процедура ДобавитьНоменклатуруПоДокументу(Команда)
	
	ОчищатьТЧ = Ложь;
	
	МассивВыбранныхГрупп = Неопределено;
	
	ОткрытьФорму("Документ.Поступление.ФормаВыбора", , ЭтаФорма,,,, Новый ОписаниеОповещения("ДобавитьНоменклатуруПоДокументуЗавершение", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруПоДокументуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	
	МассивВыбранныхГрупп = Результат;
	
	ЗаполнитьНоменклатуруПоДокументуНаСервере(МассивВыбранныхГрупп, ОчищатьТЧ);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ДобавитьНоменклатуруПоВидуЦен".
//
Процедура ДобавитьНоменклатуруПоВидуЦен(Команда)
	
	ОчищатьТЧ = Ложь;
	
	ПараметрыЗаполнения = Неопределено;
	
	ОткрытьФорму("Обработка.ФормированиеЦен.Форма.ФормаВыбораПараметров", Новый Структура("ВидЦен", Объект.ВидЦен), ЭтаФорма,,,, Новый ОписаниеОповещения("ДобавитьНоменклатуруПоВидуЦенЗавершение", ЭтотОбъект, Новый Структура("ОчищатьТЧ", ОчищатьТЧ)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруПоВидуЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОчищатьТЧ = ДополнительныеПараметры.ОчищатьТЧ;
	
	
	ПараметрыЗаполнения = Результат;
	
	Если ТипЗнч(ПараметрыЗаполнения) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыЗаполнения.ВидЦен) Тогда	
		ЗаполнитьНоменклатуруПоВидуЦенНаСервере(ПараметрыЗаполнения, ОчищатьТЧ);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗаполнитьЦеныПоВидуЦен"
//
Процедура ЗаполнитьЦеныПоВидуЦен(Команда)
	
	ЗаполнитьЦеныПоВидуЦенНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗаполнитьЦеныПоДокументу"
//
Процедура ЗаполнитьЦеныПоДокументу(Команда)
	
	ЗаполнитьЦеныПоДокументуНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ИзменитьНаПроцент"
//
Процедура ИзменитьНаПроцент(Команда)
	
	Для каждого СтрокаТЧ Из ЦеныНоменлатуры Цикл
		Если СтрокаТЧ.Пометка Тогда
			Цена = ?(ПлюсМинус = "+", СтрокаТЧ.Цена * (1 + ЧислоЗначение / 100), СтрокаТЧ.Цена * (1 - ЧислоЗначение / 100));	
			СтрокаТЧ.Цена = ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(Цена, КэшРеквизитов.ПорядокОкругления, КэшРеквизитов.ОкруглятьВБольшуюСторону);
		КонецЕсли;		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ИзменитьНаСумму"
//
Процедура ИзменитьНаСумму(Команда)
	
	Для каждого СтрокаТЧ Из ЦеныНоменлатуры Цикл
		Если СтрокаТЧ.Пометка Тогда
			Цена = ?(ПлюсМинус = "+", СтрокаТЧ.Цена + ЧислоЗначение, СтрокаТЧ.Цена - ЧислоЗначение);
			СтрокаТЧ.Цена = ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(Цена, КэшРеквизитов.ПорядокОкругления, КэшРеквизитов.ОкруглятьВБольшуюСторону);
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "Округлить"
//
Процедура Округлить(Команда)
	
	Для каждого СтрокаТЧ Из ЦеныНоменлатуры Цикл
		Если СтрокаТЧ.Пометка Тогда
			Цена = ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(СтрокаТЧ.Цена, ПорядокОкругления, ОкруглятьВБольшуюСторону);
			СтрокаТЧ.Цена = Цена;
		КонецЕсли;		
	КонецЦикла;		     
	
КонецПроцедуры


&НаКлиенте
// Процедура, обработчик команды "Удалить"
//
Процедура Удалить(Команда)
	
	УдалитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СнятьАктуальность"
//
Процедура СнятьАктуальность(Команда)
	
	УстановитьНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "Установить"
//
Процедура Установить(Команда)
	
	УстановитьНаСервере();
	
КонецПроцедуры


&НаКлиенте
// Процедура, обработчик команды "СнятьПометки"
//
Процедура СнятьПометки(Команда)
	
	Для каждого СтрокаТаблицы Из ЦеныНоменлатуры Цикл
		СтрокаТаблицы.Пометка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОтметитьВсе"
//
Процедура ОтметитьВсе(Команда)
	
	Для каждого СтрокаТаблицы Из ЦеныНоменлатуры Цикл
		СтрокаТаблицы.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - МЕХАНИЗМЫ ЗАПОЛНЕНИЯ ТАБЛИЦЫ СЕРВЕР

&НаСервере
// Процедура заполняет таблицу ЦеныНоменклатуры номенклатурой входящей в группу номенклатуры.
//
// ПАРАМЕТРЫ:
//		ВыбранноеЗначение - СправочникСсылка, ссылка на группу справочника номенклатуры
//		ОчищатьТЧ - Булево, признак очистки таблицы перед заполнением
//
Процедура ЗаполнитьНоменклатуруПоГруппамНоменклатурыНаСервере(ВыбранноеЗначение, ОчищатьТЧ)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СправочникНоменклатура.Ссылка КАК Номенклатура,
	               |	ИСТИНА КАК Пометка,
	               |	СправочникНоменклатура.УпаковкаПоУмолчанию КАК Упаковка
	               |ИЗ
	               |	Справочник.Номенклатура КАК СправочникНоменклатура
	               |ГДЕ
	               |	СправочникНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппыНоменклатуры)
	               |	И НЕ СправочникНоменклатура.ЭтоГруппа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СправочникНоменклатура.Родитель";
		
	Запрос.УстановитьПараметр("ГруппыНоменклатуры", ВыбранноеЗначение);
	
	Если ОчищатьТЧ = Истина Тогда
		ЦеныНоменлатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ЦеныНоменлатуры);
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
// Процедура заполняет таблицу ЦеныНоменклатуры данными по выбранному документу.
//
// ПАРАМЕТРЫ:
//		ВыбранноеЗначение - Документссылка, ссылка на документ поступления
//		ОчищатьТЧ - Булево, признак очистки таблицы перед заполнением
//
Процедура ЗаполнитьНоменклатуруПоДокументуНаСервере(ВыбранноеЗначение, ОчищатьТЧ)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Поступление.Номенклатура КАК Номенклатура,
	               |	Поступление.Упаковка,
	               |	Поступление.Цена,
	               |	ИСТИНА КАК Пометка
	               |ИЗ
	               |	Документ.Поступление.Запасы КАК Поступление
	               |ГДЕ
	               |	Поступление.Ссылка = &Поступление
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Поступление.НомерСтроки";
		
	Запрос.УстановитьПараметр("Поступление", ВыбранноеЗначение);
	
	Если ОчищатьТЧ = Истина Тогда
		ЦеныНоменлатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ЦеныНоменлатуры);
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура заполняет таблицу ЦеныНоменклатуры данными из установленных цен по виду цен на дату.
//
// ПАРАМЕТРЫ:
//		ПараметрыЗаполнения - Структура, параметры заполнения
//		ОчищатьТЧ - Булево, признак очистки таблицы перед заполнением
//
Процедура ЗаполнитьНоменклатуруПоВидуЦенНаСервере(ПараметрыЗаполнения, ОчищатьТЧ)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИСТИНА КАК Пометка,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&НаДату,
	               |			Актуальность = ИСТИНА
	               |				И ВидЦен = &ВидЦен
	               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура";
		
	Запрос.УстановитьПараметр("ВидЦен", ПараметрыЗаполнения.ВидЦен);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НаДату", ПараметрыЗаполнения.НаДату);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Если ОчищатьТЧ = Истина Тогда
		ЦеныНоменлатуры.Загрузить(ТаблицаРезультат);
	Иначе
		ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(ТаблицаРезультат, ЦеныНоменлатуры);
	КонецЕсли;
	
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - МЕХАНИЗМЫ ЗАПОЛНЕНИЯ ЦЕН

&НаСервере
// Процедура заполняет цены таблицы ЦеныНоменклатуры по выбранному виду цен.
//
Процедура ЗаполнитьЦеныПоВидуЦенНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	               |	ТаблицаНоменклатуры.Пометка КАК Пометка
	               |ПОМЕСТИТЬ ТаблицаНоменклатуры
	               |ИЗ
	               |	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |ГДЕ
	               |	ТаблицаНоменклатуры.Пометка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
				   |	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				&НаДату,
	               |				Актуальность = ИСТИНА
				   |					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница И ВидЦен = &ВидЦен
	               |					И (Номенклатура) В
	               |						(ВЫБРАТЬ
	               |							Таблица.Номенклатура
	               |						ИЗ
	               |							ТаблицаНоменклатуры КАК Таблица)) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
				   |			И ТаблицаНоменклатуры.Упаковка = ЦеныНоменклатурыСрезПоследних.Упаковка";
		
	Запрос.УстановитьПараметр("НаДату", Период);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиницаЗаполненияЦен);
	Запрос.УстановитьПараметр("ВидЦен", ВидЦен);
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ПолучитьТаблицуНоменклатуры());
	ПодставитьЦены(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаСервере
// Процедура заполняет цены таблицы ЦеныНоменклатуры по документу поступления.
//
Процедура ЗаполнитьЦеныПоДокументуНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	               |	ТаблицаНоменклатуры.Пометка КАК Пометка
	               |ПОМЕСТИТЬ ТаблицаНоменклатуры
	               |ИЗ
	               |	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |ГДЕ
	               |	ТаблицаНоменклатуры.Пометка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
				   |	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
				   |	ПоступлениеЗапасы.Цена КАК Цена
	               |ИЗ
	               |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поступление.Запасы КАК ПоступлениеЗапасы
	               |		ПО ПоступлениеЗапасы.Ссылка = &ПоступлениеЗапасы
				   |			И ТаблицаНоменклатуры.Номенклатура = ПоступлениеЗапасы.Номенклатура
	               |			И ТаблицаНоменклатуры.Упаковка = ПоступлениеЗапасы.Упаковка";
		
	Запрос.УстановитьПараметр("НаДату", Период);
	Запрос.УстановитьПараметр("ПоступлениеЗапасы", ПоступлениеЗапасов);
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ПолучитьТаблицуНоменклатуры());
	ПодставитьЦены(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаСервере
// Процедура устанавливает цены таблицы ЦеныНоменклатуры из ТаблицаЦен, при совпадении номенклатура, упаковка.
//
// ПАРАМЕТРЫ:
//		ТаблицаЦен - Таблица, таблица с ценами для заполнения
//
Процедура ПодставитьЦены(ТаблицаЦен)

	Для каждого СтрокаТабЧасти Из ЦеныНоменлатуры Цикл
		
		Если НЕ СтрокаТабЧасти.Пометка Тогда
			Продолжить;		
		КонецЕсли; 		
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",	 СтрокаТабЧасти.Номенклатура);
		СтруктураПоиска.Вставить("Упаковка",	 	 СтрокаТабЧасти.Упаковка);
		
		РезультатПоиска = ТаблицаЦен.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда			
			СтрокаТабЧасти.Цена = РезультатПоиска[0].Цена;
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры // ПодставитьЦены()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - УСТАНОВКИ ЦЕН

&НаСервере
// Процедура устанавливает цены или снимает актуальность цен номенклатуры.
//
Процедура УстановитьНаСервере(СнимаемАктуальность = Ложь)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	               |	ТаблицаНоменклатуры.Цена КАК Цена,
	               |	ТаблицаНоменклатуры.Пометка КАК Пометка
	               |ПОМЕСТИТЬ ТаблицаНоменклатуры
	               |ИЗ
	               |	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	               |	ТаблицаНоменклатуры.Цена КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатуры.ВидЦен ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Дубль
	               |ИЗ
	               |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	               |		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатуры.Номенклатура
				   |			И (ТаблицаНоменклатуры.Упаковка = ЦеныНоменклатуры.Упаковка)
	               |			И (ЦеныНоменклатуры.ВидЦен = &ВидЦен)
	               |			И (ЦеныНоменклатуры.Период = &НаДату)
				   |			И (ЦеныНоменклатуры.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	               |ГДЕ
	               |	ТаблицаНоменклатуры.Пометка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВложенныйЗапрос.Номенклатура,
				   |	ВложенныйЗапрос.Упаковка,
	               |	ВложенныйЗапрос.Счетчик
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
				   |		ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	               |		СУММА(1) КАК Счетчик
	               |	ИЗ
	               |		ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |	ГДЕ
	               |		ТаблицаНоменклатуры.Пометка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ТаблицаНоменклатуры.Номенклатура,
				   |		ТаблицаНоменклатуры.Упаковка) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.Счетчик > 1";
		
	Запрос.УстановитьПараметр("ВидЦен", Объект.ВидЦен);
	Запрос.УстановитьПараметр("НаДату", Объект.Период);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ПолучитьТаблицуНоменклатуры());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Проверка на дубли. При наличии дублей - отказ!	
	Выборка = МассивРезультатов[2].Выбрать();
	Отказ = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Дублируется строка: %Номенклатура% с упаковкой (%Упаковка%)!'");
		Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Номенклатура%", Выборка.Номенклатура);
		Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Упаковка%", Выборка.Упаковка);
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Установка цен отменена!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// Установка цен	
	Выборка = МассивРезультатов[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Дубль Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Для номенклатуры %Номенклатура% (%Упаковка%) на %НаДату% уже установлена цена! Новая цена не записана!'");
			Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%НаДату%", Формат(Объект.Период, "ДФ=dd.MM.yy"));
			Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Номенклатура%", Выборка.Номенклатура);
			Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Упаковка%", Выборка.Упаковка);
			Сообщение.Сообщить();
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураОтбора.Вставить("Упаковка", Выборка.Упаковка);
			СтруктураОтбора.Вставить("Пометка", Истина);
			МассивСтрок = ЦеныНоменлатуры.НайтиСтроки(СтруктураОтбора);
			
			Для каждого НайденнаяСтрока Из МассивСтрок Цикл			
				НайденнаяСтрока.Картинка = 2;	
			КонецЦикла;
		
		ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.Цена) И (НЕ СнимаемАктуальность) Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Для номенклатуры %Номенклатура% (%Упаковка%) не указана цена!'");
			Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Номенклатура%", Выборка.Номенклатура);
			Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Упаковка%", Выборка.Упаковка);
			Сообщение.Сообщить();
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураОтбора.Вставить("Упаковка", Выборка.Упаковка);
			СтруктураОтбора.Вставить("Пометка", Истина);
			МассивСтрок = ЦеныНоменлатуры.НайтиСтроки(СтруктураОтбора);
			
			Для каждого НайденнаяСтрока Из МассивСтрок Цикл			
				НайденнаяСтрока.Картинка = 2;	
			КонецЦикла;
		
		Иначе
		
			НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Объект.Период);
			НаборЗаписей.Отбор.ВидЦен.Установить(Объект.ВидЦен);
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(Объект.СтруктурнаяЕдиница);
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			НаборЗаписей.Отбор.Упаковка.Установить(Выборка.Упаковка);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Период = Объект.Период;
			НоваяЗапись.ВидЦен = Объект.ВидЦен;
			НоваяЗапись.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
			Если СнимаемАктуальность Тогда			
				НоваяЗапись.Актуальность = Ложь;
				// НоваяЗапись.Цена = 0;
			Иначе
				НоваяЗапись.Актуальность = Истина;
				// НоваяЗапись.Цена = ОкруглитьЦену(НоваяЗапись.Цена, ПорядокОкругленияУстановки, ОкруглятьВБольшуюСторонуУстановки);
			КонецЕсли; 
			НоваяЗапись.Автор = Объект.Автор;
			НаборЗаписей.Записать();	
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураОтбора.Вставить("Упаковка", Выборка.Упаковка);
			СтруктураОтбора.Вставить("Пометка", Истина);
			МассивСтрок = ЦеныНоменлатуры.НайтиСтроки(СтруктураОтбора);
			
			Для каждого НайденнаяСтрока Из МассивСтрок Цикл			
				НайденнаяСтрока.Картинка = 1;
				НайденнаяСтрока.Цена = НоваяЗапись.Цена;
			КонецЦикла; 
			
		КонецЕсли;		
	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
// Процедура удаляет из регистра записи по таблице ЦеныНоменклатуры
//
Процедура УдалитьНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
				   |	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	               |	ТаблицаНоменклатуры.Пометка КАК Пометка
	               |ПОМЕСТИТЬ ТаблицаНоменклатуры
	               |ИЗ
	               |	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |ГДЕ
	               |	ТаблицаНоменклатуры.Пометка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
	               |	ЦеныНоменклатурыСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&НаДату,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница И ВидЦен = &ВидЦен
				   |				И (Номенклатура, Упаковка) В
	               |					(ВЫБРАТЬ
	               |						Таблица.Номенклатура,
				   |						Таблица.Упаковка
	               |					ИЗ
	               |						ТаблицаНоменклатуры КАК Таблица)) КАК ЦеныНоменклатурыСрезПоследних";
		
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);			   
	Запрос.УстановитьПараметр("ВидЦен", Объект.ВидЦен);
	Запрос.УстановитьПараметр("НаДату", Объект.Период);
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ПолучитьТаблицуНоменклатуры());
	
	Выборка = Запрос.Выполнить().Выбрать();
    	
	Пока Выборка.Следующий() Цикл
	
		НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(Объект.СтруктурнаяЕдиница);
		НаборЗаписей.Отбор.ВидЦен.Установить(Объект.ВидЦен);
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Отбор.Упаковка.Установить(Выборка.Упаковка);
		
		НаборЗаписей.Записать();
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураОтбора.Вставить("Упаковка", Выборка.Упаковка);
		СтруктураОтбора.Вставить("Пометка", Истина);
		МассивСтрок = ЦеныНоменлатуры.НайтиСтроки(СтруктураОтбора);
		
		Для каждого НайденнаяСтрока Из МассивСтрок Цикл			
			НайденнаяСтрока.Картинка = 1;
		КонецЦикла;
			
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура Цены номенклатуры при изменении.
//
Процедура ЦеныНоменлатурыПриИзменении(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.Цена = ОбщегоНазначенияКлиентСерверСтоматология.ОкруглитьЦену(Элемент.ТекущиеДанные.Цена, КэшРеквизитов.ПорядокОкругления, КэшРеквизитов.ОкруглятьВБольшуюСторону);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура Вид цены шапка при изменении.
//
Процедура ВидЦеныШапкаПриИзменении(Элемент)
	
	РеквизитыВидаЦен = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Объект.ВидЦен, "ПорядокОкругления, ОкруглятьВБольшуюСторону");
	КэшРеквизитов.Вставить("ПорядокОкругления", РеквизитыВидаЦен.ПорядокОкругления);
	КэшРеквизитов.Вставить("ОкруглятьВБольшуюСторону", РеквизитыВидаЦен.ОкруглятьВБольшуюСторону);	
	
КонецПроцедуры

#КонецОбласти