
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Обновить регистр контрагенты сведения для списка
//
Процедура ОбновитьРегистрКонтрагентыСведенияДляСписка(ОповещатьОХодеВыполнения = Ложь) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 															
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	

	Если ОповещатьОХодеВыполнения Тогда 
		ДатаНачалаПроцесса = ТекущаяДатаСеанса();
		ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru='Актуализация информации для списка контрагентов...';en='Updating information for the list of counterparties...'"), Новый Структура("ПредставлениеОбъекта, ОсталосьВремениВСекундах, ПредставлениеОставшегосяВремени, СозданоОбъектов", "Получение данных...", 0, "", 0));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(Прием.ВремяНачалаПриема) КАК ДатаПервогоПриема,
	|	Прием.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаПервыхПриемов
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Прием.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(Прием.ВремяНачалаПриема) КАК ДатаПоследнегоПриема,
	|	Прием.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаПоследнихПриемов
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Прием.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Прием.Ссылка) КАК Количество,
	|	Прием.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаКоличестваПриемов
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Прием.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтатусыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СтатусыКонтрагентовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный)
	|		ИНАЧЕ СтатусыКонтрагентовСрезПоследних.Статус
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ СтатусыКонтрагентов
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов.СрезПоследних КАК СтатусыКонтрагентовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТаблицаПоследнихПриемов.Контрагент КАК Контрагент,
	|			Прием.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|		ИЗ
	|			ТаблицаПоследнихПриемов КАК ТаблицаПоследнихПриемов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Прием КАК Прием
	|				ПО ТаблицаПоследнихПриемов.Контрагент = Прием.Контрагент
	|					И ТаблицаПоследнихПриемов.ДатаПоследнегоПриема = Прием.ВремяНачалаПриема) КАК ТаблицаПоследнихПриемовПоСЕ
	|		ПО СтатусыКонтрагентовСрезПоследних.Контрагент = ТаблицаПоследнихПриемовПоСЕ.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(ТаблицаПервыхПриемов.ДатаПервогоПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПервогоПриема,
	|	ЕСТЬNULL(ТаблицаПоследнихПриемов.ДатаПоследнегоПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоПриема,
	|	ЕСТЬNULL(ТаблицаКоличестваПриемов.Количество, 0) КАК КоличествоПриемов,
	|	ЕСТЬNULL(СтатусыКонтрагентов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный)) КАК Статус,
	|	Контрагенты.КонтактнаяИнформация.(
	|		Вид КАК Вид,
	|		АдресЭП КАК АдресЭП,
	|		НомерТелефона КАК НомерТелефона,
	|		Представление КАК Представление
	|	) КАК КонтактнаяИнформация,
	|	ЕСТЬNULL(ТаблицаЗапланированнаяПЗ.ЗапланированнаяПредварительнаяЗапись, ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)) КАК ЗапланированнаяПредварительнаяЗапись,
	|	ЕСТЬNULL(ТаблицаПоследняяЗадача.ПоследняяЗадача, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК ПоследняяЗадача,
	|	ЕСТЬNULL(ТаблицаПоследняяЗадача.ПоследняяЗадачаЗадачаНазначеннаяДата, """") КАК ПоследняяЗадачаНазначеннаяДата,
	|	ЕСТЬNULL(ТаблицаПоследняяЗадача.ПоследняяЗадачаЗадачаТема, """") КАК ПоследняяЗадачаТема,
	|	ЕСТЬNULL(ТаблицаПоследняяЗадача.ПоследняяЗадачаЗадачаОписание, """") КАК ПоследняяЗадачаОписание,
	|	ЕСТЬNULL(ТаблицаСледующаяЗадача.СледующаяЗадача, ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)) КАК СледующаяЗадача,
	|	ЕСТЬNULL(ТаблицаСледующаяЗадача.СледующаяЗадачаЗадачаНазначеннаяДата, """") КАК СледующаяЗадачаНазначеннаяДата,
	|	ЕСТЬNULL(ТаблицаСледующаяЗадача.СледующаяЗадачаЗадачаТема, """") КАК СледующаяЗадачаТема,
	|	ЕСТЬNULL(ТаблицаСледующаяЗадача.СледующаяЗадачаЗадачаОписание, """") КАК СледующаяЗадачаОписание,
	|	ЕСТЬNULL(ТаблицаТекущаяСделка.ТекущаяСделка, ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)) КАК ТекущаяСделка,
	|	ЕСТЬNULL(ТаблицаТекущаяСделка.ТекущийЭтапСделки, ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)) КАК ТекущийЭтапСделки,
	|	ЕСТЬNULL(ТаблицаТекущаяСделка.СуммаСделки, 0) КАК СуммаСделки,
	|	ВЫБОР
	|		КОГДА ТаблицаПоследнихПриемов.ДатаПоследнегоПриема <= ТаблицаЗапланированнаяПЗ.ДатаСледующегоПриема
	|			ТОГДА ЕСТЬNULL(ТаблицаЗапланированнаяПЗ.ДатаСледующегоПриема, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаСледующегоПриема
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыКонтрагентов КАК СтатусыКонтрагентов
	|		ПО Контрагенты.Ссылка = СтатусыКонтрагентов.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПервыхПриемов КАК ТаблицаПервыхПриемов
	|		ПО Контрагенты.Ссылка = ТаблицаПервыхПриемов.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоследнихПриемов КАК ТаблицаПоследнихПриемов
	|		ПО Контрагенты.Ссылка = ТаблицаПоследнихПриемов.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКоличестваПриемов КАК ТаблицаКоличестваПриемов
	|		ПО Контрагенты.Ссылка = ТаблицаКоличестваПриемов.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СобытияПЗ.Ссылка КАК ЗапланированнаяПредварительнаяЗапись,
	|			СобытияПЗ.Контрагент КАК Контрагент,
	|			СобытияПЗ.ДатаСледующегоПриема КАК ДатаСледующегоПриема
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(ДокументСобытие.Ссылка) КАК Ссылка,
	|				ДокументСобытие.Контрагент КАК Контрагент,
	|				ДокументСобытие.Дата КАК ДатаСледующегоПриема
	|			ИЗ
	|				(ВЫБРАТЬ
	|					Событие.Контрагент КАК Контрагент,
	|					МАКСИМУМ(Событие.Дата) КАК ДатаПЗ
	|				ИЗ
	|					Документ.Событие КАК Событие
	|				ГДЕ
	|					Событие.Проведен
	|					И Событие.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПациентОжидает))
	|					И Событие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Событие.Контрагент) КАК ЗапланированнаяПЗ
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие КАК ДокументСобытие
	|					ПО ЗапланированнаяПЗ.ДатаПЗ = ДокументСобытие.Дата
	|						И ЗапланированнаяПЗ.Контрагент = ДокументСобытие.Контрагент
	|			ГДЕ
	|				ДокументСобытие.Проведен
	|				И ДокументСобытие.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПациентОжидает))
	|				И ДокументСобытие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДокументСобытие.Контрагент,
	|				ДокументСобытие.Дата) КАК СобытияПЗ) КАК ТаблицаЗапланированнаяПЗ
	|		ПО Контрагенты.Ссылка = ТаблицаЗапланированнаяПЗ.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТаблицаОднаПоследняяЗадача.ПоследняяЗадача КАК ПоследняяЗадача,
	|			ТаблицаОднаПоследняяЗадача.ПоследняяЗадача.ЗадачаНазначеннаяДата КАК ПоследняяЗадачаЗадачаНазначеннаяДата,
	|			ТаблицаОднаПоследняяЗадача.ПоследняяЗадача.ЗадачаТема КАК ПоследняяЗадачаЗадачаТема,
	|			ТаблицаОднаПоследняяЗадача.ПоследняяЗадача.ЗадачаОписание КАК ПоследняяЗадачаЗадачаОписание
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(Взаимодействие.Ссылка) КАК ПоследняяЗадача,
	|				Взаимодействие.Контрагент КАК Контрагент
	|			ИЗ
	|				Задача.Взаимодействие КАК Взаимодействие
	|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						Взаимодействие.Контрагент КАК Контрагент,
	|						МАКСИМУМ(Взаимодействие.ЗадачаНазначеннаяДата) КАК ЗадачаНазначеннаяДата
	|					ИЗ
	|						Задача.Взаимодействие КАК Взаимодействие
	|					
	|					СГРУППИРОВАТЬ ПО
	|						Взаимодействие.Контрагент) КАК МаксимальнаяЗадача
	|					ПО Взаимодействие.Контрагент = МаксимальнаяЗадача.Контрагент
	|						И Взаимодействие.ЗадачаНазначеннаяДата = МаксимальнаяЗадача.ЗадачаНазначеннаяДата
	|			ГДЕ
	|				Взаимодействие.Выполнена
	|				И НЕ Взаимодействие.ПометкаУдаления
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Взаимодействие.Контрагент) КАК ТаблицаОднаПоследняяЗадача) КАК ТаблицаПоследняяЗадача
	|		ПО Контрагенты.Ссылка = ТаблицаПоследняяЗадача.ПоследняяЗадача.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТаблицаОднаСледующаяЗадача.СледующаяЗадача КАК СледующаяЗадача,
	|			ТаблицаОднаСледующаяЗадача.СледующаяЗадача.ЗадачаНазначеннаяДата КАК СледующаяЗадачаЗадачаНазначеннаяДата,
	|			ТаблицаОднаСледующаяЗадача.СледующаяЗадача.ЗадачаТема КАК СледующаяЗадачаЗадачаТема,
	|			ТаблицаОднаСледующаяЗадача.СледующаяЗадача.ЗадачаОписание КАК СледующаяЗадачаЗадачаОписание
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(Взаимодействие.Ссылка) КАК СледующаяЗадача,
	|				Взаимодействие.Контрагент КАК Контрагент
	|			ИЗ
	|				Задача.Взаимодействие КАК Взаимодействие
	|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						Взаимодействие.Контрагент КАК Контрагент,
	|						МАКСИМУМ(Взаимодействие.ЗадачаНазначеннаяДата) КАК ЗадачаНазначеннаяДата
	|					ИЗ
	|						Задача.Взаимодействие КАК Взаимодействие
	|					
	|					СГРУППИРОВАТЬ ПО
	|						Взаимодействие.Контрагент) КАК МаксимальнаяЗадача
	|					ПО Взаимодействие.Контрагент = МаксимальнаяЗадача.Контрагент
	|						И Взаимодействие.ЗадачаНазначеннаяДата = МаксимальнаяЗадача.ЗадачаНазначеннаяДата
	|			ГДЕ
	|				НЕ Взаимодействие.ПометкаУдаления
	|				И НЕ Взаимодействие.Выполнена
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Взаимодействие.Контрагент) КАК ТаблицаОднаСледующаяЗадача) КАК ТаблицаСледующаяЗадача
	|		ПО Контрагенты.Ссылка = ТаблицаСледующаяЗадача.СледующаяЗадача.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Сделки.Ссылка КАК ТекущаяСделка,
	|			Сделки.Ссылка.ЭтапСделки КАК ТекущийЭтапСделки,
	|			Сделки.Ссылка.СуммаСделки КАК СуммаСделки,
	|			Сделки.Контрагент КАК Контрагент
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(Сделки.Ссылка) КАК Ссылка,
	|				Сделки.Контрагент КАК Контрагент
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(Сделки.ДатаСделки) КАК ДатаСделки,
	|					Сделки.Контрагент КАК Контрагент
	|				ИЗ
	|					Справочник.Сделки КАК Сделки
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Сделки.Контрагент) КАК МаксимальнаяСделка
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сделки КАК Сделки
	|					ПО МаксимальнаяСделка.ДатаСделки = Сделки.ДатаСделки
	|						И МаксимальнаяСделка.Контрагент = Сделки.Контрагент
	|			ГДЕ
	|				НЕ Сделки.ПометкаУдаления
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Сделки.Контрагент) КАК Сделки) КАК ТаблицаТекущаяСделка
	|		ПО Контрагенты.Ссылка = ТаблицаТекущаяСделка.Контрагент
	|ГДЕ
	|	НЕ Контрагенты.ЭтоГруппа
	|	И Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)";
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.КонтрагентыСведенияДляСписка.СоздатьНаборЗаписей();
	
	ТаблицаРегистра = НаборЗаписей.ВыгрузитьКолонки("Контрагент, ДатаПервогоПриема, ДатаПоследнегоПриема, ДатаСледующегоПриема, КоличествоПриемов, АдресЭП, ЗапланированнаяПредварительнаяЗапись, СледующаяЗадача, Статус, 
	| Телефон, ПоследняяЗадача, СледующаяЗадача, ТекущаяСделка, ТекущийЭтапСделки, СуммаСделки,
	| ПоследняяЗадачаПредставление, СледующаяЗадачаПредставление");	
	
	ВсегоКлиентов 			= ТаблицаЗапроса.Количество();
	ВсегоКлиентов 			= ?(ВсегоКлиентов < 1, 1, ВсегоКлиентов);
	Счетчик 				= 0;
	ОсталосьВремени 		= Неопределено;
	
	Для Каждого СтрокаТЧ из ТаблицаЗапроса Цикл
		
		МассивСтрокСТелефонами = СтрокаТЧ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКлиента));
		МассивТелефонов = Новый Массив;
		Для Каждого СтрокаМассива Из МассивСтрокСТелефонами Цикл
			МассивТелефонов.Добавить(СтрокаМассива.НомерТелефона);
		КонецЦикла; 
		Телефон 		= СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивТелефонов, ", ");
		
		МассивСтрокEmail = СтрокаТЧ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailКлиента));	
		МассивEmail = Новый Массив;
		Для Каждого СтрокаМассива Из МассивСтрокEmail Цикл
			МассивEmail.Добавить(СтрокаМассива.АдресЭП);
		КонецЦикла;
		АдресЭП 		= СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивEmail, ", ");
		
		МассивСтрокСоцСеть = СтрокаТЧ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.СоциальнаяСетьКлиента));	
		МассивСоцСеть = Новый Массив;
		Для Каждого СтрокаМассива Из МассивСтрокСоцСеть Цикл
			МассивСоцСеть.Добавить(СтрокаМассива.Представление);
		КонецЦикла;
		СоциальнаяСеть  = СтроковыеФункцииКлиентСерверСтоматология.ПолучитьСтрокуИзМассиваПодстрок(МассивСоцСеть, ", ");
			
		НоваяСтрокаТЗ = ТаблицаРегистра.Добавить();
		НоваяСтрокаТЗ.Контрагент 	  						= СтрокаТЧ.Контрагент;
		НоваяСтрокаТЗ.ДатаПервогоПриема 					= СтрокаТЧ.ДатаПервогоПриема;
		НоваяСтрокаТЗ.ДатаПоследнегоПриема 					= СтрокаТЧ.ДатаПоследнегоПриема;
		НоваяСтрокаТЗ.ДатаСледующегоПриема                  = СтрокаТЧ.ДатаСледующегоПриема;
		НоваяСтрокаТЗ.КоличествоПриемов 					= СтрокаТЧ.КоличествоПриемов;		
		НоваяСтрокаТЗ.Телефон 	 	  						= Телефон;
		НоваяСтрокаТЗ.АдресЭП	 	  						= АдресЭП;	
		НоваяСтрокаТЗ.Статус 	 	  						= СтрокаТЧ.Статус;
		НоваяСтрокаТЗ.ТекущаяСделка   						= СтрокаТЧ.ТекущаяСделка;
		НоваяСтрокаТЗ.ТекущийЭтапСделки 					= СтрокаТЧ.ТекущийЭтапСделки;
		НоваяСтрокаТЗ.СуммаСделки	 						= СтрокаТЧ.СуммаСделки;		
		НоваяСтрокаТЗ.СледующаяЗадача 						= СтрокаТЧ.СледующаяЗадача;
		НоваяСтрокаТЗ.ПоследняяЗадача 						= СтрокаТЧ.ПоследняяЗадача;
		НоваяСтрокаТЗ.ЗапланированнаяПредварительнаяЗапись 	= СтрокаТЧ.ЗапланированнаяПредварительнаяЗапись;
		
		НоваяСтрокаТЗ.ПоследняяЗадачаПредставление = Строка(СтрокаТЧ.ПоследняяЗадачаНазначеннаяДата) + 
		?(ЗначениеЗаполнено(СтрокаТЧ.ПоследняяЗадачаТема), " ", "") + СтрокаТЧ.ПоследняяЗадачаТема + 
		?(ЗначениеЗаполнено(СтрокаТЧ.ПоследняяЗадачаОписание), " ", "") + СтрокаТЧ.ПоследняяЗадачаОписание;
		
		НоваяСтрокаТЗ.СледующаяЗадачаПредставление = Строка(СтрокаТЧ.СледующаяЗадачаНазначеннаяДата) + 
		?(ЗначениеЗаполнено(СтрокаТЧ.СледующаяЗадачаТема), " ", "") + СтрокаТЧ.СледующаяЗадачаТема + 
		?(ЗначениеЗаполнено(СтрокаТЧ.СледующаяЗадачаОписание), " ", "") + СтрокаТЧ.СледующаяЗадачаОписание;
		
		Если ОповещатьОХодеВыполнения Тогда 
			Счетчик = Счетчик + 1;
			Прогресс = Цел(100 * Счетчик / ВсегоКлиентов);
			ОсталосьВремени 				= ОбщегоНазначенияКлиентСерверСтоматология.ПолучитьОстатокВремениВыполненияПроцессаВСекундах(Прогресс, ДатаНачалаПроцесса, ТекущаяДатаСеанса(), ОсталосьВремени);
			ПредставлениеОставшегосяВремени = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПредставлениеВремени(ОсталосьВремени);
			ДлительныеОперации.СообщитьПрогресс(Прогресс, НСтр("ru='Актуализация информации для списка контрагентов...';en='Updating information for the list of counterparties...'"), Новый Структура("ПредставлениеОбъекта, ОсталосьВремениВСекундах, ПредставлениеОставшегосяВремени", " Осталось: " + ПредставлениеОставшегосяВремени, ОсталосьВремени, ПредставлениеОставшегосяВремени));		
		КонецЕсли;	
		
	КонецЦикла;
	
	ДлительныеОперации.СообщитьПрогресс(Прогресс, НСтр("ru='Помещение данных в регистр...';en='Putting data in a register...'"), Новый Структура("ПредставлениеОбъекта, ОсталосьВремениВСекундах, ПредставлениеОставшегосяВремени", " Осталось: " + ПредставлениеОставшегосяВремени, ОсталосьВремени, ПредставлениеОставшегосяВремени));		
	
	Попытка
		НаборЗаписей.Загрузить(ТаблицаРегистра);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка записи в регистр",	УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки()); 
	КонецПопытки;
	
КонецПроцедуры	

// Процедура - Актуализировать сведения для списка
//
// Параметры:
//  Контрагент		 - 	 - 
//  ИсключаемыйПрием - 	 - 
//
Процедура АктуализироватьСведенияДляСписка(Контрагент, ИсключаемыйПрием = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Событие.Ссылка КАК Ссылка,
	|	Событие.Дата КАК ДатаСледующегоПриема
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Проведен
	|	И Событие.Контрагент = &Контрагент
	|	И Событие.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.НеПодтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.Подтверждена), ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПациентОжидает))
	|	И Событие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Событие.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Прием.ВремяНачалаПриема КАК ДатаПервогоПриема
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Контрагент = &Контрагент
	|	И Прием.Проведен
	|	И &ИсключаемыйПрием
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПервогоПриема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Прием.ВремяНачалаПриема КАК ДатаПоследнегоПриема
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Контрагент = &Контрагент
	|	И Прием.Проведен
	|	И &ИсключаемыйПрием
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоследнегоПриема УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(Прием.Ссылка) КАК Количество
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Контрагент = &Контрагент
	|	И Прием.Проведен
	|	И &ИсключаемыйПрием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сделки.Ссылка КАК ТекущаяСделка,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.СуммаСделки КАК СуммаСделки
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.Контрагент = &Контрагент
	|	И Сделки.РезультатСделки = ЗНАЧЕНИЕ(Перечисление.РезультатыСделок.ПустаяСсылка)
	|	И НЕ Сделки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СтатусыКонтрагентовСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК СтатусыКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент"      , Контрагент);
	Запрос.УстановитьПараметр("ИсключаемыйПрием", ИсключаемыйПрием);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ИсключаемыйПрием", ?(ЗначениеЗаполнено(ИсключаемыйПрием), "И Прием.Ссылка <> &ИсключаемыйПрием", ""));
	
	Результат								= Запрос.ВыполнитьПакет();
	ТаблицаЗапланированнаяПЗ				= Результат[0].Выгрузить();	
	ТаблицаПервыйПрием						= Результат[1].Выгрузить();
	ТаблицаПоследнийПрием					= Результат[2].Выгрузить();
	ТаблицаКоличествоПриемов				= Результат[3].Выгрузить(); 	
	ТаблицаТекущаяСделка					= Результат[4].Выгрузить();
	ТаблицаТекущийСтатус					= Результат[5].Выгрузить();
		
	ОбновляемыеДанные = Новый Структура;	
	ОбновляемыеДанные.Вставить("Статус", ?(ТаблицаТекущийСтатус.Количество() > 0, ТаблицаТекущийСтатус[0].Статус, Неопределено));	
	ОбновляемыеДанные.Вставить("ДатаПервогоПриема", ?(ТаблицаПервыйПрием.Количество() > 0, ТаблицаПервыйПрием[0].ДатаПервогоПриема, Дата(1,1,1))); 
	ОбновляемыеДанные.Вставить("ДатаПоследнегоПриема", ?(ТаблицаПоследнийПрием.Количество() > 0, ТаблицаПоследнийПрием[0].ДатаПоследнегоПриема, Дата(1,1,1)));	
	ОбновляемыеДанные.Вставить("КоличествоПриемов", ?(ТаблицаКоличествоПриемов.Количество() > 0, ТаблицаКоличествоПриемов[0].Количество, 0));
	
	Если ТаблицаЗапланированнаяПЗ.Количество() > 0 Тогда
		ЗапланированнаяПредварительнаяЗапись = ТаблицаЗапланированнаяПЗ[0].Ссылка;
		ДатаСледующегоПриема = ?(ОбновляемыеДанные.ДатаПоследнегоПриема <= ТаблицаЗапланированнаяПЗ[0].ДатаСледующегоПриема, ТаблицаЗапланированнаяПЗ[0].ДатаСледующегоПриема, Дата(1,1,1));
	Иначе	
		ЗапланированнаяПредварительнаяЗапись = Неопределено;
		ДатаСледующегоПриема = Дата(1,1,1);
	КонецЕсли;
	
	Если ТаблицаТекущаяСделка.Количество() > 0 Тогда
		ТекущаяСделка 		= ТаблицаТекущаяСделка[0].ТекущаяСделка;
		ТекущийЭтапСделки   = ТаблицаТекущаяСделка[0].ЭтапСделки;
		СуммаСделки         = ТаблицаТекущаяСделка[0].СуммаСделки;
	Иначе
		ТекущаяСделка 		= Неопределено;
		ТекущийЭтапСделки   = Неопределено;
		СуммаСделки         = Неопределено;	
	КонецЕсли;
	
	ОбновляемыеДанные.Вставить("ЗапланированнаяПредварительнаяЗапись", ЗапланированнаяПредварительнаяЗапись);
	ОбновляемыеДанные.Вставить("ДатаСледующегоПриема", ДатаСледующегоПриема);
	ОбновляемыеДанные.Вставить("ТекущаяСделка", ТекущаяСделка);
	ОбновляемыеДанные.Вставить("ТекущийЭтапСделки", ТекущийЭтапСделки);
	ОбновляемыеДанные.Вставить("СуммаСделки", СуммаСделки);
			
	АктуализироватьНеобходимыеДанныеВСведенияхДляСписка(Контрагент, ОбновляемыеДанные);
	
КонецПроцедуры

// Процедура - Актуализировать статус клиента
//
// Параметры:
//  Контрагент	 - 	 - 
//  Статус		 - 	 - 
//
Процедура АктуализироватьСтатусКлиента(Контрагент, Статус) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) ИЛИ НЕ ЗначениеЗаполнено(Статус) Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаписатьНабор = Истина;
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НаборЗаписей[0].Статус = Статус Тогда 
			ЗаписатьНабор = Ложь;
		Иначе 	
			НаборЗаписей[0].Статус = Статус;
		КонецЕсли;	
	Иначе 
		СтруктураЗаполнения = Справочники.Контрагенты.ПолучитьИнформациюКонтрагента(Контрагент);
		Запись 				= НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтруктураЗаполнения);
		Запись.Статус 		= Статус;	
	КонецЕсли;
	Если ЗаписатьНабор Тогда 
		НаборЗаписей.ОбменДанными.Загрузка = Истина;			
		НаборЗаписей.Записать();
	Иначе 
		НаборЗаписей = Неопределено;
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - Актуализировать необходимые данные в сведениях для списка
//
// Параметры:
//  ОбновляемыеДанные	 - 	Структура. Наименования ключей должны совпадать с наименованиями реквизитов регистра. 
//
Процедура АктуализироватьНеобходимыеДанныеВСведенияхДляСписка(Контрагент, ОбновляемыеДанные) Экспорт
	
   	Если НЕ ТипЗнч(ОбновляемыеДанные) = Тип("Структура") ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбновляемыеДанные) Тогда
		
		НоваяЗапись = РегистрыСведений.КонтрагентыСведенияДляСписка.СоздатьМенеджерЗаписи();
		НоваяЗапись.Контрагент = Контрагент;
		НоваяЗапись.Прочитать();
		
		Если НЕ НоваяЗапись.Выбран() Тогда
			НоваяЗапись.Контрагент = Контрагент;
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ОбновляемыеДанные);
		
		Попытка
			НоваяЗапись.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось обновить данные в регистре ""КонтрагентыСведенияДляСписка""';
																   |en='Failed to update the data in the account information register for the list.'"));
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
