
#Область СлужебныеПроцедурыИФункции

// Процедура - Записать
//
Процедура ОбновитьПоследниююАктивностьПользователя() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	НоваяСтрока                     = РегистрыСведений.РабочиеМестаАктивныхПользователей.СоздатьМенеджерЗаписи();
	НоваяСтрока.Сотрудник           = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	НоваяСтрока.РабочееМесто        = ПараметрыСеанса.РабочееМестоКлиента;
	НоваяСтрока.ПоследняяАктивность = ТекущаяДатаСеанса(); 	
	
	НоваяСтрока.Записать();
	
КонецПроцедуры

// Функция - Получить рабочее место
//
// Параметры:
//  Сотрудник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьРабочееМесто(Сотрудник) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочиеМестаАктивныхПользователей.Сотрудник КАК Сотрудник,
	|	РабочиеМестаАктивныхПользователей.РабочееМесто КАК РабочееМесто,
	|	РабочиеМестаАктивныхПользователей.ПоследняяАктивность КАК ПоследняяАктивность
	|ИЗ
	|	РегистрСведений.РабочиеМестаАктивныхПользователей КАК РабочиеМестаАктивныхПользователей
	|ГДЕ
	|	РабочиеМестаАктивныхПользователей.Сотрудник = &Сотрудник");
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Для Каждого Строка Из РезультатЗапроса Цикл 
			Если ОбщегоНазначения.ПолучитьРазностьДат(Строка.ПоследняяАктивность, ТекущаяДатаСеанса(), "МИНУТА") <= 2 Тогда
				Возврат Строка.РабочееМесто;
			КонецЕсли;
		КонецЦикла;
	Иначе 
		Возврат Справочники.РабочиеМеста.ПустаяСсылка(); 
	КонецЕсли;
		
КонецФункции

#КонецОбласти
