
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Вернуть массив номеров сотрудников по сегменту
//
// Параметры:
//  Сегмент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивНомеровСотрудниковПоСегменту(Сегмент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиСегмента.Сотрудник КАК Получатель,
		|	СотрудникиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
		|		ПО СотрудникиСегмента.Сотрудник = СотрудникиКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	СотрудникиСегмента.Сегмент = &Сегмент
		|	И СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКлиента)
		|	И СотрудникиКонтактнаяИнформация.НомерТелефона <> """"
		|	И НЕ СотрудникиКонтактнаяИнформация.Ссылка.ЭтоГруппа";

	Запрос.УстановитьПараметр("Сегмент", Сегмент);	
		
	Таблица = Запрос.Выполнить().Выгрузить();
	МассивПолучателей 		= Таблица.ВыгрузитьКолонку("Получатель");
	МассивНомеровТелефонов 	= Таблица.ВыгрузитьКолонку("НомерТелефона");
	МассивНомеровИПолучателей = Новый Массив(2);
	МассивНомеровИПолучателей[0] = МассивПолучателей;
	МассивНомеровИПолучателей[1] = МассивНомеровТелефонов;
	Возврат МассивНомеровИПолучателей;
	
КонецФункции

// Процедура - Добавить сотрудника в сегмент
//
// Параметры:
//  Сегмент		 - 	 - 
//  Сотрудник	 - 	 - 
//
Процедура ДобавитьСотрудникаВСегмент(Сегмент, Сотрудник) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Сегмент) ИЛИ НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	НаборЗаписейСегмента 		= СоздатьНаборЗаписей();
	НаборЗаписейСегмента.Отбор.Сегмент.Установить(Сегмент);
	НаборЗаписейСегмента.Отбор.Сотрудник.Установить(Сотрудник);
	
	ЗаписьСегмента 				= НаборЗаписейСегмента.Добавить();
	ЗаписьСегмента.Сегмент 		= Сегмент;
	ЗаписьСегмента.Сотрудник 	= Сотрудник;
	
	НаборЗаписейСегмента.ОбменДанными.Загрузка = Истина;
	Попытка
		НаборЗаписейСегмента.Записать();
	Исключение
		
	КонецПопытки;	
	
КонецПроцедуры

// Процедура - Удалить сотрудника из сегмента
//
// Параметры:
//  Сегмент		 - 	 - 
//  Сотрудник	 - 	 - 
//
Процедура УдалитьСотрудникаИзСегмента(Сегмент, Сотрудник) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Сегмент) ИЛИ НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	НаборЗаписейСегмента = СоздатьНаборЗаписей();
	НаборЗаписейСегмента.Отбор.Сегмент.Установить(Сегмент);
	НаборЗаписейСегмента.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписейСегмента.ОбменДанными.Загрузка = Истина;
	Попытка
		НаборЗаписейСегмента.Записать();
	Исключение
		
	КонецПопытки;	
		
КонецПроцедуры	

// Функция, возвращает сегменты, содержащие сотрудника.
//
Функция ПолучитьСегментыСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиСегмента.Сегмент КАК Сегмент
	|ИЗ
	|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
	|ГДЕ
	|	СотрудникиСегмента.Сотрудник = &Сотрудник
	|	И НЕ СотрудникиСегмента.Сегмент.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сегмент");
	
КонецФункции

// Функция - Получить сотрудников сегмента
//
// Параметры:
//  СегментСотрудников	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСотрудниковСегмента(СегментСотрудников) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СегментСотрудников", СегментСотрудников);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиСегмента.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СотрудникиСегмента КАК СотрудникиСегмента
	|ГДЕ
	|	СотрудникиСегмента.Сегмент = &СегментСотрудников
	|	И СотрудникиСегмента.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

#КонецОбласти

#КонецЕсли
