 
 #Область ОбработчикиСобытийФормы 
 
 // Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.Свойство("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		Объект.КлючПриложения = Новый УникальныйИдентификатор();
		СформироватьНаименование();
		Если ЗначениеЗаполнено(Объект.ТипВнешнейСистемы) Тогда
			Элементы.ТипВнешнейСистемы.Видимость = Ложь;
		Иначе
			Элементы.ТипВнешнейСистемы.Видимость = Истина;
		КонецЕсли;    
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	Иначе
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();		
		Элементы.ТипВнешнейСистемы.Видимость = Ложь;
		Если ЗначениеЗаполнено(ПараметрыВнешнейСистемы) И ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда
			ПараметрыВнешнейСистемы.Свойство("АпиКлючRoistat"		, ЭтотОбъект.АпиКлючRoistat);
			ПараметрыВнешнейСистемы.Свойство("НомерПроекта"			, ЭтотОбъект.НомерПроекта);
			//ПараметрыВнешнейСистемы.Свойство("КлючДляИнтеграции"	, ЭтотОбъект.КлючДляИнтеграции);

		КонецЕсли;
	КонецЕсли;              

	ЭтотОбъект.URLСтраницы = "https://cloud.stoma1c.ru/api/hs/mas/Roistat/" + Объект.КлючПриложения;
	
	УидСессии = ЛичныйКабинет.УидТекущейСессии();
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект);
	
	Справочники.ВнешниеСистемы.ПодключитьВнешнююСистему(РеквизитФормыВЗначение("Объект"), Отказ, УИДСессии);

	//// Заполнение статусов
	ЗаполнитьСтатусыRoistat();

КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
	СтруктураОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	Оповестить("ЗаписанаВнешняяСистема", СтруктураОповещения);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтотОбъект.НомерПроекта = "" Или ЭтотОбъект.АпиКлючRoistat = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поля ""Номер проекта"" и ""Апи ключ Roistat"" обязательны для заполнения.",,,, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименование();
	КонецЕсли;
	
	ПроверитьНастройкиЛичногоКабинетаПередЗаписью(Отказ);
	
КонецПроцедуры

 #КонецОбласти
 
#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, копирует URL.
//
Процедура СкопироватьURL(Команда)
	
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ЭтотОбъект.URLСтраницы);	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Скопировано';en='Copied'"));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
//
Процедура УдалитьИЗакрыть(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Вы точнохотите пометить на удаление данный элемент справочника?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, 
        КодВозвратаДиалога.Да
    );    
 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();

	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
	
КонецПроцедуры

// Процедура - Заполнить статусы в Roistat
//
Процедура ЗаполнитьСтатусыRoistat()
	
	ПараметрыЗапроса = "[
	|{
	|""id"": ""101"",
	|""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.ЗаявкаОтклонена)    + """,
	|""type"": ""canceled""
	|},
	|{
	|""id"": ""102"",
	|""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.ЗаявкаПринята) + """,
	|""type"": ""paid""
	|},
	|{
	|""id"": ""106"",
	|""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.СделкаСменаЭтапа) + """,
	|""type"": ""progress""
	|},
	|{
	|""id"": ""103"",
	|""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.СделкаСоздана) + """,
	|""type"": ""progress""
	|},
	|{
	|""id"": ""104"",
	|""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.СделкаСостоялась) + """,
	|""type"": ""paid""
	|},
	|{
	|""id"":""105"",
	|""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.СделкаНеСостоялась) + """,
	|""type"": ""canceled""
	|}
	|]";	
	
	ВнешняяСистемаRoistat   = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Roistat  , Истина);
	СтруктураПараметров = ВнешняяСистемаRoistat.Параметры.Получить();
		
	UrlApi = "cloud.roistat.com/api/v1/project/set-statuses?project=" + ЭтотОбъект.НомерПроекта + "&key=" + ЭтотОбъект.АпиКлючRoistat;
	Соединение = Новый HTTPСоединение(UrlApi,,,,,,НОвый ЗащищенноеСоединениеOpenSSL());
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type" , "application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("", ЗаголовкиHTTP);		
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыЗапроса);		
	
	ВозвращаемыйРезультат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Ответ = ВозвращаемыйРезультат.ПолучитьТелоКакСтроку();

КонецПроцедуры

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	ПараметрыВнешнейСистемы = Новый Структура;
	ПараметрыВнешнейСистемы.Вставить("НомерПроекта"			, ЭтотОбъект.НомерПроекта);
	ПараметрыВнешнейСистемы.Вставить("АпиКлючRoistat"		, ЭтотОбъект.АпиКлючRoistat);
	//ПараметрыВнешнейСистемы.Вставить("КлючДляИнтеграции"	, ЭтотОбъект.КлючДляИнтеграции);
	
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет проверку перед записью объекта.
//
Процедура ПроверитьНастройкиЛичногоКабинетаПередЗаписью(Отказ)
	
	Если Не ЭтоОблако Тогда
		
		РезультатПроверки = ПроверитьПубликациюИнформационнойБазы();
		Если Не РезультатПроверки Тогда
			
			ИмяФормыОбработки = "Обработка.ЛичныйКабинет.Форма.ФормаНастройкиВнешнейПубликации";
			ОткрытьФорму(ИмяФормыОбработки,,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Пояснение		 = НСтр("ru = 'Необходимо настроить внешнюю публикацию'");
			СтатусОповещения = СтатусОповещенияПользователя.Важное;
			ПоказатьОповещениеПользователя(,,Пояснение, БиблиотекаКартинок.Предупреждение32, СтатусОповещения);
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УидСессии) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОРегистрацииВЛК", ЭтотОбъект);
		ТекстВопроса = Нстр("ru = 'Необходимо авторизоваться в личном кабинете. Открыть личный кабинет?';
							|en = 'Is necessary to log in to your account. Open private cabinet?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, проверяет публикацию информационной базы.
//
Функция ПроверитьПубликациюИнформационнойБазы()
	
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(Константы.ВнешняяПубликацияАдрес.Получить());
	
	Если РезультатПроверки.ВыполненоУспешно Тогда
		Возврат РезультатПроверки.ПубликацияВерна;  
	КонецЕсли;  
	
	Если НЕ (РезультатПроверки.ВыполненоУспешно И РезультатПроверки.ПубликацияВерна = Истина) Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При проверке публикации возникла ошибка: ';en='With checking publications originated mistake:'") + РезультатПроверки.ОписаниеОшибки);
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, устанавливает служебного пользователя.
//
Процедура УстановитьСлужебногоПользователя()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
	    ПометитьНаУдаление();
		
		ПараметрыОповещения = Новый Структура;
        ПараметрыОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
		ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);

		Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление()
	
		ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
		ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
		ВнешняяСистемаОбъект.Используется = Ложь;
		
		Попытка
			ВнешняяСистемаОбъект.Записать();
		Исключение 
 		КонецПопытки;
		
КонецПроцедуры

#КонецОбласти 



