
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Сотрудник") Тогда
		Элементы.Сотрудник.Доступность = Ложь;
	ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Помещение") Тогда
		Элементы.Помещение.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора".
//
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Запись.Помещение.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрОткрытия = Новый Структура("СтруктурнаяЕдиница", ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Запись.Помещение, "СтруктурнаяЕдиница"));
		ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиКомандФормы
 
&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтаФорма.Записать();
	Закрыть();
	Оповестить("ОбновленыКабинеты");

КонецПроцедуры


#КонецОбласти
