
#Область СлужебныеПроцедурыИФункции

// Функция - Вернуть длительности приемов
//
// Параметры:
//  ЗаполнитьРегистрЕслиПустой	 - 	Истина - Заполнить регистр стандартными длительностями, если он пустой 
// 
// Возвращаемое значение:
//   Массив со стандатными длительностями, либо неопределено - если регистр пустой 
//
Функция ВернутьДлительностиПриемов(ЗаполнитьРегистрЕслиПустой = Ложь) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ДлительностиПриемов.Длительность КАК Длительность
	                      |ИЗ
	                      |	РегистрСведений.ДлительностиПриемов КАК ДлительностиПриемов
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Длительность");
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	Если НЕ ЗначениеЗаполнено(РезультатЗапроса) И ЗаполнитьРегистрЕслиПустой Тогда		
		ТаблицаДлительностей = СформироватьТаблицуСтандартныхДлительностей();
		РезультатДобавления = ЗаполнитьРегистрСтандартнымиДлительностями(ТаблицаДлительностей);
		ВозвращаемоеЗначение = ?(РезультатДобавления, ТаблицаДлительностей.ВыгрузитьКолонку("Длительность"), Неопределено); 
	ИначеЕсли ЗначениеЗаполнено(РезультатЗапроса) Тогда		
		ВозвращаемоеЗначение = РезультатЗапроса.ВыгрузитьКолонку("Длительность");			
	КонецЕсли;
			
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция - Сформировать таблицу стандартных длительностей
// 
Функция СформироватьТаблицуСтандартныхДлительностей()
	
	ТаблицаДлительностей = Новый ТаблицаЗначений;
	ТаблицаДлительностей.Колонки.Добавить("Длительность");	
	
	ТекущееВремяПриема = 5;	
	Пока ТекущееВремяПриема <= 120 Цикл
		
		Если НЕ ТекущееВремяПриема <= 15 И НЕ ТекущееВремяПриема % 10 = 0 Тогда
			ТекущееВремяПриема = ТекущееВремяПриема + 5;
			Продолжить;
		КонецЕсли; 
		
		СтрокаТаблица = ТаблицаДлительностей.Добавить();
		СтрокаТаблица.Длительность = ТекущееВремяПриема;
		
		ТекущееВремяПриема = ?(ТекущееВремяПриема < 60, ТекущееВремяПриема + 5, ТекущееВремяПриема + 30 );
		
	КонецЦикла;	
	
	Возврат ТаблицаДлительностей;
	
КонецФункции

// Функция - Заполнить регистр стандартными длительностями
//
Функция ЗаполнитьРегистрСтандартнымиДлительностями(ТаблицаДлительностей = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТаблицаДлительностей) Тогда		
		ТаблицаДлительностей = СформироватьТаблицуСтандартныхДлительностей();		
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	Попытка
		НаборЗаписей.Загрузить(ТаблицаДлительностей);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка записи длительности приемов в регистр ДлительностиПриемов", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());		
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

// Функция - Удаляет длительность приема
//
Процедура УдалитьДлительностьПриема(Длительность) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Длительность) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Длительность.Установить(Длительность);

	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка при удалении элемента длительности приема из регистра ДлительностиПриемов", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());	
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Добавить длительность приема
//
Процедура ДобавитьДлительностьПриема(Длительность) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Длительность) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Длительность = Длительность;
	Попытка		
		МенеджерЗаписи.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка записи длительности приемов в регистр ДлительностиПриемов", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());		
	КонецПопытки;	
	
КонецПроцедуры

// Функция - Получить количество кнопок длительности
// 
Функция ПолучитьКоличествоКнопокДлительности() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КОЛИЧЕСТВО(ДлительностиПриемов.Длительность) КАК Длительность
	                      |ИЗ
	                      |	РегистрСведений.ДлительностиПриемов КАК ДлительностиПриемов");
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ?(ЗначениеЗаполнено(РезультатЗапроса), РезультатЗапроса.Количество(), 0);
	
КонецФункции

#КонецОбласти

