
#Область ОбработчикиСобытий

&НаСервере
Процедура ВыполнитьАрхивациюЧековНаСервере(КассоваяСмена)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассоваяСмена.Ссылка КАК КассоваяСмена
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Ссылка В(&КассоваяСмена)
	|	И КассоваяСмена.СтатусыКассовойСмены = &СтатусыКассовойСмены";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	Запрос.УстановитьПараметр("СтатусыКассовойСмены", Перечисления.СтатусыКассовойСмены.Закрыта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОписаниеОшибки = "";
		//АрхивацияВыполнена = РозничныеПродажи.ВыполнитьАрхивациюЧековККМ(Выборка.КассоваяСмена, ОписаниеОшибки);
		
		АрхивацияВыполнена = ?(ОписаниеОшибки = "", Истина, Ложь);
		
		Если НЕ АрхивацияВыполнена Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьАрхивациюЧековНаСервере()

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыполнитьАрхивациюЧековНаСервере(ПараметрКоманды);
	
	Оповестить("ОбновитьФормыПослеЗакрытияКассовойСмены");
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Архивация чеков ККМ выполнена'"));
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти