
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Процедура, При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
// Процедура, Список при активизации строки.
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Элементы.ФормаУстановитьОсновной.Доступность = (Элементы.Список.ТекущиеДанные <> Неопределено);
	Элементы.ФормаУстановитьОсновной.Пометка = (Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.Ссылка = Элементы.Список.ТекущиеДанные.ТекущаяМедицинскаяКарта);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте 
// Обработчик события "установить основной".
//
Процедура УстановитьОсновной(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОсновнойНаСервере(Элементы.Список.ТекущиеДанные.ВладелецКарты, Элементы.Список.ТекущиеДанные.Ссылка);
	Оповестить("ОБНОВЛЕНА_ТЕКУЩАЯ_МЕДИЦИНСКАЯ_КАРТА_КЛИЕНТА", Элементы.Список.ТекущиеДанные.ВладелецКарты);
	
	Элементы.Список.Обновить();
	СписокПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры 

#КонецОбласти 

 #Область СлужебныеПроцедцрыИФункции

&НаСервереБезКонтекста 
// Процедура, Установить основной на сервере.
//
Процедура УстановитьОсновнойНаСервере(Контрагент, МедКарта)
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	КонтрагентОбъект.ТекущаяМедицинскаяКарта = МедКарта;
	КонтрагентОбъект.Записать();

КонецПроцедуры

#КонецОбласти 
