
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьПолеВвода();
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанШаблонСообщенияМессенджера" Тогда
		
		Элементы.Список.Обновить();
		
		Если Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.Ссылка = Параметр Тогда
			ОбновитьПолеПредпросмотра(Элементы.Список);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ДокументСформирован".
//
Процедура ПолеПредпросмотраДокументСформирован(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПолеПредпросмотра.Документ.getElementById("field").contentEditable = Ложь;
	Элементы.ПолеПредпросмотра.Документ.getElementById("field").innerHtml = Элементы.Список.ТекущиеДанные.СодержаниеМессенджерHTML;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриАктивизацииСтроки".
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьПолеПредпросмотра(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, формирует HTML поле ввода.
//
Процедура СформироватьПолеВвода()
	
	ЭтотОбъект.ПолеПредпросмотра =
	"<!DOCTYPE html>
	|<html>
	|
	|<head>
	|	<meta http-equiv='content-type' content='text/html; charset=UTF-8'>
	|	<meta name='viewport' content='width=device-width, initial-scale=1'>
	|
	|   <script>" + МессенджерСтоматология.ПолучитьСкриптБиблиотеки_331() + "</script>
	|   <script>" + МессенджерСтоматология.ПолучитьСкриптПоляЧата() + "</script>
	|	<style>" + МессенджерСтоматология.ПолучитьСтилиПоляЧата() + "</style>
	|
	|	<script>
	|
	|		$(document).ready(function() {
	|
	|			$('#emojionearea1').emojioneArea({
	|				pickerPosition: 'bottom',
	|				search: false,
	|				placeholder : 'Введите текст шаблона...',
	|				buttonTitle: 'Нажмите TAB, чтобы быстрее открывать эмодзи'
	|			});
	|			setTimeout(
	|				function() {
	|					document.getElementsByClassName('emojionearea-editor')[0].innerHTML = templateValue;
	|					$('.emojionearea-editor').off('blur focus');
	|				}, 300
	|			);
	|           
	|      	});
	|		
	|	</script>
	|
	|	<style>
	|		body{overflow-x:hidden;}
	|		#field{min-width:100%;max-width:100%;min-height:100%;max-height:100%;font-size:16px;}
	|		.emojioneemoji{display:inline;max-height:1em;max-width:1em;min-height:1em;min-width:1em;margin:0;}
	|		::-webkit-scrollbar{width:8px;cursor:pointer;}
	|		::-webkit-scrollbar-thumb{background:#9A9A9A;border-radius:5px;}
	|		::-webkit-scrollbar-thumb:hover{background:#757575;}
	|		::-webkit-scrollbar-track{background:#D6D6D6;border-radius:5px;}
	|	</style>
	|</head>
	|
	|<body>
	|	<div id='field'><div>
	|</body>
	|
	|</html>";
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет поле предпросмотра шаблона.
//
Процедура ОбновитьПолеПредпросмотра(СписокЭлемент)
	
	Если СписокЭлемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокЭлемент.ТекущиеДанные.ЭтоГруппа = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ПолеПредпросмотра.Документ.readyState = "complete" Тогда
		Элементы.ПолеПредпросмотра.Документ.getElementById("field").innerHtml = СписокЭлемент.ТекущиеДанные.СодержаниеМессенджерHTML;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
