
#Область СлужебныйПрограммныйИнтерфейс

// Процедура создает значения по умолчанию справочника "КлассификаторСпециальностей"
//
Процедура СоздатьЗначенияПоУмолчанию() Экспорт
	
	Макет = Справочники.КлассификаторСпециальностей.ПолучитьМакет("СпециальностиВрачейПоИЭМК");
		
	Для Х=1 по Макет.ВысотаТаблицы Цикл
		
		Ячейка1 = "R" + СтрЗаменить(Строка(Х),Символы.НПП,"")+"C1";
		Ячейка2 = "R" + СтрЗаменить(Строка(Х),Символы.НПП,"")+"C2";
		
		НаименованиеСпециальности	 = Макет.Область(Ячейка2).Текст;
		КодСпециальности		     = Макет.Область(Ячейка1).Текст; 
		
		КодЭлемента = Формат(Число(КодСпециальности), "ЧЦ=9; ЧВН=; ЧГ=0");
		
		Если НЕ ЗначениеЗаполнено(Справочники.КлассификаторСпециальностей.НайтиПоКоду(КодЭлемента)) Тогда
			ЭлементСправочника = Справочники.КлассификаторСпециальностей.СоздатьЭлемент();
			ЭлементСправочника.Код = КодЭлемента;
			ЭлементСправочника.Наименование = НаименованиеСпециальности;
			ЭлементСправочника.КодОИД = КодСпециальности;
			ЭлементСправочника.Записать();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Процедура создает значения из справочника oid:1.2.643.5.1.13.13.11.1066 ИЭМК "КлассификаторСпециальностей"
//
Процедура ЗаполнитьСправочникСпециальностей(Параметры) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Для Каждого Элемент Из Параметры Цикл
		
		Если Элемент.code = "0" Или Элемент.contains[0].display = "0" Тогда
			Продолжить;
		КонецЕсли;
		
		КодЭлемента = Формат(Число(Элемент.code), "ЧЦ=9; ЧВН=; ЧГ=0");
		Если ЗначениеЗаполнено(Справочники.КлассификаторСпециальностей.НайтиПоКоду(КодЭлемента)) Тогда
			Если Элемент.display <> НРег(Справочники.КлассификаторСпециальностей.НайтиПоКоду(КодЭлемента).Наименование) Тогда
				ЭлементСправочника = Справочники.КлассификаторСпециальностей.НайтиПоКоду(КодЭлемента).ПолучитьОбъект();
				ЭлементСправочника.Наименование = Лев(Врег(Лев(Элемент.display,1))+ Нрег(Сред(Элемент.display,2)), 100);
				ЭлементСправочника.КодОИД = Элемент.code;
				ЭлементСправочника.Записать();
			КонецЕсли;
		Иначе
			ЭлементСправочника = Справочники.КлассификаторСпециальностей.СоздатьЭлемент();
			ЭлементСправочника.Наименование = Лев(Врег(Лев(Элемент.display,1))+ Нрег(Сред(Элемент.display,2)), 100);
			ЭлементСправочника.КодОИД = Элемент.code;
			ЭлементСправочника.Код = КодЭлемента;
			ЭлементСправочника.Записать();
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти