
#Область СлужебныйПрограммныйИнтерфейс

#Область ФормированиеДанных

// Процедура производит расчет данных необходимых в мониторе руководителя.
// Вызывается в фоновом задании из формы монитора руководителя.
//
// Параметры:
//  Параметры					 - Структура - Параметры используемые для расчета, обязательные ключи:
//										* СтруктурнаяЕдиница - отбор по Структурной единице, если не заполнен - то по всем структурным единицам,
//										* ДатаРасчета - день расчета,
//										* НастройкиВиджетов - используемые настройки виджетов.
//  ВременноеХранилищеРезультата - Строка	 - Возвращаемый в родительский сеанс параметр. Содержит соответствие виджетов и структур подготовленных данных.
//
Процедура ПолучитьДанныеМонитора(Параметры, ВременноеХранилищеРезультата) Экспорт
	
	Результат = Новый Соответствие;
	
	СтруктурнаяЕдиница 		= Параметры.СтруктурнаяЕдиница;
 	ПериодРасчета 			= Параметры.ПериодРасчета;
	ОтборПериодТип			= Параметры.ОтборПериодТип; 
	ПериодРасчетаПредыдущий = ПолучитьПредыдущийПериод(ПериодРасчета, ОтборПериодТип);
	
	УстановитьПривилегированныйРежим(Истина);

	Результат.Вставить(Перечисления.ВиджетыМонитораРуководителя.Выручка				, ПолучитьДанныеВыручки(СтруктурнаяЕдиница				, ПериодРасчета, ПериодРасчетаПредыдущий));
	Результат.Вставить(Перечисления.ВиджетыМонитораРуководителя.Приемы				, ПолучитьДанныеПриемов(СтруктурнаяЕдиница				, ПериодРасчета, ПериодРасчетаПредыдущий));
	Результат.Вставить(Перечисления.ВиджетыМонитораРуководителя.ЗагрузкаВрачей		, ПолучитьДанныеЗагрузкиВрачей(СтруктурнаяЕдиница		, ПериодРасчета, ПериодРасчетаПредыдущий));
    Результат.Вставить(Перечисления.ВиджетыМонитораРуководителя.Коммуникации		, ПолучитьДанныеКоммуникаций(СтруктурнаяЕдиница			, ПериодРасчета, ПериодРасчетаПредыдущий)); 
	Результат.Вставить(Перечисления.ВиджетыМонитораРуководителя.Регистратура		, ПолучитьДанныеРегистратуры(СтруктурнаяЕдиница			, ПериодРасчета, ПериодРасчетаПредыдущий));	
	Результат.Вставить(Перечисления.ВиджетыМонитораРуководителя.СтоимостьЧасаВрача	, ПолучитьДанныеСтоимостиЧасаВрача(СтруктурнаяЕдиница	, ПериодРасчета, ПериодРасчетаПредыдущий));	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ПоместитьВоВременноеХранилище(Результат, ВременноеХранилищеРезультата);
	
КонецПроцедуры  

// Функция формирует данные для виджета "Выручки".
//
Функция ПолучитьДанныеВыручки(СтруктурнаяЕдиница, ПериодРасчета, ПериодРасчетаПредыдущий)
	
	Результат = Новый Структура;
	
	ДатаНачала 				= ПериодРасчета.ДатаНачала;   	
	ДатаОкончания 			= ПериодРасчета.ДатаОкончания;
	
	Если ЗначениеЗаполнено(ПериодРасчетаПредыдущий) Тогда
		ДатаНачалаПредыдущий    = ПериодРасчетаПредыдущий.ДатаНачала;  
		ДатаОкончанияПредыдущий = ПериодРасчетаПредыдущий.ДатаОкончания;
		ВыводитьПредыдущиеПериоды = Истина;	
	Иначе
		ВыводитьПредыдущиеПериоды = Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОбороты.ДокументРеализации.Сотрудник КАК Сотрудник,
	|	ВЫРАЗИТЬ(СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход) КАК ЧИСЛО(15, 2)) КАК Сумма
	|ПОМЕСТИТЬ ВТВыручкаПоСотрудникам
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И ДокументРеализации <> НЕОПРЕДЕЛЕНО) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|ГДЕ
	|	НЕ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.СписаниеЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОбороты.ДокументРеализации.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ВТВыручкаПоСотрудникам.Сумма), 0) КАК Сумма
	|ПОМЕСТИТЬ ВТОбщаяСуммаВыручки
	|ИЗ
	|	ВТВыручкаПоСотрудникам КАК ВТВыручкаПоСотрудникам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ПродажиОбороты.СтоимостьОборот * (ЕСТЬNULL(ВзаиморасчетыСКонтрагентами.СуммаПриход, 0) / ВЫБОР
	|					КОГДА ЕСТЬNULL(ПродажиОбороты.ДокументПродажи.СуммаДокумента, 0) = 0
	|						ТОГДА 1
	|					ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.ДокументПродажи.СуммаДокумента, 0)
	|				КОНЕЦ) КАК ЧИСЛО(15, 2))), 0) КАК Сумма
	|ПОМЕСТИТЬ ВТВыручкаПоСотрудникамПредыдущее
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, , , СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК ДокументПродажи,
	|			ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход КАК СуммаПриход
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(&ДатаНачалаПредыдущий, &ДатаОкончанияПредыдущий, Авто, , СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты) КАК ВзаиморасчетыСКонтрагентами
	|		ПО ПродажиОбороты.ДокументПродажи = ВзаиморасчетыСКонтрагентами.ДокументПродажи
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Сотрудник КАК Сотрудник,
	|	ПродажиОбороты.СтоимостьОборот КАК Сумма
	|ПОМЕСТИТЬ ВтОказанныеУслугиСотрудников
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВтОказанныеУслугиСотрудников.Сумма), 0) КАК Сумма
	|ПОМЕСТИТЬ ВтОбщаяСуммаОказано
	|ИЗ
	|	ВтОказанныеУслугиСотрудников КАК ВтОказанныеУслугиСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.СтоимостьОборот КАК Сумма
	|ПОМЕСТИТЬ ВтОказанныеУслугиПредыдущий
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачалаПредыдущий, &ДатаОкончанияПредыдущий, , СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ПродажиОбороты
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.ДокументПродажи.Сотрудник КАК Сотрудник,
	|	ПродажиОбороты.ДокументПродажи.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СУММА(ПродажиОбороты.СтоимостьОборот), 0) КАК Стоимость
	|ПОМЕСТИТЬ ВтДанныеСреднийЧек
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, День, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ДокументПродажи.Сотрудник,
	|	ПродажиОбороты.ДокументПродажи.Контрагент,
	|	ПродажиОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.ДокументПродажи.Сотрудник КАК Сотрудник,
	|	ПродажиОбороты.ДокументПродажи.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СУММА(ПродажиОбороты.СтоимостьОборот), 0) КАК Стоимость
	|ПОМЕСТИТЬ ВтДанныеСреднийЧекПредыдущий
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачалаПредыдущий, &ДатаОкончанияПредыдущий, День, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ПродажиОбороты
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ДокументПродажи.Сотрудник,
	|	ПродажиОбороты.ДокументПродажи.Контрагент,
	|	ПродажиОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСреднийЧек.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА КОЛИЧЕСТВО(ВтСреднийЧек.Контрагент) = 0
	|					ТОГДА 0
	|				ИНАЧЕ СУММА(ВтСреднийЧек.Стоимость) / КОЛИЧЕСТВО(ВтСреднийЧек.Контрагент)
	|			КОНЕЦ КАК ЧИСЛО(15, 2)), 0) КАК СреднийЧек
	|ПОМЕСТИТЬ ВТСреднийЧекОбщий
	|ИЗ
	|	ВтДанныеСреднийЧек КАК ВтСреднийЧек
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтСреднийЧек.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА КОЛИЧЕСТВО(ВтДанныеСреднийЧек.Контрагент) = 0
	|					ТОГДА 0
	|				ИНАЧЕ СУММА(ВтДанныеСреднийЧек.Стоимость) / КОЛИЧЕСТВО(ВтДанныеСреднийЧек.Контрагент)
	|			КОНЕЦ КАК ЧИСЛО(15, 2)), 0) КАК Сумма
	|ИЗ
	|	ВтДанныеСреднийЧек КАК ВтДанныеСреднийЧек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА КОЛИЧЕСТВО(ВтДанныеСреднийЧекПредыдущий.Контрагент) = 0
	|					ТОГДА 0
	|				ИНАЧЕ СУММА(ВтДанныеСреднийЧекПредыдущий.Стоимость) / КОЛИЧЕСТВО(ВтДанныеСреднийЧекПредыдущий.Контрагент)
	|			КОНЕЦ КАК ЧИСЛО(15, 2)), 0) КАК Сумма
	|ИЗ
	|	ВтДанныеСреднийЧекПредыдущий КАК ВтДанныеСреднийЧекПредыдущий
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА"
	;  
			
	Запрос.УстановитьПараметр("ДатаНачала"					, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"				, ДатаОкончания);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"			, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачалаПредыдущий"		, ДатаНачалаПредыдущий);
	Запрос.УстановитьПараметр("ДатаОкончанияПредыдущий"		, ДатаОкончанияПредыдущий);
	Запрос.УстановитьПараметр("ВыводитьПредыдущиеПериоды"	, ВыводитьПредыдущиеПериоды);

	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Результат.Вставить("ДиаграммаОплачено"				, МассивРезультатов[0]);
    Результат.Вставить("ДанныеШапкиВыручка"				, МассивРезультатов[1]);
	Результат.Вставить("ДанныеШапкиВыручкаПредыдущий"	, МассивРезультатов[2]);
	Результат.Вставить("ДиаграммаОказано"				, МассивРезультатов[3]);
    Результат.Вставить("ДанныеШапкиОказано"				, МассивРезультатов[4]);
	Результат.Вставить("ДанныеШапкиОказаноПредыдущий"	, МассивРезультатов[5]);
	Результат.Вставить("ДиаграммаСреднийЧек"			, МассивРезультатов[8]);
    Результат.Вставить("ДанныеШапкиСреднийЧек"			, МассивРезультатов[9]);
    Результат.Вставить("ДанныеШапкиСреднийЧекПредыдущий", МассивРезультатов[10]);

	Возврат Результат;
	
КонецФункции

// Функция формирует данные для виджета "Приемов".
//
Функция ПолучитьДанныеПриемов(СтруктурнаяЕдиница, ПериодРасчета, ПериодРасчетаПредыдущий)
	
	Результат = Новый Структура;
	
	ДатаНачала 				= ПериодРасчета.ДатаНачала;   	
	ДатаОкончания 			= ПериодРасчета.ДатаОкончания;
	
	Если ЗначениеЗаполнено(ПериодРасчетаПредыдущий) Тогда
		ДатаНачалаПредыдущий    = ПериодРасчетаПредыдущий.ДатаНачала;  
		ДатаОкончанияПредыдущий = ПериодРасчетаПредыдущий.ДатаОкончания;
		ВыводитьПредыдущиеПериоды = Истина;	
	Иначе
		ВыводитьПредыдущиеПериоды = Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	Прием.СтатусПациента КАК Статус,
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Прием.Ссылка) КАК Количество
	 |ПОМЕСТИТЬ ВтКоличествоЗавершенныхПриемовПоСтатусам
	 |ИЗ
	 |	Документ.Прием КАК Прием
	 |ГДЕ
	 |	Прием.Проведен = ИСТИНА
	 |	И Прием.ВремяОкончанияПриема МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Прием.СтатусПациента
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Прием.Ссылка) КАК Количество
	 |ПОМЕСТИТЬ ВтКоличествоЗавершенныхПриемовПоСтатусамПредыдущий
	 |ИЗ
	 |	Документ.Прием КАК Прием
	 |ГДЕ
	 |	Прием.Проведен = ИСТИНА
	 |	И Прием.ВремяОкончанияПриема МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	 |	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И &ВыводитьПредыдущиеПериоды = ИСТИНА
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ЕСТЬNULL(СУММА(ВтКоличествоЗавершенныхПриемовПоСтатусам.Количество), 0) КАК Количество
	 |ПОМЕСТИТЬ ВтОбшееКоличествоПриемовЗавершенных
	 |ИЗ
	 |	ВтКоличествоЗавершенныхПриемовПоСтатусам КАК ВтКоличествоЗавершенныхПриемовПоСтатусам
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ВЫБОР
	 |		КОГДА ТИПЗНАЧЕНИЯ(Прием.АвторДокумента) = ТИП(Справочник.Пользователи)
	 |				И Прием.АвторДокумента.Сотрудник <> ЗНАЧЕНИЕ(Справочник.сотрудники.Пустаяссылка)
	 |			ТОГДА Прием.АвторДокумента.Сотрудник
	 |		ИНАЧЕ Прием.АвторДокумента
	 |	КОНЕЦ КАК Сотрудник,
	 |	СУММА(ВЫБОР
	 |			КОГДА Прием.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК Первичные,
	 |	СУММА(ВЫБОР
	 |			КОГДА Прием.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК Повторные,
	 |	СУММА(ВЫБОР
	 |			КОГДА Прием.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК БезСтатуса,
	 |	СУММА(ВЫБОР
	 |			КОГДА Прием.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ + ВЫБОР
	 |			КОГДА Прием.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ + ВЫБОР
	 |			КОГДА Прием.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	 |				ТОГДА 1
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ОбщееКоличество
	 |ПОМЕСТИТЬ ВтКоличествоПервичныхПриемовПоАвторам
	 |ИЗ
	 |	Документ.Прием КАК Прием
	 |ГДЕ
	 |	Прием.ВремяОкончанияПриема МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |	И Прием.Проведен = ИСТИНА
	 |	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВЫБОР
	 |		КОГДА ТИПЗНАЧЕНИЯ(Прием.АвторДокумента) = ТИП(Справочник.Пользователи)
	 |				И Прием.АвторДокумента.Сотрудник <> ЗНАЧЕНИЕ(Справочник.сотрудники.Пустаяссылка)
	 |			ТОГДА Прием.АвторДокумента.Сотрудник
	 |		ИНАЧЕ Прием.АвторДокумента
	 |	КОНЕЦ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.СсылкаНаПрием.Ссылка) КАК Количество,
	 |	ВЫБОР
	 |		КОГДА Событие.ИсточникЗаписи = ЗНАЧЕНИЕ(Справочник.ИсточникиЗаписей.ПустаяСсылка)
	 |			ТОГДА ""Администратор""
	 |		ИНАЧЕ Событие.ИсточникЗаписи.Наименование
	 |	КОНЕЦ КАК ИсточникЗаписи
	 |ПОМЕСТИТЬ ВтКаналыПриемов
	 |ИЗ
	 |	Документ.Событие КАК Событие
	 |ГДЕ
	 |	Событие.СсылкаНаПрием.Проведен = ИСТИНА
	 |	И НЕ Событие.СсылкаНаПрием ЕСТЬ NULL
	 |	И Событие.СсылкаНаПрием.ВремяОкончанияПриема МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |	И Событие.СсылкаНаПрием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И Событие.Резерв = ЛОЖЬ
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВЫБОР
	 |		КОГДА Событие.ИсточникЗаписи = ЗНАЧЕНИЕ(Справочник.ИсточникиЗаписей.ПустаяСсылка)
	 |			ТОГДА ""Администратор""
	 |		ИНАЧЕ Событие.ИсточникЗаписи.Наименование
	 |	КОНЕЦ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Прием.Ссылка) КАК Количество
	 |ПОМЕСТИТЬ ВсегоПриемов
	 |ИЗ
	 |	Документ.Прием КАК Прием
	 |ГДЕ
	 |	Прием.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И Прием.ПометкаУдаления = ЛОЖЬ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Прием.Ссылка) КАК Количество
	 |ПОМЕСТИТЬ ВсегоПриемовПредыдущий
	 |ИЗ
	 |	Документ.Прием КАК Прием
	 |ГДЕ
	 |	Прием.Дата МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	 |	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И Прием.ПометкаУдаления = ЛОЖЬ
	 |	И &ВыводитьПредыдущиеПериоды = ИСТИНА
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Прием.Ссылка) КАК Количество
	 |ПОМЕСТИТЬ НеЗавершенныхПриемов
	 |ИЗ
	 |	Документ.Прием КАК Прием
	 |ГДЕ
	 |	Прием.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И Прием.Проведен = ЛОЖЬ
	 |	И Прием.ПометкаУдаления = ЛОЖЬ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.Ссылка) КАК Количество
	 |ПОМЕСТИТЬ КоличествоОтмененныхЗаписей
	 |ИЗ
	 |	Документ.Событие КАК Событие
	 |ГДЕ
	 |	Событие.ПометкаУдаления = ЛОЖЬ
	 |	И Событие.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	 |	И Событие.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И Событие.Резерв = ЛОЖЬ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.Ссылка) КАК Количество
	 |ПОМЕСТИТЬ КоличествоОтмененныхЗаписейПредыдущий
	 |ИЗ
	 |	Документ.Событие КАК Событие
	 |ГДЕ
	 |	Событие.ПометкаУдаления = ЛОЖЬ
	 |	И Событие.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	 |	И Событие.Дата МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	 |	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	 |	И Событие.Резерв = ЛОЖЬ
	 |	И &ВыводитьПредыдущиеПериоды = ИСТИНА"
	 ;  
			
	Запрос.УстановитьПараметр("ДатаНачала"					, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"				, ДатаОкончания);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"			, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачалаПредыдущий"		, ДатаНачалаПредыдущий);
	Запрос.УстановитьПараметр("ДатаОкончанияПредыдущий"		, ДатаОкончанияПредыдущий);
	Запрос.УстановитьПараметр("ВыводитьПредыдущиеПериоды"	, ВыводитьПредыдущиеПериоды);
	
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Результат.Вставить("ДиаграммаПриемовПоСтатусам"			, МассивРезультатов[0]);
	Результат.Вставить("ДанныеШапкиЗавершеноПредыдущий"		, МассивРезультатов[1]);
	Результат.Вставить("ДанныеШапкиЗавершено"				, МассивРезультатов[2]);
	Результат.Вставить("ДанныеСозданоПоАдминистраторам"		, МассивРезультатов[3]);
	Результат.Вставить("ДанныеКаналыПриемов"				, МассивРезультатов[4]);
	Результат.Вставить("ДанныеВсегоПриемов"					, МассивРезультатов[5]);
	Результат.Вставить("ДанныеВсегоПриемовПредыдущий"		, МассивРезультатов[6]);
	Результат.Вставить("ДанныеНеЗавершенныхПриемов"			, МассивРезультатов[7]);
	Результат.Вставить("ДанныеОтмененнхПриемов"				, МассивРезультатов[8]); 
    Результат.Вставить("ДанныеОтмененнхПриемовПредыдущий"	, МассивРезультатов[9]);
	
	Возврат Результат;
	
КонецФункции

// Функция формирует данные для виджета "Регистратуры".
//
Функция ПолучитьДанныеРегистратуры(СтруктурнаяЕдиница, ПериодРасчета, ПериодРасчетаПредыдущий)
	
	Результат = Новый Структура;
	
	ДатаНачала 				= ПериодРасчета.ДатаНачала;   	
	ДатаОкончания 			= ПериодРасчета.ДатаОкончания;
	
	Если ЗначениеЗаполнено(ПериодРасчетаПредыдущий) Тогда
		ДатаНачалаПредыдущий    = ПериодРасчетаПредыдущий.ДатаНачала;  
		ДатаОкончанияПредыдущий = ПериодРасчетаПредыдущий.ДатаОкончания;
		ВыводитьПредыдущиеПериоды = Истина;	
	Иначе
		ВыводитьПредыдущиеПериоды = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Событие.СтатусПациента КАК Статус,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.Ссылка), 0) КАК Количество
	|ПОМЕСТИТЬ ВтСозданныеЗаписи
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Событие.ПометкаУдаления = ЛОЖЬ
	|	И Событие.Резерв = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Событие.СтатусПациента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВтСозданныеЗаписи.Количество), 0) КАК Количество
	|ПОМЕСТИТЬ ВтВсегоСозданноЗаписей
	|ИЗ
	|	ВтСозданныеЗаписи КАК ВтСозданныеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.Ссылка), 0) КАК Количество
	|ПОМЕСТИТЬ ВтСозданныеЗаписиПредыдущий
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДатаСоздания МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	|	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Событие.ПометкаУдаления = ЛОЖЬ
	|	И Событие.Резерв = ЛОЖЬ
	|	И &ВыводитьПредыдущиеПериоды = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Событие.АвторДокумента) = ТИП(Справочник.Пользователи)
	|				И Событие.АвторДокумента.Сотрудник <> ЗНАЧЕНИЕ(Справочник.сотрудники.Пустаяссылка)
	|			ТОГДА Событие.АвторДокумента.Сотрудник
	|		ИНАЧЕ Событие.АвторДокумента
	|	КОНЕЦ КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА Событие.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Первичные,
	|	СУММА(ВЫБОР
	|			КОГДА Событие.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Повторные,
	|	СУММА(ВЫБОР
	|			КОГДА Событие.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БезСтатуса,
	|	СУММА(ВЫБОР
	|			КОГДА Событие.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА Событие.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА Событие.СтатусПациента = ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщееКоличество
	|ПОМЕСТИТЬ ВтСозданныхЗаписейПоАвторам
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Событие.Проведен = ИСТИНА
	|	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Событие.Резерв = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Событие.АвторДокумента) = ТИП(Справочник.Пользователи)
	|				И Событие.АвторДокумента.Сотрудник <> ЗНАЧЕНИЕ(Справочник.сотрудники.Пустаяссылка)
	|			ТОГДА Событие.АвторДокумента.Сотрудник
	|		ИНАЧЕ Событие.АвторДокумента
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Событие.СтатусПациента КАК Статус,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.Ссылка), 0) КАК Количество
	|ПОМЕСТИТЬ ВТОтмененныеПриемы
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Событие.Проведен = ИСТИНА
	|	И Событие.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И Событие.Резерв = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Событие.СтатусПациента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТОтмененныеПриемы.Количество), 0) КАК Количество
	|ИЗ
	|	ВТОтмененныеПриемы КАК ВТОтмененныеПриемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.Ссылка), 0) КАК Количество
	|ПОМЕСТИТЬ ВТОтмененныеПриемыПредыдущий
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДатаСоздания МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	|	И Событие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Событие.Проведен = ИСТИНА
	|	И Событие.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И Событие.Резерв = ЛОЖЬ
	|	И &ВыводитьПредыдущиеПериоды = ИСТИНА";

	Запрос.УстановитьПараметр("ДатаНачала"				, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"			, ДатаОкончания);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачалаПредыдущий"	, ДатаНачалаПредыдущий);
	Запрос.УстановитьПараметр("ДатаОкончанияПредыдущий"	, ДатаОкончанияПредыдущий);
	Запрос.УстановитьПараметр("ВыводитьПредыдущиеПериоды"	, ВыводитьПредыдущиеПериоды);
	
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Результат.Вставить("ДанныеСозданоНовыхЗаписей"					, МассивРезультатов[0]);
	Результат.Вставить("ДанныеСозданоНовыхЗаписейВсего"				, МассивРезультатов[1]);
	Результат.Вставить("ДанныеСозданоНовыхЗаписейВсегоПредыдущий"	, МассивРезультатов[2]);
	Результат.Вставить("ДанныеСозданоЗаписейПоАвторам"				, МассивРезультатов[3]);
	Результат.Вставить("ДанныеОтмененныеЗаписи"						, МассивРезультатов[4]);
	Результат.Вставить("ДанныеОтмененныеЗаписиВсего"				, МассивРезультатов[5]);
	Результат.Вставить("ДанныеОтмененныеЗаписиВсегоПредыдущий"		, МассивРезультатов[6]);
	
	Возврат Результат;
	
КонецФункции 

// Функция формирует данные для виджета "ЗагрузкаВрачей".
//
Функция ПолучитьДанныеЗагрузкиВрачей(СтруктурнаяЕдиница, ПериодРасчета, ПериодРасчетаПредыдущий)
	
	Результат = Новый Структура;
	
	ДатаНачала 				= ПериодРасчета.ДатаНачала;   	
	ДатаОкончания 			= ПериодРасчета.ДатаОкончания;
		
	Если ЗначениеЗаполнено(ПериодРасчетаПредыдущий) Тогда
		ДатаНачалаПредыдущий    = ПериодРасчетаПредыдущий.ДатаНачала;  
		ДатаОкончанияПредыдущий = ПериодРасчетаПредыдущий.ДатаОкончания;
		ВыводитьПредыдущиеПериоды = Истина;	
	Иначе
		ВыводитьПредыдущиеПериоды = Ложь;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВремяРаботыСотрудниковПлан.Минуты / 60 КАК ПоПлану,
	|	0 КАК ПоФакту
	|ПОМЕСТИТЬ РабочееВремяСотрудников
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СобытиеУслуги.Сотрудник,
	|	0,
	|	РАЗНОСТЬДАТ(СобытиеУслуги.ДатаНачала, СобытиеУслуги.ДатаОкончания, МИНУТА) / 60
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка.Проведен
	|	И НЕ СобытиеУслуги.Ссылка.ПометкаУдаления
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	|	И СобытиеУслуги.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И СобытиеУслуги.Ссылка.Резерв = ЛОЖЬ
	|	И СобытиеУслуги.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочееВремяСотрудников.Сотрудник КАК Сотрудник,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА СУММА(РабочееВремяСотрудников.ПоПлану) = 0
	|				ТОГДА 100
	|			ИНАЧЕ СУММА(РабочееВремяСотрудников.ПоФакту) / СУММА(РабочееВремяСотрудников.ПоПлану) * 100
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ПроцентЗагрузки
	|ПОМЕСТИТЬ ВтПроцентЗагрузкиВрачей
	|ИЗ
	|	РабочееВремяСотрудников КАК РабочееВремяСотрудников
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочееВремяСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КОЛИЧЕСТВО(ВтПроцентЗагрузкиВрачей.ПроцентЗагрузки) = 0
	|				ТОГДА 0
	|			ИНАЧЕ СУММА(ВтПроцентЗагрузкиВрачей.ПроцентЗагрузки) / КОЛИЧЕСТВО(ВтПроцентЗагрузкиВрачей.ПроцентЗагрузки)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Процент
	|ИЗ
	|	ВтПроцентЗагрузкиВрачей КАК ВтПроцентЗагрузкиВрачей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.Минуты / 60 КАК ПоПлану,
	|	0 КАК ПоФакту,
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ РабочееВремяСотрудниковПредыдущий
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	|	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &ВыводитьПредыдущиеПериоды = ИСТИНА
	|	И ВремяРаботыСотрудниковПлан.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	РАЗНОСТЬДАТ(СобытиеУслуги.ДатаНачала, СобытиеУслуги.ДатаОкончания, МИНУТА) / 60,
	|	СобытиеУслуги.Сотрудник
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	СобытиеУслуги.Ссылка.Проведен
	|	И НЕ СобытиеУслуги.Ссылка.ПометкаУдаления
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	|	И СобытиеУслуги.ДатаНачала МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	|	И СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &ВыводитьПредыдущиеПериоды = ИСТИНА
	|	И СобытиеУслуги.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочееВремяСотрудниковПредыдущий.Сотрудник КАК Сотрудник,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА СУММА(РабочееВремяСотрудниковПредыдущий.ПоПлану) = 0
	|				ТОГДА 100
	|			ИНАЧЕ СУММА(РабочееВремяСотрудниковПредыдущий.ПоФакту) / СУММА(РабочееВремяСотрудниковПредыдущий.ПоПлану) * 100
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЗагрузкаВрачей
	|ПОМЕСТИТЬ ЗагрузкаВрачейПредыдущий
	|ИЗ
	|	РабочееВремяСотрудниковПредыдущий КАК РабочееВремяСотрудниковПредыдущий
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочееВремяСотрудниковПредыдущий.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КОЛИЧЕСТВО(ЗагрузкаВрачейПредыдущий.ЗагрузкаВрачей) = 0
	|				ТОГДА 0
	|			ИНАЧЕ СУММА(ЗагрузкаВрачейПредыдущий.ЗагрузкаВрачей) / КОЛИЧЕСТВО(ЗагрузкаВрачейПредыдущий.ЗагрузкаВрачей)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Процент
	|ИЗ
	|	ЗагрузкаВрачейПредыдущий КАК ЗагрузкаВрачейПредыдущий
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДатаНачала"					, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"				, ДатаОкончания);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"			, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачалаПредыдущий"		, ДатаНачалаПредыдущий);
	Запрос.УстановитьПараметр("ДатаОкончанияПредыдущий"		, ДатаОкончанияПредыдущий);
	Запрос.УстановитьПараметр("ВыводитьПредыдущиеПериоды"	, ВыводитьПредыдущиеПериоды);
	
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Результат.Вставить("ДанныеЗагрузкиВрачей"					, МассивРезультатов[1]);
	Результат.Вставить("ДанныеЗагрузкиВрачейОбщий"				, МассивРезультатов[2]);
	Результат.Вставить("ДанныеЗагрузкиВрачейОбщийПредыдущий"	, МассивРезультатов[5]);
	
	Возврат Результат;
	
КонецФункции 

// Функция формирует данные для виджета "Коммуникации".
//
Функция ПолучитьДанныеКоммуникаций(СтруктурнаяЕдиница, ПериодРасчета, ПериодРасчетаПредыдущий)
	
	Результат = Новый Структура;
	
	ДатаНачала 				= НачалоДня(ПериодРасчета.ДатаНачала);   	
	ДатаОкончания 			= ПериодРасчета.ДатаОкончания;
	
	Если ЗначениеЗаполнено(ПериодРасчетаПредыдущий) Тогда
		ДатаНачалаПредыдущий    = ПериодРасчетаПредыдущий.ДатаНачала;  
		ДатаОкончанияПредыдущий = ПериодРасчетаПредыдущий.ДатаОкончания;
		ВыводитьПредыдущиеПериоды = Истина;	
	Иначе
		ВыводитьПредыдущиеПериоды = Ложь;
	КонецЕсли;
	
	Периодичность = Неопределено;
	
	ТаблицаПериодов = ПолучитьТаблицуПериодов(ДатаНачала, ДатаОкончания, Периодичность);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ЕСТЬNULL(СтруктурныеЕдиницыРасписаниеРаботы.НачалоРаботы, НЕОПРЕДЕЛЕНО)) КАК НачалоРаботы,
	|	МАКСИМУМ(ЕСТЬNULL(СтруктурныеЕдиницыРасписаниеРаботы.ОкончаниеРаботы, НЕОПРЕДЕЛЕНО)) КАК ОкончаниеРаботы
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК СтруктурныеЕдиницыРасписаниеРаботы
	|ГДЕ
	|	СтруктурныеЕдиницыРасписаниеРаботы.Ссылка = &Ссылка
	|	И СтруктурныеЕдиницыРасписаниеРаботы.Активность = ИСТИНА"; 
	
	Запрос.УстановитьПараметр("Ссылка", СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВремяНачалаДляАктивности 	= Дата(1,1,1,0,0,0);
	ВремяОкончанияДляАктивности = Дата(1,1,1,23,0,0);

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		 
		ВремяНачалаДляАктивности 	= ?(ЗначениеЗаполнено(Выборка.НачалоРаботы)		, НачалоЧаса(Выборка.НачалоРаботы)		, ВремяНачалаДляАктивности);	
		ВремяОкончанияДляАктивности = ?(ЗначениеЗаполнено(Выборка.ОкончаниеРаботы)	, НачалоЧаса(Выборка.ОкончаниеРаботы)	, ВремяОкончанияДляАктивности);
	КонецЕсли;
	
	ТаблицаПериодовДляАктивности = ПолучитьТаблицуПериодовДляАктивности(ВремяНачалаДляАктивности, ВремяОкончанияДляАктивности);
		
	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПериодов.ПериодНачало КАК ПериодНачало,
	|	ТаблицаПериодов.ПериодОкончание КАК ПериодОкончание
	|ПОМЕСТИТЬ ВтПериоды
	|ИЗ
	|	&ТаблицаПериодов КАК ТаблицаПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияВызовов.НачалоВызова КАК НачалоВызова,
	|	ИсторияВызовов.IDЗвонка КАК IDЗвонка,
	|	ИсторияВызовов.НаправлениеВызова КАК НаправлениеВызова,
	|	ИсторияВызовов.Статус КАК Статус
	|ПОМЕСТИТЬ ВтЗвонки
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.НачалоВызова МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВЫБОР
	|			КОГДА ИсторияВызовов.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИсторияВызовов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПериоды.ПериодНачало КАК Звонки,
	|	СУММА(ВЫБОР
	|			КОГДА ВтЗвонки.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Входящий)
	|					И ВтЗвонки.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Входящих,
	|	СУММА(ВЫБОР
	|			КОГДА ВтЗвонки.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Исходящий)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Исходящих,
	|	СУММА(ВЫБОР
	|			КОГДА ВтЗвонки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Пропущенных
	|ИЗ
	|	ВтПериоды КАК ВтПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗвонки КАК ВтЗвонки
	|		ПО (ВтЗвонки.НачалоВызова МЕЖДУ ВтПериоды.ПериодНачало И ВтПериоды.ПериодОкончание)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтПериоды.ПериодНачало
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВтПериоды.ПериодНачало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПериодовЧас.ПериодЧас КАК ПериодЧас
	|ПОМЕСТИТЬ ВТПириодыЧас
	|ИЗ
	|	&ТаблицаПериодовЧас КАК ТаблицаПериодовЧас
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияВызовов.IDЗвонка КАК IDЗвонка,
	|	ИсторияВызовов.НачалоВызова КАК НачалоВызова
	|ПОМЕСТИТЬ ВтАктивность
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.НачалоВызова МЕЖДУ &ДатаНачалаАктивность И &ДатаОкончанияАктивность
	|	И ВЫБОР
	|			КОГДА ИсторияВызовов.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИсторияВызовов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДЕНЬНЕДЕЛИ(СтруктурныеЕдиницыРасписаниеРаботы.ДеньНедели) КАК ДеньНедели,
	|	ЧАС(ВТПириодыЧас.ПериодЧас) КАК ПериодЧас
	|ПОМЕСТИТЬ ВТПериодыДляАктивности
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.РасписаниеРаботы КАК СтруктурныеЕдиницыРасписаниеРаботы
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТПириодыЧас КАК ВТПириодыЧас
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СтруктурныеЕдиницыРасписаниеРаботы.Ссылка = &СтруктурнаяЕдиница
	|	И СтруктурныеЕдиницыРасписаниеРаботы.Активность = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТПериодыДляАктивности.ДеньНедели) КАК МинимальныйДеньНедели,
	|	МИНИМУМ(ВТПериодыДляАктивности.ПериодЧас) КАК МинимальныйПериодЧас,
	|	МАКСИМУМ(ВТПериодыДляАктивности.ДеньНедели) КАК МаксимальныйДеньНедели,
	|	МАКСИМУМ(ВТПериодыДляАктивности.ПериодЧас) КАК МаксимальныйПериодЧас
	|ПОМЕСТИТЬ ВТРамки
	|ИЗ
	|	ВТПериодыДляАктивности КАК ВТПериодыДляАктивности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПериодыДляАктивности.ДеньНедели КАК ДеньНедели,
	|	ВТПериодыДляАктивности.ПериодЧас КАК ПериодЧас,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтАктивность.IDЗвонка) КАК Количество
	|ПОМЕСТИТЬ ВтРезультатДляАктивности
	|ИЗ
	|	ВТПериодыДляАктивности КАК ВТПериодыДляАктивности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтАктивность КАК ВтАктивность
	|		ПО (ВТПериодыДляАктивности.ДеньНедели = ДЕНЬНЕДЕЛИ(ВтАктивность.НачалоВызова))
	|			И (ВТПериодыДляАктивности.ПериодЧас = ЧАС(ВтАктивность.НачалоВызова))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПериодыДляАктивности.ДеньНедели,
	|	ВТПериодыДляАктивности.ПериодЧас
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ИсторияВызовов.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Входящий)
	|					И ИсторияВызовов.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Входящий,
	|	СУММА(ВЫБОР
	|			КОГДА ИсторияВызовов.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Исходящий)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Исходящий,
	|	СУММА(ВЫБОР
	|			КОГДА ИсторияВызовов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Пропущен
	|ПОМЕСТИТЬ ВтДанныеШапкиТелефония
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.НачалоВызова МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВЫБОР
	|			КОГДА ИсторияВызовов.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИсторияВызовов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ИсторияВызовов.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Входящий)
	|					И ИсторияВызовов.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Входящий,
	|	СУММА(ВЫБОР
	|			КОГДА ИсторияВызовов.НаправлениеВызова = ЗНАЧЕНИЕ(Перечисление.ВариантыНаправленияВызова.Исходящий)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Исходящий,
	|	СУММА(ВЫБОР
	|			КОГДА ИсторияВызовов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗвонка.Пропущен)
	|				ТОГДА 1
	|		КОНЕЦ) КАК Пропущен
	|ПОМЕСТИТЬ ВтДанныеШапкиТелефонияПредыдущий
	|ИЗ
	|	РегистрСведений.ИсторияВызовов КАК ИсторияВызовов
	|ГДЕ
	|	ИсторияВызовов.НачалоВызова МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	|	И ВЫБОР
	|			КОГДА ИсторияВызовов.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИсторияВызовов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		КОНЕЦ
	|	И &ВыводитьПредыдущиеПериоды = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДатаНачала"				, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"			, ДатаОкончания); 
	
	Запрос.УстановитьПараметр("ДатаНачалаПредыдущий"		, ДатаНачалаПредыдущий);
	Запрос.УстановитьПараметр("ДатаОкончанияПредыдущий"		, ДатаОкончанияПредыдущий); 
	Запрос.УстановитьПараметр("ВыводитьПредыдущиеПериоды"	, ВыводитьПредыдущиеПериоды);
	
	Запрос.УстановитьПараметр("ДатаНачалаАктивность"	, НачалоНедели(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончанияАктивность"	, КонецНедели(ДатаОкончания));
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница); 
	Запрос.УстановитьПараметр("ТаблицаПериодов"			, ТаблицаПериодов);
	Запрос.УстановитьПараметр("ТаблицаПериодовЧас"		, ТаблицаПериодовДляАктивности);
	                                                                                                                               	
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Результат.Вставить("ДанныеКомуникаци"			, МассивРезультатов[2]);
	Результат.Вставить("ВтРамкиАктивности"			, МассивРезультатов[6]);
	Результат.Вставить("ДанныеКомуникациАктивность"	, МассивРезультатов[7]);
	Результат.Вставить("ДанныеТелефонииШапка"		, МассивРезультатов[8]);
	Результат.Вставить("ДанныеТелефонииПредыдущий"	, МассивРезультатов[9]);
	Результат.Вставить("Периодичность"				, Периодичность);
					
	Возврат Результат;
	
КонецФункции 

// Функция - Получить данные "СтоимостьЧасаВрача".
//
// Параметры:
//  СтруктурнаяЕдиница		 - 	 - 
//  ПериодРасчета			 - 	 - 
//  ПериодРасчетаПредыдущий	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСтоимостиЧасаВрача(СтруктурнаяЕдиница, ПериодРасчета, ПериодРасчетаПредыдущий)
	
	Результат = Новый Структура;
	
	ДатаНачала 				= ПериодРасчета.ДатаНачала;   	
	ДатаОкончания 			= ПериодРасчета.ДатаОкончания;
		
	Если ЗначениеЗаполнено(ПериодРасчетаПредыдущий) Тогда
		ДатаНачалаПредыдущий    = ПериодРасчетаПредыдущий.ДатаНачала;  
		ДатаОкончанияПредыдущий = ПериодРасчетаПредыдущий.ДатаОкончания;
		ВыводитьПредыдущиеПериоды = Истина;	
	Иначе
		ВыводитьПредыдущиеПериоды = Ложь;
	КонецЕсли;
		
	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Прием.Ссылка КАК Прием
	|ПОМЕСТИТЬ ВТПриемы
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВЫБОР
	|			КОГДА Прием.ВремяНачалаПриема = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Прием.Дата
	|			ИНАЧЕ Прием.ВремяНачалаПриема
	|		КОНЕЦ МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Прием.ПометкаУдаления = ЛОЖЬ
	|	И Прием.Проведен = ИСТИНА
	|	И Прием.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПриемы.Прием КАК Прием,
	|	СУММА(РАЗНОСТЬДАТ(СобытиеУслуги.ДатаНачала, СобытиеУслуги.ДатаОкончания, МИНУТА)) КАК КоличествоМинут
	|ПОМЕСТИТЬ ВТПредварительныеДанные
	|ИЗ
	|	ВТПриемы КАК ВТПриемы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Событие.Услуги КАК СобытиеУслуги
	|		ПО ВТПриемы.Прием = СобытиеУслуги.Ссылка.СсылкаНаПрием
	|ГДЕ
	|	НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	|	И СобытиеУслуги.Ссылка.Резерв = ЛОЖЬ
	|	И СобытиеУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПриемы.Прием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПредварительныеДанные.Прием.Сотрудник КАК Сотрудник,
	|	СУММА(ВТПредварительныеДанные.КоличествоМинут) КАК КоличествоОтработанныхМинут
	|ПОМЕСТИТЬ ВтОтработанноеВремя
	|ИЗ
	|	ВТПредварительныеДанные КАК ВТПредварительныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПредварительныеДанные.Прием.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВтОтработанноеВремя.КоличествоОтработанныхМинут) КАК КоличествоОтработанныхМинут
	|ПОМЕСТИТЬ ВтОбщееКоличествоМинут
	|ИЗ
	|	ВтОтработанноеВремя КАК ВтОтработанноеВремя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОбороты.ДокументРеализации.Сотрудник КАК Сотрудник,
	|	СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход) КАК Сумма
	|ПОМЕСТИТЬ ВТВыручкаПоСотрудникам
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И ДокументРеализации В
	|					(ВЫБРАТЬ
	|						ВТПредварительныеДанные.Прием КАК Прием
	|					ИЗ
	|						ВТПредварительныеДанные КАК ВТПредварительныеДанные)) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОбороты.ДокументРеализации.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОтработанноеВремя.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВтОтработанноеВремя.КоличествоОтработанныхМинут = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТВыручкаПоСотрудникам.Сумма, 0) / (ВтОтработанноеВремя.КоличествоОтработанныхМинут / 60) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ВтДанныеСтоимостиЧасаПоВрачам
	|ИЗ
	|	ВтОтработанноеВремя КАК ВтОтработанноеВремя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыручкаПоСотрудникам КАК ВТВыручкаПоСотрудникам
	|		ПО ВтОтработанноеВремя.Сотрудник = ВТВыручкаПоСотрудникам.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОтработанноеВремя.Сотрудник,
	|	ВТВыручкаПоСотрудникам.Сумма,
	|	ВтОтработанноеВремя.КоличествоОтработанныхМинут
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВтОбщееКоличествоМинут.КоличествоОтработанныхМинут = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВТВыручкаПоСотрудникам.Сумма) / (ВтОбщееКоличествоМинут.КоличествоОтработанныхМинут / 60) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СредняяСтоимостьЧасаСотрудника
	|ПОМЕСТИТЬ ВтСредняяСтоимостьЧаса
	|ИЗ
	|	ВТВыручкаПоСотрудникам КАК ВТВыручкаПоСотрудникам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОбщееКоличествоМинут КАК ВтОбщееКоличествоМинут
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОбщееКоличествоМинут.КоличествоОтработанныхМинут
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Прием.Ссылка КАК Прием
	|ПОМЕСТИТЬ ВТПриемыПредыдущий
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВЫБОР
	|			КОГДА Прием.ВремяНачалаПриема = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Прием.Дата
	|			ИНАЧЕ Прием.ВремяНачалаПриема
	|		КОНЕЦ МЕЖДУ &ДатаНачалаПредыдущий И &ДатаОкончанияПредыдущий
	|	И Прием.ПометкаУдаления = ЛОЖЬ
	|	И Прием.Проведен = ИСТИНА
	|	И Прием.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|	И &ВыводитьПредыдущиеПериоды = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПриемыПредыдущий.Прием КАК Прием,
	|	СУММА(РАЗНОСТЬДАТ(СобытиеУслуги.ДатаНачала, СобытиеУслуги.ДатаОкончания, МИНУТА)) КАК КоличествоМинут
	|ПОМЕСТИТЬ ВТПредварительныеДанныеПредыдущий
	|ИЗ
	|	ВТПриемыПредыдущий КАК ВТПриемыПредыдущий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Событие.Услуги КАК СобытиеУслуги
	|		ПО ВТПриемыПредыдущий.Прием = СобытиеУслуги.Ссылка.СсылкаНаПрием
	|ГДЕ
	|	НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемНеСостоялся)
	|	И СобытиеУслуги.Ссылка.Резерв = ЛОЖЬ
	|	И &ВыводитьПредыдущиеПериоды = ИСТИНА
	|	И СобытиеУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПриемыПредыдущий.Прием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПредварительныеДанныеПредыдущий.Прием.Сотрудник КАК Сотрудник,
	|	СУММА(ВТПредварительныеДанныеПредыдущий.КоличествоМинут) КАК КоличествоОтработанныхМинут
	|ПОМЕСТИТЬ ВтОтработанноеВремяПредыдущий
	|ИЗ
	|	ВТПредварительныеДанныеПредыдущий КАК ВТПредварительныеДанныеПредыдущий
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПредварительныеДанныеПредыдущий.Прием.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВтОтработанноеВремяПредыдущий.КоличествоОтработанныхМинут) КАК КоличествоОтработанныхМинут
	|ПОМЕСТИТЬ ВтОбщееКоличествоМинутПредыдущий
	|ИЗ
	|	ВтОтработанноеВремяПредыдущий КАК ВтОтработанноеВремяПредыдущий
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ПродажиОбороты.СтоимостьОборот * (ЕСТЬNULL(ВзаиморасчетыСКонтрагентами.СуммаПриход, 0) / ВЫБОР
	|					КОГДА ЕСТЬNULL(ПродажиОбороты.ДокументПродажи.СуммаДокумента, 0) = 0
	|						ТОГДА 1
	|					ИНАЧЕ ПродажиОбороты.ДокументПродажи.СуммаДокумента
	|				КОНЕЦ) КАК ЧИСЛО(15, 2))), 0) КАК Сумма
	|ПОМЕСТИТЬ ВТВыручкаПоСотрудникамПредыдущий
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			,
	|			,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И ДокументПродажи В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТПредварительныеДанныеПредыдущий.Прием КАК Прием
	|					ИЗ
	|						ВТПредварительныеДанныеПредыдущий КАК ВТПредварительныеДанныеПредыдущий)) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК ДокументПродажи,
	|			ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход КАК СуммаПриход
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|					&ДатаНачалаПредыдущий,
	|					&ДатаОкончанияПредыдущий,
	|					Авто,
	|					,
	|					СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						И ДокументРеализации В
	|							(ВЫБРАТЬ
	|								ВТПредварительныеДанныеПредыдущий.Прием КАК Прием
	|							ИЗ
	|								ВТПредварительныеДанныеПредыдущий КАК ВТПредварительныеДанныеПредыдущий)) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты) КАК ВзаиморасчетыСКонтрагентами
	|		ПО ПродажиОбороты.ДокументПродажи = ВзаиморасчетыСКонтрагентами.ДокументПродажи
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Сотрудник
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВтОбщееКоличествоМинутПредыдущий.КоличествоОтработанныхМинут = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВТВыручкаПоСотрудникамПредыдущий.Сумма) / (ВтОбщееКоличествоМинутПредыдущий.КоличествоОтработанныхМинут / 60) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СредняяСтоимостьЧасаСотрудника
	|ПОМЕСТИТЬ ВтСредняяСтоимостьЧасаПредыдущий
	|ИЗ
	|	ВТВыручкаПоСотрудникамПредыдущий КАК ВТВыручкаПоСотрудникамПредыдущий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОбщееКоличествоМинутПредыдущий КАК ВтОбщееКоличествоМинутПредыдущий
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&ВыводитьПредыдущиеПериоды = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОбщееКоличествоМинутПредыдущий.КоличествоОтработанныхМинут";
			
	Запрос.УстановитьПараметр("ДатаНачала"					, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"				, ДатаОкончания);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"			, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачалаПредыдущий"		, ДатаНачалаПредыдущий);
	Запрос.УстановитьПараметр("ДатаОкончанияПредыдущий"		, ДатаОкончанияПредыдущий);
	Запрос.УстановитьПараметр("ВыводитьПредыдущиеПериоды"	, ВыводитьПредыдущиеПериоды);
	
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Результат.Вставить("ДанныеСтоимостьОдногоЧасаПоВрачам"			, МассивРезультатов[5]);
	Результат.Вставить("ДанныеСредняяСтоимостьОдногоЧаса"			, МассивРезультатов[6]);	
	Результат.Вставить("ДанныеСредняяСтоимостьОдногоЧасаПредыдущий"	, МассивРезультатов[12]);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область НастройкиВиджетов

// Функция определяет порядок и использование виджетов по умолчанию.
// 
// Возвращаемое значение:
//  СписокЗначений - список виджетов.
//
Функция СоставВиджетовПоУмолчанию() Экспорт
	
	СоставВиджетов = Новый СписокЗначений;
	
	СоставВиджетов.Добавить(Перечисления.ВиджетыМонитораРуководителя.Выручка, ,Истина);
	СоставВиджетов.Добавить(Перечисления.ВиджетыМонитораРуководителя.Приемы, ,Истина);
	СоставВиджетов.Добавить(Перечисления.ВиджетыМонитораРуководителя.ЗагрузкаВрачей, ,Истина);
	СоставВиджетов.Добавить(Перечисления.ВиджетыМонитораРуководителя.Регистратура, ,Истина);
	СоставВиджетов.Добавить(Перечисления.ВиджетыМонитораРуководителя.Коммуникации, , IPТелефонияПодключена());
	СоставВиджетов.Добавить(Перечисления.ВиджетыМонитораРуководителя.СтоимостьЧасаВрача, , Истина);
	
	Возврат СоставВиджетов;
	
КонецФункции

// Функция возвращает набор пастельных цветов в порядке их взаимной контрастности.
// Возвращаемое значение:
//  Массив - массив цветов для использования в сериях на диаграммах
Функция ЦветаСерийДиаграмм() Экспорт
	
	МассивЦветов = Новый Массив;
	
	МассивЦветов.Добавить(Новый Цвет(128, 129, 184));
	МассивЦветов.Добавить(Новый Цвет(74, 181, 147));
	МассивЦветов.Добавить(Новый Цвет(88, 139, 164));
	МассивЦветов.Добавить(Новый Цвет(255, 202, 125));
	МассивЦветов.Добавить(Новый Цвет(178, 154, 218));
	МассивЦветов.Добавить(Новый Цвет(163, 214, 166));
	МассивЦветов.Добавить(Новый Цвет(244, 140, 175));
	МассивЦветов.Добавить(Новый Цвет(125, 221, 233));
	МассивЦветов.Добавить(Новый Цвет(255, 242, 128));
	МассивЦветов.Добавить(Новый Цвет(205, 145, 215));
	МассивЦветов.Добавить(Новый Цвет(125, 202, 194));
	
	Возврат МассивЦветов;
	
КонецФункции

// Функция - Получить таблицу париодов.
//
// Параметры:
//  Начало	 - 	 - 
//  Конец	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуПериодов(ДатаНачало, ДатаКонец, ПериодичностьПроверяемая)
	
	КоличествоДнейОтображаемых = (ДатаКонец + 1 - ДатаНачало)/(24*60*60);
	
	Если КоличествоДнейОтображаемых > 0 И КоличествоДнейОтображаемых <= 1 Тогда     // Отображение по часам.
		ПериодичностьПроверяемая = Перечисления.Периодичность.Час;
	ИначеЕсли  КоличествоДнейОтображаемых > 1 И КоличествоДнейОтображаемых <= 61 Тогда  // Отображение по дням. 
		ПериодичностьПроверяемая = Перечисления.Периодичность.День;
	// ИначеЕсли  КоличествоДнейОтображаемых > 31 И КоличествоДнейОтображаемых <= 61 Тогда
	//	ПериодичностьПроверяемая = Перечисления.Периодичность.Неделя;
	ИначеЕсли КоличествоДнейОтображаемых > 61 И КоличествоДнейОтображаемых <= 730 Тогда
		ПериодичностьПроверяемая = Перечисления.Периодичность.Месяц;     
	ИначеЕсли КоличествоДнейОтображаемых > 730 Тогда
		ПериодичностьПроверяемая = Перечисления.Периодичность.Год; 
	Иначе
		ПериодичностьПроверяемая = Неопределено;
	КонецЕсли;                                    
	
	ТаблицаВозврат = Новый ТаблицаЗначений;
	ТаблицаВозврат.Колонки.Добавить("ПериодНачало"		, Новый ОписаниеТипов("Дата"));
	ТаблицаВозврат.Колонки.Добавить("ПериодОкончание"	, Новый ОписаниеТипов("Дата"));
	
	ДобавляемаяДата = ДатаНачало;
	
	Пока ДобавляемаяДата < КонецДня(ДатаКонец) + 1 И ЗначениеЗаполнено(ПериодичностьПроверяемая) Цикл	
		
		СтрокаТ 				= ТаблицаВозврат.Добавить(); 
		СтрокаТ.ПериодНачало 	= ДобавляемаяДата;
	
		Если ПериодичностьПроверяемая = Перечисления.Периодичность.Час Тогда
			ДобавляемаяДата = ДобавляемаяДата + 60*60;
		ИначеЕсли ПериодичностьПроверяемая = Перечисления.Периодичность.День Тогда 	
			ДобавляемаяДата = КонецДня(ДобавляемаяДата);
		ИначеЕсли ПериодичностьПроверяемая = Перечисления.Периодичность.Неделя Тогда 	
			ДобавляемаяДата = КонецНедели(ДобавляемаяДата);
		ИначеЕсли ПериодичностьПроверяемая = Перечисления.Периодичность.Месяц Тогда 	
			ДобавляемаяДата = КонецМесяца(ДобавляемаяДата);	
		ИначеЕсли ПериодичностьПроверяемая = Перечисления.Периодичность.Год Тогда 	
			ДобавляемаяДата = КонецГода(ДобавляемаяДата);
		КонецЕсли;
		
		ДобавляемаяДата = ?(ДобавляемаяДата > ДатаКонец, ДатаКонец, ДобавляемаяДата); 
		
		СтрокаТ.ПериодОкончание = ДобавляемаяДата;
		
		ДобавляемаяДата = ДобавляемаяДата + 1;
		
	КонецЦикла;
	
	Возврат ТаблицаВозврат;
	
КонецФункции

// Функция - Получить таблицу периодов для активности.
//
// Параметры:
//  ПериодНачало	 - 	 - 
//  ПериодоКончания	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуПериодовДляАктивности(Знач ПериодНачало, Знач ПериодоКончания)
	
    ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ПериодЧас", Новый ОписаниеТипов("Дата"));	
	
	ДобавляемаяДата = ПериодНачало;
	
	Пока ДобавляемаяДата < ПериодоКончания Цикл
		
		СтрокаТ = ТаблицаРезультат.Добавить();
		СтрокаТ.ПериодЧас = НачалоЧаса(ДобавляемаяДата);
		
		ДобавляемаяДата = ДобавляемаяДата + 60*60;
		
		ДобавляемаяДата = ?(ДобавляемаяДата > ПериодоКончания, ПериодоКончания, ДобавляемаяДата); 
	
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции 

#КонецОбласти          

#Область СлужебныеПроцедурыИфункции

// Функция - Получить список оборудования IPТелефонии
// 
// Возвращаемое значение:
//   - 
//
Функция IPТелефонияПодключена()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоИспользуется
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.IPТелефония)
	|	И НЕ ПодключаемоеОборудование.ПометкаУдаления");
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция - получает предыдущий период для расчета показателей предыдущего периода. 
//
// Параметры:
//  ПериодРасчета	 - 	 - 
//  ОтборПериодТип	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредыдущийПериод(ПериодРасчета, ОтборПериодТип)
	
	ПериодПредыдущий = Новый Структура("ДатаНачала, ДатаОкончания", Дата(1,1,1), Дата(1,1,1));
	
	Если ОтборПериодТип = Перечисления.Периодичность.День Тогда
		ПериодПредыдущий.ДатаНачала 	= НачалоДня(НачалоДня(ПериодРасчета.ДатаНачала - 1));
		ПериодПредыдущий.ДатаОкончания 	= КонецДня(НачалоДня(ПериодРасчета.ДатаНачала - 1));
	ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
		ДеньНедели = ?(ПериодРасчета.ДатаОкончания > КонецДня(ТекущаяДатаСеанса()), ДеньНедели(ТекущаяДатаСеанса()), ДеньНедели(ПериодРасчета.ДатаОкончания));  
		
		ПериодПредыдущий.ДатаНачала 	= НачалоНедели(НачалоНедели(ПериодРасчета.ДатаНачала - 1)); 
		ПериодПредыдущий.ДатаОкончания 	= КонецДня(ПериодПредыдущий.ДатаНачала + (ДеньНедели*24*60*60 - 1));
	ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда
		
		ДеньМеяца 						= ?(ПериодРасчета.ДатаОкончания > КонецДня(ТекущаяДатаСеанса()), День(ТекущаяДатаСеанса()), День(ПериодРасчета.ДатаОкончания));
		
		ПериодПредыдущий.ДатаНачала 	= НачалоМесяца(НачалоМесяца(ПериодРасчета.ДатаНачала - 1)); 
		ДеньМесяцаДляПредыдущегоПериода = Мин(ДеньМеяца, День(КонецМесяца(ПериодПредыдущий.ДатаНачала)));	
		ПериодПредыдущий.ДатаОкончания 	= КонецДня(ПериодПредыдущий.ДатаНачала + (ДеньМесяцаДляПредыдущегоПериода*24*60*60 - 1));
	Иначе
		ПериодПредыдущий = Неопределено;
	КонецЕсли;
	
	Возврат ПериодПредыдущий;
	
КонецФункции

// Функция создает компоновщик настроек отчета и переопределяет заданные параметры и отборы.
//
// Параметры:
//  СвойстваОтчета			 - Структура	 - ключи: "ИмяОтчета" - имя отчета как задано в конфигураторе, "КлючВарианта" (необязательный) - имя варианта отчета
//  ПараметрыИОтборы	 - Массив - массив структур для задания изменяемых параметров и отборов. Ключи структуры:
//									"ИмяПоля" (обязательный) - имя параметра или поле компоновки данных по которому задается отбор,
//									"ПравоеЗначение" (обязательный) - устанавливаемое значение параметра или отбора,
//									"ВидНастройки" (необязательный) - определяет контейнер для помещения параметра или отбора, варианты: "Настройки", "ФиксированныеНастройки",
//									прочие ключи структуры являются необязательными и задают свойства элемента отбора.
// Возвращаемое значение:
//  КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек с измененными параметрами и отборами.
Функция ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы, ИмяМакетаОтчета) Экспорт
	Перем ИмяОтчета, КлючВарианта;
	
	СвойстваОтчета.Свойство("ИмяОтчета", ИмяОтчета);
	СвойстваОтчета.Свойство("КлючВарианта", КлючВарианта);
	
	Если Метаданные.Отчеты[ИмяОтчета].Макеты.Найти("Макет") <> Неопределено Тогда
		СхемаКомпоновкиДанных = Отчеты[ИмяОтчета].ПолучитьМакет("Макет");
    КонецЕсли;
	
	Если КлючВарианта <> Неопределено И НЕ ПустаяСтрока(КлючВарианта) Тогда
		ИскомыйВариантОтчета = СхемаКомпоновкиДанных.ВариантыНастроек.Найти(КлючВарианта);
		Если ИскомыйВариантОтчета <> Неопределено Тогда
			Настройки = ИскомыйВариантОтчета.Настройки;
		КонецЕсли;
	КонецЕсли;
	
	Если Настройки = Неопределено Тогда
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;
	
	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
	
	Для Каждого ПараметрОтбор Из ПараметрыИОтборы Цикл
		
		Если ПараметрОтбор.Свойство("ВидНастройки") Тогда
			Если ПараметрОтбор.ВидНастройки = "Настройки" Тогда
				Контейнер = КомпоновщикНастроекКомпоновкиДанных.Настройки;
			ИначеЕсли ПараметрОтбор.ВидНастройки = "ФиксированныеНастройки" Тогда
				Контейнер = КомпоновщикНастроекКомпоновкиДанных.ФиксированныеНастройки;
			КонецЕсли;
		Иначе
			Контейнер = КомпоновщикНастроекКомпоновкиДанных.Настройки;
		КонецЕсли;
		
		НайденныйПараметр = Контейнер.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ПараметрОтбор.ИмяПоля));
		Если НайденныйПараметр <> Неопределено Тогда
			Контейнер.ПараметрыДанных.УстановитьЗначениеПараметра(НайденныйПараметр.Параметр, ПараметрОтбор.ПравоеЗначение);
		КонецЕсли;
		
		НайденныеОтборы = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Контейнер.Отбор, ПараметрОтбор.ИмяПоля);
		Для Каждого НайденныйОтбор Из НайденныеОтборы Цикл
			
			Если ТипЗнч(НайденныйОтбор) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НайденныйОтбор, ПараметрОтбор);
			
			Если НЕ ПараметрОтбор.Свойство("ВидСравнения") Тогда
				НайденныйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
			Если НЕ ПараметрОтбор.Свойство("Использование") Тогда
				НайденныйОтбор.Использование = Истина;
			КонецЕсли;
			Если НЕ ПараметрОтбор.Свойство("РежимОтображения") Тогда
				НайденныйОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НайденныеОтборы.Количество() = 0 И НайденныйПараметр = Неопределено Тогда
			ДобавленныйЭлемент = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Контейнер.Отбор, ПараметрОтбор.ИмяПоля, ВидСравненияКомпоновкиДанных.Равно);
			ЗаполнитьЗначенияСвойств(ДобавленныйЭлемент, ПараметрОтбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КомпоновщикНастроекКомпоновкиДанных;
	
КонецФункции 

#КонецОбласти

#КонецОбласти
