

#Область ОбработчикСобытийЭлементовФормы

&НаСервере
// Обработчик создания формы на сервер 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если это динамический параметр
	Если Объект.ТипПараметра = Перечисления.ТипыПараметровШаблоновОбследований.Динамический Тогда
		Элементы.Специализация.Видимость = Ложь;
		ЭтаФорма.ТолькоПросмотр          = Истина;
	КонецЕсли;	
	
	// Загрузить таблицу значений парамтера
	Если НЕ Объект.Ссылка.Пустая() Тогда
		МассивСтруктур = ПолучитьТаблицуЗначенийПарамтера(Объект.Ссылка);
		ТаблицаПредопределенныеЗначения.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(МассивСтруктур,ТаблицаПредопределенныеЗначения);
	КонецЕсли;	
	
	Элементы.ГруппаЗначений.Видимость    = Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияПараметровОбследований"));	
    Элементы.ПривязкаКЗубам.Видимость    = Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Диагнозы")) ИЛИ Объект.ТипЗначения.СодержитТип(Тип("Строка"));	
	Элементы.ПодчиненРеквизиту.Видимость = Объект.ТипЗначения.СодержитТип(Тип("Строка"));
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Обработчик при открытии формы на клиенте
//
Процедура ПриОткрытии(Отказ)
	
	// Обработать проверку на создание элемента в папке предопределенных
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Родитель)
		И Объект.Родитель = ПредопределенноеЗначение("ПланВидовХарактеристик.ПараметрыОбследований.Предопределенные") Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создание новых элементов в группе предопределенных параметров запрещено!";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик перед записью формы 
// 
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
    // Проверка на составной тип
	Если Объект.ТипЗначения.Типы().Количество() > 1 Тогда
		ПоказатьПредупреждение(,"Параметр должен быть строго одного типа и не может быть составным!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Обработчик после записи на сервере
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	ЗаписатьТаблицуЗначенийПараметра(ТаблицаПредопределенныеЗначения.Выгрузить(),Объект.Ссылка); 
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// При изменении типа значения
//
Процедура ТипЗначенияПриИзменении(Элемент)	
	
	ПривязкаКзубамДоступна               = Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Диагнозы")) ИЛИ Объект.ТипЗначения.СодержитТип(Тип("Строка"));
	ПодчинениеДоступно                   = Объект.ТипЗначения.СодержитТип(Тип("Строка"));
	Элементы.ПривязкаКЗубам.Видимость    = ПривязкаКзубамДоступна;	
	Элементы.ПодчиненРеквизиту.Видимость = ПодчинениеДоступно;
	Элементы.ГруппаЗначений.Видимость    = Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияПараметровОбследований"));	
	Если Объект.ПривязкаКЗубам И НЕ ПривязкаКзубамДоступна Тогда
		ПоказатьПредупреждение(,"Для типа данных привязка к зубам не используется");
		Объект.ПривязкаКЗубам = Ложь;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ПодчиненРеквизиту) И НЕ ПодчинениеДоступно Тогда
		ПоказатьПредупреждение(,"Для типа данных подчинение диагнозу не испольуется");
		Объект.ПодчиненРеквизиту = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, Подчинен реквизиту начало выбора.
//
Процедура ПодчиненРеквизитуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ПланВидовХарактеристик.ПараметрыОбследований.ФормаВыбора",Новый Структура("Отбор",Новый Структура("ТипЗначения",Новый ОписаниеТипов("СправочникСсылка.Диагнозы"))),Элемент);
	
КонецПроцедуры

&НаКлиенте 
// Процедура, Таблица предопределенные значения при окончании редактирования.
//
Процедура ТаблицаПредопределенныеЗначенияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)  
	
	Модифицированность = Истина; 
	
КонецПроцедуры

&НаКлиенте 
// Процедура, Таблица предопределенные значения перед удалением.
//
Процедура ТаблицаПредопределенныеЗначенияПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ТаблицаПредопределенныеЗначения.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		УдалитьЭлементСправочника(ТекущиеДанные.Ссылка);
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик нажатия кнопки "Дополнительно".
//
Процедура ПоказатьСкрытьДополнительно(Команда)

	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Получить таблицу значений параметра
//
Функция ПолучитьТаблицуЗначенийПарамтера(Владелец) 
	
	Выборка       = Новый Запрос;
	Выборка.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ЗначенияПараметровОбследований.Ссылка,
	|	ЗначенияПараметровОбследований.Наименование КАК Значение
	|ИЗ
	|	Справочник.ЗначенияПараметровОбследований КАК ЗначенияПараметровОбследований
	|ГДЕ
	|	ЗначенияПараметровОбследований.Владелец = &Владелец
	|	И ЗначенияПараметровОбследований.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение";
	Выборка.УстановитьПараметр("Владелец",Владелец);
	РезВыборки = Выборка.Выполнить().Выгрузить();	
	Возврат РезВыборки;	
	
КонецФункции

&НаСервереБезКонтекста 
// Процедура, Записать таблицу значений параметра.
//
Процедура ЗаписатьТаблицуЗначенийПараметра(ТаблицаДанных,СсыкаВладельца)
	
	Для Каждого СтрокаТ ИЗ ТаблицаДанных Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТ.Ссылка) И ЗначениеЗаполнено(СтрокаТ.Значение) Тогда
			ЭлНовый              = Справочники.ЗначенияПараметровОбследований.СоздатьЭлемент();
			ЭлНовый.Владелец     = СсыкаВладельца;
			ЭлНовый.Наименование = СтрокаТ.Значение;
			ЭлНовый.Записать();
		ИначеЕсли ЗначениеЗаполнено(СтрокаТ.Ссылка) И ЗначениеЗаполнено(СтрокаТ.Значение) И НЕ СтрокаТ.Ссылка.Наименование = СтрокаТ.Значение Тогда
			ЭлОбъект              = СтрокаТ.Ссылка.ПолучитьОбъект();
			ЭлОбъект.Наименование = СтрокаТ.Значение;
			ЭлОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста 
// Процедура, Удалить элемент справочника.
//
Процедура УдалитьЭлементСправочника(ЭлСсылка)
	
	ЭлОбъект = ЭлСсылка.ПолучитьОбъект();
	ЭлОбъект.УстановитьПометкуУдаления(Истина);
	ЭлОбъект.Записать(); 
	
КонецПроцедуры  

#КонецОбласти







