
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

	Если Параметры.Свойство("ТипВнешнейСистемы") Тогда
		Объект.ТипВнешнейСистемы = Параметры.ТипВнешнейСистемы;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.КлючПриложения					 = Строка(Новый УникальныйИдентификатор);
		СформироватьНаименование();
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	КонецЕсли;
	
	ЭтотОбъект.Webhook				 = "https://cloud.stoma1c.ru/api/hs/lead/Tilda/" + Объект.КлючПриложения;
	
	УидСессии = ЛичныйКабинет.УидТекущейСессии();
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЭтоОблако Тогда
		
		РезультатПроверки = ПроверитьПубликациюИнформационнойБазы();
		
		Если Не РезультатПроверки Тогда 
			
			ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаНастройкиВнешнейПубликации",,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);    
			
			ПоказатьОповещениеПользователя(,,"Необходимо настроить внешнюю публикацию", БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УидСессии) Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОРегистрацииВЛК", ЭтотОбъект), Нстр("ru='Необходимо авторизоваться в личном кабинете. Открыть личный кабинет?';en='Is necessary to log in to your account. Open private cabinet?'"), РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.ВнешниеСистемы.ПодключитьВнешнююСистему(РеквизитФормыВЗначение("Объект"), Отказ, УИДСессии);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанаВнешняяСистема", Новый Структура("ВнешняяСистема, ТипВнешнейСистемы", Объект.Ссылка, Объект.ТипВнешнейСистемы));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, копирует URL.
//
Процедура СкопироватьURL(Команда)
	
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ЭтотОбъект.Webhook);	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Скопировано';en='Copied'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПослеВопросаОРегистрацииВЛК(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Обработка.ЛичныйКабинет.Форма");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, проверяет публикацию информационной базы.
//
Функция ПроверитьПубликациюИнформационнойБазы()
	
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(Константы.ВнешняяПубликацияАдрес.Получить());
	
	Если РезультатПроверки.ВыполненоУспешно Тогда
		Возврат РезультатПроверки.ПубликацияВерна;  
	КонецЕсли;  
	
	Если НЕ (РезультатПроверки.ВыполненоУспешно И РезультатПроверки.ПубликацияВерна = Истина) Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При проверке публикации возникла ошибка: ';en='With checking publications originated mistake:'") + РезультатПроверки.ОписаниеОшибки);
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, устанавливает служебного пользователя.
//
Процедура УстановитьСлужебногоПользователя()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();

	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
//
Процедура УдалитьИЗакрыть(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Вы точнохотите пометить на удаление данный элемент справочника?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, 
        КодВозвратаДиалога.Да
    );    
 
	
КонецПроцедуры

 &НаКлиенте
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
	    ПометитьНаУдаление();
		
		ПараметрыОповещения = Новый Структура;
        ПараметрыОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
		ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);

		Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление()
	
		ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
		ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
		ВнешняяСистемаОбъект.Используется = Ложь;
		
		Попытка
			ВнешняяСистемаОбъект.Записать();
		Исключение 
 		КонецПопытки;
		
КонецПроцедуры

#КонецОбласти
