
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем список закешированных интервалов врмени и строим меню выбора
	ЗакешированныеЗначения = ХранилищеСистемныхНастроек.Загрузить("КешированиеВводимыхЗначений", "ИнтервалыВремени");
	Если ЗакешированныеЗначения <> Неопределено Тогда
		Для Каждого ЭлементМ ИЗ ЗакешированныеЗначения Цикл
			СписокШаблонов.Добавить(ЭлементМ,Обработки.ПланированиеИндивидуальногоГрафика.ПредставлениеИнтервалавремени(ЭлементМ));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Перед закрытием формы.    
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	Если СписокШаблоновБылИзменен = Истина Тогда
		СохранитьКешШаблонов();
		Оповестить("ПриИзмененииШаблоновИнтерваловВремени");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Выбрать и закрыть форму.
//
Процедура Выбрать(Команда)
	Если Элементы.СписокШаблонов.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.Закрыть(Элементы.СписокШаблонов.ТекущиеДанные.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Удалить строку данных.
//
Процедура Удалить(Команда)	
	Если Элементы.СписокШаблонов.ТекущаяСтрока <> Неопределено Тогда
		СписокШаблонов.Удалить(СписокШаблонов.НайтиПоИдентификатору(Элементы.СписокШаблонов.ТекущаяСтрока));
		СписокШаблоновБылИзменен = Истина;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Сохранить новые шаблоны.
//
Процедура СохранитьКешШаблонов()
	ХранилищеСистемныхНастроек.Сохранить("КешированиеВводимыхЗначений", "ИнтервалыВремени", СписокШаблонов.ВыгрузитьЗначения());	
КонецПроцедуры

#КонецОбласти
