
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Отбор.Свойство("СтруктурнаяЕдиница") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Параметры.Отбор.СтруктурнаяЕдиница);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Неопределено);
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ТекущаяДата") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", Параметры.Отбор.ТекущаяДата);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", Неопределено);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПравоНазначения", ПараметрыСеанса.ТекущийПользователь.РольПользователя);
	
	Если Параметры.Свойство("Клиент") Тогда
		Клиент = Параметры.Клиент;
	КонецЕсли;	
	
	Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыФункции

&НаКлиенте
// Обработчик перед добавлением строки.
//
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТипПолучателя"						, ПредопределенноеЗначение("Перечисление.ТипыПолучателейСкидкиНаценки.ОграниченоСпискомКлиентов"));
	ПараметрыОткрытия.Вставить("Родитель"							, ПредопределенноеЗначение("Справочник.СкидкиНаценки.Скидки"));
	ПараметрыОткрытия.Вставить("ПризнакИспользованиеНаУсмотрение"	, Истина);
	ПараметрыОткрытия.Вставить("ПризнакИспользованиеВыклПоУмолчанию", Ложь);
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		Получатели = Новый Массив;
		Получатели.Добавить(Клиент);
		
		ПараметрыОткрытия.Вставить("Получатели", Получатели);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СкидкиНаценки.ФормаОбъекта", Новый Структура("Основание", ПараметрыОткрытия));
	
КонецПроцедуры
	
#КонецОбласти

