
#Область СлужебныеПроцедурыИФункции
////////////////////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРА ФОРМИРОВАНИЯ ПАКЕТА ДАННЫХ ДЛЯ ДВИЖЕНИЯ ДОКУМЕНТА

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СписаниеРасшифрокаСписания.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА СписаниеРасшифрокаСписания.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА СписаниеРасшифрокаСписания.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ СписаниеРасшифрокаСписания.Ссылка.Организация
	|	КОНЕЦ КАК Организация,
	|	СписаниеРасшифрокаСписания.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА СписаниеРасшифрокаСписания.ДокументОснования = НЕОПРЕДЕЛЕНО
	|				ИЛИ СписаниеРасшифрокаСписания.ДокументОснования.ПолисМедСтрахования = ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
	|				ИЛИ ТИПЗНАЧЕНИЯ(СписаниеРасшифрокаСписания.ДокументОснования) = ТИП(Документ.Реализация)
	|			ТОГДА СписаниеРасшифрокаСписания.Ссылка.Контрагент
	|		ИНАЧЕ СписаниеРасшифрокаСписания.ДокументОснования.ПолисМедСтрахования.СтраховаяКомпания
	|	КОНЕЦ КАК Контрагент,
	|	СписаниеРасшифрокаСписания.ДокументОснования КАК ДокументОснования,
	|	СписаниеРасшифрокаСписания.ДокументАванса КАК ДокументАванса,
	|	СписаниеРасшифрокаСписания.ЭтоАванс КАК ЭтоАванс,
	|	СписаниеРасшифрокаСписания.СуммаСписания КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	Документ.СписаниеЗадолженности.РасшифрокаСписания КАК СписаниеРасшифрокаСписания
	|ГДЕ
	|	СписаниеРасшифрокаСписания.Ссылка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеРасшифрокаСписания.Ссылка.Дата КАК Период,
	|	СписаниеРасшифрокаСписания.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыСебестоимость) КАК СчетДт,
	|	ВЫБОР
	|		КОГДА СписаниеРасшифрокаСписания.Ссылка.Контрагент.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики)
	|	КОНЕЦ КАК СчетКт,
	|	СотрудникиСпецилазацииСотрудника.Специализация КАК СубконтоДт1,
	|	СписаниеРасшифрокаСписания.ДокументОснования.Контрагент КАК СубконтоДт2,
	|	СписаниеРасшифрокаСписания.ДокументОснования.Сотрудник КАК СубконтоДт3,
	|	ВЫБОР
	|		КОГДА СписаниеРасшифрокаСписания.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА СписаниеРасшифрокаСписания.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.СписаниеЗадолженностиКлиента)
	|	КОНЕЦ КАК СубконтоДт4,
	|	СписаниеРасшифрокаСписания.ДокументОснования.Контрагент КАК СубконтоКт1,
	|	-СписаниеРасшифрокаСписания.СуммаСписания КАК Сумма,
	|	""Списание задолженности"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.СписаниеЗадолженности.РасшифрокаСписания КАК СписаниеРасшифрокаСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|		ПО СписаниеРасшифрокаСписания.ДокументОснования.Сотрудник = СотрудникиСпецилазацииСотрудника.Ссылка
	|			И (СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА)
	|ГДЕ
	|	СписаниеРасшифрокаСписания.Ссылка = &Ссылка
	|	И СписаниеРасшифрокаСписания.ДокументОснования.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И СписаниеРасшифрокаСписания.СуммаСписания < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеРасшифрокаСписания.Ссылка.Дата,
	|	СписаниеРасшифрокаСписания.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыПрочие),
	|	ВЫБОР
	|		КОГДА СписаниеРасшифрокаСписания.Ссылка.Контрагент.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СписаниеРасшифрокаСписания.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА СписаниеРасшифрокаСписания.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.СписаниеЗадолженностиКлиента)
	|	КОНЕЦ,
	|	СотрудникиСпецилазацииСотрудника.Специализация,
	|	NULL,
	|	NULL,
	|	СписаниеРасшифрокаСписания.Ссылка.Контрагент,
	|	-СписаниеРасшифрокаСписания.СуммаСписания,
	|	""Списание задолженности""
	|ИЗ
	|	Документ.СписаниеЗадолженности.РасшифрокаСписания КАК СписаниеРасшифрокаСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|		ПО СписаниеРасшифрокаСписания.ДокументОснования.Сотрудник = СотрудникиСпецилазацииСотрудника.Ссылка
	|			И (СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА)
	|ГДЕ
	|	СписаниеРасшифрокаСписания.Ссылка = &Ссылка
	|	И (СписаниеРасшифрокаСписания.ДокументОснования.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ИЛИ СписаниеРасшифрокаСписания.ДокументОснования.Сотрудник ЕСТЬ NULL)
	|	И СписаниеРасшифрокаСписания.СуммаСписания < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеРасшифрокаСписания.Ссылка.Дата,
	|	СписаниеРасшифрокаСписания.Ссылка.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА СписаниеРасшифрокаСписания.Ссылка.Контрагент.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиенты)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики)
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыПрочие),
	|	СписаниеРасшифрокаСписания.Ссылка.Контрагент,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СписаниеРасшифрокаСписания.СтатьяРасходов,
	|	СписаниеРасшифрокаСписания.СуммаСписания,
	|	""Списание задолженности""
	|ИЗ
	|	Документ.СписаниеЗадолженности.РасшифрокаСписания КАК СписаниеРасшифрокаСписания
	|ГДЕ
	|	СписаниеРасшифрокаСписания.Ссылка = &Ссылка
	|	И СписаниеРасшифрокаСписания.СуммаСписания > 0";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.ВыполнитьПакет();	
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства);		
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);

КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства)
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументОснования КАК ДокументРеализации,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса КАК ДокументАванса,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ЭтоАванс КАК ЭтоАванс,
	|	-СУММА(ТаблицаВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументОснования,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ДокументАванса,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ЭтоАванс";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|	ВременнаяТаблицаУправленческий.СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	СУММА(ВременнаяТаблицаУправленческий.Сумма) КАК Сумма,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|	ВременнаяТаблицаУправленческий.СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.Содержание";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

#КонецОбласти
