

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	АвторДокумента     = ПараметрыСеанса.ТекущийПользователь;	
	// Заполнение на основании структуры
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		 ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	// Заполнение на основании приема
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Прием") Тогда	 
		СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
		Контрагент                    = ДанныеЗаполнения.Контрагент;
		НоваяСтрока                   = РасшифрокаСписания.Добавить();
		НоваяСтрока.ДокументОснования = ДанныеЗаполнения;
		НоваяСтрока.СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;
		НоваяСтрока.СуммаСписания     = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьЗадолженностьПоДокументу(ДанныеЗаполнения);
		СуммаДокумента                = РасшифрокаСписания.Итог("СуммаСписания");
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)	
	
	СуммаДокумента = 0;       
	Комментарий    = Неопределено;
	РасшифрокаСписания.Очистить();	
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик перед записью документа
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = РасшифрокаСписания.Итог("СуммаСписания");
	
КонецПроцедуры

// Обработчик проведения документа
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);		
    // Инициализация данных документа.	
	Документы.СписаниеЗадолженности.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);		
	// Движения по регистрам	
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);	
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);
	
    // Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);	

КонецПроцедуры


#КонецОбласти

