
#область ОбработчикиСобытий

// Процедура - Обработка получения представления
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СформироватьНаименование(Данные.Код, Данные.ВидБонусногоСчета, Данные.ВладелецБонусногоСчета);
	
КонецПроцедуры

// Процедура - Обработка получения полей представления
//
// Параметры:
//  Поля				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("Код");
    Поля.Добавить("Ссылка");	
    Поля.Добавить("ПометкаУдаления");	
	Поля.Добавить("ВидБонусногоСчета");
	Поля.Добавить("ВладелецБонусногоСчета");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, заполняет срок действия БС.
//
Процедура ЗаполнитьСрокДействияБонусногоСчета(Знач ВидБонусногоСчета, Знач ДатаОткрытия, СрокДействияНачало, СрокДействияКонец) Экспорт
	
	Если ЗначениеЗаполнено(ВидБонусногоСчета) Тогда 
		Если ВидБонусногоСчета.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокДействия_С_По Тогда 
			СрокДействияНачало 	= ВидБонусногоСчета.СрокДействияДатойС;
			СрокДействияКонец 	= ВидБонусногоСчета.СрокДействияДатойПо;			
		ИначеЕсли ВидБонусногоСчета.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокОграниченПериодом Тогда 
			СрокДействияНачало 	= НачалоДня(?(ДатаОткрытия = Дата(1,1,1), ТекущаяДата(), ДатаОткрытия));
			Если ЗначениеЗаполнено(ВидБонусногоСчета.СрокДействияТип) Тогда
				Если ВидБонусногоСчета.СрокДействияТип = Перечисления.Периодичность.День Тогда 
					СрокДействияКонец = КонецДня(СрокДействияНачало + ВидБонусногоСчета.СрокДействия * (60*60*24));
				ИначеЕсли ВидБонусногоСчета.СрокДействияТип = Перечисления.Периодичность.Месяц Тогда	
					СрокДействияКонец = КонецДня(ДобавитьМесяц(СрокДействияНачало, ВидБонусногоСчета.СрокДействия));
				ИначеЕсли ВидБонусногоСчета.СрокДействияТип = Перечисления.Периодичность.Год Тогда	
					СрокДействияКонец = КонецДня(ДобавитьМесяц(СрокДействияНачало, ВидБонусногоСчета.СрокДействия * 12));
				КонецЕсли;	
			Иначе 
				СрокДействияКонец 	= Дата(1,1,1);
			КонецЕсли;			
		ИначеЕсли ВидБонусногоСчета.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный Тогда 
			СрокДействияНачало 	= Дата(1,1,1);
			СрокДействияКонец 	= Дата(1,1,1);		
		КонецЕсли;
	Иначе 	
		СрокДействияНачало 	= Дата(1,1,1);
		СрокДействияКонец 	= Дата(1,1,1);				
	КонецЕсли;
	
КонецПроцедуры

// Процедура, заполняет наименование ЛС.
//
Функция СформироватьНаименование(Знач Код, Знач ВидБонусногоСчета, Знач ВладелецБонусногоСчета) Экспорт
	
	Наименование = ?(ЗначениеЗаполнено(Код), ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(СокрЛП(Код), ""), "<Код>") + ", "    // код
				+ ?(ЗначениеЗаполнено(ВидБонусногоСчета), ВидБонусногоСчета, "<Вид счета>") + ", "  //вид счета
				+ ?(ТипЗнч(ВладелецБонусногоСчета) = Тип("СправочникСсылка.Контрагенты"), ?(ЗначениеЗаполнено(ВладелецБонусногоСчета), ВладелецБонусногоСчета, "<Клиент>"), ?(ЗначениеЗаполнено(ВладелецБонусногоСчета), "Карта №" + ВладелецБонусногоСчета.КодКарты, "<Карта>"));	
				
				
	Возврат Наименование;
	
КонецФункции

// Функция возвращает лицевой счет контрагента
//
Функция ВернутьБонусныеСчетаВладельца(ВладелецБонусногоСчета, Дата, ВидБонусногоСчета = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ВладелецБонусногоСчета) Тогда 
		
		Запрос = Новый Запрос;
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	БонусныеСчета.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.БонусныеСчета КАК БонусныеСчета
		               |ГДЕ
		               |	БонусныеСчета.ВладелецБонусногоСчета = &Владелец
		               |	И ВЫБОР
		               |			КОГДА БонусныеСчета.СрокДействияНачало <> ДАТАВРЕМЯ(1, 1, 1)
		               |					И БонусныеСчета.СрокДействияКонец <> ДАТАВРЕМЯ(1, 1, 1)
		               |				ТОГДА БонусныеСчета.СрокДействияНачало <= &ТекущаяДата
		               |						И БонусныеСчета.СрокДействияКонец >= &ТекущаяДата
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И НЕ БонусныеСчета.ПометкаУдаления
					   |    И &УсловиеПоВидуБонусногоСчета";
					   
		Запрос.УстановитьПараметр("Владелец"   , ВладелецБонусногоСчета);
		Запрос.УстановитьПараметр("ТекущаяДата", ?(Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Дата));
		
		Если ВидБонусногоСчета = Неопределено Тогда
			
			Текст = СтрЗаменить(Текст, "И &УсловиеПоВидуБонусногоСчета", "");
			
		Иначе
			
			Текст = СтрЗаменить(Текст, "И &УсловиеПоВидуБонусногоСчета", " И БонусныеСчета.ВидБонусногоСчета = &ВидБонусногоСчета");
            Запрос.УстановитьПараметр("ВидБонусногоСчета", ВидБонусногоСчета);
			
		КонецЕсли;
		
		Запрос.Текст = Текст;

		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе 
		
		Возврат Новый Массив;
		
	КонецЕсли;
	 	
КонецФункции

// Функция - Получить представление лицевого счета
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеБонусногоСчета(БонусныййСчет) Экспорт
	
	ПредставлениеТелефон = БонусныййСчет.ТелефонКлиента; 
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Если ЗначениеЗаполнено(ПредставлениеТелефон) Тогда
			ПредставлениеТелефон = " " + УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(ПредставлениеТелефон, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента).Представление;	
		КонецЕсли;
	#КонецЕсли
	Возврат Строка(БонусныййСчет.ВидБонусногоСчета) + ПредставлениеТелефон + ?(ЗначениеЗаполнено(БонусныййСчет.СрокДействияКонец), " до " + Формат(БонусныййСчет.СрокДействияКонец, "ДЛФ=D"), "");

КонецФункции

// Функция - Получить историю лицевого счета
//
// Параметры:
//  ЛицевойСчет	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИсторияБонусногоСчета(БонусныйСчет, ГруппировкаПоДокументуНачисления = Истина) Экспорт
	
	Если ГруппировкаПоДокументуНачисления Тогда 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеСчетаОбороты.ДокументНачисления КАК ДокументНачисления,
		|	БонусныеСчетаОбороты.Регистратор КАК Регистратор,
		|	БонусныеСчетаОбороты.Период КАК Период,
		|	БонусныеСчетаОбороты.СуммаОборот КАК Сумма,
		|	ВЫБОР
		|		КОГДА БонусныеСчетаОбороты.СуммаОборот > 0
		|			ТОГДА &ПредставлениеНачисление
		|		ИНАЧЕ &ПредставлениеСписание
		|	КОНЕЦ КАК Операция,
		|	БонусныеСчетаОбороты.СуммаПриход КАК СуммаНачисления
		|ИЗ
		|	РегистрНакопления.БонусныеСчета.Обороты(, , Регистратор, БонусныйСчет = &БонусныйСчет) КАК БонусныеСчетаОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(СуммаНачисления)
		|ПО
		|	ДокументНачисления");   
	Иначе 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеСчетаОбороты.Регистратор КАК Регистратор,
		|	БонусныеСчетаОбороты.Период КАК Период,
		|	БонусныеСчетаОбороты.СуммаОборот КАК Сумма,
		|	ВЫБОР
		|		КОГДА БонусныеСчетаОбороты.СуммаОборот > 0
		|			ТОГДА &ПредставлениеНачисление
		|		ИНАЧЕ &ПредставлениеСписание
		|	КОНЕЦ КАК Операция,
		|	БонусныеСчетаОбороты.СуммаПриход КАК СуммаНачисления
		|ИЗ
		|	РегистрНакопления.БонусныеСчета.Обороты(, , Регистратор, БонусныйСчет = &БонусныйСчет) КАК БонусныеСчетаОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период");   
	КонецЕсли;
	
	Запрос.УстановитьПараметр("БонусныйСчет"           ,БонусныйСчет); 
	Запрос.УстановитьПараметр("ПредставлениеНачисление",НСтр("ru= 'Начисление';en= 'Accrual'")); 
	Запрос.УстановитьПараметр("ПредставлениеСписание"  ,НСтр("ru= 'Списание';en= 'Debt'")); 
		
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Создать бонусный счет владельца
//
// Параметры:
//  КонтрагентКарта		 - 	 - 
//  ВидБонусногоСчета	 - 	 - 
//  Дата				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьБонусныйСчетВладельца(Контрагент, Карта, ВидБонусногоСчета, Дата) Экспорт
	
   БонусныйСчетОбъект                        = Справочники.БонусныеСчета.СоздатьЭлемент();
   БонусныйСчетОбъект.Именной                = ЗначениеЗаполнено(Контрагент);
   БонусныйСчетОбъект.ВидБонусногоСчета      = ВидБонусногоСчета;
   БонусныйСчетОбъект.ВладелецБонусногоСчета = ?(ЗначениеЗаполнено(Контрагент), Контрагент, Карта);
   БонусныйСчетОбъект.Наименование           = СформироватьНаименование(БонусныйСчетОбъект.Код, БонусныйСчетОбъект.Именной, БонусныйСчетОбъект.ВладелецБонусногоСчета);
   БонусныйСчетОбъект.ДатаОткрытия           = Дата; 
   БонусныйСчетОбъект.Записать();
   
   Возврат БонусныйСчетОбъект.Ссылка;
   
КонецФункции

#КонецОбласти