
#Область ОбработчикиСобытий

// Процедура, обработчик события "ОбработкаЗаполнения" объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ЭтотОбъект.ДатаОткрытия = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВидыБонусныхСчетов") Тогда 
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Именной, НеОграниченПроцентомСписания, ОграничениеНачисленийПоСрокуДействия, ОграничениеСписанияПроцент, СрокДействияНачислений, СрокДействияНачисленийТип, СуммаНачисленияВДеньРождения, НеНачислятьПриОплатеБонусами");
		
		ЭтотОбъект.Закрыт            = Ложь;
		ЭтотОбъект.ДатаОткрытия      = ТекущаяДата();
		ЭтотОбъект.ВидБонусногоСчета = ДанныеЗаполнения.Ссылка;
		Справочники.БонусныеСчета.ЗаполнитьСрокДействияБонусногоСчета(ДанныеЗаполнения.Ссылка, ДатаОткрытия, СрокДействияНачало, СрокДействияКонец);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		
		//Если ДанныеЗаполнения.Свойство("СтруктураДанныхПриПроведенииДенежныхСредств") Тогда 
		//	ВидБонусногоСчета 	= ДанныеЗаполнения.СтруктураДанныхПриПроведенииДенежныхСредств.ВидБонусногоСчета;
		//	Контрагент 			= ДанныеЗаполнения.СтруктураДанныхПриПроведенииДенежныхСредств.Владелец;
		//	Карта 				= ?(ЗначениеЗаполнено(ДанныеЗаполнения.СтруктураДанныхПриПроведенииДенежныхСредств.Сертификат), ДанныеЗаполнения.СтруктураДанныхПриПроведенииДенежныхСредств.Сертификат, Справочники.Номенклатура.ПустаяСсылка());			
		//	Если ЗначениеЗаполнено(ВидБонусногоСчета) Тогда
		//		// Заполним табличную часть ПакетУслуг
		//		ПакетУслугСоставУслуг.Загрузить(ВидБонусногоСчета.ПакетУслугСоставУслуг.Выгрузить());
		//		// Заполним срок действия лицевого счета
		//		Справочники.БонусныеСчета.ЗаполнитьСрокДействияБонусногоСчета(ВидБонусногоСчета, ДатаОткрытия, СрокДействияНачало, СрокДействияКонец);
		//	КонецЕсли;
		//	// Сформируем наименование лицевого счета
		//	Справочники.БонусныеСчета.СформироватьНаименование(Наименование, ВидБонусногоСчета);
		//КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.Наименование = Справочники.БонусныеСчета.СформироватьНаименование(Код, ВидБонусногоСчета, ВладелецБонусногоСчета);
		
КонецПроцедуры

// Процедура, обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() 
		И НЕ ЗначениеЗаполнено(ЭтотОбъект.Код) Тогда
		
		ЭтотОбъект.УстановитьНовыйКод();
	КонецЕсли;

	Если ЭтоНовый() 
		И НЕ ЭтоГруппа Тогда
		// Необходимо для создания приветственных начислений
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	КонецЕсли;
	
	УстановитьНастройкиОграничений();	
	ЭтотОбъект.Наименование = Справочники.БонусныеСчета.СформироватьНаименование(Код, ВидБонусногоСчета, ВладелецБонусногоСчета);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//
//
Процедура УстановитьНастройкиОграничений()
	
	Если ЭтотОбъект.НеОграниченПроцентомСписания Тогда 
		ЭтотОбъект.ОграничениеСписанияПроцент = 0;
	ИначеЕсли ЭтотОбъект.ОграничениеСписанияПроцент = 0 Тогда 
		ЭтотОбъект.НеОграниченПроцентомСписания = Истина;
	КонецЕсли;		
	
	// Бессрочный
	Если ЭтотОбъект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный Тогда		
		
		ЭтотОбъект.СрокДействияНачислений 		= 0;
		ЭтотОбъект.СрокДействияНачисленийТип 	= Перечисления.Периодичность.ПустаяСсылка();		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
