
#Область ОбработчикиКомандФормы

&НаСервере
// Процедура, обработчки события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокЛабораторий") Тогда
		Для Каждого СтрокаТЧ из Параметры.СписокЛабораторий Цикл
			НоваяСтрока = СписокЛабораторий.Добавить();
			НоваяСтрока.Флаг = Истина;
			НоваяСтрока.Лаборатория = СтрокаТЧ;
		КонецЦикла;
		ДокументОснования = Параметры.Документ;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
// Процедура, обработчик команды
//
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТЧ из СписокЛабораторий Цикл
		СтрокаТЧ.Флаг = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды
//
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТЧ из СписокЛабораторий Цикл
		СтрокаТЧ.Флаг = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды
//
Процедура СоздатьДокументы(Команда)
	
	Для Каждого СтрокаТЧ из СписокЛабораторий Цикл
		Если СтрокаТЧ.Флаг Тогда			
			ОткрытьФорму("Документ.Поступление.Форма.ФормаДокумента", Новый Структура("Основание", Новый Структура("Документ, Лаборатория, Фильтр", ДокументОснования, СтрокаТЧ.Лаборатория, Фильтр)),ЭтаФорма, Новый УникальныйИдентификатор());			
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
