

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаДанныхИзВнешнегоИсточника

//// Процедура - При определении значения по умолчанию.
////
//Процедура ПриОпределенииЗначенияПоУмолчанию(СправочникСсылка, ИмяРеквизита, ВходящиеДанные, СтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию)
//	
//	Если СтрокаСопоставлена 
//		И НЕ ЗначениеЗаполнено(ВходящиеДанные) Тогда
//		
//		ЗначениеПоУмолчанию = СправочникСсылка[ИмяРеквизита];
//		
//	КонецЕсли;
//	
//КонецПроцедуры

// Процедура - При определении образцов загрузки данных.
//
Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

// Процедура - Поля загрузки данных из внешнего источника.
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(11));
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло10_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураКодСинхронизации", "Код синхронизации", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 1,, Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование","Номенклатура (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", "Артикул", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", "Количество", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтруктурнаяЕдиница","Клиника", ОписаниеТиповСтрока100, ОписаниеТиповКолонка,,, Истина);
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.Склады"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
	ОписаниеТиповКолонка = Новый ОписаниеТипов(МассивТипов);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СкладСотрудник","Склад / Сотрудник", ОписаниеТиповСтрока100, ОписаниеТиповКолонка,,, Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Упаковка", "Упаковка", ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Коэффициент", "Коэффициент упаковки", ОписаниеТиповСтрока11, ОписаниеТиповЧисло10_3);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", "Характеристика, серия", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	
КонецПроцедуры

// Процедура - Сопоставить загружаемые данные из внешнего источника.
//
Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	Перем ОбщееЗначение;
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	
	ОбновлятьДанные = НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	
	НастройкиЗагрузкиДанных.Свойство("ОбщееЗначение", ОбщееЗначение);
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, "", 
		СтрокаТаблицыФормы.Артикул, СтрокаТаблицыФормы.НоменклатураНаименование,,,СтрокаТаблицыФормы.НоменклатураКодСинхронизации);	
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные);
		
		// Структурная единица
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтруктурнуюЕдиницу(СтрокаТаблицыФормы.СтруктурнаяЕдиница, СтрокаТаблицыФормы.СтруктурнаяЕдиница_ВходящиеДанные, Неопределено);
		
		// Склад
		СопоставитьСклад(СтрокаТаблицыФормы.СкладСотрудник, СтрокаТаблицыФормы.СкладСотрудник_ВходящиеДанные, СтрокаТаблицыФормы.СтруктурнаяЕдиница);
		
		// Сотрудник
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.СкладСотрудник) Тогда
			СтрокаТаблицыФормы.СкладСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(СтрокаТаблицыФормы.СкладСотрудник_ВходящиеДанные, Истина);
		КонецЕсли;
		
		// Упаковка
		Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
			Выборка = Справочники.УпаковкиНоменклатуры.Выбрать(,СтрокаТаблицыФормы.Номенклатура, Новый Структура("Наименование", СтрокаТаблицыФормы.Упаковка_ВходящиеДанные));
			Пока Выборка.Следующий() Цикл
				СтрокаТаблицыФормы.Упаковка = Выборка.Ссылка;	
			КонецЦикла;
		КонецЕсли;
		
		// Коэффициент
		ЗначениеПоУмолчанию = 1;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Коэффициент, СтрокаТаблицыФормы.Коэффициент_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Характеристика
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура,,СтрокаТаблицыФормы.Партия_ВходящиеДанные); 
		
		Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
			
			ЭлементСправочника = СтрокаТаблицыФормы.Номенклатура.ПолучитьОбъект();
			
			// Характеристика
			Если Не ЗначениеЗаполнено(СтрокаТаблицыФормы.Партия)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.Партия_ВходящиеДанные) Тогда
				
				НоваяХарактеристика = Справочники.ПартииНоменклатуры.Выбрать(, СтрокаТаблицыФормы.Номенклатура, Новый Структура("Наименование", СтрокаТаблицыФормы.Партия_ВходящиеДанные));
				Если Не НоваяХарактеристика.Следующий() Тогда
					НоваяХарактеристика = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
					НоваяХарактеристика.Владелец = СтрокаТаблицыФормы.Номенклатура;
					НоваяХарактеристика.Наименование = СтрокаТаблицыФормы.Партия_ВходящиеДанные;
					НоваяХарактеристика.Записать();
				КонецЕсли;
				
				ЭлементСправочника.ИспользоватьПартии = Истина;
				СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
				
			КонецЕсли;
			
			// Упаковка
			Если Не ЗначениеЗаполнено(СтрокаТаблицыФормы.Упаковка)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.Упаковка_ВходящиеДанные) Тогда
				
				// Создать упаковку
				НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
				НоваяУпаковка.Владелец     = ЭлементСправочника.Ссылка;
				НоваяУпаковка.Наименование = СтрокаТаблицыФормы.Упаковка_ВходящиеДанные;
				НоваяУпаковка.Коэффициент  = СтрокаТаблицыФормы.Коэффициент;
				НоваяУпаковка.Записать();
				
				СтрокаТаблицыФормы.Упаковка = НоваяУпаковка.Ссылка;
				ЭлементСправочника.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
				
			КонецЕсли;

			ЭлементСправочника.Записать();
			
		КонецЕсли;
			
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

// Процедура - Проверить корректность данных в строке таблицы.
//
Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Количество)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.СкладСотрудник);
				
	Если СтрокаТаблицыФормы[ИмяСлужебногоПоля] Тогда
		
		НаборЗаписей = РегистрыСведений.КритическиеОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтрокаТаблицыФормы.СтруктурнаяЕдиница);
		НаборЗаписей.Отбор.Склад.Установить(СтрокаТаблицыФормы.СкладСотрудник);
		НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицыФормы.Номенклатура);
		НаборЗаписей.Отбор.Партия.Установить(СтрокаТаблицыФормы.Партия);
	
		НаборЗаписей.Прочитать();
		
		СтрокаТаблицыФормы._СтрокаСопоставлена = (НаборЗаписей.Количество() > 0) 
													И ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) 
													И ЗначениеЗаполнено(СтрокаТаблицыФормы.СкладСотрудник);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработать подготовленные данные.
//
Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	ОбновлятьСуществующие		= СтруктураДанных.НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьНовые 				= СтруктураДанных.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено;
	ТаблицаСопоставленияДанных	= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	КоличествоЗаписейТранзакции	= 0;
	ТранзакцияОткрыта			= Ложь;
	
	Попытка
		
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			Если НЕ ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции = 0 Тогда
				
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				
			КонецЕсли;
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьНовые);
			
			Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
				
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1;
						
				НаборЗаписей = РегистрыСведений.КритическиеОстатки.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтрокаТаблицы.СтруктурнаяЕдиница);
				НаборЗаписей.Отбор.Склад.Установить(СтрокаТаблицы.СкладСотрудник);
				НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
				НаборЗаписей.Отбор.Партия.Установить(СтрокаТаблицы.Партия);
				
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() <> 0 Тогда				
					НаборЗаписей.Очистить();				
				КонецЕсли;
				
				НоваяСтрока = НаборЗаписей.Добавить();
								
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);	
	            НоваяСтрока.Склад = СтрокаТаблицы.СкладСотрудник; 
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
			ИндексТекущейстроки	= ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы);
			ТекстПрогресса		= СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейстроки, РазмерТаблицыДанных);
			
			ДлительныеОперации.СообщитьПрогресс(ОКР(ИндексТекущейстроки * 100 / РазмерТаблицыДанных, 1), ТекстПрогресса);
			
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();			
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();	
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЦеныНоменклатуры, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Функция, возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	//Результат = Новый Массив;
	//Результат.Добавить("ТипНоменклатуры");
	//
	//Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Процедура - Сопоставить склад.
//
Процедура СопоставитьСклад(СкладЗначение, СкладВходящиеДанные, СтруктурнаяЕдиница)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ПометкаУдаления
	|	И НЕ Склады.ЭтоГруппа
	|	И Склады.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Склады.Наименование = &Наименование";
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Наименование", СкладВходящиеДанные);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СкладЗначение = Выборка.Склад;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли