
#Область СлужебныйПрограммныйИнтерфейс

// Если XMLСтрока еще не задана, то ОжидаемыйВид - обязательный параметр
//
Процедура УстановитьКомментарийКонтактнойИнформации(XMLСтрока, Комментарий, ОжидаемыйВид = Неопределено) Экспорт
	
	Если ПустаяСтрока(XMLСтрока) Тогда
		XMLСтрока = УправлениеКонтактнойИнформациейСтоматология.КонтактнаяИнформацияXMLПоПредставлению("", ОжидаемыйВид);
	КонецЕсли;
	
	УправлениеКонтактнойИнформациейСтоматология.УстановитьКомментарийКонтактнойИнформации(XMLСтрока, Комментарий);
	
КонецПроцедуры

// Функция-обертка для вызова с клиента.
// Описание см. УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению()
Функция КонтактнаяИнформацияXMLПоПредставлению(Представление, ОжидаемыйВид) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСтоматология.КонтактнаяИнформацияXMLПоПредставлению(Представление, ОжидаемыйВид);
	
КонецФункции

// Процедура - Начать преобразование формата телефонных номеров
//
Функция НачатьПреобразованиеФорматаТелефонныхНомеров(УникальныйИдентификатор, ПараметрыПреобразования = Неопределено) Экспорт
	
	Возврат КонтактнаяИнформацияСлужебныйПовтИспСтома.НачатьПреобразованиеФорматаТелефонныхНомеров(УникальныйИдентификатор, ПараметрыПреобразования);
	
КонецФункции

// Функция, возвращает структуру контактной информации.
// 
Функция ПолучитьКонтактнуюИнформацию(Объект, НормализоватьНомерТелефона = Истина) Экспорт
	
	EmailСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
	Email = Неопределено;
	Если EmailСтроки.Количество() > 0 Тогда
		Email = EmailСтроки[0].АдресЭП;
	КонецЕсли;
	
	ТелефонСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
	НомерТелефона = Неопределено;
	Если ТелефонСтроки.Количество() > 0 Тогда
		
		НомерТелефона = ТелефонСтроки[0].НомерТелефона;
		
		Если ЗначениеЗаполнено(ТелефонСтроки[0].Представление) Тогда
			НомерТелефона = ТелефонСтроки[0].Представление;	
		КонецЕсли;
		
	КонецЕсли;
	
	АдресСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	Адрес = Неопределено;
	КороткийАдрес = Неопределено;
	Город = Неопределено;
	Если АдресСтроки.Количество() > 0 Тогда
		Адрес = АдресСтроки[0].Представление;
		
		Если ЗначениеЗаполнено(АдресСтроки[0].Значение) Тогда
			
			МассивАдресовФакт	= ДекодироватьИзJSON(АдресСтроки[0].Значение);
			Если МассивАдресовФакт.Свойство("city") Тогда
				Город = МассивАдресовФакт.city;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Город) И МассивАдресовФакт.Свойство("area") Тогда
				Город = МассивАдресовФакт.area;	
			КонецЕсли;
		КонецЕсли;
		
		Если АдресСтроки.Количество() > 1 Тогда
			КороткийАдрес = АдресСтроки[1].Представление;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Новый Структура("Email, Телефон, Адрес, КороткийАдрес, Город", Email, НомерТелефона, Адрес, КороткийАдрес, Город);
	
КонецФункции

#КонецОбласти