
#Область СлужебныйПрограммныйИнтерфейс   

// Функция ДеревоПодсистем() возвращает дерево значений имен всех подсистем конфигурации.
//
// Возвращаемое значение:
//  ДеревоЗначений
//      ПолноеИмя   - Строка, например, <Имя родительской подсистемы>.<Имя подсистемы>
//      Имя         - Строка.
//      Синоним     - Строка.
// 
Функция ДеревоПодсистем() Экспорт
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Имя",       Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
	Дерево.Колонки.Добавить("Синоним",   Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
	
	ЗаполнитьПодсистемы(Дерево.Строки);
	
	Возврат Дерево;
	
КонецФункции

// Функция ВсеРоли() возвращает таблицу значений имен всех ролей конфигурации.
//
// Параметры:
//  ТолькоИменаРолей - Булево. Если ложь возвращается доп. сведения: синонимы ролей, имена и синонимы подсистем.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//      Имя         - Строка.
//                          // Если ТолькоИменаРолей = Ложь, тогда:
//      Синоним           - Строка.
//      ИменаПодсистем    - Строка, например, "СтандартныеПодсистемы, СтандартныеПодсистемы.БазоваяФункциональность".
//      СинонимыПодсистем - Строка, например, "Стандартные подсистемы, Стандартные подсистемы.Базовая функциональность".
//
Функция ВсеРоли(ТолькоИменаРолей = Ложь) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
	
	Если НЕ ТолькоИменаРолей Тогда
		Таблица.Колонки.Добавить("Синоним",           Новый ОписаниеТипов("Строка"));
		Таблица.Колонки.Добавить("ИменаПодсистем",    Новый ОписаниеТипов("Строка"));
		Таблица.Колонки.Добавить("СинонимыПодсистем", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Для каждого Роль Из Метаданные.Роли Цикл
	
		Строка = Таблица.Добавить();
		Строка.Имя = Роль.Имя;
		
		Если НЕ ТолькоИменаРолей Тогда
			Строка.Синоним = Роль.Синоним;
			ЗаполнитьПодсистемыРолей(Роль, Строка.ИменаПодсистем, Строка.СинонимыПодсистем);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

// Функция ДеревоРолей возвращает дерево
// ролей с/без подсистем
//  Если роль не принадлежит ни одной подсистеме
// она добавляется "в корень"
// 
// Параметры:
//  ПоПодсистемам - Булево, если ложь, все роли добавляются в "корень"
// 
// Возвращаемое значение:
//  ДеревоЗначений
//    ЭтоРоль       - Булево
//    Имя           - Строка - имя     роли или подсистемы
//    Синоним       - Строка - синоним роли или подсистемы
//
Функция ДеревоРолей(ПоПодсистемам = Истина) Экспорт
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("ЭтоРоль",       Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("Имя",           Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Синоним",       Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
	
	Если ПоПодсистемам Тогда
		ЗаполнитьПодсистемыИРоли(Дерево.Строки);
	КонецЕсли;
	
	// Добавление ненайденных ролей
	Для каждого Роль Из Метаданные.Роли Цикл
		Если Дерево.Строки.НайтиСтроки(Новый Структура("ЭтоРоль, Имя", Истина, Роль.Имя), Истина).Количество() = 0 Тогда
			СтрокаДерева = Дерево.Строки.Добавить();
			СтрокаДерева.ЭтоРоль       = Истина;
			СтрокаДерева.Имя           = Роль.Имя;
			СтрокаДерева.Синоним       = Роль.Синоним;
		КонецЕсли;
	КонецЦикла;
	
	Дерево.Строки.Сортировать("ЭтоРоль Убыв, Синоним Возр", Истина);
	
	Возврат Дерево;
	
КонецФункции

// Функция проверяет, есть ли у текущего пользователя право на редактирование графика работы
//
Функция ЕстьПравоДоступаКГрафикуРаботы() Экспорт

	Возврат РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеГрафикаРаботыСотрудников");

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры модуля
////////////////////////////////////////////////////////////////////////////////

// Процедура выполняет заполнение подсистемы
//
Процедура ЗаполнитьПодсистемы(КоллекцияСтрокДерева, Подсистемы = Неопределено, ИменаРодительскихПодсистем = "")
	
	Если Подсистемы = Неопределено Тогда
		Подсистемы = Метаданные.Подсистемы;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИменаРодительскихПодсистем) Тогда
		ИменаРодительскихПодсистем = ИменаРодительскихПодсистем + ".";
	КонецЕсли;
	
	Для каждого Подсистема Из Подсистемы Цикл
		
		СтрокаДерева = КоллекцияСтрокДерева.Добавить();
		
		СтрокаДерева.ПолноеИмя = ИменаРодительскихПодсистем + Подсистема.Имя;
		
		СтрокаДерева.Имя       = Подсистема.Имя;
		СтрокаДерева.Синоним   = Подсистема.Синоним;
			
		ЗаполнитьПодсистемы(СтрокаДерева.Строки, Подсистема.Подсистемы, ИменаРодительскихПодсистем + Подсистема.Имя);
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет заполнение подсистемы ролей
//
Процедура ЗаполнитьПодсистемыРолей(ОбъектМетаданных, ИменаПодсистем, СинонимыПодсистем, Подсистемы = Неопределено, ИменаРодительскихПодсистемы = "", СинонимыРодительскихПодсистемы = "")
	
	
	Если Подсистемы = Неопределено Тогда
		Подсистемы = Метаданные.Подсистемы;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИменаРодительскихПодсистемы) Тогда
		ИменаРодительскихПодсистемы    = ИменаРодительскихПодсистемы    + ".";
		СинонимыРодительскихПодсистемы = СинонимыРодительскихПодсистемы + ".";
	КонецЕсли;
	
	Для каждого Подсистема Из Подсистемы Цикл
		Если Подсистема.Состав.Содержит(ОбъектМетаданных) Тогда
			Если ЗначениеЗаполнено(ИменаПодсистем) Тогда
				ИменаПодсистем    = ИменаПодсистем    + ", ";
				СинонимыПодсистем = СинонимыПодсистем + ", ";
			КонецЕсли;
			ИменаПодсистем    = ИменаПодсистем    + ИменаРодительскихПодсистемы    + Подсистема.Имя;
			СинонимыПодсистем = СинонимыПодсистем + СинонимыРодительскихПодсистемы + Подсистема.Синоним;
		КонецЕсли;
		ЗаполнитьПодсистемыРолей(ОбъектМетаданных, ИменаПодсистем, СинонимыПодсистем, Подсистема.Подсистемы, ИменаРодительскихПодсистемы + Подсистема.Имя, СинонимыРодительскихПодсистемы + Подсистема.Синоним);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПодсистемыИРоли(КоллекцияСтрокДерева, Подсистемы = Неопределено)
	
	Если Подсистемы = Неопределено Тогда
		Подсистемы = Метаданные.Подсистемы;
	КонецЕсли;
	
	Для каждого Подсистема Из Подсистемы Цикл
		
		ОписаниеПодсистемы = КоллекцияСтрокДерева.Добавить();
		ОписаниеПодсистемы.Имя           = Подсистема.Имя;
		ОписаниеПодсистемы.Синоним       = Подсистема.Синоним;
		
		ЗаполнитьПодсистемыИРоли(ОписаниеПодсистемы.Строки, Подсистема.Подсистемы);
		
		Для каждого Роль Из Метаданные.Роли Цикл
			Если Подсистема.Состав.Содержит(Роль) Тогда
				ОписаниеРоли = ОписаниеПодсистемы.Строки.Добавить();
				ОписаниеРоли.ЭтоРоль       = Истина;
				ОписаниеРоли.Имя           = Роль.Имя;
				ОписаниеРоли.Синоним       = Роль.Синоним;
			КонецЕсли;
		КонецЦикла;
		
		Если ОписаниеПодсистемы.Строки.НайтиСтроки(Новый Структура("ЭтоРоль", Истина), Истина).Количество() = 0 Тогда
			КоллекцияСтрокДерева.Удалить(ОписаниеПодсистемы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти