
#Область ОписаниеПеременных

&НаКлиенте
Перем ДоступностьКнопкиПечатьРКО; // Флаг для показа/скрытия печати РКО 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборСтрЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтрЕдиница, ЗначениеЗаполнено(ОтборСтрЕдиница));
	Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Элементы.КассаОтбор.ОграничениеТипа      = Новый ОписаниеТипов("СправочникСсылка.Кассы");

КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
//
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыдачаПодотчетнику") Тогда
	     Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		 Элементы.КонтрагентОтбор.Заголовок       = "Сотрудник";
    Иначе
	 	 Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		 Элементы.КонтрагентОтбор.Заголовок       = "Контрагент";
	КонецЕсли;	
	
	Если ОтборТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
	     Элементы.КассаОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		 Элементы.КассаОтбор.Заголовок       = "Банковский счет";
    Иначе
	 	 Элементы.КассаОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
		 Элементы.КассаОтбор.Заголовок       = "Касса";
	КонецЕсли;	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтрЕдиница, ЗначениеЗаполнено(ОтборСтрЕдиница));
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипДенежныхСредств", ОтборТипДенСредств, ЗначениеЗаполнено(ОтборТипДенСредств));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ОтборВидОперации, ЗначениеЗаполнено(ОтборВидОперации));
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагентСотрудник, ЗначениеЗаполнено(ОтборКонтрагентСотрудник));
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", ОтборКассаБанковскийСчет, ЗначениеЗаполнено(ОтборКассаБанковскийСчет));
		 
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" таб. части Список
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда 
		ДоступностьКнопкиПечатьРКО = (Элемент.ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные")); 
		
		// Если Элемент.ТекущиеДанные.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда 	
		//	Элементы.Печать_КО2.Доступность = Истина;
		// Иначе
		//	Элементы.Печать_КО2.Доступность = Ложь;		
		// КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

////////////////////// ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ОТБОРА /////////////////////////

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтрЕдиница, ЗначениеЗаполнено(ОтборСтрЕдиница));
КонецПроцедуры

&НаКлиенте
// При изменениие типа ден. средств
Процедура ОтборТипДенСредствПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипДенежныхСредств", ОтборТипДенСредств, ЗначениеЗаполнено(ОтборТипДенСредств));
	
	Если ОтборТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
	     Элементы.КассаОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		 Элементы.КассаОтбор.Заголовок       = "Банковский счет";
    Иначе
	 	 Элементы.КассаОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
		 Элементы.КассаОтбор.Заголовок       = "Касса";
	КонецЕсли;	
	 
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", ОтборКассаБанковскийСчет, ЗначениеЗаполнено(ОтборКассаБанковскийСчет));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ВидОперацииОтбор
//
Процедура ВидОперацииОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ОтборВидОперации, ЗначениеЗаполнено(ОтборВидОперации));
	
	Если ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетника") Тогда
	    Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		Элементы.КонтрагентОтбор.Заголовок       = "Сотрудник";
    Иначе
		Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Элементы.КонтрагентОтбор.Заголовок       = "Контрагент";
	КонецЕсли;	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагентСотрудник, ЗначениеЗаполнено(ОтборКонтрагентСотрудник));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КонтрагентОтбор
//
Процедура КонтрагентОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагентСотрудник, ЗначениеЗаполнено(ОтборКонтрагентСотрудник));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КассаОтбор
//
Процедура КассаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", ОтборКассаБанковскийСчет, ЗначениеЗаполнено(ОтборКассаБанковскийСчет));
КонецПроцедуры


////////////////////// ОБРАБОТЧИК КНОПОК СОЗДАНИЯ ДОКУМЕНТОВ ///////////////////

 &НаКлиенте
// Процедура вызывается обработчиком любой кнопки создания документа
//
Процедура ОбщийОбработчикСозданияДокументов(Команда)
	
	ПараметрТипДенСредств = Неопределено;
	ПараметрВидОперации   = Неопределено;
	ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"ЛицевойСчет")          >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет"),ПараметрТипДенСредств);
	ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"Наличные")             >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные"),ПараметрТипДенСредств);
	ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"Безналичные")          >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные"),ПараметрТипДенСредств);
    ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"ПлатежнаяКарта")       >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта"),ПараметрТипДенСредств);
	ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"ПодарочныйСертификат") >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПодарочныйСертификат"),ПараметрТипДенСредств);
	
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаОтКлиента")                >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтКлиента"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОплатыКлиенту")           >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыКлиенту"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаПоставщику")               >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаПоставщику"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"СдачаНаличныхВБанк")             >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаНаличныхВБанк"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыплатаЗаработнойПлаты")         >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыплатаЗаработнойПлаты"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратСЛицевогоСчета")          >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыдачаПодотчетнику")             >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыдачаПодотчетнику"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОплатыСтраховойКомпании") >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКомпании"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыдачаЗайма")                    >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыдачаЗайма"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПрочееСписание")                 >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееСписание"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаНалога")                   >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаНалога"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыплатаДивидендовУчредителю")    >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыплатаДивидендовУчредителю"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыбытиеВКассу")                  >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыбытиеВКассу"),ПараметрВидОперации);	
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"СдачаРозничнойВыручкиВКассуПредприятия") >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВыбытиеВОперационнуюКассу")      >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВыбытиеВОперационнуюКассу"),ПараметрВидОперации);
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации, ТипДенежныхСредств, Отбор", ПараметрВидОперации, ПараметрТипДенСредств, Новый Структура("Контрагент, СтруктурнаяЕдиница, Касса", ОтборКонтрагентСотрудник, ОтборСтрЕдиница, ОтборКассаБанковскийСчет)));
	// СтруктураПараметры.Вставить("Отбор", Новый Структура("Контрагент, СтруктурнаяЕдиница, Касса", ОтборКонтрагентСотрудник, ОтборСтрЕдиница, ОтборКассаБанковскийСчет));
	ОткрытьФорму("Документ.СписаниеДенежныхСредств.ФормаОбъекта", СтруктураПараметры);

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора"
//
Процедура КассаОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ОтборСтрЕдиница) Тогда 
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("КассаОтборНачалоВыбораЗавершение", ЭтотОбъект); 
		ОткрытьФорму("Справочник.Кассы.ФормаВыбора", Новый Структура("Отбор", Новый Структура("СтруктурнаяЕдиница", ОтборСтрЕдиница)),,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе                                                                                                                                 
		СтандартнаяОбработка = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Касса отбор начало выбора завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура КассаОтборНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		ОтборКассаБанковскийСчет = Результат;
		КассаОтборПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора"
//
Процедура СтрЕдиницаОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> ОтборСтрЕдиница Тогда
		ОтборКассаБанковскийСчет = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", ОтборКассаБанковскийСчет, ЗначениеЗаполнено(ОтборКассаБанковскийСчет));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Очистка"
//
Процедура СтрЕдиницаОтборОчистка(Элемент, СтандартнаяОбработка)
	
	ОтборКассаБанковскийСчет = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
// Загрузить выписки из банка(механизм клиент банка)
Процедура ЗагрузитьВыписку(Команда)
	ОбщегоНазначенияКлиентСтоматология.ЗагрузитьДанныеИзФайлаВыписки(УникальныйИдентификатор, "kl_to_1c.txt");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////// ОБРАБОТЧИК КНОПКИ ПЕЧАТИ ///////////////////

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "СписаниеДенежныхСредств");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	
	Если ДоступностьКнопкиПечатьРКО = Истина Тогда
		СписокПечатныхФорм.Удалить(0);		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									

	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);

КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.СписаниеДенежныхСредств.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти 
