
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Создать подписку на Webhook.
//
Функция СоздатьПодпискуНаWebhook(ВнешняяСистема, ОписаниеОшибки = Неопределено) Экспорт
	
	ВыполненоУспешно = Ложь;
	
	ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	
	Если ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		
		АдресПодключения = "https://cloud.stoma1c.ru/api/hs/messenger/chatapi/v1/" + ВнешняяСистема.КлючПриложения;
		ВыполненоУспешно = GreenApi_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения, ОписаниеОшибки);
		
	ИначеЕсли ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.VkontakteApi Тогда
		
		АдресПодключения = "https://cloud.stoma1c.ru/api/hs/messenger/vkontakte/v1/" + ВнешняяСистема.КлючПриложения;
		ВыполненоУспешно = VkApi_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения);
		
	ИначеЕсли ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда
		
		АдресПодключения = "https://cloud.stoma1c.ru/api/hs/messenger/telegram/v1/" + ВнешняяСистема.КлючПриложения;
		ВыполненоУспешно = Telegram_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения);
		
	ИначеЕсли ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Viber Тогда
		
		АдресПодключения = "https://cloud.stoma1c.ru/api/hs/messenger/viber/v1/" + ВнешняяСистема.КлючПриложения;
		ВыполненоУспешно = Viber_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения);
		
	// ИначеЕсли ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Instagram Тогда
	//	
	//	ВыполненоУспешно = Истина;
		
	КонецЕсли;
	
	Возврат ВыполненоУспешно;
	
КонецФункции

// Функция - Отправить сообщение клиенту
//
// Параметры:
//  ТекстСообщения	 - 	               - Обязательный
//  Клиент			 -                 - Обязательный
//  ВнешняяСистема	 - Сервис рассылки - Обязательный 
//  НомерТелефона	 - Номер телефона нового контакта WhatsApp (если не заполнен возьмется из КИ) - Необязательный 
//  ИдКанала		 - ID канала (если не заполнен возьмется первый канал из сервиса) - Необязательный 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтправитьСообщениеКлиенту(ТекстСообщения
								, Клиент
								, ВнешняяСистема
								, НомерТелефона = Неопределено
								, ИдКанала = ""
								, ДополнительныеПараметры = Неопределено
								, ПараметрыКлиента = Неопределено) Экспорт

	Если ТипЗнч(ВнешняяСистема) = Тип("СправочникСсылка.ВнешниеСистемы") Тогда 
		ТипВнешнейСистемы = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВнешняяСистема, "ТипВнешнейСистемы");
	Иначе 	
		ТипВнешнейСистемы = ВнешняяСистема.ТипВнешнейСистемы;
	КонецЕсли;	
	
	Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		
		Возврат ОтправитьСообщениеКлиентуGreenApi(ТекстСообщения, Клиент, ВнешняяСистема, НомерТелефона, ДополнительныеПараметры, ПараметрыКлиента);
		
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.VkontakteApi Тогда
		
		Возврат ОтправитьСообщениеКлиентуVkApi(ТекстСообщения, Клиент, ВнешняяСистема, НомерТелефона, ИдКанала);
		
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Viber Тогда
		
		Возврат ОтправитьСообщениеКлиентуViber(ТекстСообщения, Клиент, ВнешняяСистема, НомерТелефона, ИдКанала);
		
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда
		
		Возврат ОтправитьСообщениеКлиентуTelegram(ТекстСообщения, Клиент, ВнешняяСистема, НомерТелефона, ИдКанала, ДополнительныеПараметры);
		
	// ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Instagram Тогда
	//	
	//	Возврат ОтправитьСообщениеКлиентуInstagram(ТекстСообщения, Клиент, ВнешняяСистема, НомерТелефона, ИдКанала);
		
	КонецЕсли;

	РезультатОтправки = Новый Структура;
	РезультатОтправки.Вставить("ВыполненоУспешно", Ложь);
	РезультатОтправки.Вставить("ОписаниеОшибки"  , Нстр("ru = 'Не удалось отправить сообщение. Сервисы рассылки недоступны.'; en = 'There are no message services available.'"));
	
	Возврат РезультатОтправки;
	
КонецФункции

// Функция - Создать клиента мессенджера.
//
Функция СоздатьКлиентаМессенджера(ВнешняяСистема, Контрагент, Знач НомерТелефона) Экспорт
	
	Если ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		
		НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь);
		НомерТелефона = ?(СтрДлина(НомерТелефона) > 10 И Лев(НомерТелефона, 1) = "8", "7" + Сред(НомерТелефона, 2), НомерТелефона);
		
		ИдКлиента = НомерТелефона + "@c.us";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдКлиента) Тогда
		РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(
			ИдКлиента,
			Контрагент,
			НомерТелефона,,
			ВнешняяСистема,
			Контрагент.Наименование
		);
		
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
			ИдКлиента,
			Строка(Новый УникальныйИдентификатор()),,
			"",
			"",
			Истина,
			Перечисления.Мессенджеры.whatsapp,
			Ложь,
			ТекущаяДатаСеанса(),
			ВнешняяСистема,,,,,,,
			Истина
		);
		
	КонецЕсли;
	
	Возврат ИдКлиента;	
	
КонецФункции

#Область Обработчики_GreenApi

Функция ОтправитьСообщениеКлиентуGreenApi(ТекстСообщения
										, Клиент
										, ВнешняяСистема
										, НомерТелефона = Неопределено
										, ДополнительныеПараметры = Неопределено
										, ПараметрыКлиента = Неопределено)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВыполненоУспешно"			, Ложь);
	СтруктураВозврата.Вставить("ОписаниеОшибки"  			, "");
	СтруктураВозврата.Вставить("ИдСообщения"     			, "");
	СтруктураВозврата.Вставить("ОписаниеВторичнойОшибки"  	, "");
	
	ОписаниеОшибки    = "";
	// Если Не ЗначениеЗаполнено(Клиент) Тогда
	//	СтруктураВозврата.ОписаниеОшибки = "Не заполнено поле ""Клиент"".";
	//	Возврат СтруктураВозврата;
	// ИначеЕсли Не ЗначениеЗаполнено(ТекстСообщения) Тогда
	//	СтруктураВозврата.ОписаниеОшибки = "Не заполнено поле ""Текст сообщения"".";
	//	Возврат СтруктураВозврата;
	// ИначеЕсли Не ЗначениеЗаполнено(ВнешняяСистема) Тогда	
	//	СтруктураВозврата.ОписаниеОшибки = "Не заполнена внешняя система Мессенджеров.";
	//	Возврат СтруктураВозврата;
	// КонецЕсли;
	
	ПараметрыВнешнейСистемы = Неопределено;	
	Если НЕ ИнициализированыПараметрыВнешнейСистемы(ВнешняяСистема, ПараметрыВнешнейСистемы) Тогда 
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не заполнены параметры внешней системы."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыКлиента) Тогда		
		ПараметрыКлиента = ?(ЗначениеЗаполнено(Клиент), ПолучитьПараметрыОбъектаИдентификации(Клиент, ВнешняяСистема), Неопределено);
	КонецЕсли;
	
	// Если клиента нет среди контактов мессенджера - попробуем отправить ему сообщение (при наличии аккаунта WhatsApp).
	Если Не ЗначениеЗаполнено(ПараметрыКлиента) Тогда
		
		// Если не передан номер телефона - возьмем первый попавшийся.
		Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
			
			НомерТелефона = Справочники.Контрагенты.ПолучитьНомерТелефонаДляРассылки(Клиент, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
			
			Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
				СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Контакт не найден. Для создания контакта заполните номер телефона клиента."; 	
				Возврат СтруктураВозврата;
			КонецЕсли;
			
		КонецЕсли;
		
		НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь);
		НомерТелефона = ?(СтрДлина(НомерТелефона) > 10 И Лев(НомерТелефона, 1) = "8", "7" + Сред(НомерТелефона, 2), НомерТелефона);
		
		ПараметрыКлиента = Новый Структура;
		ПараметрыКлиента.Вставить("ИдКлиента"	, НомерТелефона + "@c.us");
		ПараметрыКлиента.Вставить("НовыйКонтакт", Истина);
		Если НЕ ПараметрыКлиента.Свойство("НомерТелефона") Тогда 
			ПараметрыКлиента.Вставить("НомерТелефона", НомерТелефона);		
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ПараметрыКлиента.Свойство("ИдКлиента") Или Не ЗначениеЗаполнено(ПараметрыКлиента.ИдКлиента) Тогда
		ПараметрыКлиента.Вставить("ИдКлиента"	, НомерТелефона + "@c.us");
		ПараметрыКлиента.Вставить("НовыйКонтакт", Истина);
		Если НЕ ПараметрыКлиента.Свойство("НомерТелефона") Тогда 
			ПараметрыКлиента.Вставить("НомерТелефона", НомерТелефона);		
		КонецЕсли;			
	КонецЕсли;
	
	РезультатОперации = GreenApi_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы,, ОписаниеОшибки);
	
	// Если сообщение отправлено.
	Если РезультатОперации.ВыполненоУспешно Тогда
		
		СтруктураВозврата.ВыполненоУспешно = Истина;
		СтруктураВозврата.ИдСообщения      = РезультатОперации.ИдСообщения;
		
		// Если новый клиент записываем его в регистр сведений контакты мессенджеров.
		Если ТипЗнч(ПараметрыКлиента) = Тип("Структура") И ПараметрыКлиента.Свойство("НовыйКонтакт") Тогда		
			Попытка
				ДобавитьКонтактМессенджера(ВнешняяСистема, Клиент, ПараметрыКлиента);
			Исключение
				СтруктураВозврата.ОписаниеВторичнойОшибки = "WhatsApp: Ошибка при создании контакта мессенджера. " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());				
			КонецПопытки;
		КонецЕсли;
		
		ОператорСообщения 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОператорСообщения"	, Неопределено);
		Триггер 			= ?(ТипЗнч(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыРегистрацииТриггера", Ложь)) = Тип("Структура"), Истина, Ложь);
		СтартСценария 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "СтартСценария"		, Ложь);
		
		Попытка
			// Добавляем отправленное сообщенте в регистр.
			РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(ПараметрыКлиента.ИдКлиента
																			, РезультатОперации.ИдСообщения
																			,, РезультатОперации.ИдКанала
																			, ТекстСообщения
																			, Истина
																			, Перечисления.Мессенджеры.whatsapp
																			, Ложь
																			, ТекущаяДатаСеанса()
																			, ВнешняяСистема
																			, ОператорСообщения,,,
																			, Триггер,,,,,
																			, ДополнительныеПараметры);		
			
			// Оповещаем сотрудников о новом отправленном сообщении.
			ОповеститьСотрудниковОНовомСообщении(РезультатОперации.ИдСообщения,, ПараметрыКлиента.ИдКлиента,, ВнешняяСистема);				
		Исключение
			СтруктураВозврата.ОписаниеВторичнойОшибки = "WhatsApp: Ошибка при добавлении записи в журнал сообщений." + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());				
		КонецПопытки;
		
	ИначеЕсли ТипЗнч(ПараметрыКлиента) = Тип("Структура") И ПараметрыКлиента.Свойство("НовыйКонтакт") Тогда		
		СтруктураВозврата.ОписаниеОшибки = "WhatsApp: Не удалось отправить сообщение. Ошибка при создании контакта. " + ОписаниеОшибки;
	Иначе
		СтруктураВозврата.ОписаниеОшибки = "WhatsApp: Не удалось отправить сообщение. Ошибка при отправке." + ОписаниеОшибки; 		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Создать контакт мессенджера GreenApi.
//
Функция СоздатьКонтактМессенджераGreenApi(Клиент, ВнешняяСистема, ПараметрыВнешнейСистемы, НомерТелефона = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
	СтруктураВозврата.Вставить("ОписаниеОшибки"  , "");
	СтруктураВозврата.Вставить("ИдКлиента"       , "");
	СтруктураВозврата.Вставить("ИдСообщения"     , "");
	
	// Если не передан номер телефона - возьмем первый попавшийся.
	Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
		
		НомерТелефона = Справочники.Контрагенты.ПолучитьНомерТелефонаДляРассылки(Клиент, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
		
		Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
			СтруктураВозврата.ОписаниеОшибки = "Контакт не найден. Для создания контакта заполните номер телефона клиента."; 	
			Возврат СтруктураВозврата;
		КонецЕсли;
		
	КонецЕсли;
	
	НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь);
	ИдКлиента     = НомерТелефона + "@c.us";
	ИдКанала      = ПараметрыВнешнейСистемы.ChannelId;
	ИдСообщения   = Строка(Новый УникальныйИдентификатор);
	
	СтруктураВозврата.ВыполненоУспешно = Истина;
	СтруктураВозврата.ИдКлиента        = ИдКлиента;
	СтруктураВозврата.ИдСообщения      = ИдСообщения;
	
	// Создаем запись о контакте. 
	РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(
		ИдКлиента,
		Клиент,
		НомерТелефона,
		"",
		ВнешняяСистема,
		Клиент.Наименование
	);
	
	// Добавляем пустое сообщение там будет храниться канал связи.	
	РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
		ИдКлиента,
		ИдСообщения,, 
		ИдКанала,
		"Создан клиент (Служебное сообщение)",
		Истина,
		Перечисления.Мессенджеры.whatsapp,
		Ложь,
		ТекущаяДатаСеанса() - 1,
		ВнешняяСистема,,
		Неопределено,
		Неопределено,
		Неопределено
	);
	
	Возврат СтруктураВозврата;

КонецФункции

// Процедура - Добавить контакт мессенджера
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  Клиент			 - 	 - 
//  ПараметрыКлиента - 	 - 
//
Процедура ДобавитьКонтактМессенджера(ВнешняяСистема, Клиент, ПараметрыКлиента)
	
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда 
		НаименованиеКлиента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Клиент, "Наименование");
	Иначе 
		НаименованиеКлиента = Клиент.Наименование;
	КонецЕсли;
	
	РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(ПараметрыКлиента.ИдКлиента
																		, Клиент
																		, ПараметрыКлиента.НомерТелефона
																		, ""
																		, ВнешняяСистема
																		, ?(ЗначениеЗаполнено(Клиент), НаименованиеКлиента, ПараметрыКлиента.НомерТелефона));
	
	РезультатЗапроса = GreenApi_ПолучитьДанныеДиалога(ПараметрыКлиента.ИдКлиента,, ВнешняяСистема);		
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		РегистрыСведений.КонтактыМессенджеров.ЗаполнитьФотоИНаименованиеКлиента(РезультатЗапроса, ВнешняяСистема);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_VkApi

// Функция, получает данные клиента в VK и возвращает результат запроса.
//
Функция ПолучитьДанныеКлиента_VkApi(Идентификатор, ВнешняяСистема) Экспорт
	
	ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	
	Если Не (ПараметрыВнешнейСистемы.Свойство("UrlApi") И ПараметрыВнешнейСистемы.Свойство("ApiToken")) Тогда
		Возврат Новый Структура("Имя, Фамилия, Фото", "Пользователь VK " + Идентификатор, "", "");
	КонецЕсли;	
	
	Сервер		 = ПараметрыВнешнейСистемы.UrlApi;
	ТокенДоступа = ПараметрыВнешнейСистемы.ApiToken;
	
	HTTPСоединение = Новый HTTPСоединение(Сервер,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	HTTPЗапрос = Новый HTTPЗапрос("/method/users.get?user_ids="+ФорматироватьИдентификатор(Идентификатор)+"&fields=photo_200&access_token="+ТокенДоступа+"&v=5.124");
	
	СтруктураОтвета = ДекодироватьИзJSON((HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку()));
	
	Если СтруктураОтвета.Свойство("error") Тогда
		Возврат Новый Структура("Имя, Фамилия, Фото", "Пользователь VK " + Идентификатор, "", "");
	КонецЕсли;
	
	Если СтруктураОтвета.response.Количество() > 0 Тогда
		
		Возврат Новый Структура("Имя, Фамилия, Фото", СтруктураОтвета.response[0].first_name, СтруктураОтвета.response[0].last_name, СтруктураОтвета.response[0].photo_200);
		
	КонецЕсли;
	
КонецФункции

// Функция, отправляет сообщение через API VK и возвращает структуру с параметрами результата.
//
Функция ОтправитьСообщениеКлиентуVkApi(ТекстСообщения, Клиент, ВнешняяСистема, НомерТелефона = Неопределено, ИдКанала = "")
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
	СтруктураВозврата.Вставить("ОписаниеОшибки"  , "");
	СтруктураВозврата.Вставить("ИдСообщения"     , "");
	
	ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	
	Если Не ЗначениеЗаполнено(ПараметрыВнешнейСистемы)
		ИЛИ ТипЗнч(ПараметрыВнешнейСистемы) <> Тип("Структура")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("ApiToken")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("ИдОператора")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("UrlApi") Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не заполнены параметры внешней системы."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда		
		ПараметрыКлиента = ПолучитьПараметрыОбъектаИдентификации(Клиент, ВнешняяСистема);
	Иначе
		ПараметрыКлиента = Неопределено;
	КонецЕсли;
	
	Если ПараметрыКлиента = Неопределено Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не найден контакт мессенджера."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	РезультатОперации = VkApi_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы);
	
	// Если сообщение отправлено.
	Если РезультатОперации.ВыполненоУспешно Тогда
		
		СтруктураВозврата.ВыполненоУспешно = Истина;
		СтруктураВозврата.ИдСообщения      = РезультатОперации.ИдСообщения;
		
		// Добавляем отправленное сообщенте в регистр.
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
			ПараметрыКлиента.ИдКлиента,
			РезультатОперации.ИдСообщения,,
			РезультатОперации.ИдКанала,
			ТекстСообщения,
			Истина,
			Перечисления.Мессенджеры.vk,
			Ложь,
			ТекущаяДатаСеанса(),
			ВнешняяСистема,
			//// ПараметрыКлиента.ОператорСообщения
		);
		
		// Оповещаем сотрудников о новом отправленном сообщении.
		ОповеститьСотрудниковОНовомСообщении(РезультатОперации.ИдСообщения,, ПараметрыКлиента.ИдКлиента,, ВнешняяСистема);		
	
	ИначеЕсли РезультатОперации.Свойство("ОписаниеОшибки") Тогда // Если есть расшифровка ошибки, то вернем ее
		СтруктураВозврата.ОписаниеОшибки = РезультатОперации.ОписаниеОшибки;
	Иначе
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке.";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область Обработчики_Telegram

// Функция, отправляет сообщение клиенту.
//
Функция ОтправитьСообщениеКлиентуTelegram(ТекстСообщения
										, Клиент
										, ВнешняяСистема
										, НомерТелефона = Неопределено
										, ИдКанала = ""
										, ДополнительныеПараметры = Неопределено)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
	СтруктураВозврата.Вставить("ОписаниеОшибки"  , "");
	СтруктураВозврата.Вставить("ИдСообщения"     , "");
	
	ПараметрыВнешнейСистемы = Неопределено;	
	Если НЕ ИнициализированыПараметрыВнешнейСистемы(ВнешняяСистема, ПараметрыВнешнейСистемы) Тогда 
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не заполнены параметры внешней системы."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда		
		ПараметрыКлиента = ПолучитьПараметрыОбъектаИдентификации(Клиент, ВнешняяСистема);
	Иначе
		ПараметрыКлиента = Неопределено;		
	КонецЕсли;
	
	Если ПараметрыКлиента = Неопределено Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не найден контакт мессенджера."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	РезультатОперации = Telegram_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы, , ДополнительныеПараметры);
	
	// Если сообщение отправлено.
	Если РезультатОперации.ВыполненоУспешно Тогда
		
		СтруктураВозврата.ВыполненоУспешно = Истина;
		СтруктураВозврата.ИдСообщения      = РезультатОперации.ИдСообщения;
		
		ОператорСообщения 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОператорСообщения"	, Неопределено);
		Триггер 			= ?(ТипЗнч(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыРегистрацииТриггера", Ложь)) = Тип("Структура"), Истина, Ложь);
		СтартСценария 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "СтартСценария"		, Ложь);
		
		// Добавляем отправленное сообщенте в регистр.
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(ПараметрыКлиента.ИдКлиента
													, РезультатОперации.ИдСообщения
													,
													, РезультатОперации.ИдКанала
													, ТекстСообщения
													, Истина
													, Перечисления.Мессенджеры.telegram
													, Ложь
													, ТекущаяДатаСеанса()
													, ВнешняяСистема
													, ОператорСообщения
													,
													, 
													, 
													, Триггер
													, 
													, ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "JSONСтруктураКнопок", Неопределено) <> Неопределено
													, 
													, 
													, 
													, ДополнительныеПараметры);		
		
		// Оповещаем сотрудников о новом отправленном сообщении.
		ОповеститьСотрудниковОНовомСообщении(РезультатОперации.ИдСообщения,, ПараметрыКлиента.ИдКлиента,, ВнешняяСистема);		
	
	ИначеЕсли РезультатОперации.Свойство("ОписаниеОшибки") Тогда // Если есть расшифровка ошибки, то вернем ее
		СтруктураВозврата.ОписаниеОшибки = РезультатОперации.ОписаниеОшибки;
	Иначе
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке.";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Инициализированы параметры внешней системы
//
// Параметры:
//  ВнешняяСистема			 - 	 - 
//  ПараметрыВнешнейСистемы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализированыПараметрыВнешнейСистемы(ВнешняяСистема, ПараметрыВнешнейСистемы) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураВнешнейСистемы 	= ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ВнешняяСистема, "Параметры, ТипВнешнейСистемы");
	
	ПараметрыХранилищеЗначений 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураВнешнейСистемы, "Параметры"			, Неопределено);
	ТипВнешнейСистемы 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураВнешнейСистемы, "ТипВнешнейСистемы"	, Перечисления.ТипыВнешнихСистем.ПустаяСсылка());

	Если ПараметрыХранилищеЗначений = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТипВнешнейСистемы) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыВнешнейСистемы = ПараметрыХранилищеЗначений.Получить();
	Если НЕ ЗначениеЗаполнено(ПараметрыВнешнейСистемы) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда 
		Возврат Ложь;
	КонецЕсли;
	ПараметрыВнешнейСистемы.Вставить("ТипВнешнейСистемы", ТипВнешнейСистемы);
		
	Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда 
		ПараметрыВнешнейСистемы.Вставить("Мессенджер", Перечисления.Мессенджеры.whatsapp);
		
		Возврат ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура")
				И ПараметрыВнешнейСистемы.Свойство("ApiToken")
				И ПараметрыВнешнейСистемы.Свойство("ИдОператора")
				И ПараметрыВнешнейСистемы.Свойство("UrlApi")
				И ПараметрыВнешнейСистемы.Свойство("ChannelId");
				
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда	
		ПараметрыВнешнейСистемы.Вставить("Мессенджер", Перечисления.Мессенджеры.telegram);
				
		Возврат ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура")
				И ПараметрыВнешнейСистемы.Свойство("ApiToken")
				И ПараметрыВнешнейСистемы.Свойство("ИдОператора")
				И ПараметрыВнешнейСистемы.Свойство("UrlApi");
				
	Иначе 
		Возврат Ложь;			
	КонецЕсли;	
	
КонецФункции

// Функция, получает данные клиента в Telegram и возвращает результат запроса.
//
Функция ПолучитьДанныеКлиента_Telegram(Идентификатор, ВнешняяСистема) Экспорт
	
	ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	
	Если Не (ПараметрыВнешнейСистемы.Свойство("UrlApi") И ПараметрыВнешнейСистемы.Свойство("ApiToken")) Тогда
		Возврат Новый Структура("Имя, Фамилия, Фото", "Чат Telegram " + Идентификатор, "", "");
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	HTTPЗапрос = Новый HTTPЗапрос("/bot" + ПараметрыВнешнейСистемы.ApiToken + "/getChat?chat_id=" + Идентификатор);
	
	СтруктураОтвета = ДекодироватьИзJSON((HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку()));
	
	Если Не СтруктураОтвета.Свойство("result") Тогда
		Возврат Новый Структура("Имя, Фамилия, Фото", "Чат Telegram " + Идентификатор, "", "");
	КонецЕсли;
	
	Если СтруктураОтвета.ok Тогда
		
		ПредставлениеЧата = ПолучитьПредставлениеЧата_Telegram(СтруктураОтвета.result, Истина);
		
		Если СтруктураОтвета.result.Свойство("photo") Тогда
			СтруктураПараметров = Новый Структура("file_id", СтруктураОтвета.result.photo.big_file_id);
			Фото = ПолучитьСсылкуНаФайл_Telegram(СтруктураПараметров, ПараметрыВнешнейСистемы);
		Иначе
			Фото = "";
		КонецЕсли;
		
		ПредставлениеЧата.Вставить("Фото", Фото);
		
		Возврат ПредставлениеЧата;
		
	Иначе
		Возврат Новый Структура("Имя, Фамилия, Фото", "Чат Telegram " + Идентификатор, "", "");
		
	КонецЕсли;
	
КонецФункции

// Функция, возвращает ссылку на файл по идентификатору файла в Telegram.
//
Функция ПолучитьСсылкуНаФайл_Telegram(Файл, ПараметрыВнешнейСистемы) Экспорт
	
	Если ТипЗнч(Файл) = Тип("Массив") Тогда
		ИдентификаторФайла = Файл[Файл.ВГраница()].file_id;
	Иначе
		ИдентификаторФайла = Файл.file_id;
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	HTTPЗапрос = Новый HTTPЗапрос("/bot" + ПараметрыВнешнейСистемы.ApiToken + "/getFile?file_id=" + ИдентификаторФайла);
	
	СтруктураОтвета = ДекодироватьИзJSON((HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку()));
	
	Возврат ?(СтруктураОтвета.Свойство("result") И СтруктураОтвета.result.Свойство("file_path"), "https://api.telegram.org/file/bot" + ПараметрыВнешнейСистемы.ApiToken + "/" + СтруктураОтвета.result.file_path, "");
	
КонецФункции

// Функция, возвращает имя и фамилию пользователя Telegram.
//
Функция ПолучитьПредставлениеЧата_Telegram(СтруктураЧата, ВозвращатьСтруктуру = Ложь) Экспорт
	
	Если СтруктураЧата.Свойство("first_name") Тогда
		Имя		= СтруктураЧата.first_name;
		Фамилия	= ?(СтруктураЧата.Свойство("last_name"), СтруктураЧата.last_name, "");
	ИначеЕсли СтруктураЧата.Свойство("title") Тогда
		Имя		= СтруктураЧата.title;
		Фамилия	= "";
	ИначеЕсли СтруктураЧата.Свойство("username") Тогда
		Имя		= СтруктураЧата.username;
		Фамилия	= "";
	Иначе
		Имя		= "Чат Telegram " + СтруктураЧата.id;
		Фамилия = "";
	КонецЕсли;
	
	Возврат ?(ВозвращатьСтруктуру = Истина, Новый Структура("Имя, Фамилия", Имя, Фамилия), СокрЛП(Имя + " " + Фамилия));
	
КонецФункции

#КонецОбласти

#Область Обработчики_Instagram

// Функция, отправляет сообщение клиенту.
//
Функция ОтправитьСообщениеКлиентуInstagram(ТекстСообщения, Клиент, ВнешняяСистема, НомерТелефона = Неопределено, ИдКанала = "")
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
	СтруктураВозврата.Вставить("ОписаниеОшибки"  , "");
	СтруктураВозврата.Вставить("ИдСообщения"     , "");
	
	ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	
	Если Не ЗначениеЗаполнено(ПараметрыВнешнейСистемы)
		ИЛИ ТипЗнч(ПараметрыВнешнейСистемы) <> Тип("Структура")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("ApiToken")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("ИдОператора")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("UrlApi") Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не заполнены параметры внешней системы."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда		
		ПараметрыКлиента = ПолучитьПараметрыОбъектаИдентификации(Клиент, ВнешняяСистема);
	Иначе
		ПараметрыКлиента = Неопределено;		
	КонецЕсли;
	
	Если ПараметрыКлиента = Неопределено Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не найден контакт мессенджера."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	РезультатОперации = Instagram_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы);
	
	// Если сообщение отправлено.
	Если РезультатОперации.ВыполненоУспешно Тогда
		
		СтруктураВозврата.ВыполненоУспешно = Истина;
		СтруктураВозврата.ИдСообщения      = РезультатОперации.ИдСообщения;
		
		// Добавляем отправленное сообщенте в регистр.
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
			ПараметрыКлиента.ИдКлиента,
			РезультатОперации.ИдСообщения,,
			РезультатОперации.ИдКанала,
			ТекстСообщения,
			Истина,
			Перечисления.Мессенджеры.instagram,
			Ложь,
			ТекущаяДатаСеанса(),
			ВнешняяСистема,
			//// ПараметрыКлиента.ОператорСообщения
		);
		
		// Оповещаем сотрудников о новом отправленном сообщении.
		ОповеститьСотрудниковОНовомСообщении(РезультатОперации.ИдСообщения,, ПараметрыКлиента.ИдКлиента,, ВнешняяСистема);		
	
	ИначеЕсли РезультатОперации.Свойство("ОписаниеОшибки") Тогда // Если есть расшифровка ошибки, то вернем ее
		СтруктураВозврата.ОписаниеОшибки = РезультатОперации.ОписаниеОшибки;
	Иначе
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке.";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция, получает данные клиента в Instagram.
//
Функция ПолучитьДанныеКлиента_Instagram(Идентификатор, ПараметрыВнешнейСистемы) Экспорт
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	HTTPЗапрос = Новый HTTPЗапрос("/v11.0/" + Идентификатор + "?access_token=" + ПараметрыВнешнейСистемы.ApiToken);
	
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		СтруктураОтвета = ДекодироватьИзJSON((Ответ.ПолучитьТелоКакСтроку()));
		
		Если СтруктураОтвета.Свойство("error") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ПозицияРазделителяИмени = СтрНайти(СтруктураОтвета.name, " ");
		
		Если ПозицияРазделителяИмени Тогда
			Имя		= Лев(СтруктураОтвета.name, ПозицияРазделителяИмени - 1);
			Фамилия	= Сред(СтруктураОтвета.name, ПозицияРазделителяИмени + 1);
		Иначе
			Имя		= СтруктураОтвета.name;
			Фамилия = "";
		КонецЕсли;
		
		ДанныеКлиента = Новый Структура;
		ДанныеКлиента.Вставить("Имя"	, Имя);
		ДанныеКлиента.Вставить("Фамилия", Фамилия);
		ДанныеКлиента.Вставить("Фото"	, СтруктураОтвета.profile_pic);
		
		Возврат ДанныеКлиента;
		
	Исключение
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область Обработчики_Viber

// Функция, отправляет сообщение через API VK и возвращает структуру с параметрами результата.
//
Функция ОтправитьСообщениеКлиентуViber(ТекстСообщения, Клиент, ВнешняяСистема, НомерТелефона = Неопределено, ИдКанала = "")
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
	СтруктураВозврата.Вставить("ОписаниеОшибки"  , "");
	СтруктураВозврата.Вставить("ИдСообщения"     , "");
	
	ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	
	Если Не ЗначениеЗаполнено(ПараметрыВнешнейСистемы)
		ИЛИ ТипЗнч(ПараметрыВнешнейСистемы) <> Тип("Структура")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("ApiToken")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("ИдОператора")
		ИЛИ Не ПараметрыВнешнейСистемы.Свойство("UrlApi") Тогда
		
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не заполнены параметры внешней системы."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда		
		ПараметрыКлиента = ПолучитьПараметрыОбъектаИдентификации(Клиент, ВнешняяСистема);
	Иначе
		ПараметрыКлиента = Неопределено;
	КонецЕсли;
	
	Если ПараметрыКлиента = Неопределено Тогда
		СтруктураВозврата.ОписаниеОшибки = "Не удалось отправить сообщение. Не найден контакт мессенджера."; 	
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	РезультатОперации = Viber_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы);
	
	// Если сообщение отправлено.
	Если РезультатОперации.ВыполненоУспешно Тогда
		
		СтруктураВозврата.ВыполненоУспешно = Истина;
		СтруктураВозврата.ИдСообщения      = РезультатОперации.ИдСообщения;
		
		// Добавляем отправленное сообщение в регистр.
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
			ПараметрыКлиента.ИдКлиента,
			РезультатОперации.ИдСообщения,,,
			ТекстСообщения,
			Истина,
			Перечисления.Мессенджеры.viber,
			Ложь,
			ТекущаяДатаСеанса(),
			ВнешняяСистема
		);
		
		// Оповещаем сотрудников о новом отправленном сообщении.
		ОповеститьСотрудниковОНовомСообщении(РезультатОперации.ИдСообщения,, ПараметрыКлиента.ИдКлиента,, ВнешняяСистема);		
	
	ИначеЕсли РезультатОперации.Свойство("ОписаниеОшибки") Тогда // Если есть расшифровка ошибки, то вернем ее
		СтруктураВозврата.ОписаниеОшибки = РезультатОперации.ОписаниеОшибки;
	Иначе
		СтруктураВозврата.ОписаниеОшибки = "Ошибка при отправке.";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область HttpService

// Функция - отправить сообщение ChatApi.
//
Функция ChatApi_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложения = Неопределено, ОписаниеОшибки = "") Экспорт
	
	Попытка

		Если ЗначениеЗаполнено(Вложения) Тогда
			
			ИдКлиента = ПараметрыКлиента.ИдКлиента;
			ИдКанала  = ПараметрыВнешнейСистемы.ChannelId;
			ИмяМетода = "/instance" + ИдКанала + "/sendFile?token=" + ПараметрыВнешнейСистемы.ApiToken;			
			
			Если ТипЗнч(Вложения) = Тип("Массив") И Вложения.Количество() > 0 Тогда
				
				ПарамтерыЗапроса = Новый Структура();
				ПарамтерыЗапроса.Вставить("chatId"	, ИдКлиента);
				ПарамтерыЗапроса.Вставить("caption"	, ТекстСообщения);
				ПарамтерыЗапроса.Вставить("body"	, Вложения[0].ДанныеФайла);
				ПарамтерыЗапроса.Вставить("filename", Вложения[0].ИмяФайла);
				
				РезультатЗапроса = ChatApi_ВыполнитьPOSTЗапрос(ИмяМетода, ПараметрыВнешнейСистемы, ПарамтерыЗапроса);
				
				Если РезультатЗапроса.Свойство("sent") И РезультатЗапроса.sent = Истина Тогда
					
					ИдСообщения = РезультатЗапроса.id;
					ИдСообщения = ?(ТипЗнч(ИдСообщения) = Тип("Число"), Формат(ИдСообщения, "ЧГ="), ИдСообщения);
					ИдСообщения = СокрЛП(ИдСообщения);
					
					РезультатОперации = Новый Структура;
					РезультатОперации.Вставить("ВыполненоУспешно"	, Истина);
					РезультатОперации.Вставить("ИдСообщения"		, ИдСообщения);
					РезультатОперации.Вставить("ИдКанала"			, ИдКанала);
					РезультатОперации.Вставить("Вложения"			, "*Отправлен файл: " + Вложения[0].ИмяФайла + "*");
					
				Иначе
					РезультатОперации = Новый Структура("ВыполненоУспешно", Ложь);
					ОписаниеОшибки	  = ?(РезультатЗапроса.Свойство("message") И ЗначениеЗаполнено(РезультатЗапроса.message), РезультатЗапроса.message, "");

				КонецЕсли;

			Иначе
				РезультатОперации = Новый Структура("ВыполненоУспешно", Ложь);
				ОписаниеОшибки	  = "Массив вложений не заполнен";
			КонецЕсли;	
			
		Иначе
			
			ИдКлиента = ПараметрыКлиента.ИдКлиента;
			ИдКанала  = ПараметрыВнешнейСистемы.ChannelId;
			ИмяМетода = "/instance" + ИдКанала + "/sendMessage?token=" + ПараметрыВнешнейСистемы.ApiToken;			
			
			ПарамтерыЗапроса = Новый Структура();
			ПарамтерыЗапроса.Вставить("chatId", ИдКлиента);
			ПарамтерыЗапроса.Вставить("body"  , ТекстСообщения);
			
			РезультатЗапроса = ChatApi_ВыполнитьPOSTЗапрос(ИмяМетода, ПараметрыВнешнейСистемы, ПарамтерыЗапроса);

			
			Если РезультатЗапроса.Свойство("sent") И РезультатЗапроса.sent = Истина Тогда
				
				ИдСообщения = РезультатЗапроса.id;
				ИдСообщения = ?(ТипЗнч(ИдСообщения) = Тип("Число"), Формат(ИдСообщения, "ЧГ="), ИдСообщения);
				ИдСообщения = СокрЛП(ИдСообщения);
				
				РезультатОперации = Новый Структура;
				РезультатОперации.Вставить("ВыполненоУспешно", Истина);
				РезультатОперации.Вставить("ИдСообщения"     , ИдСообщения);
				РезультатОперации.Вставить("ИдКанала"        , ИдКанала);
				
			Иначе
				РезультатОперации = Новый Структура("ВыполненоУспешно", Ложь);
				ОписаниеОшибки	  = ?(РезультатЗапроса.Свойство("message") И ЗначениеЗаполнено(РезультатЗапроса.message), РезультатЗапроса.message, "");
				
			КонецЕсли;
			
		КонецЕсли;	
		
	Исключение
		РезультатОперации = Новый Структура("ВыполненоУспешно", Ложь);
		ОписаниеОшибки    = "Возникла исключительная ошибка при отправке сообщения: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - выполнить POST запрос ChatApi.
//
Функция ChatApi_ВыполнитьPOSTЗапрос(ИмяМетода, ПараметрыВнешнейСистемы, ПарамтерыЗапроса)
	
	ТекстЗапроса = СобратьJson(ПарамтерыЗапроса);
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, ЗащищенноеСоединение); 
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Authorization", ПараметрыВнешнейСистемы.ApiToken);		
	ЗаголовкиHTTP.Вставить("Content-Type" , "application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос(ИмяМетода, ЗаголовкиHTTP);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);
	
	РезультатЗапроса = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	РезультатЗапроса = РазобратьJson(РезультатЗапроса);
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция - Chat api выполнить GETЗапрос
//
// Параметры:
//  ИмяМетода	 - 	 - 
//  Параметры	 - 	 - 
//  ДопЗаголовки - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ChatApi_ВыполнитьGETЗапрос(ИмяМетода, Параметры = Неопределено, ДопЗаголовки = Неопределено)
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language", "ru");
	
	Если ДопЗаголовки <> Неопределено Тогда
		
		Для Каждого ЗаголовокЗначение ИЗ ДопЗаголовки Цикл		
			ЗаголовкиHTTP.Вставить(ЗаголовокЗначение.Ключ, ЗаголовокЗначение.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение("api.chat-api.com",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	Если Параметры <> Неопределено Тогда 
		ПараметрыЗапроса = "";
		Для Каждого ПараметрЗапроса Из Параметры Цикл
			ПараметрыЗапроса = ПараметрыЗапроса + ?(Не ЗначениеЗаполнено(ПараметрыЗапроса), "?", "&") + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение;			
		КонецЦикла;
	КонецЕсли;
	
	HTTPЗапрос = Новый HTTPЗапрос(ИмяМетода + ПараметрыЗапроса, ЗаголовкиHTTP);
	
	РезультатЗапроса = HTTPСоединение.Получить(HTTPЗапрос);
	РезультатЗапроса = РазобратьJson(РезультатЗапроса);
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция - отправить сообщение GreenApi.
//
Функция GreenApi_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложения = Неопределено, ОписаниеОшибки = "") Экспорт
	
	Попытка
		
		Если СтрНайти(ПараметрыВнешнейСистемы.UrlApi, "chat-api") Тогда
			Возврат ChatApi_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложения, ОписаниеОшибки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Вложения) Тогда
			
			Если ТипЗнч(Вложения) = Тип("Массив") И Вложения.Количество() > 0 Тогда
				
				СсылкаНаФайл = ЗагрузитьФайлВХранилищеИПолучитьСсылку(Вложения[0]);
				
				Если Не ЗначениеЗаполнено(СсылкаНаФайл) Тогда
					
					ОписаниеОшибки = "При отправке файла произошла ошибка.";// + Символы.ПС + ОшибкаЗагрузкиФайла;
					
					РезультатОперации = Новый Структура;
					РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
					РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
					
					Возврат РезультатОперации;
					
				КонецЕсли;
				
				Сервер	= "api.green-api.com/waInstance" + ПараметрыВнешнейСистемы.ChannelId + "/SendFileByUrl/" + ПараметрыВнешнейСистемы.ApiToken;
				Таймаут	= 5;
				
				Соединение = Новый HTTPСоединение(Сервер,,,,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
				
				Заголовки = Новый Соответствие;
				Заголовки.Вставить("Content-Type", "application/json");
				
				АдресРесурса = "";
				
				Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
				
				ПараметрыЗапроса = Новый Структура;
				ПараметрыЗапроса.Вставить("chatId"	, ПараметрыКлиента.ИдКлиента);
				ПараметрыЗапроса.Вставить("caption"	, ТекстСообщения);
				ПараметрыЗапроса.Вставить("urlFile"	, СсылкаНаФайл);
				ПараметрыЗапроса.Вставить("fileName", Вложения[0].ИмяФайла);
				
				ТелоЗапроса = КодироватьВJSON(ПараметрыЗапроса);
				
				Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
				
				Ответ			 = Соединение.ОтправитьДляОбработки(Запрос);
				ТелоОтвета		 = Ответ.ПолучитьТелоКакСтроку();
				СтруктураОтвета	 = ДекодироватьИзJSON(ТелоОтвета);
				
				Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда
					
					Если СтруктураОтвета.Свойство("idMessage") Тогда
						
						РезультатОперации = Новый Структура;
						РезультатОперации.Вставить("ВыполненоУспешно"	, Истина);
						РезультатОперации.Вставить("ИдСообщения"		, СтруктураОтвета.idMessage);
						РезультатОперации.Вставить("ИдКанала"			, ПараметрыВнешнейСистемы.ChannelId);
						РезультатОперации.Вставить("Вложения"			, СсылкаНаФайл);
						
					Иначе
						
						ОписаниеОшибки = "Ошибка отправки сообщения.";
						
						Если СтруктураОтвета.Свойство("message") И ЗначениеЗаполнено(СтруктураОтвета.message) Тогда
							ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Текст ошибки: " + СтруктураОтвета.message;
						КонецЕсли;
						
						ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Ответ сервера: " + ТелоОтвета;
						
						РезультатОперации = Новый Структура;
						РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
						РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
						
					КонецЕсли;
					
				Иначе
					
					ОписаниеОшибки = "Не удалось отправить сообщение." + Символы.ПС + "Ответ сервера: " + ТелоОтвета;
					
					РезультатОперации = Новый Структура;
					РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
					РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
					
				КонецЕсли;
				
			Иначе
				
				ОписаниеОшибки = "Ошибка отправки файла. Не удалось получить данные файла.";
				
				РезультатОперации = Новый Структура;
				РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
				РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
				
			КонецЕсли;	
			
		Иначе
			
			Сервер	= "api.green-api.com/waInstance" + ПараметрыВнешнейСистемы.ChannelId + "/SendMessage/" + ПараметрыВнешнейСистемы.ApiToken;
			Таймаут	= 5;
			
			Соединение = Новый HTTPСоединение(Сервер,,,,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type", "application/json");
			
			АдресРесурса = "";
			
			Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("chatId", ПараметрыКлиента.ИдКлиента);
			ПараметрыЗапроса.Вставить("message", ТекстСообщения);
			
			ТелоЗапроса = КодироватьВJSON(ПараметрыЗапроса);
			
			Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
			
			Ответ			 = Соединение.ОтправитьДляОбработки(Запрос);
			ТелоОтвета		 = Ответ.ПолучитьТелоКакСтроку();
			СтруктураОтвета	 = ДекодироватьИзJSON(ТелоОтвета);
			
			Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда
				
				Если СтруктураОтвета.Свойство("idMessage") Тогда
					
					РезультатОперации = Новый Структура;
					РезультатОперации.Вставить("ВыполненоУспешно", Истина);
					РезультатОперации.Вставить("ИдСообщения"     , СтруктураОтвета.idMessage);
					РезультатОперации.Вставить("ИдКанала"        , ПараметрыВнешнейСистемы.ChannelId);
					
				Иначе
					
					ОписаниеОшибки = "Ошибка отправки сообщения.";
					
					Если СтруктураОтвета.Свойство("message") И ЗначениеЗаполнено(СтруктураОтвета.message) Тогда
						ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Текст ошибки: " + СтруктураОтвета.message;
					КонецЕсли;
					
					ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Ответ сервера: " + ТелоОтвета;
					
					РезультатОперации = Новый Структура;
					РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
					РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
					
				КонецЕсли;
				
			Иначе
				
				ОписаниеОшибки = "Не удалось отправить сообщение." + Символы.ПС + "Ответ сервера: " + ТелоОтвета;
				
				РезультатОперации = Новый Структура;
				РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
				РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
				
			КонецЕсли;
			
		КонецЕсли;	
		
	Исключение
		
		ОписаниеОшибки = "Ошибка отправки. Текст ошибки: " + ОписаниеОшибки();
		
		РезультатОперации = Новый Структура;
		РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
		РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция, создает подписку на webhook GreenApi.
//
Функция GreenApi_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения, ОписаниеОшибки = Неопределено)
	
	ВыполненоУспешно = Ложь;
	
	Попытка
		
		Сервер	= "api.green-api.com/waInstance" + ПараметрыВнешнейСистемы.ChannelId + "/SetSettings/" + ПараметрыВнешнейСистемы.ApiToken;
		Таймаут	= 5;
		
		Соединение = Новый HTTPСоединение(Сервер,,,,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		
		АдресРесурса = "";
		
		Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("webhookUrl"				, АдресПодключения);
		ПараметрыЗапроса.Вставить("incomingWebhook"			, "yes");
		ПараметрыЗапроса.Вставить("outgoingWebhook"			, "yes");
		ПараметрыЗапроса.Вставить("outgoingMessageWebhook"	, "yes");
		
		ТелоЗапроса = КодироватьВJSON(ПараметрыЗапроса);
		
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Ответ			 = Соединение.ОтправитьДляОбработки(Запрос);
		ТелоОтвета		 = Ответ.ПолучитьТелоКакСтроку();
		СтруктураОтвета	 = ДекодироватьИзJSON(ТелоОтвета);
		
		ВыполненоУспешно = СтруктураОтвета.Свойство("saveSettings") И СтруктураОтвета.saveSettings;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат ВыполненоУспешно;
	
КонецФункции

// Функция - Chat api получить данные диалога
//
// Параметры:
//  ИдКлиента				 - 	 - 
//  ПараметрыВнешнейСистемы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ChatApi_ПолучитьДанныеДиалога(ИдКлиента, ПараметрыВнешнейСистемы, ВнешняяСистема) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыВнешнейСистемы) Тогда
		ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	КонецЕсли;
	
	РезультатОперации = Новый Структура("ВыполненоУспешно, ОписаниеОшибки, Идентификатор, НаименованиеКлиента, ФотоКлиента", Ложь);
	
	Попытка		
		
		ПараметрыЗапроса = Новый Структура();
		ПараметрыЗапроса.Вставить("token" , ПараметрыВнешнейСистемы.ApiToken);
		ПараметрыЗапроса.Вставить("chatId", ИдКлиента);		
		
		РезультатЗапроса  = ChatApi_ВыполнитьGETЗапрос("/instance" + ПараметрыВнешнейСистемы.ChannelId + "/dialog", ПараметрыЗапроса);		
		
		Если РезультатЗапроса.Свойство("id") И ЗначениеЗаполнено(РезультатЗапроса.id) Тогда
			
			РезультатОперации.ВыполненоУспешно		= Истина;
			РезультатОперации.Идентификатор			= РезультатЗапроса.id;
			РезультатОперации.НаименованиеКлиента	= РезультатЗапроса.name;
			РезультатОперации.ФотоКлиента			= РезультатЗапроса.image;
			
		Иначе
			РезультатОперации.ОписаниеОшибки	= "Нет данных по диалогу";
		КонецЕсли;
		
	Исключение
		РезультатОперации.ОписаниеОшибки	= "Возникла исключительная ошибка при получении данных диалога: " + ОписаниеОшибки();
	КонецПопытки;	
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Chat api получить данные диалога
//
// Параметры:
//  ИдКлиента				 - 	 - 
//  ПараметрыВнешнейСистемы	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция GreenApi_ПолучитьДанныеДиалога(ИдКлиента, ПараметрыВнешнейСистемы, ВнешняяСистема, ЭтоГруппа = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыВнешнейСистемы) Тогда
		ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	КонецЕсли;
	
	Если СтрНайти(ПараметрыВнешнейСистемы.UrlApi, "chat-api") Тогда
		Возврат ChatApi_ПолучитьДанныеДиалога(ИдКлиента, ПараметрыВнешнейСистемы, ВнешняяСистема);
	КонецЕсли;
	
	РезультатОперации = Новый Структура("ВыполненоУспешно, ОписаниеОшибки, Идентификатор, НаименованиеКлиента, ФотоКлиента", Ложь);
	РезультатОперации.Идентификатор = ИдКлиента;
	
	Попытка		
		
		Сервер	= ПараметрыВнешнейСистемы.UrlApi + "/waInstance" + ПараметрыВнешнейСистемы.ChannelId;
		Таймаут	= 5;
		
		Соединение = Новый HTTPСоединение(Сервер,,,,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		
		ЗапросАватара = Новый HTTPЗапрос("/GetAvatar/" + ПараметрыВнешнейСистемы.ApiToken, Заголовки);
		
		ПараметрыЗапросаАватара = Новый Структура;
		ПараметрыЗапросаАватара.Вставить("chatId", ИдКлиента);		
		
		ТелоЗапросаАватара = КодироватьВJSON(ПараметрыЗапросаАватара);
		
		ЗапросАватара.УстановитьТелоИзСтроки(ТелоЗапросаАватара);
		
		ОтветАватар				 = Соединение.ОтправитьДляОбработки(ЗапросАватара);
		ТелоОтветаАватар		 = ОтветАватар.ПолучитьТелоКакСтроку();
		СтруктураОтветаАватар	 = ДекодироватьИзJSON(ТелоОтветаАватар);
		
		СтруктураОтветаАватар.Свойство("existsWhatsapp"	, РезультатОперации.ВыполненоУспешно);
		СтруктураОтветаАватар.Свойство("urlAvatar"		, РезультатОперации.ФотоКлиента);
		
		Если ЭтоГруппа Тогда
			
			ЗапросДанныхГруппы = Новый HTTPЗапрос("/GetGroupData/" + ПараметрыВнешнейСистемы.ApiToken);
			
			ПараметрыЗапросаДанныхГруппы = Новый Структура;
			ПараметрыЗапросаДанныхГруппы.Вставить("groupId", ИдКлиента);
			
			ТелоЗапросаДанныхГруппы = КодироватьВJSON(ПараметрыЗапросаДанныхГруппы);
			
			ЗапросДанныхГруппы.УстановитьТелоИзСтроки(ТелоЗапросаДанныхГруппы);
			
			ОтветДанныеГруппы			 = Соединение.ОтправитьДляОбработки(ЗапросДанныхГруппы);
			ТелоОтветаДанныеГруппы		 = ОтветДанныеГруппы.ПолучитьТелоКакСтроку();
			СтруктураОтветаДанныеГруппы	 = ДекодироватьИзJSON(ТелоОтветаДанныеГруппы);
			
			СтруктураОтветаДанныеГруппы.Свойство("subject", РезультатОперации.НаименованиеКлиента);
			
		КонецЕсли;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;	
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция, отправляет сообщение Instagram.
//
Функция Instagram_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложения = Неопределено) Экспорт
	
	Попытка
		
		ИдКлиента = ПараметрыКлиента.ИдКлиента;
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());			
		HTTPЗапросЗахватДиалога = Новый HTTPЗапрос("/v11.0/me/take_thread_control?access_token=" + ПараметрыВнешнейСистемы.ApiToken, Заголовки);
		
		HTTPЗапросЗахватДиалога.УстановитьТелоИзСтроки("{""recipient"": {""id"": """ + ИдКлиента + """}}");
		
		ЗахватДиалогаОтвет			 = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапросЗахватДиалога);
		СтруктураОтветаЗахватДиалога = ДекодироватьИзJSON(ЗахватДиалогаОтвет.ПолучитьТелоКакСтроку());
		
		Если Не (СтруктураОтветаЗахватДиалога.Свойство("success") И СтруктураОтветаЗахватДиалога.success = Истина) Тогда
			
			РезультатОперации = Новый Структура;	
			РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
			РезультатОперации.Вставить("ОписаниеОшибки"  , "Ошибка получения контроля над диалогом. Не удалось отправить сообщение.");
			
			Возврат РезультатОперации;
			
		КонецЕсли;
		
		HTTPЗапрос = Новый HTTPЗапрос("/v11.0/me/messages?access_token=" + ПараметрыВнешнейСистемы.ApiToken, Заголовки);
		
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("recipient"	, Новый Структура("id"	, ИдКлиента));
		СтруктураЗапроса.Вставить("message"		, Новый Структура("text", ТекстСообщения));
		
		HTTPЗапрос.УстановитьТелоИзСтроки(КодироватьВJSON(СтруктураЗапроса));
		
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		СтруктураОтвета = ДекодироватьИзJSON(Ответ.ПолучитьТелоКакСтроку());
		
		Если СтруктураОтвета.Свойство("message_id") Тогда
			
			ИдСообщения = СтруктураОтвета.message_id;
			
			РезультатОперации = Новый Структура;
			РезультатОперации.Вставить("ВыполненоУспешно", Истина);
			РезультатОперации.Вставить("ИдСообщения"     , ИдСообщения);
			РезультатОперации.Вставить("ИдКанала"     	 , "");
			
		ИначеЕсли СтруктураОтвета.Свойство("error") И СтруктураОтвета.error.Свойство("code") И СтруктураОтвета.error.code = 10 Тогда
			
			РезультатОперации = Новый Структура;
			РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
			РезультатОперации.Вставить("ОписаниеОшибки"  , "Для продолжения диалога необходимо получить входящее сообщение.");
			
		Иначе
			
			РезультатОперации = Новый Структура;
			РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
			РезультатОперации.Вставить("ОписаниеОшибки"  , "Не удалось отправить сообщение.");
			
		КонецЕсли;
			
	Исключение
		РезультатОперации = Новый Структура;
		РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
		РезультатОперации.Вставить("ОписаниеОшибки"	 , "Ошибка соединения " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция, создает подписку на webhook Instagram.
//
Функция Instagram_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения)
	
	ВыполненоУспешно = Ложь;
	
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());			
		HTTPЗапрос = Новый HTTPЗапрос("/v11.0/me/subscribed_apps?subscribed_fields=messages&access_token=" + ПараметрыВнешнейСистемы.ApiToken);
		
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		СтруктураОтвета = ДекодироватьИзJSON(Ответ.ПолучитьТелоКакСтроку());
		
		ВыполненоУспешно = СтруктураОтвета.Свойство("success") И СтруктураОтвета.success = Истина;
		
	Исключение
	КонецПопытки;
	
	Возврат ВыполненоУспешно;
	
КонецФункции

// Функция, создает подписку на webhook Telegram.
//
Функция Telegram_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения)
	
	ВыполненоУспешно = Ложь;
		
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());			
		HTTPЗапрос = Новый HTTPЗапрос("/bot" + ПараметрыВнешнейСистемы.ApiToken + "/getWebhookInfo");
		
		РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
		
		Если РезультатЗапроса.Свойство("result") И РезультатЗапроса.result.Свойство("url") И РезультатЗапроса.result.url = АдресПодключения Тогда
			ВыполненоУспешно = Истина;
		Иначе	
			HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
			HTTPЗапрос = Новый HTTPЗапрос("/bot" + ПараметрыВнешнейСистемы.ApiToken + "/setWebhook?url=" + АдресПодключения + "&allowed_updates=[""message"", ""edited_message"", ""callback_query""]");
			
			РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
			
			ВыполненоУспешно = РезультатЗапроса.result = 1;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат ВыполненоУспешно;
	
КонецФункции

// Функция, отправляет сообщение Telegram.
//
Функция Telegram_ОтправитьСообщение(ТекстСообщения
									, ПараметрыКлиента
									, ПараметрыВнешнейСистемы
									, Вложения = Неопределено
									, ДополнительныеПараметры = Неопределено) Экспорт
	
	Попытка
		
		Если ТипЗнч(Вложения) = Тип("Массив") И Вложения.Количество() > 0 Тогда
			
			ИдКлиента = ПараметрыКлиента.ИдКлиента;
			Разделитель = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
			
			HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());			
			HTTPЗапрос = Новый HTTPЗапрос("/bot" + ПараметрыВнешнейСистемы.ApiToken + "/sendDocument", Заголовки);
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("chat_id", ИдКлиента);
			ПараметрыЗапроса.Вставить("caption", ТекстСообщения);
			
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(СформироватьMultipartFormData(Разделитель, Вложения[0], "document", ПараметрыЗапроса));
			
			РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос).ПолучитьТелоКакСтроку());
			
			Если РезультатЗапроса.Свойство("result") Тогда
				
				ИдСообщения = РезультатЗапроса.result.message_id;
				ИдСообщения = ?(ТипЗнч(ИдСообщения) = Тип("Число"), Формат(ИдСообщения, "ЧГ="), ИдСообщения);
				ИдСообщения = СокрЛП(ИдСообщения);
				
				РезультатОперации = Новый Структура;
				РезультатОперации.Вставить("ВыполненоУспешно", Истина);
				РезультатОперации.Вставить("ИдСообщения"     , ИдСообщения);
				РезультатОперации.Вставить("ИдКанала"        , "");
				РезультатОперации.Вставить("Вложения"		 , ПолучитьСсылкуНаФайл_Telegram(РезультатЗапроса.result.document, ПараметрыВнешнейСистемы));
				
			Иначе
				РезультатОперации = Новый Структура;
				РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
				РезультатОперации.Вставить("ОписаниеОшибки"  , ?(РезультатЗапроса.Свойство("description"), "Ошибка отправки. " + РезультатЗапроса.description, "Неизвестная ошибка отправки."));
			КонецЕсли;
			
		Иначе
			
			ИдКлиента = ПараметрыКлиента.ИдКлиента;
			
			// Кодируем сообщение чат-бота
			//ЗакодироватьСообщениеЧатБота(ТекстСообщения, ДополнительныеПараметры);
			
			HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("chat_id"	, ИдКлиента);
			ПараметрыЗапроса.Вставить("text"	, ТекстСообщения);
			
			Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "JSONСтруктураКнопок") <> Неопределено Тогда 
				ПараметрыЗапроса.Вставить("reply_markup", ДополнительныеПараметры.JSONСтруктураКнопок);
			КонецЕсли;
			
			ТелоЗапроса = КодироватьВJSON(ПараметрыЗапроса);
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type", "application/json");
			
			HTTPЗапрос = Новый HTTPЗапрос("/bot" + ПараметрыВнешнейСистемы.ApiToken + "/sendMessage", Заголовки);
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
			
			Ответ			 = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			ТелоОтвета		 = Ответ.ПолучитьТелоКакСтроку();
			ПараметрыОтвета	 = ДекодироватьИзJSON(ТелоОтвета);
			
			Если ПараметрыОтвета.Свойство("result") Тогда
				
				ИдСообщения = ПараметрыОтвета.result.message_id;
				ИдСообщения = ?(ТипЗнч(ИдСообщения) = Тип("Число"), Формат(ИдСообщения, "ЧГ="), ИдСообщения);
				ИдСообщения = СокрЛП(ИдСообщения);
				
				РезультатОперации = Новый Структура();
				РезультатОперации.Вставить("ВыполненоУспешно", Истина);
				РезультатОперации.Вставить("ИдСообщения"     , ИдСообщения);
				РезультатОперации.Вставить("ИдКанала"     	 , "");
				
			Иначе
				РезультатОперации = Новый Структура;	
				РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
				РезультатОперации.Вставить("ОписаниеОшибки"  , ?(ПараметрыОтвета.Свойство("description"), "Ошибка отправки. " + ПараметрыОтвета.description, "Неизвестная ошибка отправки."));
			КонецЕсли;
			
		КонецЕсли;	
		
	Исключение
		РезультатОперации = Новый Структура;
		РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
		РезультатОперации.Вставить("ОписаниеОшибки"	 , "Ошибка соединения " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция - Telegram редактировать сообщение
//
// Параметры:
//  СтрокаЗамены		 - 	 - 
//  ПараметрыСсобщения	 - 	 - 
//  ВнешняяСистема		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Telegram_РедактироватьСообщение(Знач СтрокаЗамены, ПараметрыСобщения, Знач ДанныеСообщения, ЭтоОтветКлиента = Ложь) Экспорт

	СтрокаЗамены = СокрЛП(СтрокаЗамены);
	
	message_id = Формат(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСобщения, "message_id", ""), "ЧГ=0");
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
	РезультатОперации.Вставить("ОписаниеОшибки"  , "");
	РезультатОперации.Вставить("ИдСообщения"     , message_id);
	
	Если НЕ ЗначениеЗаполнено(СтрокаЗамены) Тогда 
		РезультатОперации.ОписаниеОшибки = "Не удалось отредактировать сообщение. Не заполнены строка, на которую будет заменено сообщение."; 	
		Возврат РезультатОперации;
	КонецЕсли;
	
	ПараметрыВнешнейСистемы = Неопределено;
	ВнешняяСистема 				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСообщения, "ВнешняяСистема", Неопределено);
	Если ВнешняяСистема = Неопределено Тогда
		СтрокаЗаменыДляЖурнала 	= ДанныеСообщения.ДополнительныеПараметры.text;
		ДанныеСообщения 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСообщения, "ДанныеСообщения", Неопределено);
		ВнешняяСистема 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСообщения, "ВнешняяСистема", Неопределено);
	Иначе 
		СтрокаЗаменыДляЖурнала 	= СтрокаЗамены;
	КонецЕсли;	
	Если НЕ ИнициализированыПараметрыВнешнейСистемы(ВнешняяСистема, ПараметрыВнешнейСистемы) Тогда 
		РезультатОперации.ОписаниеОшибки = "Не удалось отредактировать сообщение. Не заполнены параметры внешней системы."; 	
		Возврат РезультатОперации;
	КонецЕсли;
	
	ИдКлиента = Формат(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСобщения, "chat_id", ""), "ЧГ=0");
	Если НЕ ЗначениеЗаполнено(ИдКлиента) Тогда 
		РезультатОперации.ОписаниеОшибки = "Не удалось отредактировать сообщение. Не указан идентификатор чата."; 	
		Возврат РезультатОперации;
	КонецЕсли;
	
	is_bot 				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСобщения, "is_bot"				, Ложь);	
	JSONСтруктураКнопок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСобщения, "JSONСтруктураКнопок"	, Неопределено);

	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Если JSONСтруктураКнопок = Неопределено Тогда 
			HTTPЗапрос = Новый HTTPЗапрос("/bot" + ПараметрыВнешнейСистемы.ApiToken + "/editMessageText?chat_id=" + ИдКлиента + "&message_id=" + message_id + "&text=" + СтрокаЗамены);
		Иначе 
			HTTPЗапрос = Новый HTTPЗапрос("/bot" + ПараметрыВнешнейСистемы.ApiToken + "/editMessageText?chat_id=" + ИдКлиента + "&message_id=" + message_id + "&text=" + СтрокаЗамены + "&reply_markup=" + JSONСтруктураКнопок);
		КонецЕсли;	
		РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
		
		Если РезультатЗапроса.Свойство("result") Тогда
			
			ИдСообщения = РезультатЗапроса.result.message_id;
			ИдСообщения = ?(ТипЗнч(ИдСообщения) = Тип("Число"), Формат(ИдСообщения, "ЧГ="), ИдСообщения);
			ИдСообщения = СокрЛП(ИдСообщения);
			
			Если is_bot Тогда 
				СтрокаЗаменыДляЖурнала = СокрЛП(СтрЗаменить(СтрокаЗаменыДляЖурнала, "Ваш выбор:", "")); 
			КонецЕсли;	
			РегистрыСведений.ЖурналСообщений.РедактироватьСообщение(ДанныеСообщения, СтрокаЗаменыДляЖурнала, ЭтоОтветКлиента);
			
			РезультатОперации = Новый Структура();
			РезультатОперации.Вставить("ВыполненоУспешно", Истина);
			РезультатОперации.Вставить("ИдСообщения"     , ИдСообщения);
			РезультатОперации.Вставить("ИдКанала"     	 , "");
			
		Иначе
			РезультатОперации = Новый Структура;	
			РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
			РезультатОперации.Вставить("ОписаниеОшибки"  , ?(РезультатЗапроса.Свойство("description"), "Ошибка отправки. " + РезультатЗапроса.description, "Неизвестная ошибка отправки."));
		КонецЕсли;
		
	Исключение
		РезультатОперации = Новый Структура;
		РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
		РезультатОперации.Вставить("ОписаниеОшибки"	 , "Ошибка соединения " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция, создает подписку на webhook Viber.
//
Функция Viber_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения)
	
	ВыполненоУспешно = Ложь;
		
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("url"			, АдресПодключения);
		ПараметрыЗапроса.Вставить("send_name"	, Истина);
		ПараметрыЗапроса.Вставить("send_photo"	, Истина);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type"		, "application/json");
		Заголовки.Вставить("X-Viber-Auth-Token"	, ПараметрыВнешнейСистемы.ApiToken);
		
		HTTPЗапрос = Новый HTTPЗапрос("set_webhook", Заголовки);
		
		ТелоЗапроса = КодироватьВJSON(ПараметрыЗапроса);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ПараметрыОтвета = ДекодироватьИзJSON(ТелоОтвета);
		
		ВыполненоУспешно = (ПараметрыОтвета.status = 0);
		
	Исключение
	КонецПопытки;
	
	Возврат ВыполненоУспешно;
	
КонецФункции

// Функция, отправляет сообщение Viber.
//
Функция Viber_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложения = Неопределено, Оператор = Неопределено) Экспорт
	
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type"		, "application/json");
		Заголовки.Вставить("X-Viber-Auth-Token"	, ПараметрыВнешнейСистемы.ApiToken);
		
		HTTPЗапрос = Новый HTTPЗапрос("send_message", Заголовки);
		
		Если ЗначениеЗаполнено(Оператор) И ПараметрыВнешнейСистемы.Свойство("ИспользоватьИменаСотрудников")
			И ПараметрыВнешнейСистемы.ИспользоватьИменаСотрудников = Истина Тогда
			
			ДанныеОтправителя = Новый Структура;
			ДанныеОтправителя.Вставить("name", Лев(ОбщегоНазначения.ПолучитьЗначениеРеквизита(Оператор, "НаименованиеСокращенное"), 28));
			
		Иначе
			
			ДанныеОтправителя = Новый Структура;
			ДанныеОтправителя.Вставить("name", ПараметрыВнешнейСистемы.ИмяОтправителя);
			
		КонецЕсли;
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("type"	, "text");
		ПараметрыЗапроса.Вставить("sender"	, ДанныеОтправителя);
		ПараметрыЗапроса.Вставить("receiver", ПараметрыКлиента.ИдКлиента);
		
		Если ЗначениеЗаполнено(Вложения) Тогда
			
			ОшибкаЗагрузкиФайла = "";
			СсылкаНаФайл = ЗагрузитьФайлВХранилищеИПолучитьСсылку(Вложения[0], ОшибкаЗагрузкиФайла);
			
			Если Не ЗначениеЗаполнено(СсылкаНаФайл) Тогда
				
				ОписаниеОшибки = "При отправке файла произошла ошибка." + Символы.ПС + ОшибкаЗагрузкиФайла;
				
				РезультатОперации = Новый Структура;
				РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
				РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
				
				Возврат РезультатОперации;
				
			КонецЕсли;
			
			ПараметрыЗапроса.Вставить("text", ?(ЗначениеЗаполнено(ТекстСообщения), ТекстСообщения + Символы.ПС + СсылкаНаФайл, СсылкаНаФайл));
			
		Иначе
			ПараметрыЗапроса.Вставить("text", ТекстСообщения);
			
		КонецЕсли;
		
		ТелоЗапроса = КодироватьВJSON(ПараметрыЗапроса);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		РезультатЗапроса = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ТелоРезультата = РезультатЗапроса.ПолучитьТелоКакСтроку();
		ПараметрыРезультата = ДекодироватьИзJSON(ТелоРезультата);
		
		Если ПараметрыРезультата.Свойство("status_message") И НРег(ПараметрыРезультата.status_message) = "ok" Тогда
			
			ИдСообщения = ПараметрыРезультата.message_token;
			
			РезультатОперации = Новый Структура;
			РезультатОперации.Вставить("ВыполненоУспешно", Истина);
			РезультатОперации.Вставить("ИдСообщения"     , ИдСообщения);
			РезультатОперации.Вставить("ИдКанала"	     , Неопределено);
			
			Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда
				РезультатОперации.Вставить("Вложения", СсылкаНаФайл);
			КонецЕсли;
			
		Иначе
			
			ОписаниеОшибки = "Ошибка отправки.";
			
			Если ПараметрыРезультата.Свойство("status") Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Код ошибки: " + ПараметрыРезультата.status;
			КонецЕсли;
			
			Если ПараметрыРезультата.Свойство("status_message") Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Текст ошибки: " + ПараметрыРезультата.status_message;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТелоРезультата) Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Ответ сервера: " + ТелоРезультата;
			КонецЕсли;
			
			РезультатОперации = Новый Структура;	
			РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
			РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			
		КонецЕсли;
		
	Исключение
		
		ОписаниеОшибки = "Ошибка отправки. Текст ошибки: " + ОписаниеОшибки();
		
		РезультатОперации = Новый Структура;
		РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
		РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция, получить список диалогов VkApi.
//
Функция VkApi_ПолучитьСписокДиалогов(UrlApi, ApiToken, ChannelId) Экспорт
	
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 	
		
		КодДляИсполнения = 
		"var request_conv_count = 200;
		|var c = API.messages.getConversations({""count"":request_conv_count});
		|var conversations = c.items;
		|var conversations_count = c.count;
		|var user_ids = conversations@.conversation@.peer@.id;
		|var chat_count = 0;
		|var result = [];
		|var users = API.users.get({""user_ids"":user_ids,""fields"":""photo_200""});
		|var i = 0;
		|var user_data = [];
		|while (i < users.length) {
		|  user_data.push({""id"":""""+users[i].id,""name"":users[i].first_name+"" ""+users[i].last_name,""image"":users[i].photo_200});
		|  i = i + 1;
		|}
		|return user_data;";
		
		КодДляИсполнения = КодироватьСтроку(КодДляИсполнения,СпособКодированияСтроки.КодировкаURL);
		
		HTTPЗапрос = Новый HTTPЗапрос("/method/execute?code=" + КодДляИсполнения + "&access_token=" + ApiToken + "&v=5.124");
		
		РезультатЗапроса = HTTPСоединение.Получить(HTTPЗапрос);
		СтруктураОтвета	 = РазобратьJson(РезультатЗапроса);
		
		Если СтруктураОтвета.Свойство("response") Тогда
			Возврат СтруктураОтвета.response;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Функция, получить список диалогов VkApi.
//
Функция VkApi_ПолучитьДанныеДиалога(ДиалогID, ВнешняяСистема) Экспорт
	
	ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
	
	РезультатОперации = Новый Структура("ВыполненоУспешно, ОписаниеОшибки, Идентификатор, НаименованиеКлиента, ФотоКлиента", Ложь);
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 	
		
		КодДляИсполнения = 
		"var c = API.messages.getConversationsById({""peer_ids"":""" + ДиалогID + """});
		|var conversations = c.items;
		|var conversations_count = c.count;
		|var user_ids = conversations@.peer@.id;
		|var chat_count = 0;
		|var result = [];
		|var users = API.users.get({""user_ids"":user_ids,""fields"":""photo_200""});
		|var i = 0;
		|var user_data = [];
		|while (i < users.length) {
		|  user_data.push({""id"":""""+users[i].id,""name"":users[i].first_name+"" ""+users[i].last_name,""image"":users[i].photo_200});
		|  i = i + 1;
		|}
		|return user_data;";
		
		КодДляИсполнения = КодироватьСтроку(КодДляИсполнения,СпособКодированияСтроки.КодировкаURL);
		
		HTTPЗапрос = Новый HTTPЗапрос("/method/execute?code=" + КодДляИсполнения + "&access_token=" + ПараметрыВнешнейСистемы.ApiToken + "&v=5.124");
		
		РезультатЗапроса = HTTPСоединение.Получить(HTTPЗапрос);
		СтруктураОтвета	 = РазобратьJson(РезультатЗапроса);
						
		Если СтруктураОтвета.Свойство("response") И СтруктураОтвета.response.Количество() > 0 Тогда
			
			РезультатОперации.ВыполненоУспешно		= Истина;
			РезультатОперации.Идентификатор			= СтруктураОтвета.response[0].id;
			РезультатОперации.НаименованиеКлиента	= СтруктураОтвета.response[0].name;
			РезультатОперации.ФотоКлиента			= СтруктураОтвета.response[0].image;
			
		Иначе
			РезультатОперации.ОписаниеОшибки	= "Нет данных по диалогу";
		КонецЕсли;
				
	Исключение
		РезультатОперации.ОписаниеОшибки	= "Возникла исключительная ошибка при получении данных диалога: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат РезультатОперации; 
	
КонецФункции

// Функция, создает подписку на webhook VkApi.
//
Функция VkApi_СоздатьПодпискуНаWebhook(ПараметрыВнешнейСистемы, АдресПодключения)
	
	ВыполненоУспешно = Ложь;
		
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
		КодДляИсполнения = 
		"var servers = API.groups.getCallbackServers({""group_id"":"+ПараметрыВнешнейСистемы.ChannelId+"}).items;
		|var i = 0;
		|while (i < servers.length) {
		|	if (servers[i].url == """+АдресПодключения+""") {
		|		API.groups.deleteCallbackServer({""group_id"":"+ПараметрыВнешнейСистемы.ChannelId+",""server_id"":servers[i].id});
		|	}
		|	i = i + 1;
		|}
		|var new_server_id = API.groups.addCallbackServer({""group_id"":"+ПараметрыВнешнейСистемы.ChannelId+",""url"":"""+АдресПодключения+""",""title"":""1С-Вебхуки""});
		|return API.groups.setCallbackSettings({""group_id"":"+ПараметрыВнешнейСистемы.ChannelId+",""server_id"":new_server_id,""api_version"":5.124,""message_new"":1,""message_reply"":1,""message_allow"":1,""message_edit"":1,""message_deny"":1});";

		HTTPЗапрос = Новый HTTPЗапрос("method/execute?code="+КодироватьСтроку(КодДляИсполнения, СпособКодированияСтроки.КодировкаURL)+"&access_token="+ПараметрыВнешнейСистемы.ApiToken+"&v=5.124");
		
		РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
		
		ВыполненоУспешно = РезультатЗапроса.response = 1;
		
	Исключение
	КонецПопытки;
	
	Возврат ВыполненоУспешно;
	
КонецФункции

// Функция, отправляет сообщение VkApi.
//
Функция VkApi_ОтправитьСообщение(ТекстСообщения, ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложения = Неопределено) Экспорт
	
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		ГСЧ = Новый ГенераторСлучайныхЧисел;
		random_id = ФорматироватьИдентификатор(ГСЧ.СлучайноеЧисло());
		ИдКлиента = ПараметрыКлиента.ИдКлиента;
		
		АдресаЗагруженныхВложений = Новый Массив;
		Если ЗначениеЗаполнено(Вложения) Тогда
			ВложенияДляОтправки = ПреобразоватьВложенияVkApi(ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложения, АдресаЗагруженныхВложений);
		Иначе
			ВложенияДляОтправки = "";
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Вложения) И ВложенияДляОтправки = "" Тогда
			Возврат Новый Структура("ВыполненоУспешно, ОписаниеОшибки", Ложь, "Не удалось загрузить файл, сообщение не отправлено.");
		КонецЕсли;	
		
		HTTPЗапрос = Новый HTTPЗапрос("/method/messages.send?peer_id="+ИдКлиента+"&random_id="+random_id+"&message="+ТекстСообщения+"&attachment="+ВложенияДляОтправки+"&access_token="+ПараметрыВнешнейСистемы.ApiToken+"&v=5.124");
		
		РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
		
		Если РезультатЗапроса.Свойство("response") Тогда
			
			ИдСообщения = РезультатЗапроса.response;
			ИдСообщения = ?(ТипЗнч(ИдСообщения) = Тип("Число"), Формат(ИдСообщения, "ЧГ="), ИдСообщения);
			ИдСообщения = СокрЛП(ИдСообщения);
			
			РезультатОперации = Новый Структура();
			РезультатОперации.Вставить("ВыполненоУспешно", Истина);
			РезультатОперации.Вставить("ИдСообщения"     , ИдСообщения);
			РезультатОперации.Вставить("ИдКанала"     	 , "");
			
			Если АдресаЗагруженныхВложений.Количество() > 0 Тогда
				РезультатОперации.Вставить("Вложения", СтрСоединить(АдресаЗагруженныхВложений, "|"));
			КонецЕсли;
			
		Иначе
			РезультатОперации = Новый Структура;	
			РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
			Если РезультатЗапроса.Свойство("error") Тогда
				Если РезультатЗапроса.error.Свойство("error_msg") Тогда
					РезультатОперации.Вставить("ОписаниеОшибки", РезультатЗапроса.error.error_msg);
				ИначеЕсли РезультатЗапроса.error.Свойство("error_code")	Тогда
					РезультатОперации.Вставить("ОписаниеОшибки", "Ошибка отправки. Код ошибки " + РезультатЗапроса.error.error_code);
				КонецЕсли;
			Иначе
				РезультатОперации.Вставить("ОписаниеОшибки", "Неизвестная ошибка отправки.");
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		РезультатОперации = Новый Структура;
		РезультатОперации.Вставить("ВыполненоУспешно", Ложь);
		РезультатОперации.Вставить("ОписаниеОшибки"	 , "Ошибка соединения " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Функция, преобразовывает файлы для отправки во вложения ВК.
//
Функция ПреобразоватьВложенияVkApi(ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложения, АдресаЗагруженныхВложений)
	
	Если Не ЗначениеЗаполнено(Вложения) Тогда
		Возврат "";
	КонецЕсли;
	
	ВложенияСтрокой = "";
		
	Для Каждого Вложение Из Вложения Цикл
		ВложенияСтрокой = ВложенияСтрокой + ПолучитьВложениеVkApi(ПараметрыКлиента, ПараметрыВнешнейСистемы, Вложение, АдресаЗагруженныхВложений) + ",";
	КонецЦикла;
	
	Возврат ?(СокрЛП(ВложенияСтрокой) = ",", "", ВложенияСтрокой);
	
КонецФункции

// Функция, загружает файл в ВК и возвращает вложение ВК строкой для последующей отправки.
//
Функция ПолучитьВложениеVkApi(ПараметрыКлиента, ПараметрыВнешнейСистемы, Файл, АдресаЗагруженныхВложений)
	
	Попытка
		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыВнешнейСистемы.UrlApi,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		HTTPЗапрос = Новый HTTPЗапрос("/method/docs.getMessagesUploadServer?peer_id="+ПараметрыКлиента.ИдКлиента+"&access_token="+ПараметрыВнешнейСистемы.ApiToken+"&v=5.124");
		
		РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
		
		Если РезультатЗапроса.Свойство("error") Тогда
			Возврат "";
		КонецЕсли;	
		
		АдресРесурса = Сред(РезультатЗапроса.response.upload_url, СтрНайти(РезультатЗапроса.response.upload_url, "/",,, 3));
		АдресСервера = Сред(СтрЗаменить(РезультатЗапроса.response.upload_url, АдресРесурса, ""), СтрНайти(РезультатЗапроса.response.upload_url, "/",,, 2) + 1);
		
		HTTPСоединениеСерверЗагрузки = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Разделитель = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(СформироватьMultipartFormData(Разделитель, Файл, "file"));
		
		РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединениеСерверЗагрузки.ОтправитьДляОбработки(HTTPЗапрос).ПолучитьТелоКакСтроку());
		
		Если РезультатЗапроса.Свойство("error") Тогда
			Возврат "";
		КонецЕсли;	
		
		HTTPЗапрос = Новый HTTPЗапрос("/method/docs.save?file="+РезультатЗапроса.file+"&title="+Файл.ИмяФайла+"&access_token="+ПараметрыВнешнейСистемы.ApiToken+"&v=5.124");
		
		РезультатЗапроса = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
		
		Если РезультатЗапроса.Свойство("error") Тогда
			Возврат "";
		КонецЕсли;
		
		АдресаЗагруженныхВложений.Добавить(РезультатЗапроса.response.doc.url);
		Возврат "doc" + Формат(РезультатЗапроса.response.doc.owner_id, "ЧГ=") + "_" + Формат(РезультатЗапроса.response.doc.id, "ЧГ=");
		
	Исключение
		Возврат "";
	КонецПопытки;	
	
КонецФункции

// Функция, формирует тело HTTP-запроса и возвращает его как двоичные данные.
//
Функция СформироватьMultipartFormData(Разделитель, Файл, ИмяПараметраФайла = "file", ПараметрыЗапроса = Неопределено)
	
	ДвоичныеДанныеФайла = Base64Значение(Сред(Файл.ДанныеФайла, СтрНайти(Файл.ДанныеФайла, ",") + 1));
	
	НачальнаяПозиция = СтрНайти(Файл.ДанныеФайла, ":") + 1;
	КонечнаяПозиция = СтрНайти(Файл.ДанныеФайла, ";");
	
	ТипMIME = Сред(Файл.ДанныеФайла, НачальнаяПозиция, КонечнаяПозиция - НачальнаяПозиция);
	
	Поток = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(Поток, "UTF-8",, Символы.ПС);
	Если ТипЗнч(ПараметрыЗапроса) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение Из ПараметрыЗапроса Цикл
			
			ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
			ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""" + КлючИЗначение.Ключ + """");
			ЗаписьДанных.ЗаписатьСтроку("");
			ЗаписьДанных.ЗаписатьСтроку(КлючИЗначение.Значение);
			
		КонецЦикла;
	КонецЕсли;	
	ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""" + ИмяПараметраФайла + """; filename=""" + Файл.ИмяФайла + """");
	ЗаписьДанных.ЗаписатьСтроку("Content-Type:" + ТипMIME);
	ЗаписьДанных.ЗаписатьСтроку("");
	ЗаписьДанных.Записать(ДвоичныеДанныеФайла);
	ЗаписьДанных.ЗаписатьСтроку("");
	ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель + "--");
	ЗаписьДанных.Закрыть();
	
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

// Функция - Собрать параметры JSON.
//
Функция СобратьJson(СтруктураДанных) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

// Функция - Разобрать параметры JSON.
//
Функция РазобратьJson(Запрос) Экспорт
	
	Попытка
		
		ТекстJSON  = Запрос.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		
		Возврат ПрочитатьJSON(ЧтениеJSON);
		
	Исключение
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка: %1. Код состояния: %2. Исходный текст JSON: %3';en= 'Error: %1. Code response: %2. Source text JSON: %3'"), ОписаниеОшибки(), Запрос.КодСостояния, ТекстJSON);
		
	КонецПопытки;

КонецФункции

// Функция - Получить внешний IP-Адрес.
// 
Функция ПолучитьВнешнийIPАдрес() Экспорт
	
	IPАдрес = "";
	
	Попытка
		
		// http:// ip-api.com/json/
		Соединение = Новый HTTPСоединение("ip-api.com");
		HTTPЗапрос = Новый HTTPЗапрос("json");				
		
		РезультатЗапроса = Соединение.Получить(HTTPЗапрос);
		РезультатЗапроса = РазобратьJson(РезультатЗапроса);
		
		Если РезультатЗапроса.Свойство("status") И РезультатЗапроса.status = "success"
			И РезультатЗапроса.Свойство("query") И ЗначениеЗаполнено(РезультатЗапроса.query) Тогда
			
			IPАдрес = РезультатЗапроса.query
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат IPАдрес;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция, возвращает число строкой без разделителей разрядов.
//
Функция ФорматироватьИдентификатор(Идентификатор)
	
	Возврат Формат(Число(Идентификатор), "ЧГ=");
	
КонецФункции

// Процедура - Перезаполнить фото и наименования клиентов в фоне
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  UrlApi			 - 	 - 
//  ApiToken		 - 	 - 
//  ChannelId		 - 	 - 
//
Процедура ЗаполнитьИсториюСообщенийВФоне(ВнешняяСистема, UrlApi, ApiToken, ChannelId) Экспорт
	
	ПараметрыДанных = Новый Структура("ВнешняяСистема, UrlApi, ApiToken, ChannelId", ВнешняяСистема, UrlApi, ApiToken, ChannelId);
	
	УИДФоновогоЗадания = Новый УникальныйИдентификатор;
	мПараметры = Новый Массив;
	мПараметры.Добавить(УИДФоновогоЗадания);
	мПараметры.Добавить(ПараметрыДанных);
	
	ФоновыеЗадания.Выполнить("МессенджерСтоматология.ЗаполнитьИсториюСообщенийФоновое", мПараметры, УИДФоновогоЗадания, "Заполнить историю сообщений для мессенджера");
	
КонецПроцедуры

// Процедура - Перезаполнить фото и наименования клиентов фоновое
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
//
Процедура ЗаполнитьИсториюСообщенийФоновое(УИДФоновогоЗадания, СтруктураПараметров) Экспорт
	
	ВнешняяСистема	 = СтруктураПараметров.ВнешняяСистема;
	UrlApi			 = СтруктураПараметров.UrlApi;
	ApiToken		 = СтруктураПараметров.ApiToken;
	ChannelId		 = СтруктураПараметров.ChannelId;
	
	ТипВнешнейСистемы = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВнешняяСистема, "ТипВнешнейСистемы");
	
	Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		ЗаполнитьИсториюСообщенийGreenApi(ВнешняяСистема, UrlApi, ApiToken, ChannelId);
		
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.VkontakteApi Тогда
		ЗаполнитьИсториюСообщенийVK(ВнешняяСистема, UrlApi, ApiToken, ChannelId);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, заполняет историю сообщений VK.
//
Процедура ЗаполнитьИсториюСообщенийVK(ВнешняяСистема, Сервер, ТокенДоступа, ИдСообщества)
	
	МассивДанныхКонтактов = Новый Массив;
	МассивДанныхСообщений = Новый Массив;
	
	РазмерПорции = 15;
	
	HTTPСоединение = Новый HTTPСоединение(Сервер,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	КодДляИсполнения = 
	"var conversations = API.messages.getConversations({""group_id"":"+ИдСообщества+",""count"":"+РазмерПорции+"});
	|var user_ids = conversations.items@.conversation@.peer@.id;
	|var dialogs = [];
	|var i = 0;
	|while (i < conversations.items.length) {
	|	dialogs.push(API.messages.getHistory({""count"":50,""group_id"":"+ИдСообщества+",""user_id"":user_ids[i]}));
	|	i = i %2b 1;
	|}
	|return {""dialogs"":dialogs,""conversations"":conversations,""user_data"":API.users.get({""user_ids"":user_ids,""fields"":""photo_200""})};";
	
	HTTPЗапрос = Новый HTTPЗапрос("/method/execute?code="+КодДляИсполнения+"&access_token="+ТокенДоступа+"&v=5.124");
	
	СтруктураОтвета = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
	
	Если СтруктураОтвета.Свойство("error") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заполнить контакты мессенджера в фоне.");
		Возврат;
	КонецЕсли;
	
	МассивДанныхСообщений.Добавить(СтруктураОтвета.response.dialogs);
	МассивДанныхКонтактов.Добавить(СтруктураОтвета.response.user_data);
	
	КоличествоБесед = СтруктураОтвета.response.conversations.count;
	
	Счетчик = РазмерПорции;
	СчетчикОшибок = 0;
	
	Попытка
	
		Пока Счетчик < КоличествоБесед Цикл
			
			КодДляИсполнения = 
			"var conversations = API.messages.getConversations({""group_id"":"+ИдСообщества+",""count"":"+РазмерПорции+",""offset"":"+Счетчик+"});
			|var user_ids = conversations.items@.conversation@.peer@.id;
			|var dialogs = [];
			|var i = 0;
			|while (i < conversations.items.length) {
			|	dialogs.push(API.messages.getHistory({""count"":20,""group_id"":"+ИдСообщества+",""user_id"":user_ids[i]}));
			|	i = i %2b 1;
			|}
			|return {""dialogs"":dialogs,""conversations"":conversations,""user_data"":API.users.get({""user_ids"":user_ids,""fields"":""photo_200""})};";
			
			HTTPЗапрос = Новый HTTPЗапрос("/method/execute?code="+КодДляИсполнения+"&access_token="+ТокенДоступа+"&v=5.124");
			
			СтруктураОтвета = ДекодироватьИзJSON(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакСтроку());
			
			Если СтруктураОтвета.Свойство("error") Тогда
				СчетчикОшибок = СчетчикОшибок + 1;
				Если СчетчикОшибок > 5 Тогда
					Прервать;
				Иначе
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
			МассивДанныхСообщений.Добавить(СтруктураОтвета.response.dialogs);
			МассивДанныхКонтактов.Добавить(СтруктураОтвета.response.user_data);
			
			Счетчик = Счетчик + РазмерПорции;
			
		КонецЦикла;
	
	Исключение
	КонецПопытки;	
	
	ПоправкаВремени = ТекущаяДатаСеанса() - ТекущаяДата();
	
	Контакты = РегистрыСведений.КонтактыМессенджеров.СоздатьНаборЗаписей();
	Контакты.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	
	Для Каждого Порция Из МассивДанныхКонтактов Цикл
		Для Каждого ДанныеПользователя Из Порция Цикл
			
			НоваяЗапись = Контакты.Добавить();
			
			НоваяЗапись.Идентификатор		 = Формат(ДанныеПользователя.id, "ЧГ=");
			НоваяЗапись.ВнешняяСистема		 = ВнешняяСистема;			
			НоваяЗапись.НаименованиеКлиента	 = ДанныеПользователя.first_name + " " + ДанныеПользователя.last_name;
			НоваяЗапись.ФотоКлиента			 = ДанныеПользователя.photo_200;
			
			ДиалогКонтакта = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
			ДиалогКонтакта.ИдДиалога		 = Строка(Новый УникальныйИдентификатор);
			ДиалогКонтакта.ИдКлиента		 = Формат(ДанныеПользователя.id, "ЧГ=");
			ДиалогКонтакта.ВнешняяСистема	 = ВнешняяСистема;
			ДиалогКонтакта.Начало			 = Дата(2022, 1, 1);
			ДиалогКонтакта.Окончание		 = Дата(2022, 1, 1);
			
			ДиалогКонтакта.Записать();
			
		КонецЦикла;
	КонецЦикла;	
	
	Попытка
		Контакты.Записать();
	Исключение
	КонецПопытки;
		
	Сообщения = РегистрыСведений.ЖурналСообщений.СоздатьНаборЗаписей();
	Сообщения.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	
	Для Каждого Порция Из МассивДанныхСообщений Цикл
		Для Каждого ДанныеСообщений Из Порция Цикл
			Для Каждого ДанныеСообщения Из ДанныеСообщений.items Цикл
				
				НоваяЗапись = Сообщения.Добавить();
				
				НоваяЗапись.ИдКлиента			 = Формат(ДанныеСообщения.peer_id, "ЧГ=");
				НоваяЗапись.ИдСообщения			 = Формат(ДанныеСообщения.id, "ЧГ=");
				НоваяЗапись.ИдКанала			 = ИдСообщества;
				НоваяЗапись.ТекстСообщения		 = ДанныеСообщения.text;
				НоваяЗапись.Прочитано			 = Истина;
				НоваяЗапись.Мессенджер			 = Перечисления.Мессенджеры.vk;
				НоваяЗапись.СообщениеОтКлиента	 = Не Булево(ДанныеСообщения.out);
				НоваяЗапись.Период				 = Дата(1970,1,1) + ПоправкаВремени + ДанныеСообщения.date;
				НоваяЗапись.ДатаСообщения		 = Дата(1970,1,1) + ПоправкаВремени + ДанныеСообщения.date;
				НоваяЗапись.ВнешняяСистема		 = ВнешняяСистема;
				
				Если ДанныеСообщения.attachments.Количество() > 0 Тогда
					
					НоваяЗапись.Изображение	 = ?(ДанныеСообщения.attachments[0].type = "sticker", ДанныеСообщения.attachments[0].sticker.images[ДанныеСообщения.attachments[0].sticker.images.ВГраница()].url, Неопределено);
					НоваяЗапись.Аудио		 = ?(ДанныеСообщения.attachments[0].type = "audio_message", ДанныеСообщения.attachments[0].audio_message.link_mp3, Неопределено);
					
					Если Не ЗначениеЗаполнено(НоваяЗапись.Изображение) И Не ЗначениеЗаполнено(НоваяЗапись.Аудио) Тогда
						
						МассивВложений = Новый Массив;
						Для Каждого Вложение Из ДанныеСообщения.attachments Цикл
							
							ДанныеВложения = Вложение[Вложение.type];
							Если Вложение.type <> "video" Тогда
								МассивВложений.Добавить(?(Вложение.type = "photo", ДанныеВложения.sizes[ДанныеВложения.sizes.ВГраница()].url, ДанныеВложения.url));
							КонецЕсли;
							
						КонецЦикла;
						
						НоваяЗапись.PDF = СтрСоединить(МассивВложений, "|");
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
	
	Попытка
		Сообщения.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Процедура, заполняет историю сообщений WhatsApp.
//
Процедура ЗаполнитьИсториюСообщенийGreenApi(ВнешняяСистема, UrlApi, ApiToken, ChannelId)
	
	Попытка
		
		Сервер	= UrlApi;
		Таймаут	= 5;
		
		Соединение = Новый HTTPСоединение(Сервер,,,,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		
		АдресРесурса = "/waInstance" + ChannelId + "/GetContacts/" + ApiToken;
		
		Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		
		Ответ			 = Соединение.Получить(Запрос);
		ТелоОтвета		 = Ответ.ПолучитьТелоКакСтроку();
		СтруктураОтвета	 = ДекодироватьИзJSON(ТелоОтвета);
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации(
			"ЗагрузкаКонтактовWhatsApp",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ВнешниеСистемы,
			ВнешняяСистема,
			"Не удалось загрузить контакты WhatsApp. Описание ошибки: " + ОписаниеОшибки + ?(ТелоОтвета = Неопределено, "", Символы.ПС + "Ответ сервера: " + ТелоОтвета)
		);
		
		Возврат;
		
	КонецПопытки;
	
	// Могут попадаться повторяющиеся контакты.
	ОбработанныеКонтакты = Новый Массив;
	
	Для Каждого ДанныеКонтакта Из СтруктураОтвета Цикл
		
		Если ОбработанныеКонтакты.Найти(ДанныеКонтакта.id) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеКонтакта.type = "group" Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			Сервер	= "api.green-api.com";
			Таймаут	= 5;
			
			Соединение = Новый HTTPСоединение(Сервер,,,,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type", "application/json");
			
			АдресРесурса = "/waInstance" + ChannelId + "/GetChatHistory/" + ApiToken;
			
			Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("chatId"	, ДанныеКонтакта.id);
			ПараметрыЗапроса.Вставить("count"	, 20);
			
			ТелоЗапроса = КодироватьВJSON(ПараметрыЗапроса);
			
			Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
			
			Ответ			 = Соединение.ОтправитьДляОбработки(Запрос);
			ТелоОтвета		 = Ответ.ПолучитьТелоКакСтроку();
			ДанныеСообщений	 = ДекодироватьИзJSON(ТелоОтвета);
			
		Исключение
			ОписаниеОшибки	 = ОписаниеОшибки();
			ДанныеСообщений	 = Новый Массив;
			
		КонецПопытки;
		
		
		НачатьТранзакцию();
		Попытка
			
			Диалог					 = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
			Диалог.ВнешняяСистема	 = ВнешняяСистема;
			Диалог.ИдКлиента		 = ДанныеКонтакта.id;
			Диалог.ИдДиалога		 = Строка(Новый УникальныйИдентификатор);
			Диалог.Начало			 = Дата(2022, 1 ,1);
			Диалог.Окончание		 = Дата(2022, 1 ,1);
			
			НомерТелефона = УправлениеКонтактнойИнформациейСтоматология.ВернутьТелефонТолькоЦифрами(ДанныеКонтакта.id);
			
			КонтактМессенджера						 = РегистрыСведений.КонтактыМессенджеров.СоздатьМенеджерЗаписи();
			КонтактМессенджера.ВнешняяСистема		 = ВнешняяСистема;
			КонтактМессенджера.Идентификатор		 = ДанныеКонтакта.id;
			КонтактМессенджера.НаименованиеКлиента	 = ДанныеКонтакта.name;
			КонтактМессенджера.ИдПоследнегоДиалога	 = Диалог.ИдДиалога;
			КонтактМессенджера.НомерМессенджера		 = НомерТелефона;
			КонтактМессенджера.НаименованиеКлиента	 = ?(
				ЗначениеЗаполнено(КонтактМессенджера.НаименованиеКлиента),
				КонтактМессенджера.НаименованиеКлиента,
				НомерТелефона
			);
			
			Сообщения = РегистрыСведений.ЖурналСообщений.СоздатьНаборЗаписей();
			Сообщения.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
			Сообщения.Отбор.ИдКлиента.Установить(ДанныеКонтакта.id);
			
			Если ТипЗнч(ДанныеСообщений) = Тип("Массив") Тогда
				
				Для Каждого ДанныеСообщения Из ДанныеСообщений Цикл
					
					Если ДанныеСообщения.typeMessage = "textMessage" Тогда
						ТекстСообщения = ДанныеСообщения.textMessage;
						
					ИначеЕсли ДанныеСообщения.typeMessage = "extendedTextMessage" Тогда
						ТекстСообщения = ДанныеСообщения.extendedTextMessage.text;
						
					ИначеЕсли ДанныеСообщения.typeMessage = "imageMessage" Тогда
						ТекстСообщения	 = ?(ДанныеСообщения.Свойство("caption"), ДанныеСообщения.caption, "");
						Изображение		 = ДанныеСообщения.downloadUrl;
						
					ИначеЕсли ДанныеСообщения.typeMessage = "videoMessage" Тогда
						ТекстСообщения	 = ?(ДанныеСообщения.Свойство("caption"), ДанныеСообщения.caption, "");
						PDF				 = ДанныеСообщения.downloadUrl;
						
					ИначеЕсли ДанныеСообщения.typeMessage = "documentMessage" Тогда
						ТекстСообщения	 = ?(ДанныеСообщения.Свойство("caption"), ДанныеСообщения.caption, "");
						PDF				 = ДанныеСообщения.downloadUrl;
						
					ИначеЕсли ДанныеСообщения.typeMessage = "audioMessage" Тогда
						ТекстСообщения	 = ?(ДанныеСообщения.Свойство("caption"), ДанныеСообщения.caption, "");
						Аудио			 = ДанныеСообщения.downloadUrl;
						
					Иначе
						Продолжить;
						
					КонецЕсли;
					
					ОтметкаВремени	 = ДанныеСообщений.timestamp;
					ПоправкаВремени	 = ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата();
					
					ДатаСообщения = Дата(1970, 1, 1) + ОтметкаВремени + ПоправкаВремени;
					
					Сообщение					 = Сообщения.Добавить();
					Сообщение.ИдСообщения		 = ДанныеСообщения.idMessage;
					Сообщение.ВнешняяСистема	 = ВнешняяСистема;
					Сообщение.ИдКлиента			 = ДанныеКонтакта.id;
					Сообщение.Период			 = ДатаСообщения;
					Сообщение.ДатаСообщения		 = ДатаСообщения;
					Сообщение.ИдДиалога			 = Диалог.ИдДиалога;
					Сообщение.Мессенджер		 = Перечисления.Мессенджеры.whatsapp;
					Сообщение.СообщениеОтКлиента = (ДанныеСообщения.type = "incoming");
					Сообщение.Прочитано			 = Истина;
					Сообщение.ТекстСообщения	 = ТекстСообщения;
					Сообщение.Изображение		 = Изображение;
					Сообщение.PDF				 = PDF;
					Сообщение.Аудио				 = Аудио;

				КонецЦикла;
				
			КонецЕсли;
			
			Если Сообщения.Количество() = 0 Тогда
				ПустоеСообщение						 = Сообщения.Добавить();
				ПустоеСообщение.ИдСообщения			 = Строка(Новый УникальныйИдентификатор);
				ПустоеСообщение.ВнешняяСистема		 = ВнешняяСистема;
				ПустоеСообщение.ИдКлиента			 = ДанныеКонтакта.id;
				ПустоеСообщение.Период				 = Дата(2022, 1, 1);
				ПустоеСообщение.ДатаСообщения		 = Дата(2022, 1, 1);
				ПустоеСообщение.ИдДиалога			 = Диалог.ИдДиалога;
				ПустоеСообщение.Мессенджер			 = Перечисления.Мессенджеры.whatsapp;
				ПустоеСообщение.СообщениеОтКлиента	 = Ложь;
				ПустоеСообщение.Прочитано			 = Истина;
				ПустоеСообщение.ОжиданиеСообщения	 = Истина;
			КонецЕсли;
			
			Диалог.Записать();
			Сообщения.Записать();
			КонтактМессенджера.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
		КонецПопытки;
		
		ОбработанныеКонтакты.Добавить(ДанныеКонтакта.id);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Перезаполнить фото и наименования клиентов в фоне
//
// Параметры:
//  ВнешняяСистема	 - 	 - 
//  UrlApi			 - 	 - 
//  ApiToken		 - 	 - 
//  ChannelId		 - 	 - 
//
Процедура ПерезаполнитьФотоИНаименованияКлиентовВФоне(ВнешняяСистема, UrlApi, ApiToken, ChannelId) Экспорт
	
	ПараметрыДанных = Новый Структура("ВнешняяСистема, UrlApi, ApiToken, ChannelId", ВнешняяСистема, UrlApi, ApiToken, ChannelId);
	
	УИДФоновогоЗадания = Новый УникальныйИдентификатор;
	мПараметры = Новый Массив;
	мПараметры.Добавить(УИДФоновогоЗадания);
	мПараметры.Добавить(ПараметрыДанных);
	
	ФоновыеЗадания.Выполнить("МессенджерСтоматология.ПерезаполнитьФотоИНаименованияКлиентовФоновое", мПараметры, УИДФоновогоЗадания, "Перезаполнить фото и наименования клиентов для мессенджера");
	
КонецПроцедуры

// Процедура - Перезаполнить фото и наименования клиентов фоновое
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
//
Процедура ПерезаполнитьФотоИНаименованияКлиентовФоновое(УИДФоновогоЗадания, СтруктураПараметров) Экспорт
	
	РегистрыСведений.КонтактыМессенджеров.ПерезаполнитьФотоИНаименованияКлиентов(СтруктураПараметров.ВнешняяСистема, СтруктураПараметров.UrlApi, СтруктураПараметров.ApiToken, СтруктураПараметров.ChannelId);
	
КонецПроцедуры

// Процедура, оповещает сотрудников о новом сообщении.
//
Процедура ОповеститьСотрудниковОНовомСообщении(
	ИдСообщения		 = Неопределено,
	ТексСообщения	 = Неопределено,
	ИдКлиента		 = Неопределено,
	Оператор		 = Неопределено,
	ВнешняяСистема	 = Неопределено)
	
	// Создаем оповещение других сеансов.
	УстановитьПривилегированныйРежим(Истина);
	
	ИдКонтакта = ИдКлиента + "_" + ВнешняяСистема.УникальныйИдентификатор();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ИдСообщения);
	МассивПараметров.Добавить(Неопределено);
	МассивПараметров.Добавить(Неопределено);
	МассивПараметров.Добавить(ИдКонтакта);
	МассивПараметров.Добавить(Неопределено);
	
	ТекущиеСеансы = ПолучитьСеансыИнформационнойБазы();
    НомерТекущегоСеанса = НомерСеансаИнформационнойБазы();
	
	ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
	ПользователиОповещения = Новый Массив;
	
	Для Каждого ТекущийСеанс Из ТекущиеСеансы Цикл
		
		Если НомерТекущегоСеанса = ТекущийСеанс.НомерСеанса Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущийСеанс.ИмяПриложения = "1CV8C" ИЛИ ТекущийСеанс.ИмяПриложения = "WebClient" Тогда
			
			РолиПользователя = ТекущийСеанс.Пользователь.Роли;
			
			Если РолиПользователя.Содержит(Метаданные.Роли.ИспользованиеМессенджера)
				ИЛИ РолиПользователя.Содержит(Метаданные.Роли.ПолныеПрава)
				ИЛИ РолиПользователя.Содержит(Метаданные.Роли.АдминистраторСистемы) Тогда
				
				Если ИспользоватьСистемуВзаимодействия = Истина Тогда
					ПользователиОповещения.Добавить(ТекущийСеанс.Пользователь);
				Иначе
					РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(ТекущийСеанс.НомерСеанса,, "НовоеСообщениеМессенджер", ТекущаяДатаСеанса(), 60,,, МассивПараметров);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ИспользоватьСистемуВзаимодействия = Истина И ПользователиОповещения.Количество() > 0 Тогда
		
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("Ключ"				, "НовоеСообщениеМессенджер");
		ДанныеСообщения.Вставить("IDСообщения"		, ИдСообщения);
		ДанныеСообщения.Вставить("IDКлиента"		, ИдКонтакта);
		
		ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения,, ПользователиОповещения);
		
	КонецЕсли;	
	
КонецПроцедуры

// Функция, возвращает параметры объекта идентификации.
//
Функция ПолучитьПараметрыОбъектаИдентификации(ОбъектИдентификации, ВнешняяСистема) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактыМессенджеров.Идентификатор КАК ИдКлиента
	|ИЗ
	|	РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|ГДЕ
	|	КонтактыМессенджеров.ВнешняяСистема = &ВнешняяСистема
	|	И КонтактыМессенджеров.ОбъектИдентификации = &ОбъектИдентификации
	|	И &УсловиеПоиска
	|	И НЕ КонтактыМессенджеров.НеУчаствоватьВРассылке");
	
	Запрос.УстановитьПараметр("ОбъектИдентификации", ОбъектИдентификации);
	Запрос.УстановитьПараметр("ВнешняяСистема"     , ВнешняяСистема);
	
	УсловиеПоиска = ?(ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi, "И КонтактыМессенджеров.Идентификатор ПОДОБНО ""%@c.us""", "");
	Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И &УсловиеПоиска", УсловиеПоиска);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Новый Структура("ИдКлиента", Выборка.ИдКлиента), Неопределено);
	
КонецФункции

&НаСервере
// Процедура, возвращает ид "ожидающего" сообщения в мессенджер.
//
Функция ПолучитьИдОжидающегоСообщенияВМесенджер(ИдКлиента, ВнешняяСистема) Экспорт
	
	ПоследнееСообщение = ПолучитьПоследнееСообщениеКлиента(ИдКлиента, ВнешняяСистема);
	
	Если ПоследнееСообщение = Неопределено Тогда
		
		ПоследнееСообщение = Новый Структура;
		ПоследнееСообщение.Вставить("ИдКлиента"		, ИдКлиента);
		ПоследнееСообщение.Вставить("ВнешняяСистема", ВнешняяСистема);
		ПоследнееСообщение.Вставить("Мессенджер"	, Перечисления.Мессенджеры.whatsapp);
		
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ЖурналСообщений.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПоследнееСообщение);
	
	ТекДата     = ТекущаяДатаСеанса();
	ИдСообщения = Строка(Новый УникальныйИдентификатор());
	ИдДиалога	= РегистрыСведений.Диалоги.ПолучитьТекущийДиалог(
		ИдКлиента,
		ВнешняяСистема,
		// ПараметрыСеанса.ТекущийПользователь.Сотрудник, - не передаем пользователя чтобы не открывался новый диалог.
		Неопределено,
		ТекДата,
		Ложь,
		МенеджерЗаписи.Мессенджер
	);
	
	МенеджерЗаписи.Период             = ТекДата;
	МенеджерЗаписи.ДатаСообщения      = ТекДата;
	МенеджерЗаписи.ТекстСообщения     = "";
	МенеджерЗаписи.СообщениеОтКлиента = Ложь;
	МенеджерЗаписи.Триггер            = Ложь;
	МенеджерЗаписи.ОжиданиеСообщения  = Истина;
	МенеджерЗаписи.ИдСообщения        = ИдСообщения;
	МенеджерЗаписи.Изображение        = Неопределено;
	МенеджерЗаписи.Аудио              = Неопределено;
	МенеджерЗаписи.PDF                = Неопределено;
	МенеджерЗаписи.ИдДиалога		  = ИдДиалога;
	
	МенеджерЗаписи.Записать();
	
	Возврат ИдСообщения;
	
КонецФункции	

// Фкнция, возвращает последнее сообщение клиента.
//
Функция ПолучитьПоследнееСообщениеКлиента(ИдКлиента, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЖурналСообщений.Период КАК Период,
	|	ЖурналСообщений.ВнешняяСистема КАК ВнешняяСистема,
	|	ЖурналСообщений.ИдКлиента КАК ИдКлиента,
	|	ЖурналСообщений.ИдСообщения КАК ИдСообщения,
	|	ЖурналСообщений.ТекстСообщения КАК ТекстСообщения,
	|	ЖурналСообщений.ИдОператора КАК ИдОператора,
	|	ЖурналСообщений.Мессенджер КАК Мессенджер,
	|	ЖурналСообщений.ДатаСообщения КАК ДатаСообщения,
	|	ЖурналСообщений.ИдКанала КАК ИдКанала,
	|	ЖурналСообщений.СообщениеОтКлиента КАК СообщениеОтКлиента,
	|	ЖурналСообщений.ОператорСообщения КАК ОператорСообщения,
	|	ЖурналСообщений.Изображение КАК Изображение,
	|	ЖурналСообщений.Аудио КАК Аудио,
	|	ЖурналСообщений.PDF КАК PDF,
	|	ЖурналСообщений.Прочитано КАК Прочитано,
	|	ЖурналСообщений.Триггер КАК Триггер,
	|	ЖурналСообщений.ИдНаписавшегоВГруппу КАК ИдНаписавшегоВГруппу,
	|	ЖурналСообщений.ОжиданиеСообщения КАК ОжиданиеСообщения
	|ИЗ
	|	РегистрСведений.ЖурналСообщений КАК ЖурналСообщений
	|ГДЕ
	|	ЖурналСообщений.ИдКлиента = &ИдКлиента
	|	И ЖурналСообщений.ВнешняяСистема = &ВнешняяСистема
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЖурналСообщений.Период УБЫВ");
	
	Запрос.УстановитьПараметр("ИдКлиента"     , ИдКлиента);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка, Неопределено);
	
КонецФункции

// Возвращает иконку мессенджера.
//
Функция ПолучитьИконкуМессенджера(Мессенджер) Экспорт
	
	Если Мессенджер = Перечисления.Мессенджеры.facebook Тогда
		Возврат БиблиотекаКартинок.Пустая;
	ИначеЕсли Мессенджер = Перечисления.Мессенджеры.instagram Тогда
		Возврат БиблиотекаКартинок.Пустая;
	ИначеЕсли Мессенджер = Перечисления.Мессенджеры.ok Тогда
		Возврат БиблиотекаКартинок.Пустая;
	ИначеЕсли Мессенджер = Перечисления.Мессенджеры.skype Тогда
		Возврат БиблиотекаКартинок.Skype;
	ИначеЕсли Мессенджер = Перечисления.Мессенджеры.telegram Тогда
		Возврат БиблиотекаКартинок.Telegram;
	ИначеЕсли Мессенджер = Перечисления.Мессенджеры.viber Тогда
		Возврат БиблиотекаКартинок.Viber;
	ИначеЕсли Мессенджер = Перечисления.Мессенджеры.vk Тогда
		Возврат БиблиотекаКартинок.Vk;
	ИначеЕсли Мессенджер = Перечисления.Мессенджеры.whatsapp Тогда
		Возврат БиблиотекаКартинок.Whatsapp;
	КонецЕсли;
	
	Возврат БиблиотекаКартинок.Пустая;
	
КонецФункции

// Процедура, оповещает сотрудника мессенджера о событии.
//
Процедура ОповеститьСотрудникаМессенджера(Оператор, Ключ, ИдКлиента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ИдКлиента);
	
	ТекущиеСеансы = ПолучитьСеансыИнформационнойБазы();
	
	ИдентификаторПользователяИБ = Оператор.ИдентификаторПользователяИБ;
	
	ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
	
	Для Каждого ТекущийСеанс Из ТекущиеСеансы Цикл
		
		Если (ТекущийСеанс.ИмяПриложения = "1CV8C" ИЛИ ТекущийСеанс.ИмяПриложения = "WebClient")
			И ТекущийСеанс.Пользователь.УникальныйИдентификатор = ИдентификаторПользователяИБ Тогда
			
			Если ИспользоватьСистемуВзаимодействия = Истина Тогда

				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("Ключ"		, Ключ);
				ДанныеСообщения.Вставить("IDКлиента", ИдКлиента);
								
				ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, Оператор);
				
			Иначе
				РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(Оператор,, Ключ, ТекущаяДатаСеанса(), 60,,, МассивПараметров);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла
		
КонецПроцедуры

// Функция, возвращает признак необходимости оповещения сотрудника.
//
Функция РазрешеноОповещениеСотрудника(ИдКонтакта) Экспорт
	
	Если Не РольДоступна("ИспользованиеМессенджера") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПозицияРазделителя	 = СтрНайти(ИдКонтакта, "_", НаправлениеПоиска.СКонца);
	ИдКлиента			 = Лев(ИдКонтакта, ПозицияРазделителя - 1);
	ВнешняяСистема		 = ПолучитьСсылкуОбъектаПоUID("Справочники", "ВнешниеСистемы", Сред(ИдКонтакта, ПозицияРазделителя + 1));
	
	ОператорДиалога = РегистрыСведений.Диалоги.ПолучитьОператораПоследнегоДиалога(ИдКлиента, ВнешняяСистема);
	
	Возврат (ОператорДиалога = ПараметрыСеанса.ТекущийПользователь Или Не ЗначениеЗаполнено(ОператорДиалога));
	
КонецФункции

// Функция, загружает файл и возвращает ссылку для доступа к нему.
//
Функция ЗагрузитьФайлВХранилищеИПолучитьСсылку(Файл, ОписаниеОшибки = Неопределено)
	
	Попытка
		Соединение = Новый HTTPСоединение("cloud.1c.fitness/upload_file/index.php",,,,, 10, Новый ЗащищенноеСоединениеOpenSSL);
		Запрос = Новый HTTPЗапрос();
		
		ЧастиИмени = СтрРазделить(Файл.ИмяФайла, ".", Истина);
		Расширение = "";
		Если ЧастиИмени.Количество() Тогда
			Расширение = "." + ЧастиИмени[ЧастиИмени.Количество() - 1];
			ЧастиИмени.Удалить(ЧастиИмени.Количество() - 1);
		КонецЕсли;
		
		ИмяФайла = СтрСоединить(ЧастиИмени, "_") + Расширение;
		
		ПараметрыТела = Новый Структура;
		ПараметрыТела.Вставить("name"		, "file" + Строка(Новый УникальныйИдентификатор) + "_" + СтрЗаменить(ИмяФайла, " ", "_"));
		ПараметрыТела.Вставить("file_data"	, Сред(Файл.ДанныеФайла, СтрНайти(Файл.ДанныеФайла, ",") + 1));
		
		Запрос.УстановитьТелоИзСтроки(КодироватьВJSON(ПараметрыТела));
		
		Ответ			 = Соединение.ОтправитьДляОбработки(Запрос);
		ТелоОтвета		 = Ответ.ПолучитьТелоКакСтроку();
		СтруктураОтвета	 = ДекодироватьИзJSON(ТелоОтвета);
		
		Если Ответ.КодСостояния = 200 И ЗначениеЗаполнено(СтруктураОтвета) И СтруктураОтвета.Свойство("url") Тогда
			Возврат СтруктураОтвета.url;
		КонецЕсли;
		
		ОписаниеОшибки =
		"Файловый сервер не вернул приемлемый ответ." + Символы.ПС +
		"Ответ файлового сервера: " + ТелоОтвета;
		
	Исключение
		ОписаниеОшибки =
		"Текст ошибки: " + ОписаниеОшибки() + Символы.ПС +
		?(ЗначениеЗаполнено(ТелоОтвета), "Ответ файлового сервера: " + ТелоОтвета, "Ответ файлового сервера не был получен.");
		
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

// Функция, получает файл по временной ссылке, загружает в файловое хранилище и возвращает постоянную ссылку на файл.
//
Функция ПреобразоватьВременнуюСсылку(АдресФайла) Экспорт
	
	Попытка
		
		Если СтрНачинаетсяС(АдресФайла, "http://") Тогда
			ЗащищенноеСоединение = Неопределено;
			Адрес = СтрЗаменить(АдресФайла, "http://", "");
		ИначеЕсли СтрНачинаетсяС(АдресФайла, "https://") Тогда
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
			Адрес = СтрЗаменить(АдресФайла, "https://", "");
		КонецЕсли;
		
		Соединение	 = Новый HTTPСоединение(Адрес,,,,, 5, ЗащищенноеСоединение);
		Запрос		 = Новый HTTPЗапрос("");
		
		Результат = Соединение.Получить(Запрос);
		
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("ДанныеФайла", Результат.ПолучитьТелоКакДвоичныеДанные());
		ОписаниеФайла.Вставить("ИмяФайла"	, Строка(Новый УникальныйИдентификатор));
		
		ПостояннаяСсылка = ЗагрузитьФайлВХранилищеИПолучитьСсылку(ОписаниеФайла);
		
		// Если нет постоянной ссылки, возвращаем хотя бы временную.
		Возврат ?(ЗначениеЗаполнено(ПостояннаяСсылка), ПостояннаяСсылка, АдресФайла);
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат АдресФайла;
	
КонецФункции

#Область ФайлыДляHTMLДокументов

// Функция, возвращает текст скрипта поля чата.
//
Функция ПолучитьСкриптПоляЧата() Экспорт
	
	// https://rawgit.com/mervick/emojionearea/master/dist/emojionearea.min.js
	Возврат "window=""undefined""!=typeof global?global:""undefined""!=typeof self?self:""undefined""!=typeof window?window:{},document=window.document||{},function(a,b){""function""==typeof require&&""object""==typeof exports&&""object""==typeof module?a(require(""jquery"")):""function""==typeof define&&define.amd?define([""jquery""],a):a(b.jQuery)}(function(a){""use strict"";var b=0,c={},d={},e=window.emojione,f=[];function g(a){e?a():f.push(a)}var h=""data:image/gif;base64,R0lGODlhAQABAJH/AP/// wAAAMDAwAAAACH5BAEAAAIALAAAAAABAAEAAAICVAEAOw=="",i=[].slice,j=""emojionearea"",k=0,l=""&#8203;"";function m(b,d,e){var f=!0,g=1;if(d){d=d.toLowerCase();do{var h=1==g?""@""+d:d;c[b.id][h]&&c[b.id][h].length&&a.each(c[b.id][h],function(a,c){return f=c.apply(b,e||[])!==!1})}while(f&&g--)}return f}function n(b,c,e,f){f=f||function(b,c){return a(c.currentTarget)},a.each(e,function(g,h){g=a.isArray(e)?h:g,(d[b.id][h]||(d[b.id][h]=[])).push([c,g,f])})}function o(a,b,c){var d=e.imageType,f;f=""svg""==d?e.imagePathSVG:e.imagePathPNG;var g="""";c&&(g=c.substr(1,c.length-2).replace(/_/g,"" "").replace(/\w\S*/g,function(a){return a.charAt(0).toUpperCase()+a.substr(1).toLowerCase()}));var h="""";return b.uc_base&&k>4?(h=b.uc_base,b=b.uc_output.toUpperCase()):h=b,a.replace(""{name}"",c||"""").replace(""{friendlyName}"",g).replace(""{img}"",f+(k<2?h.toUpperCase():h)+"".""+d).replace(""{uni}"",b).replace(""{alt}"",e.convert(b))}function p(a,b,c){return a.replace(/:?\+?[\w_\-]+:?/g,function(a){a="":""+a.replace(/:$/,"""").replace(/^:/,"""")+"":"";var d=e.emojioneList[a];return d?k>4?o(b,d,a):(k>3&&(d=d.unicode),o(b,d[d.length-1],a)):c?"""":a})}function q(a){var b,c;if(window.getSelection){if(b=window.getSelection(),b.getRangeAt&&b.rangeCount){c=b.getRangeAt(0),c.deleteContents();var d=document.createElement(""div"");d.innerHTML=a;var e=document.createDocumentFragment(),f,g;while(f=d.firstChild)g=e.appendChild(f);c.insertNode(e),g&&(c=c.cloneRange(),c.setStartAfter(g),c.collapse(!0),b.removeAllRanges(),b.addRange(c))}}else document.selection&&""Control""!=document.selection.type&&document.selection.createRange().pasteHTML(a)}function r(){return window.emojioneVersion||""3.1.2""}function s(a){return""object""==typeof a}function t(a){var b;return a.cacheBustParam?(b=a.cacheBustParam,s(a.jsEscapeMap)?""?v=1.2.4""===b?""2.0.0"":""?v=2.0.1""===b?""2.1.0"":""?v=2.1.1""===b?""2.1.1"":""?v=2.1.2""===b?""2.1.2"":""?v=2.1.3""===b?""2.1.3"":""?v=2.1.4""===b?""2.1.4"":""2.2.7"":""1.5.2""):a.emojiVersion}function u(a){switch(a){case""1.5.2"":return 0;case""2.0.0"":return 1;case""2.1.0"":case""2.1.1"":return 2;case""2.1.2"":return 3;case""2.1.3"":case""2.1.4"":case""2.2.7"":return 4;case""3.0.1"":case""3.0.2"":case""3.0.3"":case""3.0"":return 5;case""3.1.0"":case""3.1.1"":case""3.1.2"":case""3.1"":default:return 6}}function v(){if(a.fn.emojioneArea&&a.fn.emojioneArea.defaults)return a.fn.emojioneArea.defaults;var b={attributes:{dir:""ltr"",spellcheck:!1,autocomplete:""off"",autocorrect:""off"",autocapitalize:""off""},search:!0,placeholder:null,emojiPlaceholder:"":smiley:"",searchPlaceholder:""SEARCH"",container:null,hideSource:!0,shortnames:!0,sprite:!0,pickerPosition:""top"",filtersPosition:""top"",searchPosition:""top"",hidePickerOnBlur:!0,buttonTitle:""Use the TAB key to insert emoji faster"",tones:!0,tonesStyle:""bullet"",inline:null,saveEmojisAs:""unicode"",shortcuts:!0,autocomplete:!0,autocompleteTones:!1,standalone:!1,useInternalCDN:!0,imageType:""png"",recentEmojis:!0,textcomplete:{maxCount:15,placement:null}},c=u(e?t(e):r());return c>4?b.filters={tones:{title:""Diversity"",emoji:""open_hands raised_hands palms_up_together clap pray thumbsup thumbsdown punch fist left_facing_fist right_facing_fist fingers_crossed v metal love_you_gesture ok_hand point_left point_right point_up_2 point_down point_up raised_hand raised_back_of_hand hand_splayed vulcan wave call_me muscle middle_finger writing_hand selfie nail_care ear nose baby boy girl man woman blond-haired_woman blond-haired_man older_man older_woman man_with_chinese_cap woman_wearing_turban man_wearing_turban woman_police_officer man_police_officer woman_construction_worker man_construction_worker woman_guard man_guard woman_detective man_detective woman_health_worker man_health_worker woman_farmer man_farmer woman_cook man_cook woman_student man_student woman_singer man_singer woman_teacher man_teacher woman_factory_worker man_factory_worker woman_technologist man_technologist woman_office_worker man_office_worker woman_mechanic man_mechanic woman_scientist man_scientist woman_artist man_artist woman_firefighter man_firefighter woman_pilot man_pilot woman_astronaut man_astronaut woman_judge man_judge mrs_claus santa princess prince bride_with_veil man_in_tuxedo angel pregnant_woman breast_feeding woman_bowing man_bowing man_tipping_hand woman_tipping_hand man_gesturing_no woman_gesturing_no man_gesturing_ok woman_gesturing_ok man_raising_hand woman_raising_hand woman_facepalming man_facepalming woman_shrugging man_shrugging man_pouting woman_pouting man_frowning woman_frowning man_getting_haircut woman_getting_haircut man_getting_face_massage woman_getting_face_massage man_in_business_suit_levitating dancer man_dancing woman_walking man_walking woman_running man_running adult child older_adult bearded_person woman_with_headscarf woman_mage man_mage woman_fairy man_fairy woman_vampire man_vampire mermaid merman woman_elf man_elf snowboarder woman_lifting_weights man_lifting_weights woman_cartwheeling man_cartwheeling woman_bouncing_ball man_bouncing_ball woman_playing_handball man_playing_handball woman_golfing man_golfing woman_surfing man_surfing woman_swimming man_swimming woman_playing_water_polo man_playing_water_polo woman_rowing_boat man_rowing_boat horse_racing woman_biking man_biking woman_mountain_biking man_mountain_biking woman_juggling man_juggling woman_in_steamy_room man_in_steamy_room woman_climbing man_climbing woman_in_lotus_position man_in_lotus_position bath person_in_bed""},recent:{icon:""clock3"",title:""Recent"",emoji:""""},smileys_people:{icon:""yum"",title:""Smileys & People"",emoji:""grinning smiley smile grin laughing sweat_smile joy rofl relaxed blush innocent slight_smile upside_down wink relieved crazy_face star_struck heart_eyes kissing_heart kissing kissing_smiling_eyes kissing_closed_eyes yum stuck_out_tongue_winking_eye stuck_out_tongue_closed_eyes stuck_out_tongue money_mouth hugging nerd sunglasses cowboy smirk unamused disappointed pensive worried face_with_raised_eyebrow face_with_monocle confused slight_frown frowning2 persevere confounded tired_face weary triumph angry rage face_with_symbols_over_mouth no_mouth neutral_face expressionless hushed frowning anguished open_mouth astonished dizzy_face exploding_head flushed scream fearful cold_sweat cry disappointed_relieved drooling_face sob sweat sleepy sleeping rolling_eyes thinking shushing_face face_with_hand_over_mouth lying_face grimacing zipper_mouth face_vomiting nauseated_face sneezing_face mask thermometer_face head_bandage smiling_imp imp japanese_ogre japanese_goblin poop ghost skull skull_crossbones alien space_invader robot jack_o_lantern clown smiley_cat smile_cat joy_cat heart_eyes_cat smirk_cat kissing_cat scream_cat crying_cat_face pouting_cat open_hands raised_hands palms_up_together clap pray handshake thumbsup thumbsdown punch fist left_facing_fist right_facing_fist fingers_crossed v metal love_you_gesture ok_hand point_left point_right point_up_2 point_down point_up raised_hand raised_back_of_hand hand_splayed vulcan wave call_me muscle middle_finger writing_hand selfie nail_care ring lipstick kiss lips tongue ear nose footprints eye eyes speaking_head bust_in_silhouette busts_in_silhouette baby boy girl man woman blond-haired_woman blond_haired_man older_man older_woman man_with_chinese_cap woman_wearing_turban man_wearing_turban woman_police_officer police_officer woman_construction_worker construction_worker woman_guard guard woman_detective detective woman_health_worker man_health_worker woman_farmer man_farmer woman_cook man_cook woman_student man_student woman_singer man_singer woman_teacher man_teacher woman_factory_worker man_factory_worker woman_technologist man_technologist woman_office_worker man_office_worker woman_mechanic man_mechanic woman_scientist man_scientist woman_artist man_artist woman_firefighter man_firefighter woman_pilot man_pilot woman_astronaut man_astronaut woman_judge man_judge mrs_claus santa princess prince bride_with_veil man_in_tuxedo angel pregnant_woman breast_feeding woman_bowing man_bowing woman_tipping_hand man_tipping_hand woman_gesturing_no man_gesturing_no woman_gesturing_ok man_gesturing_ok woman_raising_hand man_raising_hand woman_facepalming man_facepalming woman_shrugging man_shrugging woman_pouting man_pouting woman_frowning man_frowning woman_getting_haircut man_getting_haircut woman_getting_face_massage man_getting_face_massage man_in_business_suit_levitating dancer man_dancing women_with_bunny_ears_partying men_with_bunny_ears_partying woman_walking man_walking woman_running man_running couple two_women_holding_hands two_men_holding_hands couple_with_heart couple_ww couple_mm couplekiss kiss_ww kiss_mm family family_mwg family_mwgb family_mwbb family_mwgg family_wwb family_wwg family_wwgb family_wwbb family_wwgg family_mmb family_mmg family_mmgb family_mmbb family_mmgg family_woman_boy family_woman_girl family_woman_girl_boy family_woman_boy_boy family_woman_girl_girl family_man_boy family_man_girl family_man_girl_boy family_man_boy_boy family_man_girl_girl bearded_person woman_with_headscarf woman_mage man_mage woman_fairy man_fairy woman_vampire man_vampire mermaid merman woman_elf man_elf woman_genie man_genie woman_zombie man_zombie womans_clothes shirt jeans necktie dress bikini kimono high_heel sandal boot mans_shoe athletic_shoe womans_hat tophat mortar_board crown helmet_with_cross school_satchel pouch purse handbag briefcase eyeglasses dark_sunglasses closed_umbrella umbrella2 brain billed_cap scarf gloves coat socks ""},animals_nature:{icon:""hamster"",title:""Animals & Nature"",emoji:""dog cat mouse hamster rabbit fox bear panda_face koala tiger lion_face cow pig pig_nose frog monkey_face see_no_evil hear_no_evil speak_no_evil monkey chicken penguin bird baby_chick hatching_chick hatched_chick duck eagle owl bat wolf boar horse unicorn bee bug butterfly snail shell beetle ant spider spider_web turtle snake lizard scorpion crab squid octopus shrimp tropical_fish fish blowfish dolphin shark whale whale2 crocodile leopard tiger2 water_buffalo ox cow2 deer dromedary_camel camel elephant rhino gorilla racehorse pig2 goat ram sheep dog2 poodle cat2 rooster turkey dove rabbit2 mouse2 rat chipmunk dragon giraffe zebra hedgehog sauropod t_rex cricket dragon_face feet cactus christmas_tree evergreen_tree deciduous_tree palm_tree seedling herb shamrock four_leaf_clover bamboo tanabata_tree leaves fallen_leaf maple_leaf mushroom ear_of_rice bouquet tulip rose wilted_rose sunflower blossom cherry_blossom hibiscus earth_americas earth_africa earth_asia full_moon waning_gibbous_moon last_quarter_moon waning_crescent_moon new_moon waxing_crescent_moon first_quarter_moon waxing_gibbous_moon new_moon_with_face full_moon_with_face sun_with_face first_quarter_moon_with_face last_quarter_moon_with_face crescent_moon dizzy star star2 sparkles zap fire boom comet sunny white_sun_small_cloud partly_sunny white_sun_cloud white_sun_rain_cloud rainbow cloud cloud_rain thunder_cloud_rain cloud_lightning cloud_snow snowman2 snowman snowflake wind_blowing_face dash cloud_tornado fog ocean droplet sweat_drops umbrella ""},food_drink:{icon:""pizza"",title:""Food & Drink"",emoji:""green_apple apple pear tangerine lemon banana watermelon grapes strawberry melon cherries peach pineapple kiwi avocado tomato eggplant cucumber carrot corn hot_pepper potato sweet_potato chestnut peanuts honey_pot croissant bread french_bread cheese egg cooking bacon pancakes fried_shrimp poultry_leg meat_on_bone pizza hotdog hamburger fries stuffed_flatbread taco burrito salad shallow_pan_of_food spaghetti ramen stew fish_cake sushi bento curry rice_ball rice rice_cracker oden dango shaved_ice ice_cream icecream cake birthday custard lollipop candy chocolate_bar popcorn doughnut cookie milk baby_bottle coffee tea sake beer beers champagne_glass wine_glass tumbler_glass cocktail tropical_drink champagne spoon fork_and_knife fork_knife_plate dumpling fortune_cookie takeout_box chopsticks bowl_with_spoon cup_with_straw coconut broccoli pie pretzel cut_of_meat sandwich canned_food""},activity:{icon:""basketball"",title:""Activity"",emoji:""soccer basketball football baseball tennis volleyball rugby_football 8ball ping_pong badminton goal hockey field_hockey cricket_game golf bow_and_arrow fishing_pole_and_fish boxing_glove martial_arts_uniform ice_skate ski skier snowboarder woman_lifting_weights man_lifting_weights person_fencing women_wrestling men_wrestling woman_cartwheeling man_cartwheeling woman_bouncing_ball man_bouncing_ball woman_playing_handball man_playing_handball woman_golfing man_golfing woman_surfing man_surfing woman_swimming man_swimming woman_playing_water_polo man_playing_water_polo woman_rowing_boat man_rowing_boat horse_racing woman_biking man_biking woman_mountain_biking man_mountain_biking woman_in_steamy_room man_in_steamy_room woman_climbing man_climbing woman_in_lotus_position man_in_lotus_position running_shirt_with_sash medal military_medal first_place second_place third_place trophy rosette reminder_ribbon ticket tickets circus_tent woman_juggling man_juggling performing_arts art clapper microphone headphones musical_score musical_keyboard drum saxophone trumpet guitar violin game_die dart bowling video_game slot_machine sled curling_stone ""},travel_places:{icon:""rocket"",title:""Travel & Places"",emoji:""red_car taxi blue_car bus trolleybus race_car police_car ambulance fire_engine minibus truck articulated_lorry tractor scooter bike motor_scooter motorcycle rotating_light oncoming_police_car oncoming_bus oncoming_automobile oncoming_taxi aerial_tramway mountain_cableway suspension_railway railway_car train mountain_railway monorail bullettrain_side bullettrain_front light_rail steam_locomotive train2 metro tram station helicopter airplane_small airplane airplane_departure airplane_arriving rocket satellite_orbital seat canoe sailboat motorboat speedboat cruise_ship ferry ship anchor construction fuelpump busstop vertical_traffic_light traffic_light map moyai statue_of_liberty fountain tokyo_tower european_castle japanese_castle stadium ferris_wheel roller_coaster carousel_horse beach_umbrella beach island mountain mountain_snow mount_fuji volcano desert camping tent railway_track motorway construction_site factory house house_with_garden homes house_abandoned office department_store post_office european_post_office hospital bank hotel convenience_store school love_hotel wedding classical_building church mosque synagogue kaaba shinto_shrine japan rice_scene park sunrise sunrise_over_mountains stars sparkler fireworks city_sunset city_dusk cityscape night_with_stars milky_way bridge_at_night foggy flying_saucer""},objects:{icon:""bulb"",title:""Objects"",emoji:""watch iphone calling computer keyboard desktop printer mouse_three_button trackball joystick compression minidisc floppy_disk cd dvd vhs camera camera_with_flash video_camera movie_camera projector film_frames telephone_receiver telephone pager fax tv radio microphone2 level_slider control_knobs stopwatch timer alarm_clock clock hourglass hourglass_flowing_sand satellite battery electric_plug bulb flashlight candle wastebasket oil money_with_wings dollar yen euro pound moneybag credit_card gem scales wrench hammer hammer_pick tools pick nut_and_bolt gear chains gun bomb knife dagger crossed_swords shield smoking coffin urn amphora crystal_ball prayer_beads barber alembic telescope microscope hole pill syringe thermometer toilet potable_water shower bathtub bath bellhop key key2 door couch bed sleeping_accommodation frame_photo shopping_bags shopping_cart gift balloon flags ribbon confetti_ball tada dolls izakaya_lantern wind_chime envelope envelope_with_arrow incoming_envelope e-mail love_letter inbox_tray outbox_tray package label mailbox_closed mailbox mailbox_with_mail mailbox_with_no_mail postbox postal_horn scroll page_with_curl page_facing_up bookmark_tabs bar_chart chart_with_upwards_trend chart_with_downwards_trend notepad_spiral calendar_spiral calendar date card_index card_box ballot_box file_cabinet clipboard file_folder open_file_folder dividers newspaper2 newspaper notebook notebook_with_decorative_cover ledger closed_book green_book blue_book orange_book books book bookmark link paperclip paperclips triangular_ruler straight_ruler pushpin round_pushpin scissors pen_ballpoint pen_fountain black_nib paintbrush crayon pencil pencil2 mag mag_right lock_with_ink_pen closed_lock_with_key lock unlock""},symbols:{icon:""heartpulse"",title:""Symbols"",emoji:""heart orange_heart yellow_heart green_heart blue_heart purple_heart black_heart broken_heart heart_exclamation two_hearts revolving_hearts heartbeat heartpulse sparkling_heart cupid gift_heart heart_decoration peace cross star_and_crescent om_symbol wheel_of_dharma star_of_david six_pointed_star menorah yin_yang orthodox_cross place_of_worship ophiuchus aries taurus gemini cancer leo virgo libra scorpius sagittarius capricorn aquarius pisces id atom accept radioactive biohazard mobile_phone_off vibration_mode u6709 u7121 u7533 u55b6 u6708 eight_pointed_black_star vs white_flower ideograph_advantage secret congratulations u5408 u6e80 u5272 u7981 a b ab cl o2 sos x o octagonal_sign no_entry name_badge no_entry_sign 100 anger hotsprings no_pedestrians do_not_litter no_bicycles non-potable_water underage no_mobile_phones no_smoking exclamation grey_exclamation question grey_question bangbang interrobang low_brightness high_brightness part_alternation_mark warning children_crossing trident fleur-de-lis beginner recycle white_check_mark u6307 chart sparkle eight_spoked_asterisk negative_squared_cross_mark globe_with_meridians diamond_shape_with_a_dot_inside m cyclone zzz atm wc wheelchair parking u7a7a sa passport_control customs baggage_claim left_luggage mens womens baby_symbol restroom put_litter_in_its_place cinema signal_strength koko symbols information_source abc abcd capital_abcd ng ok up cool new free zero one two three four five six seven eight nine keycap_ten 1234 hash asterisk arrow_forward pause_button play_pause stop_button record_button eject track_next track_previous fast_forward rewind arrow_double_up arrow_double_down arrow_backward arrow_up_small arrow_down_small arrow_right arrow_left arrow_up arrow_down arrow_upper_right arrow_lower_right arrow_lower_left arrow_upper_left arrow_up_down left_right_arrow arrow_right_hook leftwards_arrow_with_hook arrow_heading_up arrow_heading_down twisted_rightwards_arrows repeat repeat_one arrows_counterclockwise arrows_clockwise musical_note notes heavy_plus_sign heavy_minus_sign heavy_division_sign heavy_multiplication_x heavy_dollar_sign currency_exchange tm copyright registered wavy_dash curly_loop loop end back on top soon heavy_check_mark ballot_box_with_check radio_button white_circle black_circle red_circle blue_circle small_red_triangle small_red_triangle_down small_orange_diamond small_blue_diamond large_orange_diamond large_blue_diamond white_square_button black_square_button black_small_square white_small_square black_medium_small_square white_medium_small_square black_medium_square white_medium_square black_large_square white_large_square speaker mute sound loud_sound bell no_bell mega loudspeaker speech_left eye_in_speech_bubble speech_balloon thought_balloon anger_right spades clubs hearts diamonds black_joker flower_playing_cards mahjong clock1 clock2 clock3 clock4 clock5 clock6 clock7 clock8 clock9 clock10 clock11 clock12 clock130 clock230 clock330 clock430 clock530 clock630 clock730 clock830 clock930 clock1030 clock1130 clock1230""},flags:{icon:""flag_gb"",title:""Flags"",emoji:""flag_white flag_black checkered_flag triangular_flag_on_post rainbow_flag flag_af flag_ax flag_al flag_dz flag_as flag_ad flag_ao flag_ai flag_aq flag_ag flag_ar flag_am flag_aw flag_au flag_at flag_az flag_bs flag_bh flag_bd flag_bb flag_by flag_be flag_bz flag_bj flag_bm flag_bt flag_bo flag_ba flag_bw flag_br flag_io flag_vg flag_bn flag_bg flag_bf flag_bi flag_kh flag_cm flag_ca flag_ic flag_cv flag_bq flag_ky flag_cf flag_td flag_cl flag_cn flag_cx flag_cc flag_co flag_km flag_cg flag_cd flag_ck flag_cr flag_ci flag_hr flag_cu flag_cw flag_cy flag_cz flag_dk flag_dj flag_dm flag_do flag_ec flag_eg flag_sv flag_gq flag_er flag_ee flag_et flag_eu flag_fk flag_fo flag_fj flag_fi flag_fr flag_gf flag_pf flag_tf flag_ga flag_gm flag_ge flag_de flag_gh flag_gi flag_gr flag_gl flag_gd flag_gp flag_gu flag_gt flag_gg flag_gn flag_gw flag_gy flag_ht flag_hn flag_hk flag_hu flag_is flag_in flag_id flag_ir flag_iq flag_ie flag_im flag_il flag_it flag_jm flag_jp crossed_flags flag_je flag_jo flag_kz flag_ke flag_ki flag_xk flag_kw flag_kg flag_la flag_lv flag_lb flag_ls flag_lr flag_ly flag_li flag_lt flag_lu flag_mo flag_mk flag_mg flag_mw flag_my flag_mv flag_ml flag_mt flag_mh flag_mq flag_mr flag_mu flag_yt flag_mx flag_fm flag_md flag_mc flag_mn flag_me flag_ms flag_ma flag_mz flag_mm flag_na flag_nr flag_np flag_nl flag_nc flag_nz flag_ni flag_ne flag_ng flag_nu flag_nf flag_kp flag_mp flag_no flag_om flag_pk flag_pw flag_ps flag_pa flag_pg flag_py flag_pe flag_ph flag_pn flag_pl flag_pt flag_pr flag_qa flag_re flag_ro flag_ru flag_rw flag_ws flag_sm flag_st flag_sa flag_sn flag_rs flag_sc flag_sl flag_sg flag_sx flag_sk flag_si flag_gs flag_sb flag_so flag_za flag_kr flag_ss flag_es flag_lk flag_bl flag_sh flag_kn flag_lc flag_pm flag_vc flag_sd flag_sr flag_sz flag_se flag_ch flag_sy flag_tw flag_tj flag_tz flag_th flag_tl flag_tg flag_tk flag_to flag_tt flag_tn flag_tr flag_tm flag_tc flag_tv flag_vi flag_ug flag_ua flag_ae flag_gb flag_us flag_uy flag_uz flag_vu flag_va flag_ve flag_vn flag_wf flag_eh flag_ye flag_zm flag_zw flag_ac flag_ta flag_bv flag_hm flag_sj flag_um flag_ea flag_cp flag_dg flag_mf united_nations england scotland wales""}}:b.filters={tones:{title:""Diversity"",emoji:""santa runner surfer swimmer lifter ear nose point_up_2 point_down point_left point_right punch wave ok_hand thumbsup thumbsdown clap open_hands boy girl man woman cop bride_with_veil person_with_blond_hair man_with_gua_pi_mao man_with_turban older_man grandma baby construction_worker princess angel information_desk_person guardsman dancer nail_care massage haircut muscle spy hand_splayed middle_finger vulcan no_good ok_woman bow raising_hand raised_hands person_frowning person_with_pouting_face pray rowboat bicyclist mountain_bicyclist walking bath metal point_up basketball_player fist raised_hand v writing_hand""},recent:{icon:""clock3"",title:""Recent"",emoji:""""},smileys_people:{icon:""yum"",title:""Smileys & People"",emoji:""grinning grimacing grin joy smiley smile sweat_smile laughing innocent wink blush slight_smile upside_down relaxed yum relieved heart_eyes kissing_heart kissing kissing_smiling_eyes kissing_closed_eyes stuck_out_tongue_winking_eye stuck_out_tongue_closed_eyes stuck_out_tongue money_mouth nerd sunglasses hugging smirk no_mouth neutral_face expressionless unamused rolling_eyes thinking flushed disappointed worried angry rage pensive confused slight_frown frowning2 persevere confounded tired_face weary triumph open_mouth scream fearful cold_sweat hushed frowning anguished cry disappointed_relieved sleepy sweat sob dizzy_face astonished zipper_mouth mask thermometer_face head_bandage sleeping zzz poop smiling_imp imp japanese_ogre japanese_goblin skull ghost alien robot smiley_cat smile_cat joy_cat heart_eyes_cat smirk_cat kissing_cat scream_cat crying_cat_face pouting_cat raised_hands clap wave thumbsup thumbsdown punch fist v ok_hand raised_hand open_hands muscle pray point_up point_up_2 point_down point_left point_right middle_finger hand_splayed metal vulcan writing_hand nail_care lips tongue ear nose eye eyes bust_in_silhouette busts_in_silhouette speaking_head baby boy girl man woman person_with_blond_hair older_man older_woman man_with_gua_pi_mao man_with_turban cop construction_worker guardsman spy santa angel princess bride_with_veil walking runner dancer dancers couple two_men_holding_hands two_women_holding_hands bow information_desk_person no_good ok_woman raising_hand person_with_pouting_face person_frowning haircut massage couple_with_heart couple_ww couple_mm couplekiss kiss_ww kiss_mm family family_mwg family_mwgb family_mwbb family_mwgg family_wwb family_wwg family_wwgb family_wwbb family_wwgg family_mmb family_mmg family_mmgb family_mmbb family_mmgg womans_clothes shirt jeans necktie dress bikini kimono lipstick kiss footprints high_heel sandal boot mans_shoe athletic_shoe womans_hat tophat helmet_with_cross mortar_board crown school_satchel pouch purse handbag briefcase eyeglasses dark_sunglasses ring closed_umbrella""},animals_nature:{icon:""hamster"",title:""Animals & Nature"",emoji:""dog cat mouse hamster rabbit bear panda_face koala tiger lion_face cow pig pig_nose frog octopus monkey_face see_no_evil hear_no_evil speak_no_evil monkey chicken penguin bird baby_chick hatching_chick hatched_chick wolf boar horse unicorn bee bug snail beetle ant spider scorpion crab snake turtle tropical_fish fish blowfish dolphin whale whale2 crocodile leopard tiger2 water_buffalo ox cow2 dromedary_camel camel elephant goat ram sheep racehorse pig2 rat mouse2 rooster turkey dove dog2 poodle cat2 rabbit2 chipmunk feet dragon dragon_face cactus christmas_tree evergreen_tree deciduous_tree palm_tree seedling herb shamrock four_leaf_clover bamboo tanabata_tree leaves fallen_leaf maple_leaf ear_of_rice hibiscus sunflower rose tulip blossom cherry_blossom bouquet mushroom chestnut jack_o_lantern shell spider_web earth_americas earth_africa earth_asia full_moon waning_gibbous_moon last_quarter_moon waning_crescent_moon new_moon waxing_crescent_moon first_quarter_moon waxing_gibbous_moon new_moon_with_face full_moon_with_face first_quarter_moon_with_face last_quarter_moon_with_face sun_with_face crescent_moon star star2 dizzy sparkles comet sunny white_sun_small_cloud partly_sunny white_sun_cloud white_sun_rain_cloud cloud cloud_rain thunder_cloud_rain cloud_lightning zap fire boom snowflake cloud_snow snowman2 snowman wind_blowing_face dash cloud_tornado fog umbrella2 umbrella droplet sweat_drops ocean""},food_drink:{icon:""pizza"",title:""Food & Drink"",emoji:""green_apple apple pear tangerine lemon banana watermelon grapes strawberry melon cherries peach pineapple tomato eggplant hot_pepper corn sweet_potato honey_pot bread cheese poultry_leg meat_on_bone fried_shrimp egg hamburger fries hotdog pizza spaghetti taco burrito ramen stew fish_cake sushi bento curry rice_ball rice rice_cracker oden dango shaved_ice ice_cream icecream cake birthday custard candy lollipop chocolate_bar popcorn doughnut cookie beer beers wine_glass cocktail tropical_drink champagne sake tea coffee baby_bottle fork_and_knife fork_knife_plate""},activity:{icon:""basketball"",title:""Activity"",emoji:""soccer basketball football baseball tennis volleyball rugby_football 8ball golf golfer ping_pong badminton hockey field_hockey cricket ski skier snowboarder ice_skate bow_and_arrow fishing_pole_and_fish rowboat swimmer surfer bath basketball_player lifter bicyclist mountain_bicyclist horse_racing levitate trophy running_shirt_with_sash medal military_medal reminder_ribbon rosette ticket tickets performing_arts art circus_tent microphone headphones musical_score musical_keyboard saxophone trumpet guitar violin clapper video_game space_invader dart game_die slot_machine bowling""},travel_places:{icon:""rocket"",title:""Travel & Places"",emoji:""red_car taxi blue_car bus trolleybus race_car police_car ambulance fire_engine minibus truck articulated_lorry tractor motorcycle bike rotating_light oncoming_police_car oncoming_bus oncoming_automobile oncoming_taxi aerial_tramway mountain_cableway suspension_railway railway_car train monorail bullettrain_side bullettrain_front light_rail mountain_railway steam_locomotive train2 metro tram station helicopter airplane_small airplane airplane_departure airplane_arriving sailboat motorboat speedboat ferry cruise_ship rocket satellite_orbital seat anchor construction fuelpump busstop vertical_traffic_light traffic_light checkered_flag ship ferris_wheel roller_coaster carousel_horse construction_site foggy tokyo_tower factory fountain rice_scene mountain mountain_snow mount_fuji volcano japan camping tent park motorway railway_track sunrise sunrise_over_mountains desert beach island city_sunset city_dusk cityscape night_with_stars bridge_at_night milky_way stars sparkler fireworks rainbow homes european_castle japanese_castle stadium statue_of_liberty house house_with_garden house_abandoned office department_store post_office european_post_office hospital bank hotel convenience_store school love_hotel wedding classical_building church mosque synagogue kaaba shinto_shrine""},objects:{icon:""bulb"",title:""Objects"",emoji:""watch iphone calling computer keyboard desktop printer mouse_three_button trackball joystick compression minidisc floppy_disk cd dvd vhs camera camera_with_flash video_camera movie_camera projector film_frames telephone_receiver telephone pager fax tv radio microphone2 level_slider control_knobs stopwatch timer alarm_clock clock hourglass_flowing_sand hourglass satellite battery electric_plug bulb flashlight candle wastebasket oil money_with_wings dollar yen euro pound moneybag credit_card gem scales wrench hammer hammer_pick tools pick nut_and_bolt gear chains gun bomb knife dagger crossed_swords shield smoking skull_crossbones coffin urn amphora crystal_ball prayer_beads barber alembic telescope microscope hole pill syringe thermometer label bookmark toilet shower bathtub key key2 couch sleeping_accommodation bed door bellhop frame_photo map beach_umbrella moyai shopping_bags balloon flags ribbon gift confetti_ball tada dolls wind_chime crossed_flags izakaya_lantern envelope envelope_with_arrow incoming_envelope e-mail love_letter postbox mailbox_closed mailbox mailbox_with_mail mailbox_with_no_mail package postal_horn inbox_tray outbox_tray scroll page_with_curl bookmark_tabs bar_chart chart_with_upwards_trend chart_with_downwards_trend page_facing_up date calendar calendar_spiral card_index card_box ballot_box file_cabinet clipboard notepad_spiral file_folder open_file_folder dividers newspaper2 newspaper notebook closed_book green_book blue_book orange_book notebook_with_decorative_cover ledger books book link paperclip paperclips scissors triangular_ruler straight_ruler pushpin round_pushpin triangular_flag_on_post flag_white flag_black closed_lock_with_key lock unlock lock_with_ink_pen pen_ballpoint pen_fountain black_nib pencil pencil2 crayon paintbrush mag mag_right""},symbols:{icon:""heartpulse"",title:""Symbols"",emoji:""heart yellow_heart green_heart blue_heart purple_heart broken_heart heart_exclamation two_hearts revolving_hearts heartbeat heartpulse sparkling_heart cupid gift_heart heart_decoration peace cross star_and_crescent om_symbol wheel_of_dharma star_of_david six_pointed_star menorah yin_yang orthodox_cross place_of_worship ophiuchus aries taurus gemini cancer leo virgo libra scorpius sagittarius capricorn aquarius pisces id atom u7a7a u5272 radioactive biohazard mobile_phone_off vibration_mode u6709 u7121 u7533 u55b6 u6708 eight_pointed_black_star vs accept white_flower ideograph_advantage secret congratulations u5408 u6e80 u7981 a b ab cl o2 sos no_entry name_badge no_entry_sign x o anger hotsprings no_pedestrians do_not_litter no_bicycles non-potable_water underage no_mobile_phones exclamation grey_exclamation question grey_question bangbang interrobang 100 low_brightness high_brightness trident fleur-de-lis part_alternation_mark warning children_crossing beginner recycle u6307 chart sparkle eight_spoked_asterisk negative_squared_cross_mark white_check_mark diamond_shape_with_a_dot_inside cyclone loop globe_with_meridians m atm sa passport_control customs baggage_claim left_luggage wheelchair no_smoking wc parking potable_water mens womens baby_symbol restroom put_litter_in_its_place cinema signal_strength koko ng ok up cool new free zero one two three four five six seven eight nine ten 1234 arrow_forward pause_button play_pause stop_button record_button track_next track_previous fast_forward rewind twisted_rightwards_arrows repeat repeat_one arrow_backward arrow_up_small arrow_down_small arrow_double_up arrow_double_down arrow_right arrow_left arrow_up arrow_down arrow_upper_right arrow_lower_right arrow_lower_left arrow_upper_left arrow_up_down left_right_arrow arrows_counterclockwise arrow_right_hook leftwards_arrow_with_hook arrow_heading_up arrow_heading_down hash asterisk information_source abc abcd capital_abcd symbols musical_note notes wavy_dash curly_loop heavy_check_mark arrows_clockwise heavy_plus_sign heavy_minus_sign heavy_division_sign heavy_multiplication_x heavy_dollar_sign currency_exchange copyright registered tm end back on top soon ballot_box_with_check radio_button white_circle black_circle red_circle large_blue_circle small_orange_diamond small_blue_diamond large_orange_diamond large_blue_diamond small_red_triangle black_small_square white_small_square black_large_square white_large_square small_red_triangle_down black_medium_square white_medium_square black_medium_small_square white_medium_small_square black_square_button white_square_button speaker sound loud_sound mute mega loudspeaker bell no_bell black_joker mahjong spades clubs hearts diamonds flower_playing_cards thought_balloon anger_right speech_balloon clock1 clock2 clock3 clock4 clock5 clock6 clock7 clock8 clock9 clock10 clock11 clock12 clock130 clock230 clock330 clock430 clock530 clock630 clock730 clock830 clock930 clock1030 clock1130 clock1230 eye_in_speech_bubble""},flags:{icon:""flag_gb"",title:""Flags"",emoji:""ac af al dz ad ao ai ag ar am aw au at az bs bh bd bb by be bz bj bm bt bo ba bw br bn bg bf bi cv kh cm ca ky cf td flag_cl cn co km cg flag_cd cr hr cu cy cz dk dj dm do ec eg sv gq er ee et fk fo fj fi fr pf ga gm ge de gh gi gr gl gd gu gt gn gw gy ht hn hk hu is in flag_id ir iq ie il it ci jm jp je jo kz ke ki xk kw kg la lv lb ls lr ly li lt lu mo mk mg mw my mv ml mt mh mr mu mx fm md mc mn me ms ma mz mm na nr np nl nc nz ni ne flag_ng nu kp no om pk pw ps pa pg py pe ph pl pt pr qa ro ru rw sh kn lc vc ws sm st flag_sa sn rs sc sl sg sk si sb so za kr es lk sd sr sz se ch sy tw tj tz th tl tg to tt tn tr flag_tm flag_tm ug ua ae gb us vi uy uz vu va ve vn wf eh ye zm zw re ax ta io bq cx cc gg im yt nf pn bl pm gs tk bv hm sj um ic ea cp dg as aq vg ck cw eu gf tf gp mq mp sx ss tc ""}},b}function w(b){var c=v();if(b&&b.filters){var d=c.filters;a.each(b.filters,function(b,c){return!s(c)||a.isEmptyObject(c)?void delete d[b]:void a.each(c,function(a,c){d[b][a]=c})}),b.filters=d}return a.extend({},c,b)}var x,y;window.getSelection&&document.createRange?(x=function(a){var b=window.getSelection&&window.getSelection();if(b&&b.rangeCount>0)return b.getRangeAt(0)},y=function(a,b){var c=document.createRange();c.setStart(b.startContainer,b.startOffset),c.setEnd(b.endContainer,b.endOffset),b=window.getSelection(),b.removeAllRanges(),b.addRange(c)}):document.selection&&document.body.createTextRange&&(x=function(a){return document.selection.createRange()},y=function(a,b){var c=document.body.createTextRange();c.moveToElementText(a),c.setStart(b.startContanier,b.startOffset),c.setEnd(b.endContainer,b.endOffset),c.select()});var z;function A(a,b){return a.replace(z,function(a){var c=e[0===k?""jsecapeMap"":""jsEscapeMap""];return""undefined""!=typeof a&&a in c?o(b,c[a]):a})}function B(a,b){return a=a.replace(/&/g,""&amp;"").replace(/</g,""&lt;"").replace(/>/g,""&gt;"").replace(/""/g,""&quot;"").replace(/'/g,""&#x27;"").replace(/`/g,""&#x60;"").replace(/(?:\r\n|\r|\n)/g,""\n"").replace(/(\n+)/g,""<div>$1</div>"").replace(/\n/g,""<br/>"").replace(/<br\/><\/div>/g,""</div>""),b.shortnames&&(a=e.shortnameToUnicode(a)),A(a,b.emojiTemplate).replace(/\t/g,""&nbsp;&nbsp;&nbsp;&nbsp;"").replace(/  /g,""&nbsp;&nbsp;"")}function C(a,b){switch(a=a.replace(/&#10;/g,""\n"").replace(/&#09;/g,""\t"").replace(/<img[^>]*alt=""([^""]+)""[^>]*>/gi,""$1"").replace(/\n|\r/g,"""").replace(/<br[^>]*>/gi,""\n"").replace(/(?:<(?:div|p|ol|ul|li|pre|code|object)[^>]*>)+/gi,""<div>"").replace(/(?:<\/(?:div|p|ol|ul|li|pre|code|object)>)+/gi,""</div>"").replace(/\n<div><\/div>/gi,""\n"").replace(/<div><\/div>\n/gi,""\n"").replace(/(?:<div>)+<\/div>/gi,""\n"").replace(/([^\n])<\/div><div>/gi,""$1\n"").replace(/(?:<\/div>)+/gi,""</div>"").replace(/([^\n])<\/div>([^\n])/gi,""$1\n$2"").replace(/<\/div>/gi,"""").replace(/([^\n])<div>/gi,""$1\n"").replace(/\n<div>/gi,""\n"").replace(/<div>\n/gi,""\n\n"").replace(/<(?:[^>]+)?>/g,"""").replace(new RegExp(l,""g""),"""").replace(/&nbsp;/g,"" "").replace(/&lt;/g,""<"").replace(/&gt;/g,"">"").replace(/&quot;/g,'""').replace(/&#x27;/g,""'"").replace(/&#x60;/g,""`"").replace(/&#60;/g,""<"").replace(/&#62;/g,"">"").replace(/&amp;/g,""&""),b.saveEmojisAs){case""image"":a=A(a,b.emojiTemplate);break;case""shortname"":a=e.toShort(a)}return a}function D(){var a=this,b=a.editor[0].offsetWidth-a.editor[0].clientWidth,c=parseInt(a.button.css(""marginRight""));c!==b&&(a.button.css({marginRight:b}),a.floatingPicker&&a.picker.css({right:parseInt(a.picker.css(""right""))-c+b}))}function E(){var b=this;if(!b.sprite&&b.lasyEmoji[0]&&b.lasyEmoji.eq(0).is("".lazy-emoji"")){var c=b.picker.offset().top,d=c+b.picker.height()+20;b.lasyEmoji.each(function(){var b=a(this),e=b.offset().top;if(e>c&&e<d&&b.attr(""src"",b.data(""src"")).removeClass(""lazy-emoji""),e>d)return!1}),b.lasyEmoji=b.lasyEmoji.filter("".lazy-emoji"")}}function F(a,b){return(b?"""":""."")+j+(a?""-""+a:"""")}function G(b){var c=a(""<div/>"",s(b)?b:{""class"":F(b,!0)});return a.each(i.call(arguments).slice(1),function(b,d){a.isFunction(d)&&(d=d.call(c)),d&&a(d).appendTo(c)}),c}function H(){return localStorage.getItem(""recent_emojis"")||""""}function I(b,c){var d=H();if(!b.recent||b.recent!==d||c){if(d.length){var e=b.scrollArea.is("".skinnable""),f,g;e||(f=b.scrollArea.scrollTop(),c&&b.recentCategory.show(),g=b.recentCategory.is("":visible"")?b.recentCategory.height():0);var h=p(d,b.emojiBtnTemplate,!0).split(""|"").join("""");if(b.recentCategory.children("".emojibtn"").remove(),a(h).insertAfter(b.recentCategory.children("".emojionearea-category-title"")),b.recentCategory.children("".emojibtn"").on(""click"",function(){b.trigger(""emojibtn.click"",a(this))}),b.recentFilter.show(),!e){b.recentCategory.show();var i=b.recentCategory.height();g!==i&&b.scrollArea.scrollTop(f+i-g)}}else b.recentFilter.hasClass(""active"")&&b.recentFilter.removeClass(""active"").next().addClass(""active""),b.recentCategory.hide(),b.recentFilter.hide();b.recent=d}}function J(a,b){var c=H(),d=c.split(""|""),e=d.indexOf(b);e!==-1&&d.splice(e,1),d.unshift(b),d.length>9&&d.pop(),localStorage.setItem(""recent_emojis"",d.join(""|"")),I(a)}function K(){var a=""test"";try{return localStorage.setItem(a,a),localStorage.removeItem(a),!0}catch(b){return!1}}function L(b,c,d){b.options=d=w(d),b.sprite=d.sprite&&k<3,b.inline=null===d.inline?c.is(""INPUT""):d.inline,b.shortnames=d.shortnames,b.saveEmojisAs=d.saveEmojisAs,b.standalone=d.standalone,b.emojiTemplate='<img alt=""{alt}"" class=""emojione'+(b.sprite?'-{uni}"" src=""'+h+'""/>':'emoji"" src=""{img}""/>'),b.emojiTemplateAlt=b.sprite?'<i class=""emojione-{uni}""/>':'<img class=""emojioneemoji"" src=""{img}""/>',b.emojiBtnTemplate='<i class=""emojibtn"" role=""button"" data-name=""{name}"" title=""{friendlyName}"">'+b.emojiTemplateAlt+""</i>"",b.recentEmojis=d.recentEmojis&&K();var f=d.pickerPosition;b.floatingPicker=""top""===f||""bottom""===f,b.source=c,(c.is("":disabled"")||c.is("".disabled""))&&b.disable();var g=c.is(""TEXTAREA"")||c.is(""INPUT"")?""val"":""text"",i,o,r,t,u,v,z,A,L,M,N=G(""tones"",d.tones?function(){this.addClass(F(""tones-""+d.tonesStyle,!0));for(var b=0;b<=5;b++)this.append(a(""<i/>"",{""class"":""btn-tone btn-tone-""+b+(b?"""":"" active""),""data-skin"":b,role:""button""}))}:null),O=G({""class"":j+(b.standalone?"" ""+j+""-standalone "":"" "")+(c.attr(""class"")||""""),role:""application""},i=b.editor=G(""editor"").attr({contenteditable:!b.standalone,placeholder:d.placeholder||c.data(""placeholder"")||c.attr(""placeholder"")||"""",tabindex:0}),o=b.button=G(""button"",G(""button-open""),G(""button-close"")).attr(""title"",d.buttonTitle),r=b.picker=G(""picker"",G(""wrapper"",t=G(""filters""),d.search?v=G(""search-panel"",G(""search"",d.search?function(){b.search=a(""<input/>"",{placeholder:d.searchPlaceholder||"""",type:""text"",""class"":""search""}),this.append(b.search)}:null),N):null,M=G(""scroll-area"",d.tones&&!d.search?G(""tones-panel"",N):null,z=G(""emojis-list"")))).addClass(F(""picker-position-""+d.pickerPosition,!0)).addClass(F(""filters-position-""+d.filtersPosition,!0)).addClass(F(""search-position-""+d.searchPosition,!0)).addClass(""hidden""));d.search&&v.addClass(F(""with-search"",!0)),b.searchSel=null,i.data(c.data()),a.each(d.attributes,function(a,b){i.attr(a,b)});var P=G(""category-block"").attr({""data-tone"":0}).prependTo(z);if(a.each(d.filters,function(c,e){var f=0;if(""recent""!==c||b.recentEmojis){if(""tones""!==c)a(""<i/>"",{""class"":F(""filter"",!0)+"" ""+F(""filter-""+c,!0),""data-filter"":c,title:e.title}).wrapInner(p(e.icon,b.emojiTemplateAlt)).appendTo(t);else{if(!d.tones)return;f=5}do{var g,h=e.emoji.replace(/[\s,;]+/g,""|"");g=0===f?G(""category"").attr({name:c,""data-tone"":f}).appendTo(P):G(""category-block"").attr({name:c,""data-tone"":f}).appendTo(z),f>0&&(g.hide(),h=h.split(""|"").join(""_tone""+f+""|"")+""_tone""+f),""recent""===c&&(h=H()),h=p(h,b.sprite?'<i class=""emojibtn"" role=""button"" data-name=""{name}"" title=""{friendlyName}""><i class=""emojione-{uni}""></i></i>':'<i class=""emojibtn"" role=""button"" data-name=""{name}"" title=""{friendlyName}""><img class=""emojioneemoji lazy-emoji"" data-src=""{img}""/></i>',!0).split(""|"").join(""""),g.html(h),a('<div class=""emojionearea-category-title""/>').text(e.title).prependTo(g)}while(--f>0)}}),d.filters=null,b.sprite||(b.lasyEmoji=z.find("".lazy-emoji"")),u=t.find(F(""filter"")),u.eq(0).addClass(""active""),L=z.find(F(""category-block"")),A=z.find(F(""category"")),b.recentFilter=u.filter('[data-filter=""recent""]'),b.recentCategory=A.filter(""[name=recent]""),b.scrollArea=M,d.container?a(d.container).wrapInner(O):O.insertAfter(c),d.hideSource&&c.hide(),b.setText(c[g]()),c[g](b.getText()),D.apply(b),b.standalone&&!b.getText().length){var Q=a(c).data(""emoji-placeholder"")||d.emojiPlaceholder;b.setText(Q),i.addClass(""has-placeholder"")}n(b,z.find("".emojibtn""),{click:""emojibtn.click""}),n(b,window,{resize:""!resize""}),n(b,N.children(),{click:""tone.click""}),n(b,[r,o],{mousedown:""!mousedown""},i),n(b,o,{click:""button.click""}),n(b,i,{paste:""!paste""},i),n(b,i,[""focus"",""blur""],function(){return!b.stayFocused&&i}),n(b,r,{mousedown:""picker.mousedown"",mouseup:""picker.mouseup"",click:""picker.click"",keyup:""picker.keyup"",keydown:""picker.keydown"",keypress:""picker.keypress""}),n(b,i,[""mousedown"",""mouseup"",""click"",""keyup"",""keydown"",""keypress""]),n(b,r.find("".emojionearea-filter""),{click:""filter.click""}),n(b,c,{change:""source.change""}),d.search&&n(b,b.search,{keyup:""search.keypress"",focus:""search.focus"",blur:""search.blur""});var R=!1;if(M.on(""scroll"",function(){if(!R&&(E.call(b),M.is("":not(.skinnable)""))){var c=A.eq(0),d=M.offset().top;A.each(function(b,e){return!(a(e).offset().top-d>=10)&&void(c=a(e))});var e=u.filter('[data-filter=""'+c.attr(""name"")+'""]');e[0]&&!e.is("".active"")&&(u.removeClass(""active""),e.addClass(""active""))}}),b.on(""@filter.click"",function(a){var c=a.is("".active"");if(M.is("".skinnable"")){if(c)return;N.children().eq(0).click()}R=!0,c||(u.filter("".active"").removeClass(""active""),a.addClass(""active""));var d=A.filter('[name=""'+a.data(""filter"")+'""]').offset().top,e=M.scrollTop(),f=M.offset().top;M.stop().animate({scrollTop:d+e-f-2},200,""swing"",function(){E.call(b),R=!1})}).on(""@picker.show"",function(){b.recentEmojis&&I(b),E.call(b)}).on(""@tone.click"",function(a){N.children().removeClass(""active"");var c=a.addClass(""active"").data(""skin"");c?(M.addClass(""skinnable""),L.hide().filter(""[data-tone=""+c+""]"").show(),u.removeClass(""active"")):(M.removeClass(""skinnable""),L.hide().filter(""[data-tone=0]"").show(),u.eq(0).click()),E.call(b),d.search&&b.trigger(""search.keypress"")}).on(""@button.click"",function(a){a.is("".active"")?b.hidePicker():(b.showPicker(),b.searchSel=null)}).on(""@!paste"",function(c,d){var e=function(d){var e=""caret-""+(new Date).getTime(),f=B(d,b);q(f),q('<i id=""'+e+'""></i>'),c.scrollTop(h);var g=a(""#""+e),i=g.offset().top-c.offset().top,j=c.height();(h+i>=j||h>i)&&c.scrollTop(h+i-2*j/3),g.remove(),b.stayFocused=!1,D.apply(b),m(b,""paste"",[c,d,f])};if(d.originalEvent.clipboardData){var f=d.originalEvent.clipboardData.getData(""text/plain"");return e(f),d.preventDefault?d.preventDefault():d.stop(),d.returnValue=!1,d.stopPropagation(),!1}b.stayFocused=!0,q(""<span>""+l+""</span>"");var g=x(c[0]),h=c.scrollTop(),i=a(""<div/>"",{contenteditable:!0}).css({position:""fixed"",left:""-999px"",width:""1px"",height:""1px"",top:""20px"",overflow:""hidden""}).appendTo(a(""BODY"")).focus();window.setTimeout(function(){c.focus(),y(c[0],g);var a=C(i.html().replace(/\r\n|\n|\r/g,""<br>""),b);i.remove(),e(a)},200)}).on(""@emojibtn.click"",function(a){i.removeClass(""has-placeholder""),null!==b.searchSel&&(i.focus(),y(i[0],b.searchSel),b.searchSel=null),b.standalone?(i.html(p(a.data(""name""),b.emojiTemplate)),b.trigger(""blur"")):(x(i[0]),q(p(a.data(""name""),b.emojiTemplate))),b.recentEmojis&&J(b,a.data(""name"")),b.trigger(""search.keypress"")}).on(""@!resize @keyup @emojibtn.click"",D).on(""@!mousedown"",function(c,d){return a(d.target).hasClass(""search"")?(b.stayFocused=!0,null===b.searchSel&&(b.searchSel=x(c[0]))):(O.is("".focused"")||c.trigger(""focus""),d.preventDefault()),!1}).on(""@change"",function(){var a=b.editor.html().replace(/<\/?(?:div|span|p)[^>]*>/gi,"""");a.length&&!/^<br[^>]*>$/i.test(a)||b.editor.html(b.content=""""),c[g](b.getText())}).on(""@source.change"",function(){b.setText(c[g]()),m(""change"")}).on(""@focus"",function(){O.addClass(""focused"")}).on(""@blur"",function(){O.removeClass(""focused""),d.hidePickerOnBlur&&b.hidePicker();var a=b.editor.html();b.content!==a?(b.content=a,m(b,""change"",[b.editor]),c.trigger(""blur"").trigger(""change"")):c.trigger(""blur""),d.search&&(b.search.val(""""),b.trigger(""search.keypress"",!0))}),d.search&&b.on(""@search.focus"",function(){b.stayFocused=!0,b.search.addClass(""focused"")}).on(""@search.keypress"",function(c){var e=r.find("".emojionearea-filter""),f=d.tones?N.find(""i.active"").data(""skin""):0,g=b.search.val().replace(/ /g,""_"").replace(/""/g,'\\""');g&&g.length?(b.recentFilter.hasClass(""active"")&&b.recentFilter.removeClass(""active"").next().addClass(""active""),b.recentCategory.hide(),b.recentFilter.hide(),L.each(function(){var b=function(a,b){var c=a.find('.emojibtn[data-name*=""'+g+'""]');if(0===c.length)a.data(""tone"")===b&&a.hide(),e.filter('[data-filter=""'+a.attr(""name"")+'""]').hide();else{var d=a.find('.emojibtn:not([data-name*=""'+g+'""])');d.hide(),c.show(),a.data(""tone"")===b&&a.show(),e.filter('[data-filter=""'+a.attr(""name"")+'""]').show()}},c=a(this);0===c.data(""tone"")?A.filter(':not([name=""recent""])').each(function(){b(a(this),0)}):b(c,f)}),R?E.call(b):M.trigger(""scroll"")):(I(b,!0),L.filter('[data-tone=""'+N.find(""i.active"").data(""skin"")+'""]:not([name=""recent""])').show(),a("".emojibtn"",L).show(),e.show(),E.call(b))}).on(""@search.blur"",function(){b.stayFocused=!1,b.search.removeClass(""focused""),b.trigger(""blur"")}),d.shortcuts&&b.on(""@keydown"",function(a,c){c.ctrlKey||(9==c.which?(c.preventDefault(),o.click()):27==c.which&&(c.preventDefault(),o.is("".active"")&&b.hidePicker()))}),s(d.events)&&!a.isEmptyObject(d.events)&&a.each(d.events,function(a,c){b.on(a.replace(/_/g,"".""),c)}),d.autocomplete){var S=function(){var c={maxCount:d.textcomplete.maxCount,placement:d.textcomplete.placement};d.shortcuts&&(c.onKeydown=function(a,b){if(!a.ctrlKey&&13==a.which)return b.KEY_ENTER});var f=a.map(e.emojioneList,function(a,b){return d.autocompleteTones?b:/_tone[12345]/.test(b)?null:b});f.sort(),i.textcomplete([{id:j,match:/\B(:[\-+\w]*)$/,search:function(b,c){c(a.map(f,function(a){return 0===a.indexOf(b)?a:null}))},template:function(a){return p(a,b.emojiTemplate)+"" ""+a.replace(/:/g,"""")},replace:function(a){return p(a,b.emojiTemplate)},cache:!0,index:1}],c),d.textcomplete.placement&&""static""==a(i.data(""textComplete"").option.appendTo).css(""position"")&&a(i.data(""textComplete"").option.appendTo).css(""position"",""relative"")},T=function(){if(b.disabled){var a=function(){b.off(""enabled"",a),S()};b.on(""enabled"",a)}else S()};a.fn.textcomplete?T():a.ajax({url:""https://cdn.rawgit.com/yuku-t/jquery-textcomplete/v1.3.4/dist/jquery.textcomplete.js"",dataType:""script"",cache:!0,success:T})}b.inline&&(O.addClass(F(""inline"",!0)),b.on(""@keydown"",function(a,b){13==b.which&&b.preventDefault()})),/firefox/i.test(navigator.userAgent)&&document.execCommand(""enableObjectResizing"",!1,!1),b.isReady=!0,b.trigger(""onLoad"",i),b.trigger(""ready"",i)}var M={defaultBase:""https://cdnjs.cloudflare.com/ajax/libs/emojione/"",defaultBase3:""https://cdn.jsdelivr.net/"",base:null,isLoading:!1};function N(b){var c=r();if(b=w(b),!M.isLoading)if(!e||u(t(e))<2){M.isLoading=!0;var d;d=u(c)>5?M.defaultBase3+""npm/emojione@""+c:u(c)>4?M.defaultBase3+""emojione/""+c:M.defaultBase+""/""+c,a.ajax({url:d+""/lib/js/emojione.min.js"",dataType:""script"",cache:!0,success:function(){e=window.emojione,c=t(e),k=u(c);var d;k>4?(M.base=M.defaultBase3+""emojione/assets/""+c,d=M.base+""/sprites/emojione-sprite-""+e.emojiSize+"".css""):(M.base=M.defaultBase+c+""/assets"",d=M.base+""/sprites/emojione.sprites.css""),b.sprite&&(document.createStyleSheet?document.createStyleSheet(d):a(""<link/>"",{rel:""stylesheet"",href:d}).appendTo(""head""));while(f.length)f.shift().call();M.isLoading=!1}})}else c=t(e),k=u(c),k>4?M.base=M.defaultBase3+""emojione/assets/""+c:M.base=M.defaultBase+c+""/assets"";g(function(){var a="""";b.useInternalCDN&&(k>4&&(a=e.emojiSize+""/""),e.imagePathPNG=M.base+""/png/""+a,e.imagePathSVG=M.base+""/svg/""+a,e.imagePathSVGSprites=M.base+""/sprites/emojione.sprites.svg"",e.imageType=b.imageType),u(c)>4?(z=e.regUnicode,e.imageType=b.imageType||""png""):z=new RegExp(""<object[^>]*>.*?</object>|<span[^>]*>.*?</span>|<(?:object|embed|svg|img|div|span|p|a)[^>]*>|(""+e.unicodeRegexp+"")"",""gi"")})}var O=function(a,e){var f=this;N(e),c[f.id=++b]={},d[f.id]={},g(function(){L(f,a,e)})};function P(b,c){c=c.replace(/^@/,"""");var e=b.id;d[e][c]&&(a.each(d[e][c],function(d,e){a.each(a.isArray(e[0])?e[0]:[e[0]],function(d,f){a(f).on(e[1],function(){var d=i.call(arguments),f=a.isFunction(e[2])?e[2].apply(b,[c].concat(d)):e[2];f&&m(b,c,[f].concat(d))})})}),d[e][c]=null)}O.prototype.on=function(b,d){if(b&&a.isFunction(d)){var e=this;a.each(b.toLowerCase().split("" ""),function(a,b){P(e,b),(c[e.id][b]||(c[e.id][b]=[])).push(d)})}return this},O.prototype.off=function(b,d){if(b){var e=this.id;a.each(b.toLowerCase().replace(/_/g,""."").split("" ""),function(b,f){c[e][f]&&!/^@/.test(f)&&(d?a.each(c[e][f],function(a,b){b===d&&(c[e][f]=c[e][f].splice(a,1))}):c[e][f]=[])})}return this},O.prototype.trigger=function(){var a=i.call(arguments),b=[this].concat(a.slice(0,1));return b.push(a.slice(1)),m.apply(this,b)},O.prototype.setFocus=function(){var a=this;return g(function(){a.editor.focus()}),a},O.prototype.setText=function(a){var b=this;return g(function(){b.editor.html(B(a,b)),b.content=b.editor.html(),m(b,""change"",[b.editor]),D.apply(b)}),b},O.prototype.getText=function(){return C(this.editor.html(),this)},O.prototype.showPicker=function(){var a=this;return a._sh_timer&&window.clearTimeout(a._sh_timer),a.picker.removeClass(""hidden""),a._sh_timer=window.setTimeout(function(){a.button.addClass(""active"")},50),m(a,""picker.show"",[a.picker]),a},O.prototype.hidePicker=function(){var a=this;return a._sh_timer&&window.clearTimeout(a._sh_timer),a.button.removeClass(""active""),a._sh_timer=window.setTimeout(function(){a.picker.addClass(""hidden"")},500),m(a,""picker.hide"",[a.picker]),a},O.prototype.enable=function(){var a=this,b=function(){a.disabled=!1,a.editor.prop(""contenteditable"",!0),a.button.show();var b=a[a.standalone?""button"":""editor""];b.parent().removeClass(""emojionearea-disable""),m(a,""enabled"",[b])};return a.isReady?b():a.on(""ready"",b),a},O.prototype.disable=function(){var a=this;a.disabled=!0;var b=function(){a.editor.prop(""contenteditable"",!1),a.hidePicker(),a.button.hide();var b=a[a.standalone?""button"":""editor""];b.parent().addClass(""emojionearea-disable""),m(a,""disabled"",[b])};return a.isReady?b():a.on(""ready"",b),a},a.fn.emojioneArea=function(b){return this.each(function(){return this.emojioneArea?this.emojioneArea:(a.data(this,""emojioneArea"",this.emojioneArea=new O(a(this),b)),this.emojioneArea)})},a.fn.emojioneArea.defaults=v(),a.fn.emojioneAreaText=function(b){b=w(b);var c=this,d={shortnames:!b||""undefined""==typeof b.shortnames||b.shortnames,emojiTemplate:'<img alt=""{alt}"" class=""emojione'+(b&&b.sprite&&k<3?'-{uni}"" src=""'+h:'emoji"" src=""{img}')+'""/>'};return N(b),g(function(){c.each(function(){var b=a(this);return b.hasClass(""emojionearea-text"")||b.addClass(""emojionearea-text"").html(B(b.is(""TEXTAREA"")||b.is(""INPUT"")?b.val():b.text(),d)),b})}),this}},window);";
	
КонецФункции

// Функция, возвращает текст стилей поля чата.
//
Функция ПолучитьСтилиПоляЧата() Экспорт
	
	// https://rawgit.com/mervick/emojionearea/master/dist/emojionearea.min.css
	Возврат ".dropdown-menu.textcomplete-dropdown[data-strategy=emojionearea]{position:absolute;z-index:1000;min-width:160px;padding:5px 0;margin:2px 0 0;font-size:14px;text-align:left;list-style:none;background-color:#fff;-webkit-background-clip:padding-box;background-clip:padding-box;border:1px solid #ccc;border:1px solid rgba(0,0,0,.15);-moz-border-radius:4px;-webkit-border-radius:4px;border-radius:4px;-moz-box-shadow:0 6px 12px rgba(0,0,0,.175);-webkit-box-shadow:0 6px 12px rgba(0,0,0,.175);box-shadow:0 6px 12px rgba(0,0,0,.175)}.dropdown-menu.textcomplete-dropdown[data-strategy=emojionearea] li.textcomplete-item{font-size:14px;padding:1px 3px;border:0}.dropdown-menu.textcomplete-dropdown[data-strategy=emojionearea] li.textcomplete-item a{text-decoration:none;display:block;height:100%;line-height:1.8em;padding:0 1.54em 0 .615em;color:#4f4f4f}.dropdown-menu.textcomplete-dropdown[data-strategy=emojionearea] li.textcomplete-item.active,.dropdown-menu.textcomplete-dropdown[data-strategy=emojionearea] li.textcomplete-item:hover{background-color:#e4e4e4}.dropdown-menu.textcomplete-dropdown[data-strategy=emojionearea] li.textcomplete-item.active a,.dropdown-menu.textcomplete-dropdown[data-strategy=emojionearea] li.textcomplete-item:hover a{color:#333}.dropdown-menu.textcomplete-dropdown[data-strategy=emojionearea] li.textcomplete-item .emojioneemoji{font-size:inherit;height:2ex;width:2.1ex;min-height:20px;min-width:20px;display:inline-block;margin:0 5px .2ex 0;line-height:normal;vertical-align:middle;max-width:100%;top:0}.emojionearea-text .emojioneemoji,.emojionearea-text [class*=emojione-]{font-size:inherit;height:2ex;width:2.1ex;min-height:20px;min-width:20px;display:inline-block;margin:-.2ex .15em .2ex;line-height:normal;vertical-align:middle;max-width:100%;top:0}.emojionearea,.emojionearea *{-moz-box-sizing:border-box;-webkit-box-sizing:border-box;box-sizing:border-box}.emojionearea.emojionearea-disable{position:relative;background-color:#eee;-moz-user-select:-moz-none;-ms-user-select:none;-webkit-user-select:none;user-select:none}.emojionearea.emojionearea-disable:before{content:'';display:block;top:0;left:0;right:0;bottom:0;z-index:1;opacity:.3;position:absolute;background-color:#eee}.emojionearea,.emojionearea.form-control{display:block;position:relative!important;width:100%;height:auto;padding:0;font-size:14px;background-color:#FFF;border:1px solid #CCC;-moz-border-radius:3px;-webkit-border-radius:3px;border-radius:3px;-moz-box-shadow:inset 0 1px 1px rgba(0,0,0,.075);-webkit-box-shadow:inset 0 1px 1px rgba(0,0,0,.075);box-shadow:inset 0 1px 1px rgba(0,0,0,.075);-moz-transition:border-color .15s ease-in-out,-moz-box-shadow .15s ease-in-out;-o-transition:border-color .15s ease-in-out,box-shadow .15s ease-in-out;-webkit-transition:border-color .15s ease-in-out,-webkit-box-shadow .15s ease-in-out;transition:border-color .15s ease-in-out,box-shadow .15s ease-in-out}.emojionearea.focused{border-color:#66AFE9;outline:0;-moz-box-shadow:inset 0 1px 1px rgba(0,0,0,.075),0 0 8px rgba(102,175,233,.6);-webkit-box-shadow:inset 0 1px 1px rgba(0,0,0,.075),0 0 8px rgba(102,175,233,.6);box-shadow:inset 0 1px 1px rgba(0,0,0,.075),0 0 8px rgba(102,175,233,.6)}.emojionearea .emojionearea-editor{display:block;height:auto;min-height:8em;max-height:15em;overflow:auto;padding:6px 24px 6px 12px;line-height:1.42857143;font-size:inherit;color:#555;background-color:transparent;border:0;cursor:text;margin-right:1px;-moz-border-radius:0;-webkit-border-radius:0;border-radius:0;-moz-box-shadow:none;-webkit-box-shadow:none;box-shadow:none}.emojionearea .emojionearea-editor:empty:before{content:attr(placeholder);display:block;color:#BBB}.emojionearea .emojionearea-editor:focus{border:0;outline:0;-moz-box-shadow:none;-webkit-box-shadow:none;box-shadow:none}.emojionearea .emojionearea-editor .emojioneemoji,.emojionearea .emojionearea-editor [class*=emojione-]{font-size:inherit;height:2ex;width:2.1ex;min-height:20px;min-width:20px;display:inline-block;margin:-.2ex .15em .2ex;line-height:normal;vertical-align:middle;max-width:100%;top:0}.emojionearea.emojionearea-inline{height:34px}.emojionearea.emojionearea-inline>.emojionearea-editor{height:32px;min-height:20px;overflow:hidden;white-space:nowrap;position:absolute;top:0;left:12px;right:24px;padding:6px 0}.emojionearea.emojionearea-inline>.emojionearea-button{top:4px}.emojionearea .emojionearea-button{z-index:5;position:absolute;right:3px;top:3px;width:24px;height:24px;opacity:.6;cursor:pointer;-moz-transition:opacity .3s ease-in-out;-o-transition:opacity .3s ease-in-out;-webkit-transition:opacity .3s ease-in-out;transition:opacity .3s ease-in-out}.emojionearea .emojionearea-button:hover{opacity:1}.emojionearea .emojionearea-button>div{display:block;width:24px;height:24px;position:absolute;-moz-transition:all .4s ease-in-out;-o-transition:all .4s ease-in-out;-webkit-transition:all .4s ease-in-out;transition:all .4s ease-in-out}.emojionearea .emojionearea-button>div.emojionearea-button-open{background-position:0 -24px;filter:alpha(enabled=false);opacity:1}.emojionearea .emojionearea-button>div.emojionearea-button-close{background-position:0 0;-webkit-transform:rotate(-45deg);-o-transform:rotate(-45deg);transform:rotate(-45deg);filter:alpha(Opacity=0);opacity:0}.emojionearea .emojionearea-button.active>div.emojionearea-button-open{-webkit-transform:rotate(45deg);-o-transform:rotate(45deg);transform:rotate(45deg);filter:alpha(Opacity=0);opacity:0}.emojionearea .emojionearea-button.active>div.emojionearea-button-close{-webkit-transform:rotate(0);-o-transform:rotate(0);transform:rotate(0);filter:alpha(enabled=false);opacity:1}.emojionearea .emojionearea-picker{background:#FFF;position:absolute;-moz-box-shadow:0 1px 5px rgba(0,0,0,.32);-webkit-box-shadow:0 1px 5px rgba(0,0,0,.32);box-shadow:0 1px 5px rgba(0,0,0,.32);-moz-border-radius:5px;-webkit-border-radius:5px;border-radius:5px;height:276px;width:316px;top:-15px;right:-15px;z-index:90;-moz-transition:all .25s ease-in-out;-o-transition:all .25s ease-in-out;-webkit-transition:all .25s ease-in-out;transition:all .25s ease-in-out;filter:alpha(Opacity=0);opacity:0;-moz-user-select:-moz-none;-ms-user-select:none;-webkit-user-select:none;user-select:none}.emojionearea .emojionearea-picker.hidden{display:none}.emojionearea .emojionearea-picker .emojionearea-wrapper{position:relative;height:276px;width:316px}.emojionearea .emojionearea-picker .emojionearea-wrapper:after{content:'';display:block;position:absolute;background-repeat:no-repeat;z-index:91}.emojionearea .emojionearea-picker .emojionearea-filters{width:100%;position:absolute;z-index:95;background:#F5F7F9;padding:0 0 0 7px;height:40px}.emojionearea .emojionearea-picker .emojionearea-filters .emojionearea-filter{display:block;float:left;height:40px;width:32px;padding:7px 1px 0;cursor:pointer;-webkit-filter:grayscale(1);filter:grayscale(1)}.emojionearea .emojionearea-picker .emojionearea-filters .emojionearea-filter.active{background:#fff}.emojionearea .emojionearea-picker .emojionearea-filters .emojionearea-filter.active,.emojionearea .emojionearea-picker .emojionearea-filters .emojionearea-filter:hover{-webkit-filter:grayscale(0);filter:grayscale(0)}.emojionearea .emojionearea-picker .emojionearea-filters .emojionearea-filter>i{width:24px;height:24px;top:0}.emojionearea .emojionearea-picker .emojionearea-filters .emojionearea-filter>img{width:24px;height:24px;margin:0 3px}.emojionearea .emojionearea-picker .emojionearea-search-panel{height:30px;position:absolute;z-index:95;top:40px;left:0;right:0;padding:5px 0 5px 8px}.emojionearea .emojionearea-picker .emojionearea-search-panel .emojionearea-tones{float:right;margin-right:10px;margin-top:-1px}.emojionearea .emojionearea-picker .emojionearea-tones-panel .emojionearea-tones{position:absolute;top:4px;left:171px}.emojionearea .emojionearea-picker .emojionearea-search{float:left;padding:0;height:20px;width:160px}.emojionearea .emojionearea-picker .emojionearea-search>input{outline:0;width:160px;min-width:160px;height:20px}.emojionearea .emojionearea-picker .emojionearea-tones{padding:0;width:120px;height:20px}.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone{display:inline-block;padding:0;border:0;vertical-align:middle;outline:0;background:0 0;cursor:pointer;position:relative}.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-0,.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-0:after{background-color:#ffcf3e}.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-1,.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-1:after{background-color:#fae3c5}.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-2,.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-2:after{background-color:#e2cfa5}.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-3,.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-3:after{background-color:#daa478}.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-4,.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-4:after{background-color:#a78058}.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-5,.emojionearea .emojionearea-picker .emojionearea-tones>.btn-tone.btn-tone-5:after{background-color:#5e4d43}.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-bullet>.btn-tone,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-square>.btn-tone{width:20px;height:20px;margin:0;background-color:transparent}.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-bullet>.btn-tone:after,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-square>.btn-tone:after{content:'';position:absolute;display:block;top:4px;left:4px;width:12px;height:12px}.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-bullet>.btn-tone.active:after,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-square>.btn-tone.active:after{top:0;left:0;width:20px;height:20px}.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-checkbox>.btn-tone,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-radio>.btn-tone{width:16px;height:16px;margin:0 2px}.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-checkbox>.btn-tone.active:after,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-radio>.btn-tone.active:after{content:'';position:absolute;display:block;background-color:transparent;border:2px solid #fff;width:8px;height:8px;top:2px;left:2px;box-sizing:initial}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-block:after,.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-block:before,.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-block>.emojionearea-category:after,.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-block>.emojionearea-category:before,.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-title:after,.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-title:before{content:' ';clear:both;display:block}.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-bullet>.btn-tone,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-bullet>.btn-tone:after,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-radio>.btn-tone,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-radio>.btn-tone:after{-moz-border-radius:100%;-webkit-border-radius:100%;border-radius:100%}.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-checkbox>.btn-tone,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-checkbox>.btn-tone:after,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-square>.btn-tone,.emojionearea .emojionearea-picker .emojionearea-tones.emojionearea-tones-square>.btn-tone:after{-moz-border-radius:1px;-webkit-border-radius:1px;border-radius:1px}.emojionearea .emojionearea-picker .emojionearea-scroll-area{height:236px;overflow:auto;overflow-x:hidden;width:100%;position:absolute;padding:0 0 5px}.emojionearea .emojionearea-picker .emojionearea-search-panel+.emojionearea-scroll-area{height:206px}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-emojis-list{z-index:1}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-title{display:block;font-family:Arial,'Helvetica Neue',Helvetica,sans-serif;font-size:13px;font-weight:400;color:#b2b2b2;background:#FFF;line-height:20px;margin:0;padding:7px 0 5px 6px}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-block{padding:0 0 0 7px}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojionearea-category-block>.emojionearea-category{padding:0!important}.emojionearea .emojionearea-picker .emojionearea-scroll-area [class*=emojione-]{-moz-box-sizing:content-box;-webkit-box-sizing:content-box;box-sizing:content-box;margin:0;width:24px;height:24px;top:0}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojibtn{-moz-box-sizing:content-box;-webkit-box-sizing:content-box;box-sizing:content-box;width:24px;height:24px;float:left;display:block;margin:1px;padding:3px}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojibtn:hover{-moz-border-radius:4px;-webkit-border-radius:4px;border-radius:4px;background-color:#e4e4e4;cursor:pointer}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojibtn i,.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojibtn img{float:left;display:block;width:24px;height:24px}.emojionearea .emojionearea-picker .emojionearea-scroll-area .emojibtn img.lazy-emoji{filter:alpha(Opacity=0);opacity:0}.emojionearea .emojionearea-picker.emojionearea-filters-position-top .emojionearea-filters{top:0;-moz-border-radius-topleft:5px;-webkit-border-top-left-radius:5px;border-top-left-radius:5px;-moz-border-radius-topright:5px;-webkit-border-top-right-radius:5px;border-top-right-radius:5px}.emojionearea .emojionearea-picker.emojionearea-filters-position-top.emojionearea-search-position-top .emojionearea-scroll-area{bottom:0}.emojionearea .emojionearea-picker.emojionearea-filters-position-top.emojionearea-search-position-bottom .emojionearea-scroll-area{top:40px}.emojionearea .emojionearea-picker.emojionearea-filters-position-top.emojionearea-search-position-bottom .emojionearea-search-panel{top:initial;bottom:0}.emojionearea .emojionearea-picker.emojionearea-filters-position-bottom .emojionearea-filters{bottom:0;-moz-border-radius-bottomleft:5px;-webkit-border-bottom-left-radius:5px;border-bottom-left-radius:5px;-moz-border-radius-bottomright:5px;-webkit-border-bottom-right-radius:5px;border-bottom-right-radius:5px}.emojionearea .emojionearea-picker.emojionearea-filters-position-bottom.emojionearea-search-position-bottom .emojionearea-scroll-area{top:0}.emojionearea .emojionearea-picker.emojionearea-filters-position-bottom.emojionearea-search-position-bottom .emojionearea-search-panel,.emojionearea .emojionearea-picker.emojionearea-filters-position-bottom.emojionearea-search-position-top .emojionearea-scroll-area{top:initial;bottom:40px}.emojionearea .emojionearea-picker.emojionearea-filters-position-bottom.emojionearea-search-position-top .emojionearea-search-panel{top:0}.emojionearea .emojionearea-picker.emojionearea-picker-position-top{margin-top:-286px;right:-14px}.emojionearea .emojionearea-picker.emojionearea-picker-position-top .emojionearea-wrapper:after{width:19px;height:10px;background-position:-2px -49px;bottom:-10px;right:20px}.emojionearea .emojionearea-picker.emojionearea-picker-position-top.emojionearea-filters-position-bottom .emojionearea-wrapper:after{background-position:-2px -80px}.emojionearea .emojionearea-picker.emojionearea-picker-position-left,.emojionearea .emojionearea-picker.emojionearea-picker-position-right{margin-right:-326px;top:-8px}.emojionearea .emojionearea-picker.emojionearea-picker-position-left .emojionearea-wrapper:after,.emojionearea .emojionearea-picker.emojionearea-picker-position-right .emojionearea-wrapper:after{width:10px;height:19px;background-position:0 -60px;top:13px;left:-10px}.emojionearea .emojionearea-picker.emojionearea-picker-position-left.emojionearea-filters-position-bottom .emojionearea-wrapper:after,.emojionearea .emojionearea-picker.emojionearea-picker-position-right.emojionearea-filters-position-bottom .emojionearea-wrapper:after{background-position:right -60px}.emojionearea .emojionearea-picker.emojionearea-picker-position-bottom{margin-top:10px;right:-14px;top:47px}.emojionearea .emojionearea-picker.emojionearea-picker-position-bottom .emojionearea-wrapper:after{width:19px;height:10px;background-position:-2px -100px;top:-10px;right:20px}.emojionearea .emojionearea-picker.emojionearea-picker-position-bottom.emojionearea-filters-position-bottom .emojionearea-wrapper:after{background-position:-2px -90px}.emojionearea .emojionearea-button.active+.emojionearea-picker{filter:alpha(enabled=false);opacity:1}.emojionearea .emojionearea-button.active+.emojionearea-picker-position-top{margin-top:-269px}.emojionearea .emojionearea-button.active+.emojionearea-picker-position-left,.emojionearea .emojionearea-button.active+.emojionearea-picker-position-right{margin-right:-309px}.emojionearea .emojionearea-button.active+.emojionearea-picker-position-bottom{margin-top:-7px}.emojionearea.emojionearea-standalone{display:inline-block;width:auto;box-shadow:none}.emojionearea.emojionearea-standalone .emojionearea-editor{min-height:33px;position:relative;padding:6px 42px 6px 6px}.emojionearea.emojionearea-standalone .emojionearea-editor::before{content:'';position:absolute;top:4px;left:50%;bottom:4px;border-left:1px solid #e6e6e6}.emojionearea.emojionearea-standalone .emojionearea-editor.has-placeholder .emojioneemoji{opacity:.4}.emojionearea.emojionearea-standalone .emojionearea-button{top:0;right:0;bottom:0;left:0;width:auto;height:auto}.emojionearea.emojionearea-standalone .emojionearea-button>div{right:6px;top:5px}.emojionearea.emojionearea-standalone .emojionearea-picker.emojionearea-picker-position-bottom .emojionearea-wrapper:after,.emojionearea.emojionearea-standalone .emojionearea-picker.emojionearea-picker-position-top .emojionearea-wrapper:after{right:23px}.emojionearea.emojionearea-standalone .emojionearea-picker.emojionearea-picker-position-left .emojionearea-wrapper:after,.emojionearea.emojionearea-standalone .emojionearea-picker.emojionearea-picker-position-right .emojionearea-wrapper:after{top:15px}.emojionearea .emojionearea-button>div,.emojionearea .emojionearea-picker .emojionearea-wrapper:after{background-image:url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABcAAABuCAYAAADMB4ipAAAHfElEQVRo3u1XS1NT2Rb+9uOcQF4YlAJzLymFUHaLrdxKULvEUNpdTnRqD532f+AHMLMc94gqR1Zbt8rBnUh3YXipPGKwRDoWgXvrYiFUlEdIkPPYZ/dAkwox5yQCVt/bzRrBPnt9e+211/etFeDQDu3ArL+/X37OeqmRWoH7+vpItfWawStF1tfXR+zW9xW5ne0p8loOcAKuCdwpRft60C8a+X5zTvebCqcAvmidf1GGHtqhHdpf1qqKzsrKipyensbi4iKWl5cBAMFgEG1tbYhGo2hpadlbmxseHpaDg4MAgI6ODng8HgBAPp/H/Pw8AODatWvo7e2tvUHrui7v3r2L+fl5XL58GVeuXIHH49m1N5/Py0ePHmF0dBQdHR24desWVFXdtYdXAn/48CHm5+dx8+ZNRKPRigEUDpuenpb3799H4YaOnWh5eVmOj48jFoshGo0STdPkwMCAXF5elqV7BgYGpKZpMhqNklgshrGxMbx580Y6gicSCTDGEIvFAADpdBqpVArJZLK4J5lMIpVKIZ1OAwBisRgYY0gkEs6Rp1IphMNh+Hw+AgCGYQAANE0r7in8Xfjm8/lIOBzGq1evnMHX19fR1NRU/D8UCoFzjnA4XFwLh8PgnCMUChXXmpqakM1mUfVBS62xsZHk83lZWi1nz579ZA0AhBDO4A0NDchkMsWSJIRAURRiVy26rktVVUkmk0EgEHAGP3XqFKamppDP56Vpmrhz5w5u374t/X4/OP+w3TRNZLNZ6LoO0zSRz+dlf38/Ll686Jzz8+fPQwiBeDwOt9tNrl+/jkwmU6yaQpVkMhncuHEDbrebxONxCCEQiUScIw8Gg+TBgwdyZGQEyWRSdnV1kVQqJYeGhrC6ugrGGEKhEHp7e3Hy5EmSTCblvXv30NPTg2AwSA6M/vF4HCMjI7b0/yzh8vv9AIBsNrt34aokuQsLC7skt729varkHtqftUFf++FHsrq0QN3eBvp68Tfvf9Mv12oFCYU7G//e9nVuO7dpNbe2W4M//yQr0p8yRvyBo1Zr++lwLcCt7afD/sBRizJGavrB1dDYYh47Htrq+Kb7jBNwxzfdZ44dD201NLaYVUkU7ozQpuAJBkARwnRZpunN5zaa5hJjiXLH05GeiMd7JEM5zzHGNQBGZvk/Iv0yYVWMvK0zKk1Dl6ahW5RQobjqdjy+wEZn9PKF0n2d0csXPL7AhuKq26GECtPQLdPQZVtn1LlB69p7yRVVSEiDEGJwRd12e4+8PR3piRQidnuPvOWKuk0IMSSkwRVV6Np7WVVbSqvGsgSnlKkAFNPQXdrOtuKqcxtcUTUAhmUJnVJmlleJo3CVHmAaOlPUOmYJkxFKibQsSRkXhr4juKIKO2BHVSwcoLrqCVdUYho6K3YYRRWmoUtdey/tgKtK7rUffiQAsLq08MnbNLe2WwBgB/zHzueFyD8nwlIfbvdx8eU0WV1aKD1cVAMs9+F2j9gUPEEKemEJIe3AnXy4XfkBoNKSZHNthWfX31EA69VKttyHVyIOY1wRwmS6tqNsrr31vXo5k/bUu4gT2cp9lhbm0rzCJpeUUrE0vS63+c7/6uXMbDUWl/ssLczNFrVFddUT09AZpUy1LKvO0DVfPrfR9HxqfNbuEe185l9MFX3o6tIC5YpKFLWOfdQQ93Zu49j0+FDCDtjOp1yaOQCYhs4Y40wI05XfWj8yPT40Ua2ey33mEmMTtp2IUEq0nW3FKeJPGPjRp1Iz2QUuLUu66txG9NLVSK3gBZ+C1lcE54oqKOOCK6rm8QU2unu+u1ANuNynvFsBAG1ubbdMQ5eGviMAFDuP0w3sfMpvQEtb24fOQncU1bXl8R7JnOu+ZNv97XxKJwY6+PNPsrm13drObVqUMlMIU5OWpVHOc96Go5lTnV2fzC/VfAozD7HTCa6olBBa1Imlhbmq2lLuQ5xaW6nCPfnln0Yt7bDUhzhps8cfKH5//uTXmvS81OeLdqI/ZoROzSZrHqG/OvOPzxuhK5VgJTvV2bW3EdqJRABwrvvS/kfoSkoZvXT1YEbociHr7vnuYEfogpBFL109HKH/h0fomnXg3Lff79r7/MmvVbWG7gX4QObzc99+Tz7mHKah05KcW6ahQ9feS6cbMCdgt7eBWJagjCuUAC5tZzuouuo0Spm0hElc9R4cbf4bVl8v1p6WUmCuqEwIs34ruxaeeTy4uJVd67As08UVlVmWoG5vA7FLG3WMmHEupVTyW+vh2cn4DADMTsaTuc21LiGEhzHOnQ6gNtMrJSBMCKHkNt999WLi0S7hejEZH81n174WpukiIMw0dKq66p3Bw50RwhUVXFGJKUy28Xal48VkfKrSlWenhsc23q2cEB9SR7iiItwZIbbgHn8AlDFCCMW7laXjqZnHjkNpaubJzNuVpWZCKChjxOMPVH/QlaW0f/G3ZLqWWl6ce/bvlddp7yFD/w8Z+njoX1+GoZMjgzMAMDkyeLAMnRh+uKveJ0YGD4ahEyODFRk6OfrL/hj67GnckaHPng7vjaGzyYmaGDr77KktQ38H8tqx8Wja+WIAAAAASUVORK5CYII=)!important}.emojionearea.emojionearea-standalone .emojionearea-editor.has-placeholder{background-repeat:no-repeat;background-position:20px 4px;background-image:url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAwAAAAMAQMAAABsu86kAAAABlBMVEUAAAC/v79T5hyIAAAAAXRSTlMAQObYZgAAABNJREFUCNdjYGNgQEb/P4AQqiAASiUEG6Vit44AAAAASUVORK5CYII=)!important}";
	
КонецФункции

// Функция, возвращает текст скрипта парсера эмодзи.
//
Функция ПолучитьСкриптПарсераЭмодзи() Экспорт
	
	// https://twemoji.maxcdn.com/2/twemoji.min.js?11.2
	Возврат "var twemoji=function(){""use strict"";var twemoji={base:""https://cdn.jsdelivr.net/gh/twitter/twemoji@14.0.2/assets/"",ext:"".png"",size:""72x72"",className:""emoji"",convert:{fromCodePoint:fromCodePoint,toCodePoint:toCodePoint},onerror:function onerror(){if(this.parentNode){this.parentNode.replaceChild(createText(this.alt,false),this)}},parse:parse,replace:replace,test:test},escaper={""&"":""&amp;"",""<"":""&lt;"","">"":""&gt;"",""'"":""&#39;"",'""':""&quot;""},re=/(?:\ud83d\udc68\ud83c\udffb\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udffc\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udffd\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udffe\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udfff\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffb\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffb\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffc\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffc\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffd\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffd\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffe\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffe\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udfff\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udfff\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83e\uddd1\ud83c\udffb\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83e\uddd1\ud83c[\udffc-\udfff]|\ud83e\uddd1\ud83c\udffc\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83e\uddd1\ud83c[\udffb\udffd-\udfff]|\ud83e\uddd1\ud83c\udffd\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83e\uddd1\ud83c[\udffb\udffc\udffe\udfff]|\ud83e\uddd1\ud83c\udffe\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83e\uddd1\ud83c[\udffb-\udffd\udfff]|\ud83e\uddd1\ud83c\udfff\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83e\uddd1\ud83c[\udffb-\udffe]|\ud83d\udc68\ud83c\udffb\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udffb\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffc-\udfff]|\ud83d\udc68\ud83c\udffc\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udffc\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffb\udffd-\udfff]|\ud83d\udc68\ud83c\udffd\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udffd\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffb\udffc\udffe\udfff]|\ud83d\udc68\ud83c\udffe\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udffe\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffb-\udffd\udfff]|\ud83d\udc68\ud83c\udfff\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc68\ud83c\udfff\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffb-\udffe]|\ud83d\udc69\ud83c\udffb\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffb\u200d\u2764\ufe0f\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffb\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffc-\udfff]|\ud83d\udc69\ud83c\udffb\u200d\ud83e\udd1d\u200d\ud83d\udc69\ud83c[\udffc-\udfff]|\ud83d\udc69\ud83c\udffc\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffc\u200d\u2764\ufe0f\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffc\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffb\udffd-\udfff]|\ud83d\udc69\ud83c\udffc\u200d\ud83e\udd1d\u200d\ud83d\udc69\ud83c[\udffb\udffd-\udfff]|\ud83d\udc69\ud83c\udffd\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffd\u200d\u2764\ufe0f\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffd\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffb\udffc\udffe\udfff]|\ud83d\udc69\ud83c\udffd\u200d\ud83e\udd1d\u200d\ud83d\udc69\ud83c[\udffb\udffc\udffe\udfff]|\ud83d\udc69\ud83c\udffe\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffe\u200d\u2764\ufe0f\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udffe\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffb-\udffd\udfff]|\ud83d\udc69\ud83c\udffe\u200d\ud83e\udd1d\u200d\ud83d\udc69\ud83c[\udffb-\udffd\udfff]|\ud83d\udc69\ud83c\udfff\u200d\u2764\ufe0f\u200d\ud83d\udc68\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udfff\u200d\u2764\ufe0f\u200d\ud83d\udc69\ud83c[\udffb-\udfff]|\ud83d\udc69\ud83c\udfff\u200d\ud83e\udd1d\u200d\ud83d\udc68\ud83c[\udffb-\udffe]|\ud83d\udc69\ud83c\udfff\u200d\ud83e\udd1d\u200d\ud83d\udc69\ud83c[\udffb-\udffe]|\ud83e\uddd1\ud83c\udffb\u200d\u2764\ufe0f\u200d\ud83e\uddd1\ud83c[\udffc-\udfff]|\ud83e\uddd1\ud83c\udffb\u200d\ud83e\udd1d\u200d\ud83e\uddd1\ud83c[\udffb-\udfff]|\ud83e\uddd1\ud83c\udffc\u200d\u2764\ufe0f\u200d\ud83e\uddd1\ud83c[\udffb\udffd-\udfff]|\ud83e\uddd1\ud83c\udffc\u200d\ud83e\udd1d\u200d\ud83e\uddd1\ud83c[\udffb-\udfff]|\ud83e\uddd1\ud83c\udffd\u200d\u2764\ufe0f\u200d\ud83e\uddd1\ud83c[\udffb\udffc\udffe\udfff]|\ud83e\uddd1\ud83c\udffd\u200d\ud83e\udd1d\u200d\ud83e\uddd1\ud83c[\udffb-\udfff]|\ud83e\uddd1\ud83c\udffe\u200d\u2764\ufe0f\u200d\ud83e\uddd1\ud83c[\udffb-\udffd\udfff]|\ud83e\uddd1\ud83c\udffe\u200d\ud83e\udd1d\u200d\ud83e\uddd1\ud83c[\udffb-\udfff]|\ud83e\uddd1\ud83c\udfff\u200d\u2764\ufe0f\u200d\ud83e\uddd1\ud83c[\udffb-\udffe]|\ud83e\uddd1\ud83c\udfff\u200d\ud83e\udd1d\u200d\ud83e\uddd1\ud83c[\udffb-\udfff]|\ud83d\udc68\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d\udc68|\ud83d\udc69\u200d\u2764\ufe0f\u200d\ud83d\udc8b\u200d\ud83d[\udc68\udc69]|\ud83d\udc68\u200d\u2764\ufe0f\u200d\ud83d\udc68|\ud83d\udc69\u200d\u2764\ufe0f\u200d\ud83d[\udc68\udc69]|\ud83e\uddd1\u200d\ud83e\udd1d\u200d\ud83e\uddd1|\ud83d\udc6b\ud83c[\udffb-\udfff]|\ud83d\udc6c\ud83c[\udffb-\udfff]|\ud83d\udc6d\ud83c[\udffb-\udfff]|\ud83d\udc8f\ud83c[\udffb-\udfff]|\ud83d\udc91\ud83c[\udffb-\udfff]|\ud83d[\udc6b-\udc6d\udc8f\udc91])|(?:\ud83d[\udc68\udc69]|\ud83e\uddd1)(?:\ud83c[\udffb-\udfff])?\u200d(?:\u2695\ufe0f|\u2696\ufe0f|\u2708\ufe0f|\ud83c[\udf3e\udf73\udf7c\udf84\udf93\udfa4\udfa8\udfeb\udfed]|\ud83d[\udcbb\udcbc\udd27\udd2c\ude80\ude92]|\ud83e[\uddaf-\uddb3\uddbc\uddbd])|(?:\ud83c[\udfcb\udfcc]|\ud83d[\udd74\udd75]|\u26f9)((?:\ud83c[\udffb-\udfff]|\ufe0f)\u200d[\u2640\u2642]\ufe0f)|(?:\ud83c[\udfc3\udfc4\udfca]|\ud83d[\udc6e\udc70\udc71\udc73\udc77\udc81\udc82\udc86\udc87\ude45-\ude47\ude4b\ude4d\ude4e\udea3\udeb4-\udeb6]|\ud83e[\udd26\udd35\udd37-\udd39\udd3d\udd3e\uddb8\uddb9\uddcd-\uddcf\uddd4\uddd6-\udddd])(?:\ud83c[\udffb-\udfff])?\u200d[\u2640\u2642]\ufe0f|(?:\ud83d\udc68\u200d\ud83d\udc68\u200d\ud83d\udc66\u200d\ud83d\udc66|\ud83d\udc68\u200d\ud83d\udc68\u200d\ud83d\udc67\u200d\ud83d[\udc66\udc67]|\ud83d\udc68\u200d\ud83d\udc69\u200d\ud83d\udc66\u200d\ud83d\udc66|\ud83d\udc68\u200d\ud83d\udc69\u200d\ud83d\udc67\u200d\ud83d[\udc66\udc67]|\ud83d\udc69\u200d\ud83d\udc69\u200d\ud83d\udc66\u200d\ud83d\udc66|\ud83d\udc69\u200d\ud83d\udc69\u200d\ud83d\udc67\u200d\ud83d[\udc66\udc67]|\ud83d\udc68\u200d\ud83d\udc66\u200d\ud83d\udc66|\ud83d\udc68\u200d\ud83d\udc67\u200d\ud83d[\udc66\udc67]|\ud83d\udc68\u200d\ud83d\udc68\u200d\ud83d[\udc66\udc67]|\ud83d\udc68\u200d\ud83d\udc69\u200d\ud83d[\udc66\udc67]|\ud83d\udc69\u200d\ud83d\udc66\u200d\ud83d\udc66|\ud83d\udc69\u200d\ud83d\udc67\u200d\ud83d[\udc66\udc67]|\ud83d\udc69\u200d\ud83d\udc69\u200d\ud83d[\udc66\udc67]|\ud83c\udff3\ufe0f\u200d\u26a7\ufe0f|\ud83c\udff3\ufe0f\u200d\ud83c\udf08|\ud83d\ude36\u200d\ud83c\udf2b\ufe0f|\u2764\ufe0f\u200d\ud83d\udd25|\u2764\ufe0f\u200d\ud83e\ude79|\ud83c\udff4\u200d\u2620\ufe0f|\ud83d\udc15\u200d\ud83e\uddba|\ud83d\udc3b\u200d\u2744\ufe0f|\ud83d\udc41\u200d\ud83d\udde8|\ud83d\udc68\u200d\ud83d[\udc66\udc67]|\ud83d\udc69\u200d\ud83d[\udc66\udc67]|\ud83d\udc6f\u200d\u2640\ufe0f|\ud83d\udc6f\u200d\u2642\ufe0f|\ud83d\ude2e\u200d\ud83d\udca8|\ud83d\ude35\u200d\ud83d\udcab|\ud83e\udd3c\u200d\u2640\ufe0f|\ud83e\udd3c\u200d\u2642\ufe0f|\ud83e\uddde\u200d\u2640\ufe0f|\ud83e\uddde\u200d\u2642\ufe0f|\ud83e\udddf\u200d\u2640\ufe0f|\ud83e\udddf\u200d\u2642\ufe0f|\ud83d\udc08\u200d\u2b1b)|[#*0-9]\ufe0f?\u20e3|(?:[©®\u2122\u265f]\ufe0f)|(?:\ud83c[\udc04\udd70\udd71\udd7e\udd7f\ude02\ude1a\ude2f\ude37\udf21\udf24-\udf2c\udf36\udf7d\udf96\udf97\udf99-\udf9b\udf9e\udf9f\udfcd\udfce\udfd4-\udfdf\udff3\udff5\udff7]|\ud83d[\udc3f\udc41\udcfd\udd49\udd4a\udd6f\udd70\udd73\udd76-\udd79\udd87\udd8a-\udd8d\udda5\udda8\uddb1\uddb2\uddbc\uddc2-\uddc4\uddd1-\uddd3\udddc-\uddde\udde1\udde3\udde8\uddef\uddf3\uddfa\udecb\udecd-\udecf\udee0-\udee5\udee9\udef0\udef3]|[\u203c\u2049\u2139\u2194-\u2199\u21a9\u21aa\u231a\u231b\u2328\u23cf\u23ed-\u23ef\u23f1\u23f2\u23f8-\u23fa\u24c2\u25aa\u25ab\u25b6\u25c0\u25fb-\u25fe\u2600-\u2604\u260e\u2611\u2614\u2615\u2618\u2620\u2622\u2623\u2626\u262a\u262e\u262f\u2638-\u263a\u2640\u2642\u2648-\u2653\u2660\u2663\u2665\u2666\u2668\u267b\u267f\u2692-\u2697\u2699\u269b\u269c\u26a0\u26a1\u26a7\u26aa\u26ab\u26b0\u26b1\u26bd\u26be\u26c4\u26c5\u26c8\u26cf\u26d1\u26d3\u26d4\u26e9\u26ea\u26f0-\u26f5\u26f8\u26fa\u26fd\u2702\u2708\u2709\u270f\u2712\u2714\u2716\u271d\u2721\u2733\u2734\u2744\u2747\u2757\u2763\u2764\u27a1\u2934\u2935\u2b05-\u2b07\u2b1b\u2b1c\u2b50\u2b55\u3030\u303d\u3297\u3299])(?:\ufe0f|(?!\ufe0e))|(?:(?:\ud83c[\udfcb\udfcc]|\ud83d[\udd74\udd75\udd90]|[\u261d\u26f7\u26f9\u270c\u270d])(?:\ufe0f|(?!\ufe0e))|(?:\ud83c[\udf85\udfc2-\udfc4\udfc7\udfca]|\ud83d[\udc42\udc43\udc46-\udc50\udc66-\udc69\udc6e\udc70-\udc78\udc7c\udc81-\udc83\udc85-\udc87\udcaa\udd7a\udd95\udd96\ude45-\ude47\ude4b-\ude4f\udea3\udeb4-\udeb6\udec0\udecc]|\ud83e[\udd0c\udd0f\udd18-\udd1c\udd1e\udd1f\udd26\udd30-\udd39\udd3d\udd3e\udd77\uddb5\uddb6\uddb8\uddb9\uddbb\uddcd-\uddcf\uddd1-\udddd]|[\u270a\u270b]))(?:\ud83c[\udffb-\udfff])?|(?:\ud83c\udff4\udb40\udc67\udb40\udc62\udb40\udc65\udb40\udc6e\udb40\udc67\udb40\udc7f|\ud83c\udff4\udb40\udc67\udb40\udc62\udb40\udc73\udb40\udc63\udb40\udc74\udb40\udc7f|\ud83c\udff4\udb40\udc67\udb40\udc62\udb40\udc77\udb40\udc6c\udb40\udc73\udb40\udc7f|\ud83c\udde6\ud83c[\udde8-\uddec\uddee\uddf1\uddf2\uddf4\uddf6-\uddfa\uddfc\uddfd\uddff]|\ud83c\udde7\ud83c[\udde6\udde7\udde9-\uddef\uddf1-\uddf4\uddf6-\uddf9\uddfb\uddfc\uddfe\uddff]|\ud83c\udde8\ud83c[\udde6\udde8\udde9\uddeb-\uddee\uddf0-\uddf5\uddf7\uddfa-\uddff]|\ud83c\udde9\ud83c[\uddea\uddec\uddef\uddf0\uddf2\uddf4\uddff]|\ud83c\uddea\ud83c[\udde6\udde8\uddea\uddec\udded\uddf7-\uddfa]|\ud83c\uddeb\ud83c[\uddee-\uddf0\uddf2\uddf4\uddf7]|\ud83c\uddec\ud83c[\udde6\udde7\udde9-\uddee\uddf1-\uddf3\uddf5-\uddfa\uddfc\uddfe]|\ud83c\udded\ud83c[\uddf0\uddf2\uddf3\uddf7\uddf9\uddfa]|\ud83c\uddee\ud83c[\udde8-\uddea\uddf1-\uddf4\uddf6-\uddf9]|\ud83c\uddef\ud83c[\uddea\uddf2\uddf4\uddf5]|\ud83c\uddf0\ud83c[\uddea\uddec-\uddee\uddf2\uddf3\uddf5\uddf7\uddfc\uddfe\uddff]|\ud83c\uddf1\ud83c[\udde6-\udde8\uddee\uddf0\uddf7-\uddfb\uddfe]|\ud83c\uddf2\ud83c[\udde6\udde8-\udded\uddf0-\uddff]|\ud83c\uddf3\ud83c[\udde6\udde8\uddea-\uddec\uddee\uddf1\uddf4\uddf5\uddf7\uddfa\uddff]|\ud83c\uddf4\ud83c\uddf2|\ud83c\uddf5\ud83c[\udde6\uddea-\udded\uddf0-\uddf3\uddf7-\uddf9\uddfc\uddfe]|\ud83c\uddf6\ud83c\udde6|\ud83c\uddf7\ud83c[\uddea\uddf4\uddf8\uddfa\uddfc]|\ud83c\uddf8\ud83c[\udde6-\uddea\uddec-\uddf4\uddf7-\uddf9\uddfb\uddfd-\uddff]|\ud83c\uddf9\ud83c[\udde6\udde8\udde9\uddeb-\udded\uddef-\uddf4\uddf7\uddf9\uddfb\uddfc\uddff]|\ud83c\uddfa\ud83c[\udde6\uddec\uddf2\uddf3\uddf8\uddfe\uddff]|\ud83c\uddfb\ud83c[\udde6\udde8\uddea\uddec\uddee\uddf3\uddfa]|\ud83c\uddfc\ud83c[\uddeb\uddf8]|\ud83c\uddfd\ud83c\uddf0|\ud83c\uddfe\ud83c[\uddea\uddf9]|\ud83c\uddff\ud83c[\udde6\uddf2\uddfc]|\ud83c[\udccf\udd8e\udd91-\udd9a\udde6-\uddff\ude01\ude32-\ude36\ude38-\ude3a\ude50\ude51\udf00-\udf20\udf2d-\udf35\udf37-\udf7c\udf7e-\udf84\udf86-\udf93\udfa0-\udfc1\udfc5\udfc6\udfc8\udfc9\udfcf-\udfd3\udfe0-\udff0\udff4\udff8-\udfff]|\ud83d[\udc00-\udc3e\udc40\udc44\udc45\udc51-\udc65\udc6a\udc6f\udc79-\udc7b\udc7d-\udc80\udc84\udc88-\udc8e\udc90\udc92-\udca9\udcab-\udcfc\udcff-\udd3d\udd4b-\udd4e\udd50-\udd67\udda4\uddfb-\ude44\ude48-\ude4a\ude80-\udea2\udea4-\udeb3\udeb7-\udebf\udec1-\udec5\uded0-\uded2\uded5-\uded7\udeeb\udeec\udef4-\udefc\udfe0-\udfeb]|\ud83e[\udd0d\udd0e\udd10-\udd17\udd1d\udd20-\udd25\udd27-\udd2f\udd3a\udd3c\udd3f-\udd45\udd47-\udd76\udd78\udd7a-\uddb4\uddb7\uddba\uddbc-\uddcb\uddd0\uddde-\uddff\ude70-\ude74\ude78-\ude7a\ude80-\ude86\ude90-\udea8\udeb0-\udeb6\udec0-\udec2\uded0-\uded6]|[\u23e9-\u23ec\u23f0\u23f3\u267e\u26ce\u2705\u2728\u274c\u274e\u2753-\u2755\u2795-\u2797\u27b0\u27bf\ue50a])|\ufe0f/g,UFE0Fg=/\uFE0F/g,U200D=String.fromCharCode(8205),rescaper=/[&<>'""]/g,shouldntBeParsed=/^(?:iframe|noframes|noscript|script|select|style|textarea)$/,fromCharCode=String.fromCharCode;return twemoji;function createText(text,clean){return document.createTextNode(clean?text.replace(UFE0Fg,""""):text)}function escapeHTML(s){return s.replace(rescaper,replacer)}function defaultImageSrcGenerator(icon,options){return"""".concat(options.base,options.size,""/"",icon,options.ext)}function grabAllTextNodes(node,allText){var childNodes=node.childNodes,length=childNodes.length,subnode,nodeType;while(length--){subnode=childNodes[length];nodeType=subnode.nodeType;if(nodeType===3){allText.push(subnode)}else if(nodeType===1&&!(""ownerSVGElement""in subnode)&&!shouldntBeParsed.test(subnode.nodeName.toLowerCase())){grabAllTextNodes(subnode,allText)}}return allText}function grabTheRightIcon(rawText){return toCodePoint(rawText.indexOf(U200D)<0?rawText.replace(UFE0Fg,""""):rawText)}function parseNode(node,options){var allText=grabAllTextNodes(node,[]),length=allText.length,attrib,attrname,modified,fragment,subnode,text,match,i,index,img,rawText,iconId,src;while(length--){modified=false;fragment=document.createDocumentFragment();subnode=allText[length];text=subnode.nodeValue;i=0;while(match=re.exec(text)){index=match.index;if(index!==i){fragment.appendChild(createText(text.slice(i,index),true))}rawText=match[0];iconId=grabTheRightIcon(rawText);i=index+rawText.length;src=options.callback(iconId,options);if(iconId&&src){img=new Image;img.onerror=options.onerror;img.setAttribute(""draggable"",""false"");attrib=options.attributes(rawText,iconId);for(attrname in attrib){if(attrib.hasOwnProperty(attrname)&&attrname.indexOf(""on"")!==0&&!img.hasAttribute(attrname)){img.setAttribute(attrname,attrib[attrname])}}img.className=options.className;img.alt=rawText;img.src=src;modified=true;fragment.appendChild(img)}if(!img)fragment.appendChild(createText(rawText,false));img=null}if(modified){if(i<text.length){fragment.appendChild(createText(text.slice(i),true))}subnode.parentNode.replaceChild(fragment,subnode)}}return node}function parseString(str,options){return replace(str,function(rawText){var ret=rawText,iconId=grabTheRightIcon(rawText),src=options.callback(iconId,options),attrib,attrname;if(iconId&&src){ret=""<img "".concat('class=""',options.className,'"" ','draggable=""false"" ','alt=""',rawText,'""',' src=""',src,'""');attrib=options.attributes(rawText,iconId);for(attrname in attrib){if(attrib.hasOwnProperty(attrname)&&attrname.indexOf(""on"")!==0&&ret.indexOf("" ""+attrname+""="")===-1){ret=ret.concat("" "",attrname,'=""',escapeHTML(attrib[attrname]),'""')}}ret=ret.concat(""/>"")}return ret})}function replacer(m){return escaper[m]}function returnNull(){return null}function toSizeSquaredAsset(value){return typeof value===""number""?value+""x""+value:value}function fromCodePoint(codepoint){var code=typeof codepoint===""string""?parseInt(codepoint,16):codepoint;if(code<65536){return fromCharCode(code)}code-=65536;return fromCharCode(55296+(code>>10),56320+(code&1023))}function parse(what,how){if(!how||typeof how===""function""){how={callback:how}}return(typeof what===""string""?parseString:parseNode)(what,{callback:how.callback||defaultImageSrcGenerator,attributes:typeof how.attributes===""function""?how.attributes:returnNull,base:typeof how.base===""string""?how.base:twemoji.base,ext:how.ext||twemoji.ext,size:how.folder||toSizeSquaredAsset(how.size||twemoji.size),className:how.className||twemoji.className,onerror:how.onerror||twemoji.onerror})}function replace(text,callback){return String(text).replace(re,callback)}function test(text){re.lastIndex=0;var result=re.test(text);re.lastIndex=0;return result}function toCodePoint(unicodeSurrogates,sep){var r=[],c=0,p=0,i=0;while(i<unicodeSurrogates.length){c=unicodeSurrogates.charCodeAt(i++);if(p){r.push((65536+(p-55296<<10)+(c-56320)).toString(16));p=0}else if(55296<=c&&c<=56319){p=c}else{r.push(c.toString(16))}}return r.join(sep||""-"")}}();";
	
КонецФункции

// Функция, возвращает текст стилей мессенджера.
//
Функция ПолучитьСтилиМессенджера() Экспорт
	
	// https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/css/bootstrap.min.css
	Возврат ":root{--blue:#007bff;--indigo:#6610f2;--purple:#6f42c1;--pink:#e83e8c;--red:#dc3545;--orange:#fd7e14;--yellow:#ffc107;--green:#28a745;--teal:#20c997;--cyan:#17a2b8;--white:#fff;--gray:#6c757d;--gray-dark:#343a40;--primary:#007bff;--secondary:#6c757d;--success:#28a745;--info:#17a2b8;--warning:#ffc107;--danger:#dc3545;--light:#f8f9fa;--dark:#343a40;--breakpoint-xs:0;--breakpoint-sm:576px;--breakpoint-md:768px;--breakpoint-lg:992px;--breakpoint-xl:1200px;--font-family-sans-serif:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,""Helvetica Neue"",Arial,""Noto Sans"",sans-serif,""Apple Color Emoji"",""Segoe UI Emoji"",""Segoe UI Symbol"",""Noto Color Emoji"";--font-family-monospace:SFMono-Regular,Menlo,Monaco,Consolas,""Liberation Mono"",""Courier New"",monospace}*,::after,::before{box-sizing:border-box}html{font-family:sans-serif;line-height:1.15;-webkit-text-size-adjust:100%;-webkit-tap-highlight-color:transparent}article,aside,figcaption,figure,footer,header,hgroup,main,nav,section{display:block}body{margin:0;font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,""Helvetica Neue"",Arial,""Noto Sans"",sans-serif,""Apple Color Emoji"",""Segoe UI Emoji"",""Segoe UI Symbol"",""Noto Color Emoji"";font-size:1rem;font-weight:400;line-height:1.5;color:#212529;text-align:left;background-color:#fff}[tabindex=""-1""]:focus:not(:focus-visible){outline:0!important}hr{box-sizing:content-box;height:0;overflow:visible}h1,h2,h3,h4,h5,h6{margin-top:0;margin-bottom:.5rem}p{margin-top:0;margin-bottom:1rem}abbr[data-original-title],abbr[title]{text-decoration:underline;-webkit-text-decoration:underline dotted;text-decoration:underline dotted;cursor:help;border-bottom:0;-webkit-text-decoration-skip-ink:none;text-decoration-skip-ink:none}address{margin-bottom:1rem;font-style:normal;line-height:inherit}dl,ol,ul{margin-top:0;margin-bottom:1rem}ol ol,ol ul,ul ol,ul ul{margin-bottom:0}dt{font-weight:700}dd{margin-bottom:.5rem;margin-left:0}blockquote{margin:0 0 1rem}b,strong{font-weight:bolder}small{font-size:80%}sub,sup{position:relative;font-size:75%;line-height:0;vertical-align:baseline}sub{bottom:-.25em}sup{top:-.5em}a{color:#007bff;text-decoration:none;background-color:transparent}a:hover{color:#0056b3;text-decoration:underline}a:not([href]){color:inherit;text-decoration:none}a:not([href]):hover{color:inherit;text-decoration:none}code,kbd,pre,samp{font-family:SFMono-Regular,Menlo,Monaco,Consolas,""Liberation Mono"",""Courier New"",monospace;font-size:1em}pre{margin-top:0;margin-bottom:1rem;overflow:auto}figure{margin:0 0 1rem}img{vertical-align:middle;border-style:none}svg{overflow:hidden;vertical-align:middle}table{border-collapse:collapse}caption{padding-top:.75rem;padding-bottom:.75rem;color:#6c757d;text-align:left;caption-side:bottom}th{text-align:inherit}label{display:inline-block;margin-bottom:.5rem}button{border-radius:0}button:focus{outline:1px dotted;outline:5px auto -webkit-focus-ring-color}button,input,optgroup,select,textarea{margin:0;font-family:inherit;font-size:inherit;line-height:inherit}button,input{overflow:visible}button,select{text-transform:none}select{word-wrap:normal}[type=button],[type=reset],[type=submit],button{-webkit-appearance:button}[type=button]:not(:disabled),[type=reset]:not(:disabled),[type=submit]:not(:disabled),button:not(:disabled){cursor:pointer}[type=button]::-moz-focus-inner,[type=reset]::-moz-focus-inner,[type=submit]::-moz-focus-inner,button::-moz-focus-inner{padding:0;border-style:none}input[type=checkbox],input[type=radio]{box-sizing:border-box;padding:0}input[type=date],input[type=datetime-local],input[type=month],input[type=time]{-webkit-appearance:listbox}textarea{overflow:auto;resize:vertical}fieldset{min-width:0;padding:0;margin:0;border:0}legend{display:block;width:100%;max-width:100%;padding:0;margin-bottom:.5rem;font-size:1.5rem;line-height:inherit;color:inherit;white-space:normal}progress{vertical-align:baseline}[type=number]::-webkit-inner-spin-button,[type=number]::-webkit-outer-spin-button{height:auto}[type=search]{outline-offset:-2px;-webkit-appearance:none}[type=search]::-webkit-search-decoration{-webkit-appearance:none}::-webkit-file-upload-button{font:inherit;-webkit-appearance:button}output{display:inline-block}summary{display:list-item;cursor:pointer}template{display:none}[hidden]{display:none!important}.h1,.h2,.h3,.h4,.h5,.h6,h1,h2,h3,h4,h5,h6{margin-bottom:.5rem;font-weight:500;line-height:1.2}.h1,h1{font-size:2.5rem}.h2,h2{font-size:2rem}.h3,h3{font-size:1.75rem}.h4,h4{font-size:1.5rem}.h5,h5{font-size:1.25rem}.h6,h6{font-size:1rem}.lead{font-size:1.25rem;font-weight:300}.display-1{font-size:6rem;font-weight:300;line-height:1.2}.display-2{font-size:5.5rem;font-weight:300;line-height:1.2}.display-3{font-size:4.5rem;font-weight:300;line-height:1.2}.display-4{font-size:3.5rem;font-weight:300;line-height:1.2}hr{margin-top:1rem;margin-bottom:1rem;border:0;border-top:1px solid rgba(0,0,0,.1)}.small,small{font-size:80%;font-weight:400}.mark,mark{padding:.2em;background-color:#fcf8e3}.list-unstyled{padding-left:0;list-style:none}.list-inline{padding-left:0;list-style:none}.list-inline-item{display:inline-block}.list-inline-item:not(:last-child){margin-right:.5rem}.initialism{font-size:90%;text-transform:uppercase}.blockquote{margin-bottom:1rem;font-size:1.25rem}.blockquote-footer{display:block;font-size:80%;color:#6c757d}.blockquote-footer::before{content:""\2014\00A0""}.img-fluid{max-width:100%;height:auto}.img-thumbnail{padding:.25rem;background-color:#fff;border:1px solid #dee2e6;border-radius:.25rem;max-width:100%;height:auto}.figure{display:inline-block}.figure-img{margin-bottom:.5rem;line-height:1}.figure-caption{font-size:90%;color:#6c757d}code{font-size:87.5%;color:#e83e8c;word-wrap:break-word}a>code{color:inherit}kbd{padding:.2rem .4rem;font-size:87.5%;color:#fff;background-color:#212529;border-radius:.2rem}kbd kbd{padding:0;font-size:100%;font-weight:700}pre{display:block;font-size:87.5%;color:#212529}pre code{font-size:inherit;color:inherit;word-break:normal}.pre-scrollable{max-height:340px;overflow-y:scroll}.container{width:100%;padding-right:15px;padding-left:15px;margin-right:auto;margin-left:auto}@media (min-width:576px){.container{max-width:540px}}@media (min-width:768px){.container{max-width:720px}}@media (min-width:992px){.container{max-width:960px}}@media (min-width:1200px){.container{max-width:1140px}}.container-fluid,.container-lg,.container-md,.container-sm,.container-xl{width:100%;padding-right:15px;padding-left:15px;margin-right:auto;margin-left:auto}@media (min-width:576px){.container,.container-sm{max-width:540px}}@media (min-width:768px){.container,.container-md,.container-sm{max-width:720px}}@media (min-width:992px){.container,.container-lg,.container-md,.container-sm{max-width:960px}}@media (min-width:1200px){.container,.container-lg,.container-md,.container-sm,.container-xl{max-width:1140px}}.row{display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;margin-right:-15px;margin-left:-15px}.no-gutters{margin-right:0;margin-left:0}.no-gutters>.col,.no-gutters>[class*=col-]{padding-right:0;padding-left:0}.col,.col-1,.col-10,.col-11,.col-12,.col-2,.col-3,.col-4,.col-5,.col-6,.col-7,.col-8,.col-9,.col-auto,.col-lg,.col-lg-1,.col-lg-10,.col-lg-11,.col-lg-12,.col-lg-2,.col-lg-3,.col-lg-4,.col-lg-5,.col-lg-6,.col-lg-7,.col-lg-8,.col-lg-9,.col-lg-auto,.col-md,.col-md-1,.col-md-10,.col-md-11,.col-md-12,.col-md-2,.col-md-3,.col-md-4,.col-md-5,.col-md-6,.col-md-7,.col-md-8,.col-md-9,.col-md-auto,.col-sm,.col-sm-1,.col-sm-10,.col-sm-11,.col-sm-12,.col-sm-2,.col-sm-3,.col-sm-4,.col-sm-5,.col-sm-6,.col-sm-7,.col-sm-8,.col-sm-9,.col-sm-auto,.col-xl,.col-xl-1,.col-xl-10,.col-xl-11,.col-xl-12,.col-xl-2,.col-xl-3,.col-xl-4,.col-xl-5,.col-xl-6,.col-xl-7,.col-xl-8,.col-xl-9,.col-xl-auto{position:relative;width:100%;padding-right:15px;padding-left:15px}.col{-ms-flex-preferred-size:0;flex-basis:0;-ms-flex-positive:1;flex-grow:1;max-width:100%}.row-cols-1>*{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.row-cols-2>*{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.row-cols-3>*{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.row-cols-4>*{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.row-cols-5>*{-ms-flex:0 0 20%;flex:0 0 20%;max-width:20%}.row-cols-6>*{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-auto{-ms-flex:0 0 auto;flex:0 0 auto;width:auto;max-width:100%}.col-1{-ms-flex:0 0 8.333333%;flex:0 0 8.333333%;max-width:8.333333%}.col-2{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-3{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.col-4{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.col-5{-ms-flex:0 0 41.666667%;flex:0 0 41.666667%;max-width:41.666667%}.col-6{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.col-7{-ms-flex:0 0 58.333333%;flex:0 0 58.333333%;max-width:58.333333%}.col-8{-ms-flex:0 0 66.666667%;flex:0 0 66.666667%;max-width:66.666667%}.col-9{-ms-flex:0 0 75%;flex:0 0 75%;max-width:75%}.col-10{-ms-flex:0 0 83.333333%;flex:0 0 83.333333%;max-width:83.333333%}.col-11{-ms-flex:0 0 91.666667%;flex:0 0 91.666667%;max-width:91.666667%}.col-12{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.order-first{-ms-flex-order:-1;order:-1}.order-last{-ms-flex-order:13;order:13}.order-0{-ms-flex-order:0;order:0}.order-1{-ms-flex-order:1;order:1}.order-2{-ms-flex-order:2;order:2}.order-3{-ms-flex-order:3;order:3}.order-4{-ms-flex-order:4;order:4}.order-5{-ms-flex-order:5;order:5}.order-6{-ms-flex-order:6;order:6}.order-7{-ms-flex-order:7;order:7}.order-8{-ms-flex-order:8;order:8}.order-9{-ms-flex-order:9;order:9}.order-10{-ms-flex-order:10;order:10}.order-11{-ms-flex-order:11;order:11}.order-12{-ms-flex-order:12;order:12}.offset-1{margin-left:8.333333%}.offset-2{margin-left:16.666667%}.offset-3{margin-left:25%}.offset-4{margin-left:33.333333%}.offset-5{margin-left:41.666667%}.offset-6{margin-left:50%}.offset-7{margin-left:58.333333%}.offset-8{margin-left:66.666667%}.offset-9{margin-left:75%}.offset-10{margin-left:83.333333%}.offset-11{margin-left:91.666667%}@media (min-width:576px){.col-sm{-ms-flex-preferred-size:0;flex-basis:0;-ms-flex-positive:1;flex-grow:1;max-width:100%}.row-cols-sm-1>*{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.row-cols-sm-2>*{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.row-cols-sm-3>*{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.row-cols-sm-4>*{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.row-cols-sm-5>*{-ms-flex:0 0 20%;flex:0 0 20%;max-width:20%}.row-cols-sm-6>*{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-sm-auto{-ms-flex:0 0 auto;flex:0 0 auto;width:auto;max-width:100%}.col-sm-1{-ms-flex:0 0 8.333333%;flex:0 0 8.333333%;max-width:8.333333%}.col-sm-2{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-sm-3{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.col-sm-4{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.col-sm-5{-ms-flex:0 0 41.666667%;flex:0 0 41.666667%;max-width:41.666667%}.col-sm-6{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.col-sm-7{-ms-flex:0 0 58.333333%;flex:0 0 58.333333%;max-width:58.333333%}.col-sm-8{-ms-flex:0 0 66.666667%;flex:0 0 66.666667%;max-width:66.666667%}.col-sm-9{-ms-flex:0 0 75%;flex:0 0 75%;max-width:75%}.col-sm-10{-ms-flex:0 0 83.333333%;flex:0 0 83.333333%;max-width:83.333333%}.col-sm-11{-ms-flex:0 0 91.666667%;flex:0 0 91.666667%;max-width:91.666667%}.col-sm-12{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.order-sm-first{-ms-flex-order:-1;order:-1}.order-sm-last{-ms-flex-order:13;order:13}.order-sm-0{-ms-flex-order:0;order:0}.order-sm-1{-ms-flex-order:1;order:1}.order-sm-2{-ms-flex-order:2;order:2}.order-sm-3{-ms-flex-order:3;order:3}.order-sm-4{-ms-flex-order:4;order:4}.order-sm-5{-ms-flex-order:5;order:5}.order-sm-6{-ms-flex-order:6;order:6}.order-sm-7{-ms-flex-order:7;order:7}.order-sm-8{-ms-flex-order:8;order:8}.order-sm-9{-ms-flex-order:9;order:9}.order-sm-10{-ms-flex-order:10;order:10}.order-sm-11{-ms-flex-order:11;order:11}.order-sm-12{-ms-flex-order:12;order:12}.offset-sm-0{margin-left:0}.offset-sm-1{margin-left:8.333333%}.offset-sm-2{margin-left:16.666667%}.offset-sm-3{margin-left:25%}.offset-sm-4{margin-left:33.333333%}.offset-sm-5{margin-left:41.666667%}.offset-sm-6{margin-left:50%}.offset-sm-7{margin-left:58.333333%}.offset-sm-8{margin-left:66.666667%}.offset-sm-9{margin-left:75%}.offset-sm-10{margin-left:83.333333%}.offset-sm-11{margin-left:91.666667%}}@media (min-width:768px){.col-md{-ms-flex-preferred-size:0;flex-basis:0;-ms-flex-positive:1;flex-grow:1;max-width:100%}.row-cols-md-1>*{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.row-cols-md-2>*{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.row-cols-md-3>*{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.row-cols-md-4>*{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.row-cols-md-5>*{-ms-flex:0 0 20%;flex:0 0 20%;max-width:20%}.row-cols-md-6>*{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-md-auto{-ms-flex:0 0 auto;flex:0 0 auto;width:auto;max-width:100%}.col-md-1{-ms-flex:0 0 8.333333%;flex:0 0 8.333333%;max-width:8.333333%}.col-md-2{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-md-3{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.col-md-4{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.col-md-5{-ms-flex:0 0 41.666667%;flex:0 0 41.666667%;max-width:41.666667%}.col-md-6{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.col-md-7{-ms-flex:0 0 58.333333%;flex:0 0 58.333333%;max-width:58.333333%}.col-md-8{-ms-flex:0 0 66.666667%;flex:0 0 66.666667%;max-width:66.666667%}.col-md-9{-ms-flex:0 0 75%;flex:0 0 75%;max-width:75%}.col-md-10{-ms-flex:0 0 83.333333%;flex:0 0 83.333333%;max-width:83.333333%}.col-md-11{-ms-flex:0 0 91.666667%;flex:0 0 91.666667%;max-width:91.666667%}.col-md-12{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.order-md-first{-ms-flex-order:-1;order:-1}.order-md-last{-ms-flex-order:13;order:13}.order-md-0{-ms-flex-order:0;order:0}.order-md-1{-ms-flex-order:1;order:1}.order-md-2{-ms-flex-order:2;order:2}.order-md-3{-ms-flex-order:3;order:3}.order-md-4{-ms-flex-order:4;order:4}.order-md-5{-ms-flex-order:5;order:5}.order-md-6{-ms-flex-order:6;order:6}.order-md-7{-ms-flex-order:7;order:7}.order-md-8{-ms-flex-order:8;order:8}.order-md-9{-ms-flex-order:9;order:9}.order-md-10{-ms-flex-order:10;order:10}.order-md-11{-ms-flex-order:11;order:11}.order-md-12{-ms-flex-order:12;order:12}.offset-md-0{margin-left:0}.offset-md-1{margin-left:8.333333%}.offset-md-2{margin-left:16.666667%}.offset-md-3{margin-left:25%}.offset-md-4{margin-left:33.333333%}.offset-md-5{margin-left:41.666667%}.offset-md-6{margin-left:50%}.offset-md-7{margin-left:58.333333%}.offset-md-8{margin-left:66.666667%}.offset-md-9{margin-left:75%}.offset-md-10{margin-left:83.333333%}.offset-md-11{margin-left:91.666667%}}@media (min-width:992px){.col-lg{-ms-flex-preferred-size:0;flex-basis:0;-ms-flex-positive:1;flex-grow:1;max-width:100%}.row-cols-lg-1>*{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.row-cols-lg-2>*{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.row-cols-lg-3>*{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.row-cols-lg-4>*{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.row-cols-lg-5>*{-ms-flex:0 0 20%;flex:0 0 20%;max-width:20%}.row-cols-lg-6>*{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-lg-auto{-ms-flex:0 0 auto;flex:0 0 auto;width:auto;max-width:100%}.col-lg-1{-ms-flex:0 0 8.333333%;flex:0 0 8.333333%;max-width:8.333333%}.col-lg-2{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-lg-3{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.col-lg-4{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.col-lg-5{-ms-flex:0 0 41.666667%;flex:0 0 41.666667%;max-width:41.666667%}.col-lg-6{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.col-lg-7{-ms-flex:0 0 58.333333%;flex:0 0 58.333333%;max-width:58.333333%}.col-lg-8{-ms-flex:0 0 66.666667%;flex:0 0 66.666667%;max-width:66.666667%}.col-lg-9{-ms-flex:0 0 75%;flex:0 0 75%;max-width:75%}.col-lg-10{-ms-flex:0 0 83.333333%;flex:0 0 83.333333%;max-width:83.333333%}.col-lg-11{-ms-flex:0 0 91.666667%;flex:0 0 91.666667%;max-width:91.666667%}.col-lg-12{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.order-lg-first{-ms-flex-order:-1;order:-1}.order-lg-last{-ms-flex-order:13;order:13}.order-lg-0{-ms-flex-order:0;order:0}.order-lg-1{-ms-flex-order:1;order:1}.order-lg-2{-ms-flex-order:2;order:2}.order-lg-3{-ms-flex-order:3;order:3}.order-lg-4{-ms-flex-order:4;order:4}.order-lg-5{-ms-flex-order:5;order:5}.order-lg-6{-ms-flex-order:6;order:6}.order-lg-7{-ms-flex-order:7;order:7}.order-lg-8{-ms-flex-order:8;order:8}.order-lg-9{-ms-flex-order:9;order:9}.order-lg-10{-ms-flex-order:10;order:10}.order-lg-11{-ms-flex-order:11;order:11}.order-lg-12{-ms-flex-order:12;order:12}.offset-lg-0{margin-left:0}.offset-lg-1{margin-left:8.333333%}.offset-lg-2{margin-left:16.666667%}.offset-lg-3{margin-left:25%}.offset-lg-4{margin-left:33.333333%}.offset-lg-5{margin-left:41.666667%}.offset-lg-6{margin-left:50%}.offset-lg-7{margin-left:58.333333%}.offset-lg-8{margin-left:66.666667%}.offset-lg-9{margin-left:75%}.offset-lg-10{margin-left:83.333333%}.offset-lg-11{margin-left:91.666667%}}@media (min-width:1200px){.col-xl{-ms-flex-preferred-size:0;flex-basis:0;-ms-flex-positive:1;flex-grow:1;max-width:100%}.row-cols-xl-1>*{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.row-cols-xl-2>*{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.row-cols-xl-3>*{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.row-cols-xl-4>*{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.row-cols-xl-5>*{-ms-flex:0 0 20%;flex:0 0 20%;max-width:20%}.row-cols-xl-6>*{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-xl-auto{-ms-flex:0 0 auto;flex:0 0 auto;width:auto;max-width:100%}.col-xl-1{-ms-flex:0 0 8.333333%;flex:0 0 8.333333%;max-width:8.333333%}.col-xl-2{-ms-flex:0 0 16.666667%;flex:0 0 16.666667%;max-width:16.666667%}.col-xl-3{-ms-flex:0 0 25%;flex:0 0 25%;max-width:25%}.col-xl-4{-ms-flex:0 0 33.333333%;flex:0 0 33.333333%;max-width:33.333333%}.col-xl-5{-ms-flex:0 0 41.666667%;flex:0 0 41.666667%;max-width:41.666667%}.col-xl-6{-ms-flex:0 0 50%;flex:0 0 50%;max-width:50%}.col-xl-7{-ms-flex:0 0 58.333333%;flex:0 0 58.333333%;max-width:58.333333%}.col-xl-8{-ms-flex:0 0 66.666667%;flex:0 0 66.666667%;max-width:66.666667%}.col-xl-9{-ms-flex:0 0 75%;flex:0 0 75%;max-width:75%}.col-xl-10{-ms-flex:0 0 83.333333%;flex:0 0 83.333333%;max-width:83.333333%}.col-xl-11{-ms-flex:0 0 91.666667%;flex:0 0 91.666667%;max-width:91.666667%}.col-xl-12{-ms-flex:0 0 100%;flex:0 0 100%;max-width:100%}.order-xl-first{-ms-flex-order:-1;order:-1}.order-xl-last{-ms-flex-order:13;order:13}.order-xl-0{-ms-flex-order:0;order:0}.order-xl-1{-ms-flex-order:1;order:1}.order-xl-2{-ms-flex-order:2;order:2}.order-xl-3{-ms-flex-order:3;order:3}.order-xl-4{-ms-flex-order:4;order:4}.order-xl-5{-ms-flex-order:5;order:5}.order-xl-6{-ms-flex-order:6;order:6}.order-xl-7{-ms-flex-order:7;order:7}.order-xl-8{-ms-flex-order:8;order:8}.order-xl-9{-ms-flex-order:9;order:9}.order-xl-10{-ms-flex-order:10;order:10}.order-xl-11{-ms-flex-order:11;order:11}.order-xl-12{-ms-flex-order:12;order:12}.offset-xl-0{margin-left:0}.offset-xl-1{margin-left:8.333333%}.offset-xl-2{margin-left:16.666667%}.offset-xl-3{margin-left:25%}.offset-xl-4{margin-left:33.333333%}.offset-xl-5{margin-left:41.666667%}.offset-xl-6{margin-left:50%}.offset-xl-7{margin-left:58.333333%}.offset-xl-8{margin-left:66.666667%}.offset-xl-9{margin-left:75%}.offset-xl-10{margin-left:83.333333%}.offset-xl-11{margin-left:91.666667%}}.table{width:100%;margin-bottom:1rem;color:#212529}.table td,.table th{padding:.75rem;vertical-align:top;border-top:1px solid #dee2e6}.table thead th{vertical-align:bottom;border-bottom:2px solid #dee2e6}.table tbody+tbody{border-top:2px solid #dee2e6}.table-sm td,.table-sm th{padding:.3rem}.table-bordered{border:1px solid #dee2e6}.table-bordered td,.table-bordered th{border:1px solid #dee2e6}.table-bordered thead td,.table-bordered thead th{border-bottom-width:2px}.table-borderless tbody+tbody,.table-borderless td,.table-borderless th,.table-borderless thead th{border:0}.table-striped tbody tr:nth-of-type(odd){background-color:rgba(0,0,0,.05)}.table-hover tbody tr:hover{color:#212529;background-color:rgba(0,0,0,.075)}.table-primary,.table-primary>td,.table-primary>th{background-color:#b8daff}.table-primary tbody+tbody,.table-primary td,.table-primary th,.table-primary thead th{border-color:#7abaff}.table-hover .table-primary:hover{background-color:#9fcdff}.table-hover .table-primary:hover>td,.table-hover .table-primary:hover>th{background-color:#9fcdff}.table-secondary,.table-secondary>td,.table-secondary>th{background-color:#d6d8db}.table-secondary tbody+tbody,.table-secondary td,.table-secondary th,.table-secondary thead th{border-color:#b3b7bb}.table-hover .table-secondary:hover{background-color:#c8cbcf}.table-hover .table-secondary:hover>td,.table-hover .table-secondary:hover>th{background-color:#c8cbcf}.table-success,.table-success>td,.table-success>th{background-color:#c3e6cb}.table-success tbody+tbody,.table-success td,.table-success th,.table-success thead th{border-color:#8fd19e}.table-hover .table-success:hover{background-color:#b1dfbb}.table-hover .table-success:hover>td,.table-hover .table-success:hover>th{background-color:#b1dfbb}.table-info,.table-info>td,.table-info>th{background-color:#bee5eb}.table-info tbody+tbody,.table-info td,.table-info th,.table-info thead th{border-color:#86cfda}.table-hover .table-info:hover{background-color:#abdde5}.table-hover .table-info:hover>td,.table-hover .table-info:hover>th{background-color:#abdde5}.table-warning,.table-warning>td,.table-warning>th{background-color:#ffeeba}.table-warning tbody+tbody,.table-warning td,.table-warning th,.table-warning thead th{border-color:#ffdf7e}.table-hover .table-warning:hover{background-color:#ffe8a1}.table-hover .table-warning:hover>td,.table-hover .table-warning:hover>th{background-color:#ffe8a1}.table-danger,.table-danger>td,.table-danger>th{background-color:#f5c6cb}.table-danger tbody+tbody,.table-danger td,.table-danger th,.table-danger thead th{border-color:#ed969e}.table-hover .table-danger:hover{background-color:#f1b0b7}.table-hover .table-danger:hover>td,.table-hover .table-danger:hover>th{background-color:#f1b0b7}.table-light,.table-light>td,.table-light>th{background-color:#fdfdfe}.table-light tbody+tbody,.table-light td,.table-light th,.table-light thead th{border-color:#fbfcfc}.table-hover .table-light:hover{background-color:#ececf6}.table-hover .table-light:hover>td,.table-hover .table-light:hover>th{background-color:#ececf6}.table-dark,.table-dark>td,.table-dark>th{background-color:#c6c8ca}.table-dark tbody+tbody,.table-dark td,.table-dark th,.table-dark thead th{border-color:#95999c}.table-hover .table-dark:hover{background-color:#b9bbbe}.table-hover .table-dark:hover>td,.table-hover .table-dark:hover>th{background-color:#b9bbbe}.table-active,.table-active>td,.table-active>th{background-color:rgba(0,0,0,.075)}.table-hover .table-active:hover{background-color:rgba(0,0,0,.075)}.table-hover .table-active:hover>td,.table-hover .table-active:hover>th{background-color:rgba(0,0,0,.075)}.table .thead-dark th{color:#fff;background-color:#343a40;border-color:#454d55}.table .thead-light th{color:#495057;background-color:#e9ecef;border-color:#dee2e6}.table-dark{color:#fff;background-color:#343a40}.table-dark td,.table-dark th,.table-dark thead th{border-color:#454d55}.table-dark.table-bordered{border:0}.table-dark.table-striped tbody tr:nth-of-type(odd){background-color:rgba(255,255,255,.05)}.table-dark.table-hover tbody tr:hover{color:#fff;background-color:rgba(255,255,255,.075)}@media (max-width:575.98px){.table-responsive-sm{display:block;width:100%;overflow-x:auto;-webkit-overflow-scrolling:touch}.table-responsive-sm>.table-bordered{border:0}}@media (max-width:767.98px){.table-responsive-md{display:block;width:100%;overflow-x:auto;-webkit-overflow-scrolling:touch}.table-responsive-md>.table-bordered{border:0}}@media (max-width:991.98px){.table-responsive-lg{display:block;width:100%;overflow-x:auto;-webkit-overflow-scrolling:touch}.table-responsive-lg>.table-bordered{border:0}}@media (max-width:1199.98px){.table-responsive-xl{display:block;width:100%;overflow-x:auto;-webkit-overflow-scrolling:touch}.table-responsive-xl>.table-bordered{border:0}}.table-responsive{display:block;width:100%;overflow-x:auto;-webkit-overflow-scrolling:touch}.table-responsive>.table-bordered{border:0}.form-control{display:block;width:100%;height:calc(1.5em + .75rem + 2px);padding:.375rem .75rem;font-size:1rem;font-weight:400;line-height:1.5;color:#495057;background-color:#fff;background-clip:padding-box;border:1px solid #ced4da;border-radius:.25rem;transition:border-color .15s ease-in-out,box-shadow .15s ease-in-out}@media (prefers-reduced-motion:reduce){.form-control{transition:none}}.form-control::-ms-expand{background-color:transparent;border:0}.form-control:-moz-focusring{color:transparent;text-shadow:0 0 0 #495057}.form-control:focus{color:#495057;background-color:#fff;border-color:#80bdff;outline:0;box-shadow:0 0 0 .2rem rgba(0,123,255,.25)}.form-control::-webkit-input-placeholder{color:#6c757d;opacity:1}.form-control::-moz-placeholder{color:#6c757d;opacity:1}.form-control:-ms-input-placeholder{color:#6c757d;opacity:1}.form-control::-ms-input-placeholder{color:#6c757d;opacity:1}.form-control::placeholder{color:#6c757d;opacity:1}.form-control:disabled,.form-control[readonly]{background-color:#e9ecef;opacity:1}select.form-control:focus::-ms-value{color:#495057;background-color:#fff}.form-control-file,.form-control-range{display:block;width:100%}.col-form-label{padding-top:calc(.375rem + 1px);padding-bottom:calc(.375rem + 1px);margin-bottom:0;font-size:inherit;line-height:1.5}.col-form-label-lg{padding-top:calc(.5rem + 1px);padding-bottom:calc(.5rem + 1px);font-size:1.25rem;line-height:1.5}.col-form-label-sm{padding-top:calc(.25rem + 1px);padding-bottom:calc(.25rem + 1px);font-size:.875rem;line-height:1.5}.form-control-plaintext{display:block;width:100%;padding:.375rem 0;margin-bottom:0;font-size:1rem;line-height:1.5;color:#212529;background-color:transparent;border:solid transparent;border-width:1px 0}.form-control-plaintext.form-control-lg,.form-control-plaintext.form-control-sm{padding-right:0;padding-left:0}.form-control-sm{height:calc(1.5em + .5rem + 2px);padding:.25rem .5rem;font-size:.875rem;line-height:1.5;border-radius:.2rem}.form-control-lg{height:calc(1.5em + 1rem + 2px);padding:.5rem 1rem;font-size:1.25rem;line-height:1.5;border-radius:.3rem}select.form-control[multiple],select.form-control[size]{height:auto}textarea.form-control{height:auto}.form-group{margin-bottom:1rem}.form-text{display:block;margin-top:.25rem}.form-row{display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;margin-right:-5px;margin-left:-5px}.form-row>.col,.form-row>[class*=col-]{padding-right:5px;padding-left:5px}.form-check{position:relative;display:block;padding-left:1.25rem}.form-check-input{position:absolute;margin-top:.3rem;margin-left:-1.25rem}.form-check-input:disabled~.form-check-label,.form-check-input[disabled]~.form-check-label{color:#6c757d}.form-check-label{margin-bottom:0}.form-check-inline{display:-ms-inline-flexbox;display:inline-flex;-ms-flex-align:center;align-items:center;padding-left:0;margin-right:.75rem}.form-check-inline .form-check-input{position:static;margin-top:0;margin-right:.3125rem;margin-left:0}.valid-feedback{display:none;width:100%;margin-top:.25rem;font-size:80%;color:#28a745}.valid-tooltip{position:absolute;top:100%;z-index:5;display:none;max-width:100%;padding:.25rem .5rem;margin-top:.1rem;font-size:.875rem;line-height:1.5;color:#fff;background-color:rgba(40,167,69,.9);border-radius:.25rem}.is-valid~.valid-feedback,.is-valid~.valid-tooltip,.was-validated :valid~.valid-feedback,.was-validated :valid~.valid-tooltip{display:block}.form-control.is-valid,.was-validated .form-control:valid{border-color:#28a745;padding-right:calc(1.5em + .75rem);background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='8' height='8' viewBox='0 0 8 8'%3e%3cpath fill='%2328a745' d='M2.3 6.73L.6 4.53c-.4-1.04.46-1.4 1.1-.8l1.1 1.4 3.4-3.8c.6-.63 1.6-.27 1.2.7l-4 4.6c-.43.5-.8.4-1.1.1z'/%3e%3c/svg%3e"");background-repeat:no-repeat;background-position:right calc(.375em + .1875rem) center;background-size:calc(.75em + .375rem) calc(.75em + .375rem)}.form-control.is-valid:focus,.was-validated .form-control:valid:focus{border-color:#28a745;box-shadow:0 0 0 .2rem rgba(40,167,69,.25)}.was-validated textarea.form-control:valid,textarea.form-control.is-valid{padding-right:calc(1.5em + .75rem);background-position:top calc(.375em + .1875rem) right calc(.375em + .1875rem)}.custom-select.is-valid,.was-validated .custom-select:valid{border-color:#28a745;padding-right:calc(.75em + 2.3125rem);background:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='4' height='5' viewBox='0 0 4 5'%3e%3cpath fill='%23343a40' d='M2 0L0 2h4zm0 5L0 3h4z'/%3e%3c/svg%3e"") no-repeat right .75rem center/8px 10px,url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='8' height='8' viewBox='0 0 8 8'%3e%3cpath fill='%2328a745' d='M2.3 6.73L.6 4.53c-.4-1.04.46-1.4 1.1-.8l1.1 1.4 3.4-3.8c.6-.63 1.6-.27 1.2.7l-4 4.6c-.43.5-.8.4-1.1.1z'/%3e%3c/svg%3e"") #fff no-repeat center right 1.75rem/calc(.75em + .375rem) calc(.75em + .375rem)}.custom-select.is-valid:focus,.was-validated .custom-select:valid:focus{border-color:#28a745;box-shadow:0 0 0 .2rem rgba(40,167,69,.25)}.form-check-input.is-valid~.form-check-label,.was-validated .form-check-input:valid~.form-check-label{color:#28a745}.form-check-input.is-valid~.valid-feedback,.form-check-input.is-valid~.valid-tooltip,.was-validated .form-check-input:valid~.valid-feedback,.was-validated .form-check-input:valid~.valid-tooltip{display:block}.custom-control-input.is-valid~.custom-control-label,.was-validated .custom-control-input:valid~.custom-control-label{color:#28a745}.custom-control-input.is-valid~.custom-control-label::before,.was-validated .custom-control-input:valid~.custom-control-label::before{border-color:#28a745}.custom-control-input.is-valid:checked~.custom-control-label::before,.was-validated .custom-control-input:valid:checked~.custom-control-label::before{border-color:#34ce57;background-color:#34ce57}.custom-control-input.is-valid:focus~.custom-control-label::before,.was-validated .custom-control-input:valid:focus~.custom-control-label::before{box-shadow:0 0 0 .2rem rgba(40,167,69,.25)}.custom-control-input.is-valid:focus:not(:checked)~.custom-control-label::before,.was-validated .custom-control-input:valid:focus:not(:checked)~.custom-control-label::before{border-color:#28a745}.custom-file-input.is-valid~.custom-file-label,.was-validated .custom-file-input:valid~.custom-file-label{border-color:#28a745}.custom-file-input.is-valid:focus~.custom-file-label,.was-validated .custom-file-input:valid:focus~.custom-file-label{border-color:#28a745;box-shadow:0 0 0 .2rem rgba(40,167,69,.25)}.invalid-feedback{display:none;width:100%;margin-top:.25rem;font-size:80%;color:#dc3545}.invalid-tooltip{position:absolute;top:100%;z-index:5;display:none;max-width:100%;padding:.25rem .5rem;margin-top:.1rem;font-size:.875rem;line-height:1.5;color:#fff;background-color:rgba(220,53,69,.9);border-radius:.25rem}.is-invalid~.invalid-feedback,.is-invalid~.invalid-tooltip,.was-validated :invalid~.invalid-feedback,.was-validated :invalid~.invalid-tooltip{display:block}.form-control.is-invalid,.was-validated .form-control:invalid{border-color:#dc3545;padding-right:calc(1.5em + .75rem);background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='12' height='12' fill='none' stroke='%23dc3545' viewBox='0 0 12 12'%3e%3ccircle cx='6' cy='6' r='4.5'/%3e%3cpath stroke-linejoin='round' d='M5.8 3.6h.4L6 6.5z'/%3e%3ccircle cx='6' cy='8.2' r='.6' fill='%23dc3545' stroke='none'/%3e%3c/svg%3e"");background-repeat:no-repeat;background-position:right calc(.375em + .1875rem) center;background-size:calc(.75em + .375rem) calc(.75em + .375rem)}.form-control.is-invalid:focus,.was-validated .form-control:invalid:focus{border-color:#dc3545;box-shadow:0 0 0 .2rem rgba(220,53,69,.25)}.was-validated textarea.form-control:invalid,textarea.form-control.is-invalid{padding-right:calc(1.5em + .75rem);background-position:top calc(.375em + .1875rem) right calc(.375em + .1875rem)}.custom-select.is-invalid,.was-validated .custom-select:invalid{border-color:#dc3545;padding-right:calc(.75em + 2.3125rem);background:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='4' height='5' viewBox='0 0 4 5'%3e%3cpath fill='%23343a40' d='M2 0L0 2h4zm0 5L0 3h4z'/%3e%3c/svg%3e"") no-repeat right .75rem center/8px 10px,url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='12' height='12' fill='none' stroke='%23dc3545' viewBox='0 0 12 12'%3e%3ccircle cx='6' cy='6' r='4.5'/%3e%3cpath stroke-linejoin='round' d='M5.8 3.6h.4L6 6.5z'/%3e%3ccircle cx='6' cy='8.2' r='.6' fill='%23dc3545' stroke='none'/%3e%3c/svg%3e"") #fff no-repeat center right 1.75rem/calc(.75em + .375rem) calc(.75em + .375rem)}.custom-select.is-invalid:focus,.was-validated .custom-select:invalid:focus{border-color:#dc3545;box-shadow:0 0 0 .2rem rgba(220,53,69,.25)}.form-check-input.is-invalid~.form-check-label,.was-validated .form-check-input:invalid~.form-check-label{color:#dc3545}.form-check-input.is-invalid~.invalid-feedback,.form-check-input.is-invalid~.invalid-tooltip,.was-validated .form-check-input:invalid~.invalid-feedback,.was-validated .form-check-input:invalid~.invalid-tooltip{display:block}.custom-control-input.is-invalid~.custom-control-label,.was-validated .custom-control-input:invalid~.custom-control-label{color:#dc3545}.custom-control-input.is-invalid~.custom-control-label::before,.was-validated .custom-control-input:invalid~.custom-control-label::before{border-color:#dc3545}.custom-control-input.is-invalid:checked~.custom-control-label::before,.was-validated .custom-control-input:invalid:checked~.custom-control-label::before{border-color:#e4606d;background-color:#e4606d}.custom-control-input.is-invalid:focus~.custom-control-label::before,.was-validated .custom-control-input:invalid:focus~.custom-control-label::before{box-shadow:0 0 0 .2rem rgba(220,53,69,.25)}.custom-control-input.is-invalid:focus:not(:checked)~.custom-control-label::before,.was-validated .custom-control-input:invalid:focus:not(:checked)~.custom-control-label::before{border-color:#dc3545}.custom-file-input.is-invalid~.custom-file-label,.was-validated .custom-file-input:invalid~.custom-file-label{border-color:#dc3545}.custom-file-input.is-invalid:focus~.custom-file-label,.was-validated .custom-file-input:invalid:focus~.custom-file-label{border-color:#dc3545;box-shadow:0 0 0 .2rem rgba(220,53,69,.25)}.form-inline{display:-ms-flexbox;display:flex;-ms-flex-flow:row wrap;flex-flow:row wrap;-ms-flex-align:center;align-items:center}.form-inline .form-check{width:100%}@media (min-width:576px){.form-inline label{display:-ms-flexbox;display:flex;-ms-flex-align:center;align-items:center;-ms-flex-pack:center;justify-content:center;margin-bottom:0}.form-inline .form-group{display:-ms-flexbox;display:flex;-ms-flex:0 0 auto;flex:0 0 auto;-ms-flex-flow:row wrap;flex-flow:row wrap;-ms-flex-align:center;align-items:center;margin-bottom:0}.form-inline .form-control{display:inline-block;width:auto;vertical-align:middle}.form-inline .form-control-plaintext{display:inline-block}.form-inline .custom-select,.form-inline .input-group{width:auto}.form-inline .form-check{display:-ms-flexbox;display:flex;-ms-flex-align:center;align-items:center;-ms-flex-pack:center;justify-content:center;width:auto;padding-left:0}.form-inline .form-check-input{position:relative;-ms-flex-negative:0;flex-shrink:0;margin-top:0;margin-right:.25rem;margin-left:0}.form-inline .custom-control{-ms-flex-align:center;align-items:center;-ms-flex-pack:center;justify-content:center}.form-inline .custom-control-label{margin-bottom:0}}.btn{display:inline-block;font-weight:400;color:#212529;text-align:center;vertical-align:middle;cursor:pointer;-webkit-user-select:none;-moz-user-select:none;-ms-user-select:none;user-select:none;background-color:transparent;border:1px solid transparent;padding:.375rem .75rem;font-size:1rem;line-height:1.5;border-radius:.25rem;transition:color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out}@media (prefers-reduced-motion:reduce){.btn{transition:none}}.btn:hover{color:#212529;text-decoration:none}.btn.focus,.btn:focus{outline:0;box-shadow:0 0 0 .2rem rgba(0,123,255,.25)}.btn.disabled,.btn:disabled{opacity:.65}a.btn.disabled,fieldset:disabled a.btn{pointer-events:none}.btn-primary{color:#fff;background-color:#007bff;border-color:#007bff}.btn-primary:hover{color:#fff;background-color:#0069d9;border-color:#0062cc}.btn-primary.focus,.btn-primary:focus{color:#fff;background-color:#0069d9;border-color:#0062cc;box-shadow:0 0 0 .2rem rgba(38,143,255,.5)}.btn-primary.disabled,.btn-primary:disabled{color:#fff;background-color:#007bff;border-color:#007bff}.btn-primary:not(:disabled):not(.disabled).active,.btn-primary:not(:disabled):not(.disabled):active,.show>.btn-primary.dropdown-toggle{color:#fff;background-color:#0062cc;border-color:#005cbf}.btn-primary:not(:disabled):not(.disabled).active:focus,.btn-primary:not(:disabled):not(.disabled):active:focus,.show>.btn-primary.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(38,143,255,.5)}.btn-secondary{color:#fff;background-color:#6c757d;border-color:#6c757d}.btn-secondary:hover{color:#fff;background-color:#5a6268;border-color:#545b62}.btn-secondary.focus,.btn-secondary:focus{color:#fff;background-color:#5a6268;border-color:#545b62;box-shadow:0 0 0 .2rem rgba(130,138,145,.5)}.btn-secondary.disabled,.btn-secondary:disabled{color:#fff;background-color:#6c757d;border-color:#6c757d}.btn-secondary:not(:disabled):not(.disabled).active,.btn-secondary:not(:disabled):not(.disabled):active,.show>.btn-secondary.dropdown-toggle{color:#fff;background-color:#545b62;border-color:#4e555b}.btn-secondary:not(:disabled):not(.disabled).active:focus,.btn-secondary:not(:disabled):not(.disabled):active:focus,.show>.btn-secondary.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(130,138,145,.5)}.btn-success{color:#fff;background-color:#28a745;border-color:#28a745}.btn-success:hover{color:#fff;background-color:#218838;border-color:#1e7e34}.btn-success.focus,.btn-success:focus{color:#fff;background-color:#218838;border-color:#1e7e34;box-shadow:0 0 0 .2rem rgba(72,180,97,.5)}.btn-success.disabled,.btn-success:disabled{color:#fff;background-color:#28a745;border-color:#28a745}.btn-success:not(:disabled):not(.disabled).active,.btn-success:not(:disabled):not(.disabled):active,.show>.btn-success.dropdown-toggle{color:#fff;background-color:#1e7e34;border-color:#1c7430}.btn-success:not(:disabled):not(.disabled).active:focus,.btn-success:not(:disabled):not(.disabled):active:focus,.show>.btn-success.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(72,180,97,.5)}.btn-info{color:#fff;background-color:#17a2b8;border-color:#17a2b8}.btn-info:hover{color:#fff;background-color:#138496;border-color:#117a8b}.btn-info.focus,.btn-info:focus{color:#fff;background-color:#138496;border-color:#117a8b;box-shadow:0 0 0 .2rem rgba(58,176,195,.5)}.btn-info.disabled,.btn-info:disabled{color:#fff;background-color:#17a2b8;border-color:#17a2b8}.btn-info:not(:disabled):not(.disabled).active,.btn-info:not(:disabled):not(.disabled):active,.show>.btn-info.dropdown-toggle{color:#fff;background-color:#117a8b;border-color:#10707f}.btn-info:not(:disabled):not(.disabled).active:focus,.btn-info:not(:disabled):not(.disabled):active:focus,.show>.btn-info.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(58,176,195,.5)}.btn-warning{color:#212529;background-color:#ffc107;border-color:#ffc107}.btn-warning:hover{color:#212529;background-color:#e0a800;border-color:#d39e00}.btn-warning.focus,.btn-warning:focus{color:#212529;background-color:#e0a800;border-color:#d39e00;box-shadow:0 0 0 .2rem rgba(222,170,12,.5)}.btn-warning.disabled,.btn-warning:disabled{color:#212529;background-color:#ffc107;border-color:#ffc107}.btn-warning:not(:disabled):not(.disabled).active,.btn-warning:not(:disabled):not(.disabled):active,.show>.btn-warning.dropdown-toggle{color:#212529;background-color:#d39e00;border-color:#c69500}.btn-warning:not(:disabled):not(.disabled).active:focus,.btn-warning:not(:disabled):not(.disabled):active:focus,.show>.btn-warning.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(222,170,12,.5)}.btn-danger{color:#fff;background-color:#dc3545;border-color:#dc3545}.btn-danger:hover{color:#fff;background-color:#c82333;border-color:#bd2130}.btn-danger.focus,.btn-danger:focus{color:#fff;background-color:#c82333;border-color:#bd2130;box-shadow:0 0 0 .2rem rgba(225,83,97,.5)}.btn-danger.disabled,.btn-danger:disabled{color:#fff;background-color:#dc3545;border-color:#dc3545}.btn-danger:not(:disabled):not(.disabled).active,.btn-danger:not(:disabled):not(.disabled):active,.show>.btn-danger.dropdown-toggle{color:#fff;background-color:#bd2130;border-color:#b21f2d}.btn-danger:not(:disabled):not(.disabled).active:focus,.btn-danger:not(:disabled):not(.disabled):active:focus,.show>.btn-danger.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(225,83,97,.5)}.btn-light{color:#212529;background-color:#f8f9fa;border-color:#f8f9fa}.btn-light:hover{color:#212529;background-color:#e2e6ea;border-color:#dae0e5}.btn-light.focus,.btn-light:focus{color:#212529;background-color:#e2e6ea;border-color:#dae0e5;box-shadow:0 0 0 .2rem rgba(216,217,219,.5)}.btn-light.disabled,.btn-light:disabled{color:#212529;background-color:#f8f9fa;border-color:#f8f9fa}.btn-light:not(:disabled):not(.disabled).active,.btn-light:not(:disabled):not(.disabled):active,.show>.btn-light.dropdown-toggle{color:#212529;background-color:#dae0e5;border-color:#d3d9df}.btn-light:not(:disabled):not(.disabled).active:focus,.btn-light:not(:disabled):not(.disabled):active:focus,.show>.btn-light.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(216,217,219,.5)}.btn-dark{color:#fff;background-color:#343a40;border-color:#343a40}.btn-dark:hover{color:#fff;background-color:#23272b;border-color:#1d2124}.btn-dark.focus,.btn-dark:focus{color:#fff;background-color:#23272b;border-color:#1d2124;box-shadow:0 0 0 .2rem rgba(82,88,93,.5)}.btn-dark.disabled,.btn-dark:disabled{color:#fff;background-color:#343a40;border-color:#343a40}.btn-dark:not(:disabled):not(.disabled).active,.btn-dark:not(:disabled):not(.disabled):active,.show>.btn-dark.dropdown-toggle{color:#fff;background-color:#1d2124;border-color:#171a1d}.btn-dark:not(:disabled):not(.disabled).active:focus,.btn-dark:not(:disabled):not(.disabled):active:focus,.show>.btn-dark.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(82,88,93,.5)}.btn-outline-primary{color:#007bff;border-color:#007bff}.btn-outline-primary:hover{color:#fff;background-color:#007bff;border-color:#007bff}.btn-outline-primary.focus,.btn-outline-primary:focus{box-shadow:0 0 0 .2rem rgba(0,123,255,.5)}.btn-outline-primary.disabled,.btn-outline-primary:disabled{color:#007bff;background-color:transparent}.btn-outline-primary:not(:disabled):not(.disabled).active,.btn-outline-primary:not(:disabled):not(.disabled):active,.show>.btn-outline-primary.dropdown-toggle{color:#fff;background-color:#007bff;border-color:#007bff}.btn-outline-primary:not(:disabled):not(.disabled).active:focus,.btn-outline-primary:not(:disabled):not(.disabled):active:focus,.show>.btn-outline-primary.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(0,123,255,.5)}.btn-outline-secondary{color:#6c757d;border-color:#6c757d}.btn-outline-secondary:hover{color:#fff;background-color:#6c757d;border-color:#6c757d}.btn-outline-secondary.focus,.btn-outline-secondary:focus{box-shadow:0 0 0 .2rem rgba(108,117,125,.5)}.btn-outline-secondary.disabled,.btn-outline-secondary:disabled{color:#6c757d;background-color:transparent}.btn-outline-secondary:not(:disabled):not(.disabled).active,.btn-outline-secondary:not(:disabled):not(.disabled):active,.show>.btn-outline-secondary.dropdown-toggle{color:#fff;background-color:#6c757d;border-color:#6c757d}.btn-outline-secondary:not(:disabled):not(.disabled).active:focus,.btn-outline-secondary:not(:disabled):not(.disabled):active:focus,.show>.btn-outline-secondary.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(108,117,125,.5)}.btn-outline-success{color:#28a745;border-color:#28a745}.btn-outline-success:hover{color:#fff;background-color:#28a745;border-color:#28a745}.btn-outline-success.focus,.btn-outline-success:focus{box-shadow:0 0 0 .2rem rgba(40,167,69,.5)}.btn-outline-success.disabled,.btn-outline-success:disabled{color:#28a745;background-color:transparent}.btn-outline-success:not(:disabled):not(.disabled).active,.btn-outline-success:not(:disabled):not(.disabled):active,.show>.btn-outline-success.dropdown-toggle{color:#fff;background-color:#28a745;border-color:#28a745}.btn-outline-success:not(:disabled):not(.disabled).active:focus,.btn-outline-success:not(:disabled):not(.disabled):active:focus,.show>.btn-outline-success.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(40,167,69,.5)}.btn-outline-info{color:#17a2b8;border-color:#17a2b8}.btn-outline-info:hover{color:#fff;background-color:#17a2b8;border-color:#17a2b8}.btn-outline-info.focus,.btn-outline-info:focus{box-shadow:0 0 0 .2rem rgba(23,162,184,.5)}.btn-outline-info.disabled,.btn-outline-info:disabled{color:#17a2b8;background-color:transparent}.btn-outline-info:not(:disabled):not(.disabled).active,.btn-outline-info:not(:disabled):not(.disabled):active,.show>.btn-outline-info.dropdown-toggle{color:#fff;background-color:#17a2b8;border-color:#17a2b8}.btn-outline-info:not(:disabled):not(.disabled).active:focus,.btn-outline-info:not(:disabled):not(.disabled):active:focus,.show>.btn-outline-info.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(23,162,184,.5)}.btn-outline-warning{color:#ffc107;border-color:#ffc107}.btn-outline-warning:hover{color:#212529;background-color:#ffc107;border-color:#ffc107}.btn-outline-warning.focus,.btn-outline-warning:focus{box-shadow:0 0 0 .2rem rgba(255,193,7,.5)}.btn-outline-warning.disabled,.btn-outline-warning:disabled{color:#ffc107;background-color:transparent}.btn-outline-warning:not(:disabled):not(.disabled).active,.btn-outline-warning:not(:disabled):not(.disabled):active,.show>.btn-outline-warning.dropdown-toggle{color:#212529;background-color:#ffc107;border-color:#ffc107}.btn-outline-warning:not(:disabled):not(.disabled).active:focus,.btn-outline-warning:not(:disabled):not(.disabled):active:focus,.show>.btn-outline-warning.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(255,193,7,.5)}.btn-outline-danger{color:#dc3545;border-color:#dc3545}.btn-outline-danger:hover{color:#fff;background-color:#dc3545;border-color:#dc3545}.btn-outline-danger.focus,.btn-outline-danger:focus{box-shadow:0 0 0 .2rem rgba(220,53,69,.5)}.btn-outline-danger.disabled,.btn-outline-danger:disabled{color:#dc3545;background-color:transparent}.btn-outline-danger:not(:disabled):not(.disabled).active,.btn-outline-danger:not(:disabled):not(.disabled):active,.show>.btn-outline-danger.dropdown-toggle{color:#fff;background-color:#dc3545;border-color:#dc3545}.btn-outline-danger:not(:disabled):not(.disabled).active:focus,.btn-outline-danger:not(:disabled):not(.disabled):active:focus,.show>.btn-outline-danger.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(220,53,69,.5)}.btn-outline-light{color:#f8f9fa;border-color:#f8f9fa}.btn-outline-light:hover{color:#212529;background-color:#f8f9fa;border-color:#f8f9fa}.btn-outline-light.focus,.btn-outline-light:focus{box-shadow:0 0 0 .2rem rgba(248,249,250,.5)}.btn-outline-light.disabled,.btn-outline-light:disabled{color:#f8f9fa;background-color:transparent}.btn-outline-light:not(:disabled):not(.disabled).active,.btn-outline-light:not(:disabled):not(.disabled):active,.show>.btn-outline-light.dropdown-toggle{color:#212529;background-color:#f8f9fa;border-color:#f8f9fa}.btn-outline-light:not(:disabled):not(.disabled).active:focus,.btn-outline-light:not(:disabled):not(.disabled):active:focus,.show>.btn-outline-light.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(248,249,250,.5)}.btn-outline-dark{color:#343a40;border-color:#343a40}.btn-outline-dark:hover{color:#fff;background-color:#343a40;border-color:#343a40}.btn-outline-dark.focus,.btn-outline-dark:focus{box-shadow:0 0 0 .2rem rgba(52,58,64,.5)}.btn-outline-dark.disabled,.btn-outline-dark:disabled{color:#343a40;background-color:transparent}.btn-outline-dark:not(:disabled):not(.disabled).active,.btn-outline-dark:not(:disabled):not(.disabled):active,.show>.btn-outline-dark.dropdown-toggle{color:#fff;background-color:#343a40;border-color:#343a40}.btn-outline-dark:not(:disabled):not(.disabled).active:focus,.btn-outline-dark:not(:disabled):not(.disabled):active:focus,.show>.btn-outline-dark.dropdown-toggle:focus{box-shadow:0 0 0 .2rem rgba(52,58,64,.5)}.btn-link{font-weight:400;color:#007bff;text-decoration:none}.btn-link:hover{color:#0056b3;text-decoration:underline}.btn-link.focus,.btn-link:focus{text-decoration:underline;box-shadow:none}.btn-link.disabled,.btn-link:disabled{color:#6c757d;pointer-events:none}.btn-group-lg>.btn,.btn-lg{padding:.5rem 1rem;font-size:1.25rem;line-height:1.5;border-radius:.3rem}.btn-group-sm>.btn,.btn-sm{padding:.25rem .5rem;font-size:.875rem;line-height:1.5;border-radius:.2rem}.btn-block{display:block;width:100%}.btn-block+.btn-block{margin-top:.5rem}input[type=button].btn-block,input[type=reset].btn-block,input[type=submit].btn-block{width:100%}.fade{transition:opacity .15s linear}@media (prefers-reduced-motion:reduce){.fade{transition:none}}.fade:not(.show){opacity:0}.collapse:not(.show){display:none}.collapsing{position:relative;height:0;overflow:hidden;transition:height .35s ease}@media (prefers-reduced-motion:reduce){.collapsing{transition:none}}.dropdown,.dropleft,.dropright,.dropup{position:relative}.dropdown-toggle{white-space:nowrap}.dropdown-toggle::after{display:inline-block;margin-left:.255em;vertical-align:.255em;content:"""";border-top:.3em solid;border-right:.3em solid transparent;border-bottom:0;border-left:.3em solid transparent}.dropdown-toggle:empty::after{margin-left:0}.dropdown-menu{position:absolute;top:100%;left:0;z-index:1000;display:none;float:left;min-width:10rem;padding:.5rem 0;margin:.125rem 0 0;font-size:1rem;color:#212529;text-align:left;list-style:none;background-color:#fff;background-clip:padding-box;border:1px solid rgba(0,0,0,.15);border-radius:.25rem}.dropdown-menu-left{right:auto;left:0}.dropdown-menu-right{right:0;left:auto}@media (min-width:576px){.dropdown-menu-sm-left{right:auto;left:0}.dropdown-menu-sm-right{right:0;left:auto}}@media (min-width:768px){.dropdown-menu-md-left{right:auto;left:0}.dropdown-menu-md-right{right:0;left:auto}}@media (min-width:992px){.dropdown-menu-lg-left{right:auto;left:0}.dropdown-menu-lg-right{right:0;left:auto}}@media (min-width:1200px){.dropdown-menu-xl-left{right:auto;left:0}.dropdown-menu-xl-right{right:0;left:auto}}.dropup .dropdown-menu{top:auto;bottom:100%;margin-top:0;margin-bottom:.125rem}.dropup .dropdown-toggle::after{display:inline-block;margin-left:.255em;vertical-align:.255em;content:"""";border-top:0;border-right:.3em solid transparent;border-bottom:.3em solid;border-left:.3em solid transparent}.dropup .dropdown-toggle:empty::after{margin-left:0}.dropright .dropdown-menu{top:0;right:auto;left:100%;margin-top:0;margin-left:.125rem}.dropright .dropdown-toggle::after{display:inline-block;margin-left:.255em;vertical-align:.255em;content:"""";border-top:.3em solid transparent;border-right:0;border-bottom:.3em solid transparent;border-left:.3em solid}.dropright .dropdown-toggle:empty::after{margin-left:0}.dropright .dropdown-toggle::after{vertical-align:0}.dropleft .dropdown-menu{top:0;right:100%;left:auto;margin-top:0;margin-right:.125rem}.dropleft .dropdown-toggle::after{display:inline-block;margin-left:.255em;vertical-align:.255em;content:""""}.dropleft .dropdown-toggle::after{display:none}.dropleft .dropdown-toggle::before{display:inline-block;margin-right:.255em;vertical-align:.255em;content:"""";border-top:.3em solid transparent;border-right:.3em solid;border-bottom:.3em solid transparent}.dropleft .dropdown-toggle:empty::after{margin-left:0}.dropleft .dropdown-toggle::before{vertical-align:0}.dropdown-menu[x-placement^=bottom],.dropdown-menu[x-placement^=left],.dropdown-menu[x-placement^=right],.dropdown-menu[x-placement^=top]{right:auto;bottom:auto}.dropdown-divider{height:0;margin:.5rem 0;overflow:hidden;border-top:1px solid #e9ecef}.dropdown-item{display:block;width:100%;padding:.25rem 1.5rem;clear:both;font-weight:400;color:#212529;text-align:inherit;white-space:nowrap;background-color:transparent;border:0}.dropdown-item:focus,.dropdown-item:hover{color:#16181b;text-decoration:none;background-color:#f8f9fa}.dropdown-item.active,.dropdown-item:active{color:#fff;text-decoration:none;background-color:#007bff}.dropdown-item.disabled,.dropdown-item:disabled{color:#6c757d;pointer-events:none;background-color:transparent}.dropdown-menu.show{display:block}.dropdown-header{display:block;padding:.5rem 1.5rem;margin-bottom:0;font-size:.875rem;color:#6c757d;white-space:nowrap}.dropdown-item-text{display:block;padding:.25rem 1.5rem;color:#212529}.btn-group,.btn-group-vertical{position:relative;display:-ms-inline-flexbox;display:inline-flex;vertical-align:middle}.btn-group-vertical>.btn,.btn-group>.btn{position:relative;-ms-flex:1 1 auto;flex:1 1 auto}.btn-group-vertical>.btn:hover,.btn-group>.btn:hover{z-index:1}.btn-group-vertical>.btn.active,.btn-group-vertical>.btn:active,.btn-group-vertical>.btn:focus,.btn-group>.btn.active,.btn-group>.btn:active,.btn-group>.btn:focus{z-index:1}.btn-toolbar{display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;-ms-flex-pack:start;justify-content:flex-start}.btn-toolbar .input-group{width:auto}.btn-group>.btn-group:not(:first-child),.btn-group>.btn:not(:first-child){margin-left:-1px}.btn-group>.btn-group:not(:last-child)>.btn,.btn-group>.btn:not(:last-child):not(.dropdown-toggle){border-top-right-radius:0;border-bottom-right-radius:0}.btn-group>.btn-group:not(:first-child)>.btn,.btn-group>.btn:not(:first-child){border-top-left-radius:0;border-bottom-left-radius:0}.dropdown-toggle-split{padding-right:.5625rem;padding-left:.5625rem}.dropdown-toggle-split::after,.dropright .dropdown-toggle-split::after,.dropup .dropdown-toggle-split::after{margin-left:0}.dropleft .dropdown-toggle-split::before{margin-right:0}.btn-group-sm>.btn+.dropdown-toggle-split,.btn-sm+.dropdown-toggle-split{padding-right:.375rem;padding-left:.375rem}.btn-group-lg>.btn+.dropdown-toggle-split,.btn-lg+.dropdown-toggle-split{padding-right:.75rem;padding-left:.75rem}.btn-group-vertical{-ms-flex-direction:column;flex-direction:column;-ms-flex-align:start;align-items:flex-start;-ms-flex-pack:center;justify-content:center}.btn-group-vertical>.btn,.btn-group-vertical>.btn-group{width:100%}.btn-group-vertical>.btn-group:not(:first-child),.btn-group-vertical>.btn:not(:first-child){margin-top:-1px}.btn-group-vertical>.btn-group:not(:last-child)>.btn,.btn-group-vertical>.btn:not(:last-child):not(.dropdown-toggle){border-bottom-right-radius:0;border-bottom-left-radius:0}.btn-group-vertical>.btn-group:not(:first-child)>.btn,.btn-group-vertical>.btn:not(:first-child){border-top-left-radius:0;border-top-right-radius:0}.btn-group-toggle>.btn,.btn-group-toggle>.btn-group>.btn{margin-bottom:0}.btn-group-toggle>.btn input[type=checkbox],.btn-group-toggle>.btn input[type=radio],.btn-group-toggle>.btn-group>.btn input[type=checkbox],.btn-group-toggle>.btn-group>.btn input[type=radio]{position:absolute;clip:rect(0,0,0,0);pointer-events:none}.input-group{position:relative;display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;-ms-flex-align:stretch;align-items:stretch;width:100%}.input-group>.custom-file,.input-group>.custom-select,.input-group>.form-control,.input-group>.form-control-plaintext{position:relative;-ms-flex:1 1 0%;flex:1 1 0%;min-width:0;margin-bottom:0}.input-group>.custom-file+.custom-file,.input-group>.custom-file+.custom-select,.input-group>.custom-file+.form-control,.input-group>.custom-select+.custom-file,.input-group>.custom-select+.custom-select,.input-group>.custom-select+.form-control,.input-group>.form-control+.custom-file,.input-group>.form-control+.custom-select,.input-group>.form-control+.form-control,.input-group>.form-control-plaintext+.custom-file,.input-group>.form-control-plaintext+.custom-select,.input-group>.form-control-plaintext+.form-control{margin-left:-1px}.input-group>.custom-file .custom-file-input:focus~.custom-file-label,.input-group>.custom-select:focus,.input-group>.form-control:focus{z-index:3}.input-group>.custom-file .custom-file-input:focus{z-index:4}.input-group>.custom-select:not(:last-child),.input-group>.form-control:not(:last-child){border-top-right-radius:0;border-bottom-right-radius:0}.input-group>.custom-select:not(:first-child),.input-group>.form-control:not(:first-child){border-top-left-radius:0;border-bottom-left-radius:0}.input-group>.custom-file{display:-ms-flexbox;display:flex;-ms-flex-align:center;align-items:center}.input-group>.custom-file:not(:last-child) .custom-file-label,.input-group>.custom-file:not(:last-child) .custom-file-label::after{border-top-right-radius:0;border-bottom-right-radius:0}.input-group>.custom-file:not(:first-child) .custom-file-label{border-top-left-radius:0;border-bottom-left-radius:0}.input-group-append,.input-group-prepend{display:-ms-flexbox;display:flex}.input-group-append .btn,.input-group-prepend .btn{position:relative;z-index:2}.input-group-append .btn:focus,.input-group-prepend .btn:focus{z-index:3}.input-group-append .btn+.btn,.input-group-append .btn+.input-group-text,.input-group-append .input-group-text+.btn,.input-group-append .input-group-text+.input-group-text,.input-group-prepend .btn+.btn,.input-group-prepend .btn+.input-group-text,.input-group-prepend .input-group-text+.btn,.input-group-prepend .input-group-text+.input-group-text{margin-left:-1px}.input-group-prepend{margin-right:-1px}.input-group-append{margin-left:-1px}.input-group-text{display:-ms-flexbox;display:flex;-ms-flex-align:center;align-items:center;padding:.375rem .75rem;margin-bottom:0;font-size:1rem;font-weight:400;line-height:1.5;color:#495057;text-align:center;white-space:nowrap;background-color:#e9ecef;border:1px solid #ced4da;border-radius:.25rem}.input-group-text input[type=checkbox],.input-group-text input[type=radio]{margin-top:0}.input-group-lg>.custom-select,.input-group-lg>.form-control:not(textarea){height:calc(1.5em + 1rem + 2px)}.input-group-lg>.custom-select,.input-group-lg>.form-control,.input-group-lg>.input-group-append>.btn,.input-group-lg>.input-group-append>.input-group-text,.input-group-lg>.input-group-prepend>.btn,.input-group-lg>.input-group-prepend>.input-group-text{padding:.5rem 1rem;font-size:1.25rem;line-height:1.5;border-radius:.3rem}.input-group-sm>.custom-select,.input-group-sm>.form-control:not(textarea){height:calc(1.5em + .5rem + 2px)}.input-group-sm>.custom-select,.input-group-sm>.form-control,.input-group-sm>.input-group-append>.btn,.input-group-sm>.input-group-append>.input-group-text,.input-group-sm>.input-group-prepend>.btn,.input-group-sm>.input-group-prepend>.input-group-text{padding:.25rem .5rem;font-size:.875rem;line-height:1.5;border-radius:.2rem}.input-group-lg>.custom-select,.input-group-sm>.custom-select{padding-right:1.75rem}.input-group>.input-group-append:last-child>.btn:not(:last-child):not(.dropdown-toggle),.input-group>.input-group-append:last-child>.input-group-text:not(:last-child),.input-group>.input-group-append:not(:last-child)>.btn,.input-group>.input-group-append:not(:last-child)>.input-group-text,.input-group>.input-group-prepend>.btn,.input-group>.input-group-prepend>.input-group-text{border-top-right-radius:0;border-bottom-right-radius:0}.input-group>.input-group-append>.btn,.input-group>.input-group-append>.input-group-text,.input-group>.input-group-prepend:first-child>.btn:not(:first-child),.input-group>.input-group-prepend:first-child>.input-group-text:not(:first-child),.input-group>.input-group-prepend:not(:first-child)>.btn,.input-group>.input-group-prepend:not(:first-child)>.input-group-text{border-top-left-radius:0;border-bottom-left-radius:0}.custom-control{position:relative;display:block;min-height:1.5rem;padding-left:1.5rem}.custom-control-inline{display:-ms-inline-flexbox;display:inline-flex;margin-right:1rem}.custom-control-input{position:absolute;left:0;z-index:-1;width:1rem;height:1.25rem;opacity:0}.custom-control-input:checked~.custom-control-label::before{color:#fff;border-color:#007bff;background-color:#007bff}.custom-control-input:focus~.custom-control-label::before{box-shadow:0 0 0 .2rem rgba(0,123,255,.25)}.custom-control-input:focus:not(:checked)~.custom-control-label::before{border-color:#80bdff}.custom-control-input:not(:disabled):active~.custom-control-label::before{color:#fff;background-color:#b3d7ff;border-color:#b3d7ff}.custom-control-input:disabled~.custom-control-label,.custom-control-input[disabled]~.custom-control-label{color:#6c757d}.custom-control-input:disabled~.custom-control-label::before,.custom-control-input[disabled]~.custom-control-label::before{background-color:#e9ecef}.custom-control-label{position:relative;margin-bottom:0;vertical-align:top}.custom-control-label::before{position:absolute;top:.25rem;left:-1.5rem;display:block;width:1rem;height:1rem;pointer-events:none;content:"""";background-color:#fff;border:#adb5bd solid 1px}.custom-control-label::after{position:absolute;top:.25rem;left:-1.5rem;display:block;width:1rem;height:1rem;content:"""";background:no-repeat 50%/50% 50%}.custom-checkbox .custom-control-label::before{border-radius:.25rem}.custom-checkbox .custom-control-input:checked~.custom-control-label::after{background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='8' height='8' viewBox='0 0 8 8'%3e%3cpath fill='%23fff' d='M6.564.75l-3.59 3.612-1.538-1.55L0 4.26l2.974 2.99L8 2.193z'/%3e%3c/svg%3e"")}.custom-checkbox .custom-control-input:indeterminate~.custom-control-label::before{border-color:#007bff;background-color:#007bff}.custom-checkbox .custom-control-input:indeterminate~.custom-control-label::after{background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='4' height='4' viewBox='0 0 4 4'%3e%3cpath stroke='%23fff' d='M0 2h4'/%3e%3c/svg%3e"")}.custom-checkbox .custom-control-input:disabled:checked~.custom-control-label::before{background-color:rgba(0,123,255,.5)}.custom-checkbox .custom-control-input:disabled:indeterminate~.custom-control-label::before{background-color:rgba(0,123,255,.5)}.custom-radio .custom-control-label::before{border-radius:50%}.custom-radio .custom-control-input:checked~.custom-control-label::after{background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='12' height='12' viewBox='-4 -4 8 8'%3e%3ccircle r='3' fill='%23fff'/%3e%3c/svg%3e"")}.custom-radio .custom-control-input:disabled:checked~.custom-control-label::before{background-color:rgba(0,123,255,.5)}.custom-switch{padding-left:2.25rem}.custom-switch .custom-control-label::before{left:-2.25rem;width:1.75rem;pointer-events:all;border-radius:.5rem}.custom-switch .custom-control-label::after{top:calc(.25rem + 2px);left:calc(-2.25rem + 2px);width:calc(1rem - 4px);height:calc(1rem - 4px);background-color:#adb5bd;border-radius:.5rem;transition:background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out,-webkit-transform .15s ease-in-out;transition:transform .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out;transition:transform .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out,-webkit-transform .15s ease-in-out}@media (prefers-reduced-motion:reduce){.custom-switch .custom-control-label::after{transition:none}}.custom-switch .custom-control-input:checked~.custom-control-label::after{background-color:#fff;-webkit-transform:translateX(.75rem);transform:translateX(.75rem)}.custom-switch .custom-control-input:disabled:checked~.custom-control-label::before{background-color:rgba(0,123,255,.5)}.custom-select{display:inline-block;width:100%;height:calc(1.5em + .75rem + 2px);padding:.375rem 1.75rem .375rem .75rem;font-size:1rem;font-weight:400;line-height:1.5;color:#495057;vertical-align:middle;background:#fff url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='4' height='5' viewBox='0 0 4 5'%3e%3cpath fill='%23343a40' d='M2 0L0 2h4zm0 5L0 3h4z'/%3e%3c/svg%3e"") no-repeat right .75rem center/8px 10px;border:1px solid #ced4da;border-radius:.25rem;-webkit-appearance:none;-moz-appearance:none;appearance:none}.custom-select:focus{border-color:#80bdff;outline:0;box-shadow:0 0 0 .2rem rgba(0,123,255,.25)}.custom-select:focus::-ms-value{color:#495057;background-color:#fff}.custom-select[multiple],.custom-select[size]:not([size=""1""]){height:auto;padding-right:.75rem;background-image:none}.custom-select:disabled{color:#6c757d;background-color:#e9ecef}.custom-select::-ms-expand{display:none}.custom-select:-moz-focusring{color:transparent;text-shadow:0 0 0 #495057}.custom-select-sm{height:calc(1.5em + .5rem + 2px);padding-top:.25rem;padding-bottom:.25rem;padding-left:.5rem;font-size:.875rem}.custom-select-lg{height:calc(1.5em + 1rem + 2px);padding-top:.5rem;padding-bottom:.5rem;padding-left:1rem;font-size:1.25rem}.custom-file{position:relative;display:inline-block;width:100%;height:calc(1.5em + .75rem + 2px);margin-bottom:0}.custom-file-input{position:relative;z-index:2;width:100%;height:calc(1.5em + .75rem + 2px);margin:0;opacity:0}.custom-file-input:focus~.custom-file-label{border-color:#80bdff;box-shadow:0 0 0 .2rem rgba(0,123,255,.25)}.custom-file-input:disabled~.custom-file-label,.custom-file-input[disabled]~.custom-file-label{background-color:#e9ecef}.custom-file-input:lang(en)~.custom-file-label::after{content:""Browse""}.custom-file-input~.custom-file-label[data-browse]::after{content:attr(data-browse)}.custom-file-label{position:absolute;top:0;right:0;left:0;z-index:1;height:calc(1.5em + .75rem + 2px);padding:.375rem .75rem;font-weight:400;line-height:1.5;color:#495057;background-color:#fff;border:1px solid #ced4da;border-radius:.25rem}.custom-file-label::after{position:absolute;top:0;right:0;bottom:0;z-index:3;display:block;height:calc(1.5em + .75rem);padding:.375rem .75rem;line-height:1.5;color:#495057;content:""Browse"";background-color:#e9ecef;border-left:inherit;border-radius:0 .25rem .25rem 0}.custom-range{width:100%;height:1.4rem;padding:0;background-color:transparent;-webkit-appearance:none;-moz-appearance:none;appearance:none}.custom-range:focus{outline:0}.custom-range:focus::-webkit-slider-thumb{box-shadow:0 0 0 1px #fff,0 0 0 .2rem rgba(0,123,255,.25)}.custom-range:focus::-moz-range-thumb{box-shadow:0 0 0 1px #fff,0 0 0 .2rem rgba(0,123,255,.25)}.custom-range:focus::-ms-thumb{box-shadow:0 0 0 1px #fff,0 0 0 .2rem rgba(0,123,255,.25)}.custom-range::-moz-focus-outer{border:0}.custom-range::-webkit-slider-thumb{width:1rem;height:1rem;margin-top:-.25rem;background-color:#007bff;border:0;border-radius:1rem;-webkit-transition:background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out;transition:background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out;-webkit-appearance:none;appearance:none}@media (prefers-reduced-motion:reduce){.custom-range::-webkit-slider-thumb{-webkit-transition:none;transition:none}}.custom-range::-webkit-slider-thumb:active{background-color:#b3d7ff}.custom-range::-webkit-slider-runnable-track{width:100%;height:.5rem;color:transparent;cursor:pointer;background-color:#dee2e6;border-color:transparent;border-radius:1rem}.custom-range::-moz-range-thumb{width:1rem;height:1rem;background-color:#007bff;border:0;border-radius:1rem;-moz-transition:background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out;transition:background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out;-moz-appearance:none;appearance:none}@media (prefers-reduced-motion:reduce){.custom-range::-moz-range-thumb{-moz-transition:none;transition:none}}.custom-range::-moz-range-thumb:active{background-color:#b3d7ff}.custom-range::-moz-range-track{width:100%;height:.5rem;color:transparent;cursor:pointer;background-color:#dee2e6;border-color:transparent;border-radius:1rem}.custom-range::-ms-thumb{width:1rem;height:1rem;margin-top:0;margin-right:.2rem;margin-left:.2rem;background-color:#007bff;border:0;border-radius:1rem;-ms-transition:background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out;transition:background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out;appearance:none}@media (prefers-reduced-motion:reduce){.custom-range::-ms-thumb{-ms-transition:none;transition:none}}.custom-range::-ms-thumb:active{background-color:#b3d7ff}.custom-range::-ms-track{width:100%;height:.5rem;color:transparent;cursor:pointer;background-color:transparent;border-color:transparent;border-width:.5rem}.custom-range::-ms-fill-lower{background-color:#dee2e6;border-radius:1rem}.custom-range::-ms-fill-upper{margin-right:15px;background-color:#dee2e6;border-radius:1rem}.custom-range:disabled::-webkit-slider-thumb{background-color:#adb5bd}.custom-range:disabled::-webkit-slider-runnable-track{cursor:default}.custom-range:disabled::-moz-range-thumb{background-color:#adb5bd}.custom-range:disabled::-moz-range-track{cursor:default}.custom-range:disabled::-ms-thumb{background-color:#adb5bd}.custom-control-label::before,.custom-file-label,.custom-select{transition:background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out}@media (prefers-reduced-motion:reduce){.custom-control-label::before,.custom-file-label,.custom-select{transition:none}}.nav{display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;padding-left:0;margin-bottom:0;list-style:none}.nav-link{display:block;padding:.5rem 1rem}.nav-link:focus,.nav-link:hover{text-decoration:none}.nav-link.disabled{color:#6c757d;pointer-events:none;cursor:default}.nav-tabs{border-bottom:1px solid #dee2e6}.nav-tabs .nav-item{margin-bottom:-1px}.nav-tabs .nav-link{border:1px solid transparent;border-top-left-radius:.25rem;border-top-right-radius:.25rem}.nav-tabs .nav-link:focus,.nav-tabs .nav-link:hover{border-color:#e9ecef #e9ecef #dee2e6}.nav-tabs .nav-link.disabled{color:#6c757d;background-color:transparent;border-color:transparent}.nav-tabs .nav-item.show .nav-link,.nav-tabs .nav-link.active{color:#495057;background-color:#fff;border-color:#dee2e6 #dee2e6 #fff}.nav-tabs .dropdown-menu{margin-top:-1px;border-top-left-radius:0;border-top-right-radius:0}.nav-pills .nav-link{border-radius:.25rem}.nav-pills .nav-link.active,.nav-pills .show>.nav-link{color:#fff;background-color:#007bff}.nav-fill .nav-item{-ms-flex:1 1 auto;flex:1 1 auto;text-align:center}.nav-justified .nav-item{-ms-flex-preferred-size:0;flex-basis:0;-ms-flex-positive:1;flex-grow:1;text-align:center}.tab-content>.tab-pane{display:none}.tab-content>.active{display:block}.navbar{position:relative;display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;-ms-flex-align:center;align-items:center;-ms-flex-pack:justify;justify-content:space-between;padding:.5rem 1rem}.navbar .container,.navbar .container-fluid,.navbar .container-lg,.navbar .container-md,.navbar .container-sm,.navbar .container-xl{display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;-ms-flex-align:center;align-items:center;-ms-flex-pack:justify;justify-content:space-between}.navbar-brand{display:inline-block;padding-top:.3125rem;padding-bottom:.3125rem;margin-right:1rem;font-size:1.25rem;line-height:inherit;white-space:nowrap}.navbar-brand:focus,.navbar-brand:hover{text-decoration:none}.navbar-nav{display:-ms-flexbox;display:flex;-ms-flex-direction:column;flex-direction:column;padding-left:0;margin-bottom:0;list-style:none}.navbar-nav .nav-link{padding-right:0;padding-left:0}.navbar-nav .dropdown-menu{position:static;float:none}.navbar-text{display:inline-block;padding-top:.5rem;padding-bottom:.5rem}.navbar-collapse{-ms-flex-preferred-size:100%;flex-basis:100%;-ms-flex-positive:1;flex-grow:1;-ms-flex-align:center;align-items:center}.navbar-toggler{padding:.25rem .75rem;font-size:1.25rem;line-height:1;background-color:transparent;border:1px solid transparent;border-radius:.25rem}.navbar-toggler:focus,.navbar-toggler:hover{text-decoration:none}.navbar-toggler-icon{display:inline-block;width:1.5em;height:1.5em;vertical-align:middle;content:"""";background:no-repeat center center;background-size:100% 100%}@media (max-width:575.98px){.navbar-expand-sm>.container,.navbar-expand-sm>.container-fluid,.navbar-expand-sm>.container-lg,.navbar-expand-sm>.container-md,.navbar-expand-sm>.container-sm,.navbar-expand-sm>.container-xl{padding-right:0;padding-left:0}}@media (min-width:576px){.navbar-expand-sm{-ms-flex-flow:row nowrap;flex-flow:row nowrap;-ms-flex-pack:start;justify-content:flex-start}.navbar-expand-sm .navbar-nav{-ms-flex-direction:row;flex-direction:row}.navbar-expand-sm .navbar-nav .dropdown-menu{position:absolute}.navbar-expand-sm .navbar-nav .nav-link{padding-right:.5rem;padding-left:.5rem}.navbar-expand-sm>.container,.navbar-expand-sm>.container-fluid,.navbar-expand-sm>.container-lg,.navbar-expand-sm>.container-md,.navbar-expand-sm>.container-sm,.navbar-expand-sm>.container-xl{-ms-flex-wrap:nowrap;flex-wrap:nowrap}.navbar-expand-sm .navbar-collapse{display:-ms-flexbox!important;display:flex!important;-ms-flex-preferred-size:auto;flex-basis:auto}.navbar-expand-sm .navbar-toggler{display:none}}@media (max-width:767.98px){.navbar-expand-md>.container,.navbar-expand-md>.container-fluid,.navbar-expand-md>.container-lg,.navbar-expand-md>.container-md,.navbar-expand-md>.container-sm,.navbar-expand-md>.container-xl{padding-right:0;padding-left:0}}@media (min-width:768px){.navbar-expand-md{-ms-flex-flow:row nowrap;flex-flow:row nowrap;-ms-flex-pack:start;justify-content:flex-start}.navbar-expand-md .navbar-nav{-ms-flex-direction:row;flex-direction:row}.navbar-expand-md .navbar-nav .dropdown-menu{position:absolute}.navbar-expand-md .navbar-nav .nav-link{padding-right:.5rem;padding-left:.5rem}.navbar-expand-md>.container,.navbar-expand-md>.container-fluid,.navbar-expand-md>.container-lg,.navbar-expand-md>.container-md,.navbar-expand-md>.container-sm,.navbar-expand-md>.container-xl{-ms-flex-wrap:nowrap;flex-wrap:nowrap}.navbar-expand-md .navbar-collapse{display:-ms-flexbox!important;display:flex!important;-ms-flex-preferred-size:auto;flex-basis:auto}.navbar-expand-md .navbar-toggler{display:none}}@media (max-width:991.98px){.navbar-expand-lg>.container,.navbar-expand-lg>.container-fluid,.navbar-expand-lg>.container-lg,.navbar-expand-lg>.container-md,.navbar-expand-lg>.container-sm,.navbar-expand-lg>.container-xl{padding-right:0;padding-left:0}}@media (min-width:992px){.navbar-expand-lg{-ms-flex-flow:row nowrap;flex-flow:row nowrap;-ms-flex-pack:start;justify-content:flex-start}.navbar-expand-lg .navbar-nav{-ms-flex-direction:row;flex-direction:row}.navbar-expand-lg .navbar-nav .dropdown-menu{position:absolute}.navbar-expand-lg .navbar-nav .nav-link{padding-right:.5rem;padding-left:.5rem}.navbar-expand-lg>.container,.navbar-expand-lg>.container-fluid,.navbar-expand-lg>.container-lg,.navbar-expand-lg>.container-md,.navbar-expand-lg>.container-sm,.navbar-expand-lg>.container-xl{-ms-flex-wrap:nowrap;flex-wrap:nowrap}.navbar-expand-lg .navbar-collapse{display:-ms-flexbox!important;display:flex!important;-ms-flex-preferred-size:auto;flex-basis:auto}.navbar-expand-lg .navbar-toggler{display:none}}@media (max-width:1199.98px){.navbar-expand-xl>.container,.navbar-expand-xl>.container-fluid,.navbar-expand-xl>.container-lg,.navbar-expand-xl>.container-md,.navbar-expand-xl>.container-sm,.navbar-expand-xl>.container-xl{padding-right:0;padding-left:0}}@media (min-width:1200px){.navbar-expand-xl{-ms-flex-flow:row nowrap;flex-flow:row nowrap;-ms-flex-pack:start;justify-content:flex-start}.navbar-expand-xl .navbar-nav{-ms-flex-direction:row;flex-direction:row}.navbar-expand-xl .navbar-nav .dropdown-menu{position:absolute}.navbar-expand-xl .navbar-nav .nav-link{padding-right:.5rem;padding-left:.5rem}.navbar-expand-xl>.container,.navbar-expand-xl>.container-fluid,.navbar-expand-xl>.container-lg,.navbar-expand-xl>.container-md,.navbar-expand-xl>.container-sm,.navbar-expand-xl>.container-xl{-ms-flex-wrap:nowrap;flex-wrap:nowrap}.navbar-expand-xl .navbar-collapse{display:-ms-flexbox!important;display:flex!important;-ms-flex-preferred-size:auto;flex-basis:auto}.navbar-expand-xl .navbar-toggler{display:none}}.navbar-expand{-ms-flex-flow:row nowrap;flex-flow:row nowrap;-ms-flex-pack:start;justify-content:flex-start}.navbar-expand>.container,.navbar-expand>.container-fluid,.navbar-expand>.container-lg,.navbar-expand>.container-md,.navbar-expand>.container-sm,.navbar-expand>.container-xl{padding-right:0;padding-left:0}.navbar-expand .navbar-nav{-ms-flex-direction:row;flex-direction:row}.navbar-expand .navbar-nav .dropdown-menu{position:absolute}.navbar-expand .navbar-nav .nav-link{padding-right:.5rem;padding-left:.5rem}.navbar-expand>.container,.navbar-expand>.container-fluid,.navbar-expand>.container-lg,.navbar-expand>.container-md,.navbar-expand>.container-sm,.navbar-expand>.container-xl{-ms-flex-wrap:nowrap;flex-wrap:nowrap}.navbar-expand .navbar-collapse{display:-ms-flexbox!important;display:flex!important;-ms-flex-preferred-size:auto;flex-basis:auto}.navbar-expand .navbar-toggler{display:none}.navbar-light .navbar-brand{color:rgba(0,0,0,.9)}.navbar-light .navbar-brand:focus,.navbar-light .navbar-brand:hover{color:rgba(0,0,0,.9)}.navbar-light .navbar-nav .nav-link{color:rgba(0,0,0,.5)}.navbar-light .navbar-nav .nav-link:focus,.navbar-light .navbar-nav .nav-link:hover{color:rgba(0,0,0,.7)}.navbar-light .navbar-nav .nav-link.disabled{color:rgba(0,0,0,.3)}.navbar-light .navbar-nav .active>.nav-link,.navbar-light .navbar-nav .nav-link.active,.navbar-light .navbar-nav .nav-link.show,.navbar-light .navbar-nav .show>.nav-link{color:rgba(0,0,0,.9)}.navbar-light .navbar-toggler{color:rgba(0,0,0,.5);border-color:rgba(0,0,0,.1)}.navbar-light .navbar-toggler-icon{background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='30' height='30' viewBox='0 0 30 30'%3e%3cpath stroke='rgba(0, 0, 0, 0.5)' stroke-linecap='round' stroke-miterlimit='10' stroke-width='2' d='M4 7h22M4 15h22M4 23h22'/%3e%3c/svg%3e"")}.navbar-light .navbar-text{color:rgba(0,0,0,.5)}.navbar-light .navbar-text a{color:rgba(0,0,0,.9)}.navbar-light .navbar-text a:focus,.navbar-light .navbar-text a:hover{color:rgba(0,0,0,.9)}.navbar-dark .navbar-brand{color:#fff}.navbar-dark .navbar-brand:focus,.navbar-dark .navbar-brand:hover{color:#fff}.navbar-dark .navbar-nav .nav-link{color:rgba(255,255,255,.5)}.navbar-dark .navbar-nav .nav-link:focus,.navbar-dark .navbar-nav .nav-link:hover{color:rgba(255,255,255,.75)}.navbar-dark .navbar-nav .nav-link.disabled{color:rgba(255,255,255,.25)}.navbar-dark .navbar-nav .active>.nav-link,.navbar-dark .navbar-nav .nav-link.active,.navbar-dark .navbar-nav .nav-link.show,.navbar-dark .navbar-nav .show>.nav-link{color:#fff}.navbar-dark .navbar-toggler{color:rgba(255,255,255,.5);border-color:rgba(255,255,255,.1)}.navbar-dark .navbar-toggler-icon{background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='30' height='30' viewBox='0 0 30 30'%3e%3cpath stroke='rgba(255, 255, 255, 0.5)' stroke-linecap='round' stroke-miterlimit='10' stroke-width='2' d='M4 7h22M4 15h22M4 23h22'/%3e%3c/svg%3e"")}.navbar-dark .navbar-text{color:rgba(255,255,255,.5)}.navbar-dark .navbar-text a{color:#fff}.navbar-dark .navbar-text a:focus,.navbar-dark .navbar-text a:hover{color:#fff}.card{position:relative;display:-ms-flexbox;display:flex;-ms-flex-direction:column;flex-direction:column;min-width:0;word-wrap:break-word;background-color:#fff;background-clip:border-box;border:1px solid rgba(0,0,0,.125);border-radius:.25rem}.card>hr{margin-right:0;margin-left:0}.card>.list-group:first-child .list-group-item:first-child{border-top-left-radius:.25rem;border-top-right-radius:.25rem}.card>.list-group:last-child .list-group-item:last-child{border-bottom-right-radius:.25rem;border-bottom-left-radius:.25rem}.card-body{-ms-flex:1 1 auto;flex:1 1 auto;min-height:1px;padding:1.25rem}.card-title{margin-bottom:.75rem}.card-subtitle{margin-top:-.375rem;margin-bottom:0}.card-text:last-child{margin-bottom:0}.card-link:hover{text-decoration:none}.card-link+.card-link{margin-left:1.25rem}.card-header{padding:.75rem 1.25rem;margin-bottom:0;background-color:rgba(0,0,0,.03);border-bottom:1px solid rgba(0,0,0,.125)}.card-header:first-child{border-radius:calc(.25rem - 1px) calc(.25rem - 1px) 0 0}.card-header+.list-group .list-group-item:first-child{border-top:0}.card-footer{padding:.75rem 1.25rem;background-color:rgba(0,0,0,.03);border-top:1px solid rgba(0,0,0,.125)}.card-footer:last-child{border-radius:0 0 calc(.25rem - 1px) calc(.25rem - 1px)}.card-header-tabs{margin-right:-.625rem;margin-bottom:-.75rem;margin-left:-.625rem;border-bottom:0}.card-header-pills{margin-right:-.625rem;margin-left:-.625rem}.card-img-overlay{position:absolute;top:0;right:0;bottom:0;left:0;padding:1.25rem}.card-img,.card-img-bottom,.card-img-top{-ms-flex-negative:0;flex-shrink:0;width:100%}.card-img,.card-img-top{border-top-left-radius:calc(.25rem - 1px);border-top-right-radius:calc(.25rem - 1px)}.card-img,.card-img-bottom{border-bottom-right-radius:calc(.25rem - 1px);border-bottom-left-radius:calc(.25rem - 1px)}.card-deck .card{margin-bottom:15px}@media (min-width:576px){.card-deck{display:-ms-flexbox;display:flex;-ms-flex-flow:row wrap;flex-flow:row wrap;margin-right:-15px;margin-left:-15px}.card-deck .card{-ms-flex:1 0 0%;flex:1 0 0%;margin-right:15px;margin-bottom:0;margin-left:15px}}.card-group>.card{margin-bottom:15px}@media (min-width:576px){.card-group{display:-ms-flexbox;display:flex;-ms-flex-flow:row wrap;flex-flow:row wrap}.card-group>.card{-ms-flex:1 0 0%;flex:1 0 0%;margin-bottom:0}.card-group>.card+.card{margin-left:0;border-left:0}.card-group>.card:not(:last-child){border-top-right-radius:0;border-bottom-right-radius:0}.card-group>.card:not(:last-child) .card-header,.card-group>.card:not(:last-child) .card-img-top{border-top-right-radius:0}.card-group>.card:not(:last-child) .card-footer,.card-group>.card:not(:last-child) .card-img-bottom{border-bottom-right-radius:0}.card-group>.card:not(:first-child){border-top-left-radius:0;border-bottom-left-radius:0}.card-group>.card:not(:first-child) .card-header,.card-group>.card:not(:first-child) .card-img-top{border-top-left-radius:0}.card-group>.card:not(:first-child) .card-footer,.card-group>.card:not(:first-child) .card-img-bottom{border-bottom-left-radius:0}}.card-columns .card{margin-bottom:.75rem}@media (min-width:576px){.card-columns{-webkit-column-count:3;-moz-column-count:3;column-count:3;-webkit-column-gap:1.25rem;-moz-column-gap:1.25rem;column-gap:1.25rem;orphans:1;widows:1}.card-columns .card{display:inline-block;width:100%}}.accordion>.card{overflow:hidden}.accordion>.card:not(:last-of-type){border-bottom:0;border-bottom-right-radius:0;border-bottom-left-radius:0}.accordion>.card:not(:first-of-type){border-top-left-radius:0;border-top-right-radius:0}.accordion>.card>.card-header{border-radius:0;margin-bottom:-1px}.breadcrumb{display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;padding:.75rem 1rem;margin-bottom:1rem;list-style:none;background-color:#e9ecef;border-radius:.25rem}.breadcrumb-item+.breadcrumb-item{padding-left:.5rem}.breadcrumb-item+.breadcrumb-item::before{display:inline-block;padding-right:.5rem;color:#6c757d;content:""/""}.breadcrumb-item+.breadcrumb-item:hover::before{text-decoration:underline}.breadcrumb-item+.breadcrumb-item:hover::before{text-decoration:none}.breadcrumb-item.active{color:#6c757d}.pagination{display:-ms-flexbox;display:flex;padding-left:0;list-style:none;border-radius:.25rem}.page-link{position:relative;display:block;padding:.5rem .75rem;margin-left:-1px;line-height:1.25;color:#007bff;background-color:#fff;border:1px solid #dee2e6}.page-link:hover{z-index:2;color:#0056b3;text-decoration:none;background-color:#e9ecef;border-color:#dee2e6}.page-link:focus{z-index:3;outline:0;box-shadow:0 0 0 .2rem rgba(0,123,255,.25)}.page-item:first-child .page-link{margin-left:0;border-top-left-radius:.25rem;border-bottom-left-radius:.25rem}.page-item:last-child .page-link{border-top-right-radius:.25rem;border-bottom-right-radius:.25rem}.page-item.active .page-link{z-index:3;color:#fff;background-color:#007bff;border-color:#007bff}.page-item.disabled .page-link{color:#6c757d;pointer-events:none;cursor:auto;background-color:#fff;border-color:#dee2e6}.pagination-lg .page-link{padding:.75rem 1.5rem;font-size:1.25rem;line-height:1.5}.pagination-lg .page-item:first-child .page-link{border-top-left-radius:.3rem;border-bottom-left-radius:.3rem}.pagination-lg .page-item:last-child .page-link{border-top-right-radius:.3rem;border-bottom-right-radius:.3rem}.pagination-sm .page-link{padding:.25rem .5rem;font-size:.875rem;line-height:1.5}.pagination-sm .page-item:first-child .page-link{border-top-left-radius:.2rem;border-bottom-left-radius:.2rem}.pagination-sm .page-item:last-child .page-link{border-top-right-radius:.2rem;border-bottom-right-radius:.2rem}.badge{display:inline-block;padding:.25em .4em;font-size:75%;font-weight:700;line-height:1;text-align:center;white-space:nowrap;vertical-align:baseline;border-radius:.25rem;transition:color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out,box-shadow .15s ease-in-out}@media (prefers-reduced-motion:reduce){.badge{transition:none}}a.badge:focus,a.badge:hover{text-decoration:none}.badge:empty{display:none}.btn .badge{position:relative;top:-1px}.badge-pill{padding-right:.6em;padding-left:.6em;border-radius:10rem}.badge-primary{color:#fff;background-color:#007bff}a.badge-primary:focus,a.badge-primary:hover{color:#fff;background-color:#0062cc}a.badge-primary.focus,a.badge-primary:focus{outline:0;box-shadow:0 0 0 .2rem rgba(0,123,255,.5)}.badge-secondary{color:#fff;background-color:#6c757d}a.badge-secondary:focus,a.badge-secondary:hover{color:#fff;background-color:#545b62}a.badge-secondary.focus,a.badge-secondary:focus{outline:0;box-shadow:0 0 0 .2rem rgba(108,117,125,.5)}.badge-success{color:#fff;background-color:#28a745}a.badge-success:focus,a.badge-success:hover{color:#fff;background-color:#1e7e34}a.badge-success.focus,a.badge-success:focus{outline:0;box-shadow:0 0 0 .2rem rgba(40,167,69,.5)}.badge-info{color:#fff;background-color:#17a2b8}a.badge-info:focus,a.badge-info:hover{color:#fff;background-color:#117a8b}a.badge-info.focus,a.badge-info:focus{outline:0;box-shadow:0 0 0 .2rem rgba(23,162,184,.5)}.badge-warning{color:#212529;background-color:#ffc107}a.badge-warning:focus,a.badge-warning:hover{color:#212529;background-color:#d39e00}a.badge-warning.focus,a.badge-warning:focus{outline:0;box-shadow:0 0 0 .2rem rgba(255,193,7,.5)}.badge-danger{color:#fff;background-color:#dc3545}a.badge-danger:focus,a.badge-danger:hover{color:#fff;background-color:#bd2130}a.badge-danger.focus,a.badge-danger:focus{outline:0;box-shadow:0 0 0 .2rem rgba(220,53,69,.5)}.badge-light{color:#212529;background-color:#f8f9fa}a.badge-light:focus,a.badge-light:hover{color:#212529;background-color:#dae0e5}a.badge-light.focus,a.badge-light:focus{outline:0;box-shadow:0 0 0 .2rem rgba(248,249,250,.5)}.badge-dark{color:#fff;background-color:#343a40}a.badge-dark:focus,a.badge-dark:hover{color:#fff;background-color:#1d2124}a.badge-dark.focus,a.badge-dark:focus{outline:0;box-shadow:0 0 0 .2rem rgba(52,58,64,.5)}.jumbotron{padding:2rem 1rem;margin-bottom:2rem;background-color:#e9ecef;border-radius:.3rem}@media (min-width:576px){.jumbotron{padding:4rem 2rem}}.jumbotron-fluid{padding-right:0;padding-left:0;border-radius:0}.alert{position:relative;padding:.75rem 1.25rem;margin-bottom:1rem;border:1px solid transparent;border-radius:.25rem}.alert-heading{color:inherit}.alert-link{font-weight:700}.alert-dismissible{padding-right:4rem}.alert-dismissible .close{position:absolute;top:0;right:0;padding:.75rem 1.25rem;color:inherit}.alert-primary{color:#004085;background-color:#cce5ff;border-color:#b8daff}.alert-primary hr{border-top-color:#9fcdff}.alert-primary .alert-link{color:#002752}.alert-secondary{color:#383d41;background-color:#e2e3e5;border-color:#d6d8db}.alert-secondary hr{border-top-color:#c8cbcf}.alert-secondary .alert-link{color:#202326}.alert-success{color:#155724;background-color:#d4edda;border-color:#c3e6cb}.alert-success hr{border-top-color:#b1dfbb}.alert-success .alert-link{color:#0b2e13}.alert-info{color:#0c5460;background-color:#d1ecf1;border-color:#bee5eb}.alert-info hr{border-top-color:#abdde5}.alert-info .alert-link{color:#062c33}.alert-warning{color:#856404;background-color:#fff3cd;border-color:#ffeeba}.alert-warning hr{border-top-color:#ffe8a1}.alert-warning .alert-link{color:#533f03}.alert-danger{color:#721c24;background-color:#f8d7da;border-color:#f5c6cb}.alert-danger hr{border-top-color:#f1b0b7}.alert-danger .alert-link{color:#491217}.alert-light{color:#818182;background-color:#fefefe;border-color:#fdfdfe}.alert-light hr{border-top-color:#ececf6}.alert-light .alert-link{color:#686868}.alert-dark{color:#1b1e21;background-color:#d6d8d9;border-color:#c6c8ca}.alert-dark hr{border-top-color:#b9bbbe}.alert-dark .alert-link{color:#040505}@-webkit-keyframes progress-bar-stripes{from{background-position:1rem 0}to{background-position:0 0}}@keyframes progress-bar-stripes{from{background-position:1rem 0}to{background-position:0 0}}.progress{display:-ms-flexbox;display:flex;height:1rem;overflow:hidden;font-size:.75rem;background-color:#e9ecef;border-radius:.25rem}.progress-bar{display:-ms-flexbox;display:flex;-ms-flex-direction:column;flex-direction:column;-ms-flex-pack:center;justify-content:center;overflow:hidden;color:#fff;text-align:center;white-space:nowrap;background-color:#007bff;transition:width .6s ease}@media (prefers-reduced-motion:reduce){.progress-bar{transition:none}}.progress-bar-striped{background-image:linear-gradient(45deg,rgba(255,255,255,.15) 25%,transparent 25%,transparent 50%,rgba(255,255,255,.15) 50%,rgba(255,255,255,.15) 75%,transparent 75%,transparent);background-size:1rem 1rem}.progress-bar-animated{-webkit-animation:progress-bar-stripes 1s linear infinite;animation:progress-bar-stripes 1s linear infinite}@media (prefers-reduced-motion:reduce){.progress-bar-animated{-webkit-animation:none;animation:none}}.media{display:-ms-flexbox;display:flex;-ms-flex-align:start;align-items:flex-start}.media-body{-ms-flex:1;flex:1}.list-group{display:-ms-flexbox;display:flex;-ms-flex-direction:column;flex-direction:column;padding-left:0;margin-bottom:0}.list-group-item-action{width:100%;color:#495057;text-align:inherit}.list-group-item-action:focus,.list-group-item-action:hover{z-index:1;color:#495057;text-decoration:none;background-color:#f8f9fa}.list-group-item-action:active{color:#212529;background-color:#e9ecef}.list-group-item{position:relative;display:block;padding:.75rem 1.25rem;background-color:#fff;border:1px solid rgba(0,0,0,.125)}.list-group-item:first-child{border-top-left-radius:.25rem;border-top-right-radius:.25rem}.list-group-item:last-child{border-bottom-right-radius:.25rem;border-bottom-left-radius:.25rem}.list-group-item.disabled,.list-group-item:disabled{color:#6c757d;pointer-events:none;background-color:#fff}.list-group-item.active{z-index:2;color:#fff;background-color:#007bff;border-color:#007bff}.list-group-item+.list-group-item{border-top-width:0}.list-group-item+.list-group-item.active{margin-top:-1px;border-top-width:1px}.list-group-horizontal{-ms-flex-direction:row;flex-direction:row}.list-group-horizontal .list-group-item:first-child{border-bottom-left-radius:.25rem;border-top-right-radius:0}.list-group-horizontal .list-group-item:last-child{border-top-right-radius:.25rem;border-bottom-left-radius:0}.list-group-horizontal .list-group-item.active{margin-top:0}.list-group-horizontal .list-group-item+.list-group-item{border-top-width:1px;border-left-width:0}.list-group-horizontal .list-group-item+.list-group-item.active{margin-left:-1px;border-left-width:1px}@media (min-width:576px){.list-group-horizontal-sm{-ms-flex-direction:row;flex-direction:row}.list-group-horizontal-sm .list-group-item:first-child{border-bottom-left-radius:.25rem;border-top-right-radius:0}.list-group-horizontal-sm .list-group-item:last-child{border-top-right-radius:.25rem;border-bottom-left-radius:0}.list-group-horizontal-sm .list-group-item.active{margin-top:0}.list-group-horizontal-sm .list-group-item+.list-group-item{border-top-width:1px;border-left-width:0}.list-group-horizontal-sm .list-group-item+.list-group-item.active{margin-left:-1px;border-left-width:1px}}@media (min-width:768px){.list-group-horizontal-md{-ms-flex-direction:row;flex-direction:row}.list-group-horizontal-md .list-group-item:first-child{border-bottom-left-radius:.25rem;border-top-right-radius:0}.list-group-horizontal-md .list-group-item:last-child{border-top-right-radius:.25rem;border-bottom-left-radius:0}.list-group-horizontal-md .list-group-item.active{margin-top:0}.list-group-horizontal-md .list-group-item+.list-group-item{border-top-width:1px;border-left-width:0}.list-group-horizontal-md .list-group-item+.list-group-item.active{margin-left:-1px;border-left-width:1px}}@media (min-width:992px){.list-group-horizontal-lg{-ms-flex-direction:row;flex-direction:row}.list-group-horizontal-lg .list-group-item:first-child{border-bottom-left-radius:.25rem;border-top-right-radius:0}.list-group-horizontal-lg .list-group-item:last-child{border-top-right-radius:.25rem;border-bottom-left-radius:0}.list-group-horizontal-lg .list-group-item.active{margin-top:0}.list-group-horizontal-lg .list-group-item+.list-group-item{border-top-width:1px;border-left-width:0}.list-group-horizontal-lg .list-group-item+.list-group-item.active{margin-left:-1px;border-left-width:1px}}@media (min-width:1200px){.list-group-horizontal-xl{-ms-flex-direction:row;flex-direction:row}.list-group-horizontal-xl .list-group-item:first-child{border-bottom-left-radius:.25rem;border-top-right-radius:0}.list-group-horizontal-xl .list-group-item:last-child{border-top-right-radius:.25rem;border-bottom-left-radius:0}.list-group-horizontal-xl .list-group-item.active{margin-top:0}.list-group-horizontal-xl .list-group-item+.list-group-item{border-top-width:1px;border-left-width:0}.list-group-horizontal-xl .list-group-item+.list-group-item.active{margin-left:-1px;border-left-width:1px}}.list-group-flush .list-group-item{border-right-width:0;border-left-width:0;border-radius:0}.list-group-flush .list-group-item:first-child{border-top-width:0}.list-group-flush:last-child .list-group-item:last-child{border-bottom-width:0}.list-group-item-primary{color:#004085;background-color:#b8daff}.list-group-item-primary.list-group-item-action:focus,.list-group-item-primary.list-group-item-action:hover{color:#004085;background-color:#9fcdff}.list-group-item-primary.list-group-item-action.active{color:#fff;background-color:#004085;border-color:#004085}.list-group-item-secondary{color:#383d41;background-color:#d6d8db}.list-group-item-secondary.list-group-item-action:focus,.list-group-item-secondary.list-group-item-action:hover{color:#383d41;background-color:#c8cbcf}.list-group-item-secondary.list-group-item-action.active{color:#fff;background-color:#383d41;border-color:#383d41}.list-group-item-success{color:#155724;background-color:#c3e6cb}.list-group-item-success.list-group-item-action:focus,.list-group-item-success.list-group-item-action:hover{color:#155724;background-color:#b1dfbb}.list-group-item-success.list-group-item-action.active{color:#fff;background-color:#155724;border-color:#155724}.list-group-item-info{color:#0c5460;background-color:#bee5eb}.list-group-item-info.list-group-item-action:focus,.list-group-item-info.list-group-item-action:hover{color:#0c5460;background-color:#abdde5}.list-group-item-info.list-group-item-action.active{color:#fff;background-color:#0c5460;border-color:#0c5460}.list-group-item-warning{color:#856404;background-color:#ffeeba}.list-group-item-warning.list-group-item-action:focus,.list-group-item-warning.list-group-item-action:hover{color:#856404;background-color:#ffe8a1}.list-group-item-warning.list-group-item-action.active{color:#fff;background-color:#856404;border-color:#856404}.list-group-item-danger{color:#721c24;background-color:#f5c6cb}.list-group-item-danger.list-group-item-action:focus,.list-group-item-danger.list-group-item-action:hover{color:#721c24;background-color:#f1b0b7}.list-group-item-danger.list-group-item-action.active{color:#fff;background-color:#721c24;border-color:#721c24}.list-group-item-light{color:#818182;background-color:#fdfdfe}.list-group-item-light.list-group-item-action:focus,.list-group-item-light.list-group-item-action:hover{color:#818182;background-color:#ececf6}.list-group-item-light.list-group-item-action.active{color:#fff;background-color:#818182;border-color:#818182}.list-group-item-dark{color:#1b1e21;background-color:#c6c8ca}.list-group-item-dark.list-group-item-action:focus,.list-group-item-dark.list-group-item-action:hover{color:#1b1e21;background-color:#b9bbbe}.list-group-item-dark.list-group-item-action.active{color:#fff;background-color:#1b1e21;border-color:#1b1e21}.close{float:right;font-size:1.5rem;font-weight:700;line-height:1;color:#000;text-shadow:0 1px 0 #fff;opacity:.5}.close:hover{color:#000;text-decoration:none}.close:not(:disabled):not(.disabled):focus,.close:not(:disabled):not(.disabled):hover{opacity:.75}button.close{padding:0;background-color:transparent;border:0;-webkit-appearance:none;-moz-appearance:none;appearance:none}a.close.disabled{pointer-events:none}.toast{max-width:350px;overflow:hidden;font-size:.875rem;background-color:rgba(255,255,255,.85);background-clip:padding-box;border:1px solid rgba(0,0,0,.1);box-shadow:0 .25rem .75rem rgba(0,0,0,.1);-webkit-backdrop-filter:blur(10px);backdrop-filter:blur(10px);opacity:0;border-radius:.25rem}.toast:not(:last-child){margin-bottom:.75rem}.toast.showing{opacity:1}.toast.show{display:block;opacity:1}.toast.hide{display:none}.toast-header{display:-ms-flexbox;display:flex;-ms-flex-align:center;align-items:center;padding:.25rem .75rem;color:#6c757d;background-color:rgba(255,255,255,.85);background-clip:padding-box;border-bottom:1px solid rgba(0,0,0,.05)}.toast-body{padding:.75rem}.modal-open{overflow:hidden}.modal-open .modal{overflow-x:hidden;overflow-y:auto}.modal{position:fixed;top:0;left:0;z-index:1050;display:none;width:100%;height:100%;overflow:hidden;outline:0}.modal-dialog{position:relative;width:auto;margin:.5rem;pointer-events:none}.modal.fade .modal-dialog{transition:-webkit-transform .3s ease-out;transition:transform .3s ease-out;transition:transform .3s ease-out,-webkit-transform .3s ease-out;-webkit-transform:translate(0,-50px);transform:translate(0,-50px)}@media (prefers-reduced-motion:reduce){.modal.fade .modal-dialog{transition:none}}.modal.show .modal-dialog{-webkit-transform:none;transform:none}.modal.modal-static .modal-dialog{-webkit-transform:scale(1.02);transform:scale(1.02)}.modal-dialog-scrollable{display:-ms-flexbox;display:flex;max-height:calc(100% - 1rem)}.modal-dialog-scrollable .modal-content{max-height:calc(100vh - 1rem);overflow:hidden}.modal-dialog-scrollable .modal-footer,.modal-dialog-scrollable .modal-header{-ms-flex-negative:0;flex-shrink:0}.modal-dialog-scrollable .modal-body{overflow-y:auto}.modal-dialog-centered{display:-ms-flexbox;display:flex;-ms-flex-align:center;align-items:center;min-height:calc(100% - 1rem)}.modal-dialog-centered::before{display:block;height:calc(100vh - 1rem);content:""""}.modal-dialog-centered.modal-dialog-scrollable{-ms-flex-direction:column;flex-direction:column;-ms-flex-pack:center;justify-content:center;height:100%}.modal-dialog-centered.modal-dialog-scrollable .modal-content{max-height:none}.modal-dialog-centered.modal-dialog-scrollable::before{content:none}.modal-content{position:relative;display:-ms-flexbox;display:flex;-ms-flex-direction:column;flex-direction:column;width:100%;pointer-events:auto;background-color:#fff;background-clip:padding-box;border:1px solid rgba(0,0,0,.2);border-radius:.3rem;outline:0}.modal-backdrop{position:fixed;top:0;left:0;z-index:1040;width:100vw;height:100vh;background-color:#000}.modal-backdrop.fade{opacity:0}.modal-backdrop.show{opacity:.5}.modal-header{display:-ms-flexbox;display:flex;-ms-flex-align:start;align-items:flex-start;-ms-flex-pack:justify;justify-content:space-between;padding:1rem 1rem;border-bottom:1px solid #dee2e6;border-top-left-radius:calc(.3rem - 1px);border-top-right-radius:calc(.3rem - 1px)}.modal-header .close{padding:1rem 1rem;margin:-1rem -1rem -1rem auto}.modal-title{margin-bottom:0;line-height:1.5}.modal-body{position:relative;-ms-flex:1 1 auto;flex:1 1 auto;padding:1rem}.modal-footer{display:-ms-flexbox;display:flex;-ms-flex-wrap:wrap;flex-wrap:wrap;-ms-flex-align:center;align-items:center;-ms-flex-pack:end;justify-content:flex-end;padding:.75rem;border-top:1px solid #dee2e6;border-bottom-right-radius:calc(.3rem - 1px);border-bottom-left-radius:calc(.3rem - 1px)}.modal-footer>*{margin:.25rem}.modal-scrollbar-measure{position:absolute;top:-9999px;width:50px;height:50px;overflow:scroll}@media (min-width:576px){.modal-dialog{max-width:500px;margin:1.75rem auto}.modal-dialog-scrollable{max-height:calc(100% - 3.5rem)}.modal-dialog-scrollable .modal-content{max-height:calc(100vh - 3.5rem)}.modal-dialog-centered{min-height:calc(100% - 3.5rem)}.modal-dialog-centered::before{height:calc(100vh - 3.5rem)}.modal-sm{max-width:300px}}@media (min-width:992px){.modal-lg,.modal-xl{max-width:800px}}@media (min-width:1200px){.modal-xl{max-width:1140px}}.tooltip{position:absolute;z-index:1070;display:block;margin:0;font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,""Helvetica Neue"",Arial,""Noto Sans"",sans-serif,""Apple Color Emoji"",""Segoe UI Emoji"",""Segoe UI Symbol"",""Noto Color Emoji"";font-style:normal;font-weight:400;line-height:1.5;text-align:left;text-align:start;text-decoration:none;text-shadow:none;text-transform:none;letter-spacing:normal;word-break:normal;word-spacing:normal;white-space:normal;line-break:auto;font-size:.875rem;word-wrap:break-word;opacity:0}.tooltip.show{opacity:.9}.tooltip .arrow{position:absolute;display:block;width:.8rem;height:.4rem}.tooltip .arrow::before{position:absolute;content:"""";border-color:transparent;border-style:solid}.bs-tooltip-auto[x-placement^=top],.bs-tooltip-top{padding:.4rem 0}.bs-tooltip-auto[x-placement^=top] .arrow,.bs-tooltip-top .arrow{bottom:0}.bs-tooltip-auto[x-placement^=top] .arrow::before,.bs-tooltip-top .arrow::before{top:0;border-width:.4rem .4rem 0;border-top-color:#000}.bs-tooltip-auto[x-placement^=right],.bs-tooltip-right{padding:0 .4rem}.bs-tooltip-auto[x-placement^=right] .arrow,.bs-tooltip-right .arrow{left:0;width:.4rem;height:.8rem}.bs-tooltip-auto[x-placement^=right] .arrow::before,.bs-tooltip-right .arrow::before{right:0;border-width:.4rem .4rem .4rem 0;border-right-color:#000}.bs-tooltip-auto[x-placement^=bottom],.bs-tooltip-bottom{padding:.4rem 0}.bs-tooltip-auto[x-placement^=bottom] .arrow,.bs-tooltip-bottom .arrow{top:0}.bs-tooltip-auto[x-placement^=bottom] .arrow::before,.bs-tooltip-bottom .arrow::before{bottom:0;border-width:0 .4rem .4rem;border-bottom-color:#000}.bs-tooltip-auto[x-placement^=left],.bs-tooltip-left{padding:0 .4rem}.bs-tooltip-auto[x-placement^=left] .arrow,.bs-tooltip-left .arrow{right:0;width:.4rem;height:.8rem}.bs-tooltip-auto[x-placement^=left] .arrow::before,.bs-tooltip-left .arrow::before{left:0;border-width:.4rem 0 .4rem .4rem;border-left-color:#000}.tooltip-inner{max-width:200px;padding:.25rem .5rem;color:#fff;text-align:center;background-color:#000;border-radius:.25rem}.popover{position:absolute;top:0;left:0;z-index:1060;display:block;max-width:276px;font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,""Helvetica Neue"",Arial,""Noto Sans"",sans-serif,""Apple Color Emoji"",""Segoe UI Emoji"",""Segoe UI Symbol"",""Noto Color Emoji"";font-style:normal;font-weight:400;line-height:1.5;text-align:left;text-align:start;text-decoration:none;text-shadow:none;text-transform:none;letter-spacing:normal;word-break:normal;word-spacing:normal;white-space:normal;line-break:auto;font-size:.875rem;word-wrap:break-word;background-color:#fff;background-clip:padding-box;border:1px solid rgba(0,0,0,.2);border-radius:.3rem}.popover .arrow{position:absolute;display:block;width:1rem;height:.5rem;margin:0 .3rem}.popover .arrow::after,.popover .arrow::before{position:absolute;display:block;content:"""";border-color:transparent;border-style:solid}.bs-popover-auto[x-placement^=top],.bs-popover-top{margin-bottom:.5rem}.bs-popover-auto[x-placement^=top]>.arrow,.bs-popover-top>.arrow{bottom:calc(-.5rem - 1px)}.bs-popover-auto[x-placement^=top]>.arrow::before,.bs-popover-top>.arrow::before{bottom:0;border-width:.5rem .5rem 0;border-top-color:rgba(0,0,0,.25)}.bs-popover-auto[x-placement^=top]>.arrow::after,.bs-popover-top>.arrow::after{bottom:1px;border-width:.5rem .5rem 0;border-top-color:#fff}.bs-popover-auto[x-placement^=right],.bs-popover-right{margin-left:.5rem}.bs-popover-auto[x-placement^=right]>.arrow,.bs-popover-right>.arrow{left:calc(-.5rem - 1px);width:.5rem;height:1rem;margin:.3rem 0}.bs-popover-auto[x-placement^=right]>.arrow::before,.bs-popover-right>.arrow::before{left:0;border-width:.5rem .5rem .5rem 0;border-right-color:rgba(0,0,0,.25)}.bs-popover-auto[x-placement^=right]>.arrow::after,.bs-popover-right>.arrow::after{left:1px;border-width:.5rem .5rem .5rem 0;border-right-color:#fff}.bs-popover-auto[x-placement^=bottom],.bs-popover-bottom{margin-top:.5rem}.bs-popover-auto[x-placement^=bottom]>.arrow,.bs-popover-bottom>.arrow{top:calc(-.5rem - 1px)}.bs-popover-auto[x-placement^=bottom]>.arrow::before,.bs-popover-bottom>.arrow::before{top:0;border-width:0 .5rem .5rem .5rem;border-bottom-color:rgba(0,0,0,.25)}.bs-popover-auto[x-placement^=bottom]>.arrow::after,.bs-popover-bottom>.arrow::after{top:1px;border-width:0 .5rem .5rem .5rem;border-bottom-color:#fff}.bs-popover-auto[x-placement^=bottom] .popover-header::before,.bs-popover-bottom .popover-header::before{position:absolute;top:0;left:50%;display:block;width:1rem;margin-left:-.5rem;content:"""";border-bottom:1px solid #f7f7f7}.bs-popover-auto[x-placement^=left],.bs-popover-left{margin-right:.5rem}.bs-popover-auto[x-placement^=left]>.arrow,.bs-popover-left>.arrow{right:calc(-.5rem - 1px);width:.5rem;height:1rem;margin:.3rem 0}.bs-popover-auto[x-placement^=left]>.arrow::before,.bs-popover-left>.arrow::before{right:0;border-width:.5rem 0 .5rem .5rem;border-left-color:rgba(0,0,0,.25)}.bs-popover-auto[x-placement^=left]>.arrow::after,.bs-popover-left>.arrow::after{right:1px;border-width:.5rem 0 .5rem .5rem;border-left-color:#fff}.popover-header{padding:.5rem .75rem;margin-bottom:0;font-size:1rem;background-color:#f7f7f7;border-bottom:1px solid #ebebeb;border-top-left-radius:calc(.3rem - 1px);border-top-right-radius:calc(.3rem - 1px)}.popover-header:empty{display:none}.popover-body{padding:.5rem .75rem;color:#212529}.carousel{position:relative}.carousel.pointer-event{-ms-touch-action:pan-y;touch-action:pan-y}.carousel-inner{position:relative;width:100%;overflow:hidden}.carousel-inner::after{display:block;clear:both;content:""""}.carousel-item{position:relative;display:none;float:left;width:100%;margin-right:-100%;-webkit-backface-visibility:hidden;backface-visibility:hidden;transition:-webkit-transform .6s ease-in-out;transition:transform .6s ease-in-out;transition:transform .6s ease-in-out,-webkit-transform .6s ease-in-out}@media (prefers-reduced-motion:reduce){.carousel-item{transition:none}}.carousel-item-next,.carousel-item-prev,.carousel-item.active{display:block}.active.carousel-item-right,.carousel-item-next:not(.carousel-item-left){-webkit-transform:translateX(100%);transform:translateX(100%)}.active.carousel-item-left,.carousel-item-prev:not(.carousel-item-right){-webkit-transform:translateX(-100%);transform:translateX(-100%)}.carousel-fade .carousel-item{opacity:0;transition-property:opacity;-webkit-transform:none;transform:none}.carousel-fade .carousel-item-next.carousel-item-left,.carousel-fade .carousel-item-prev.carousel-item-right,.carousel-fade .carousel-item.active{z-index:1;opacity:1}.carousel-fade .active.carousel-item-left,.carousel-fade .active.carousel-item-right{z-index:0;opacity:0;transition:opacity 0s .6s}@media (prefers-reduced-motion:reduce){.carousel-fade .active.carousel-item-left,.carousel-fade .active.carousel-item-right{transition:none}}.carousel-control-next,.carousel-control-prev{position:absolute;top:0;bottom:0;z-index:1;display:-ms-flexbox;display:flex;-ms-flex-align:center;align-items:center;-ms-flex-pack:center;justify-content:center;width:15%;color:#fff;text-align:center;opacity:.5;transition:opacity .15s ease}@media (prefers-reduced-motion:reduce){.carousel-control-next,.carousel-control-prev{transition:none}}.carousel-control-next:focus,.carousel-control-next:hover,.carousel-control-prev:focus,.carousel-control-prev:hover{color:#fff;text-decoration:none;outline:0;opacity:.9}.carousel-control-prev{left:0}.carousel-control-next{right:0}.carousel-control-next-icon,.carousel-control-prev-icon{display:inline-block;width:20px;height:20px;background:no-repeat 50%/100% 100%}.carousel-control-prev-icon{background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' fill='%23fff' width='8' height='8' viewBox='0 0 8 8'%3e%3cpath d='M5.25 0l-4 4 4 4 1.5-1.5L4.25 4l2.5-2.5L5.25 0z'/%3e%3c/svg%3e"")}.carousel-control-next-icon{background-image:url(""data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' fill='%23fff' width='8' height='8' viewBox='0 0 8 8'%3e%3cpath d='M2.75 0l-1.5 1.5L3.75 4l-2.5 2.5L2.75 8l4-4-4-4z'/%3e%3c/svg%3e"")}.carousel-indicators{position:absolute;right:0;bottom:0;left:0;z-index:15;display:-ms-flexbox;display:flex;-ms-flex-pack:center;justify-content:center;padding-left:0;margin-right:15%;margin-left:15%;list-style:none}.carousel-indicators li{box-sizing:content-box;-ms-flex:0 1 auto;flex:0 1 auto;width:30px;height:3px;margin-right:3px;margin-left:3px;text-indent:-999px;cursor:pointer;background-color:#fff;background-clip:padding-box;border-top:10px solid transparent;border-bottom:10px solid transparent;opacity:.5;transition:opacity .6s ease}@media (prefers-reduced-motion:reduce){.carousel-indicators li{transition:none}}.carousel-indicators .active{opacity:1}.carousel-caption{position:absolute;right:15%;bottom:20px;left:15%;z-index:10;padding-top:20px;padding-bottom:20px;color:#fff;text-align:center}@-webkit-keyframes spinner-border{to{-webkit-transform:rotate(360deg);transform:rotate(360deg)}}@keyframes spinner-border{to{-webkit-transform:rotate(360deg);transform:rotate(360deg)}}.spinner-border{display:inline-block;width:2rem;height:2rem;vertical-align:text-bottom;border:.25em solid currentColor;border-right-color:transparent;border-radius:50%;-webkit-animation:spinner-border .75s linear infinite;animation:spinner-border .75s linear infinite}.spinner-border-sm{width:1rem;height:1rem;border-width:.2em}@-webkit-keyframes spinner-grow{0%{-webkit-transform:scale(0);transform:scale(0)}50%{opacity:1}}@keyframes spinner-grow{0%{-webkit-transform:scale(0);transform:scale(0)}50%{opacity:1}}.spinner-grow{display:inline-block;width:2rem;height:2rem;vertical-align:text-bottom;background-color:currentColor;border-radius:50%;opacity:0;-webkit-animation:spinner-grow .75s linear infinite;animation:spinner-grow .75s linear infinite}.spinner-grow-sm{width:1rem;height:1rem}.align-baseline{vertical-align:baseline!important}.align-top{vertical-align:top!important}.align-middle{vertical-align:middle!important}.align-bottom{vertical-align:bottom!important}.align-text-bottom{vertical-align:text-bottom!important}.align-text-top{vertical-align:text-top!important}.bg-primary{background-color:#007bff!important}a.bg-primary:focus,a.bg-primary:hover,button.bg-primary:focus,button.bg-primary:hover{background-color:#0062cc!important}.bg-secondary{background-color:#6c757d!important}a.bg-secondary:focus,a.bg-secondary:hover,button.bg-secondary:focus,button.bg-secondary:hover{background-color:#545b62!important}.bg-success{background-color:#28a745!important}a.bg-success:focus,a.bg-success:hover,button.bg-success:focus,button.bg-success:hover{background-color:#1e7e34!important}.bg-info{background-color:#17a2b8!important}a.bg-info:focus,a.bg-info:hover,button.bg-info:focus,button.bg-info:hover{background-color:#117a8b!important}.bg-warning{background-color:#ffc107!important}a.bg-warning:focus,a.bg-warning:hover,button.bg-warning:focus,button.bg-warning:hover{background-color:#d39e00!important}.bg-danger{background-color:#dc3545!important}a.bg-danger:focus,a.bg-danger:hover,button.bg-danger:focus,button.bg-danger:hover{background-color:#bd2130!important}.bg-light{background-color:#f8f9fa!important}a.bg-light:focus,a.bg-light:hover,button.bg-light:focus,button.bg-light:hover{background-color:#dae0e5!important}.bg-dark{background-color:#343a40!important}a.bg-dark:focus,a.bg-dark:hover,button.bg-dark:focus,button.bg-dark:hover{background-color:#1d2124!important}.bg-white{background-color:#fff!important}.bg-transparent{background-color:transparent!important}.border{border:1px solid #dee2e6!important}.border-top{border-top:1px solid #dee2e6!important}.border-right{border-right:1px solid #dee2e6!important}.border-bottom{border-bottom:1px solid #dee2e6!important}.border-left{border-left:1px solid #dee2e6!important}.border-0{border:0!important}.border-top-0{border-top:0!important}.border-right-0{border-right:0!important}.border-bottom-0{border-bottom:0!important}.border-left-0{border-left:0!important}.border-primary{border-color:#007bff!important}.border-secondary{border-color:#6c757d!important}.border-success{border-color:#28a745!important}.border-info{border-color:#17a2b8!important}.border-warning{border-color:#ffc107!important}.border-danger{border-color:#dc3545!important}.border-light{border-color:#f8f9fa!important}.border-dark{border-color:#343a40!important}.border-white{border-color:#fff!important}.rounded-sm{border-radius:.2rem!important}.rounded{border-radius:.25rem!important}.rounded-top{border-top-left-radius:.25rem!important;border-top-right-radius:.25rem!important}.rounded-right{border-top-right-radius:.25rem!important;border-bottom-right-radius:.25rem!important}.rounded-bottom{border-bottom-right-radius:.25rem!important;border-bottom-left-radius:.25rem!important}.rounded-left{border-top-left-radius:.25rem!important;border-bottom-left-radius:.25rem!important}.rounded-lg{border-radius:.3rem!important}.rounded-circle{border-radius:50%!important}.rounded-pill{border-radius:50rem!important}.rounded-0{border-radius:0!important}.clearfix::after{display:block;clear:both;content:""""}.d-none{display:none!important}.d-inline{display:inline!important}.d-inline-block{display:inline-block!important}.d-block{display:block!important}.d-table{display:table!important}.d-table-row{display:table-row!important}.d-table-cell{display:table-cell!important}.d-flex{display:-ms-flexbox!important;display:flex!important}.d-inline-flex{display:-ms-inline-flexbox!important;display:inline-flex!important}@media (min-width:576px){.d-sm-none{display:none!important}.d-sm-inline{display:inline!important}.d-sm-inline-block{display:inline-block!important}.d-sm-block{display:block!important}.d-sm-table{display:table!important}.d-sm-table-row{display:table-row!important}.d-sm-table-cell{display:table-cell!important}.d-sm-flex{display:-ms-flexbox!important;display:flex!important}.d-sm-inline-flex{display:-ms-inline-flexbox!important;display:inline-flex!important}}@media (min-width:768px){.d-md-none{display:none!important}.d-md-inline{display:inline!important}.d-md-inline-block{display:inline-block!important}.d-md-block{display:block!important}.d-md-table{display:table!important}.d-md-table-row{display:table-row!important}.d-md-table-cell{display:table-cell!important}.d-md-flex{display:-ms-flexbox!important;display:flex!important}.d-md-inline-flex{display:-ms-inline-flexbox!important;display:inline-flex!important}}@media (min-width:992px){.d-lg-none{display:none!important}.d-lg-inline{display:inline!important}.d-lg-inline-block{display:inline-block!important}.d-lg-block{display:block!important}.d-lg-table{display:table!important}.d-lg-table-row{display:table-row!important}.d-lg-table-cell{display:table-cell!important}.d-lg-flex{display:-ms-flexbox!important;display:flex!important}.d-lg-inline-flex{display:-ms-inline-flexbox!important;display:inline-flex!important}}@media (min-width:1200px){.d-xl-none{display:none!important}.d-xl-inline{display:inline!important}.d-xl-inline-block{display:inline-block!important}.d-xl-block{display:block!important}.d-xl-table{display:table!important}.d-xl-table-row{display:table-row!important}.d-xl-table-cell{display:table-cell!important}.d-xl-flex{display:-ms-flexbox!important;display:flex!important}.d-xl-inline-flex{display:-ms-inline-flexbox!important;display:inline-flex!important}}@media print{.d-print-none{display:none!important}.d-print-inline{display:inline!important}.d-print-inline-block{display:inline-block!important}.d-print-block{display:block!important}.d-print-table{display:table!important}.d-print-table-row{display:table-row!important}.d-print-table-cell{display:table-cell!important}.d-print-flex{display:-ms-flexbox!important;display:flex!important}.d-print-inline-flex{display:-ms-inline-flexbox!important;display:inline-flex!important}}.embed-responsive{position:relative;display:block;width:100%;padding:0;overflow:hidden}.embed-responsive::before{display:block;content:""""}.embed-responsive .embed-responsive-item,.embed-responsive embed,.embed-responsive iframe,.embed-responsive object,.embed-responsive video{position:absolute;top:0;bottom:0;left:0;width:100%;height:100%;border:0}.embed-responsive-21by9::before{padding-top:42.857143%}.embed-responsive-16by9::before{padding-top:56.25%}.embed-responsive-4by3::before{padding-top:75%}.embed-responsive-1by1::before{padding-top:100%}.flex-row{-ms-flex-direction:row!important;flex-direction:row!important}.flex-column{-ms-flex-direction:column!important;flex-direction:column!important}.flex-row-reverse{-ms-flex-direction:row-reverse!important;flex-direction:row-reverse!important}.flex-column-reverse{-ms-flex-direction:column-reverse!important;flex-direction:column-reverse!important}.flex-wrap{-ms-flex-wrap:wrap!important;flex-wrap:wrap!important}.flex-nowrap{-ms-flex-wrap:nowrap!important;flex-wrap:nowrap!important}.flex-wrap-reverse{-ms-flex-wrap:wrap-reverse!important;flex-wrap:wrap-reverse!important}.flex-fill{-ms-flex:1 1 auto!important;flex:1 1 auto!important}.flex-grow-0{-ms-flex-positive:0!important;flex-grow:0!important}.flex-grow-1{-ms-flex-positive:1!important;flex-grow:1!important}.flex-shrink-0{-ms-flex-negative:0!important;flex-shrink:0!important}.flex-shrink-1{-ms-flex-negative:1!important;flex-shrink:1!important}.justify-content-start{-ms-flex-pack:start!important;justify-content:flex-start!important}.justify-content-end{-ms-flex-pack:end!important;justify-content:flex-end!important}.justify-content-center{-ms-flex-pack:center!important;justify-content:center!important}.justify-content-between{-ms-flex-pack:justify!important;justify-content:space-between!important}.justify-content-around{-ms-flex-pack:distribute!important;justify-content:space-around!important}.align-items-start{-ms-flex-align:start!important;align-items:flex-start!important}.align-items-end{-ms-flex-align:end!important;align-items:flex-end!important}.align-items-center{-ms-flex-align:center!important;align-items:center!important}.align-items-baseline{-ms-flex-align:baseline!important;align-items:baseline!important}.align-items-stretch{-ms-flex-align:stretch!important;align-items:stretch!important}.align-content-start{-ms-flex-line-pack:start!important;align-content:flex-start!important}.align-content-end{-ms-flex-line-pack:end!important;align-content:flex-end!important}.align-content-center{-ms-flex-line-pack:center!important;align-content:center!important}.align-content-between{-ms-flex-line-pack:justify!important;align-content:space-between!important}.align-content-around{-ms-flex-line-pack:distribute!important;align-content:space-around!important}.align-content-stretch{-ms-flex-line-pack:stretch!important;align-content:stretch!important}.align-self-auto{-ms-flex-item-align:auto!important;align-self:auto!important}.align-self-start{-ms-flex-item-align:start!important;align-self:flex-start!important}.align-self-end{-ms-flex-item-align:end!important;align-self:flex-end!important}.align-self-center{-ms-flex-item-align:center!important;align-self:center!important}.align-self-baseline{-ms-flex-item-align:baseline!important;align-self:baseline!important}.align-self-stretch{-ms-flex-item-align:stretch!important;align-self:stretch!important}@media (min-width:576px){.flex-sm-row{-ms-flex-direction:row!important;flex-direction:row!important}.flex-sm-column{-ms-flex-direction:column!important;flex-direction:column!important}.flex-sm-row-reverse{-ms-flex-direction:row-reverse!important;flex-direction:row-reverse!important}.flex-sm-column-reverse{-ms-flex-direction:column-reverse!important;flex-direction:column-reverse!important}.flex-sm-wrap{-ms-flex-wrap:wrap!important;flex-wrap:wrap!important}.flex-sm-nowrap{-ms-flex-wrap:nowrap!important;flex-wrap:nowrap!important}.flex-sm-wrap-reverse{-ms-flex-wrap:wrap-reverse!important;flex-wrap:wrap-reverse!important}.flex-sm-fill{-ms-flex:1 1 auto!important;flex:1 1 auto!important}.flex-sm-grow-0{-ms-flex-positive:0!important;flex-grow:0!important}.flex-sm-grow-1{-ms-flex-positive:1!important;flex-grow:1!important}.flex-sm-shrink-0{-ms-flex-negative:0!important;flex-shrink:0!important}.flex-sm-shrink-1{-ms-flex-negative:1!important;flex-shrink:1!important}.justify-content-sm-start{-ms-flex-pack:start!important;justify-content:flex-start!important}.justify-content-sm-end{-ms-flex-pack:end!important;justify-content:flex-end!important}.justify-content-sm-center{-ms-flex-pack:center!important;justify-content:center!important}.justify-content-sm-between{-ms-flex-pack:justify!important;justify-content:space-between!important}.justify-content-sm-around{-ms-flex-pack:distribute!important;justify-content:space-around!important}.align-items-sm-start{-ms-flex-align:start!important;align-items:flex-start!important}.align-items-sm-end{-ms-flex-align:end!important;align-items:flex-end!important}.align-items-sm-center{-ms-flex-align:center!important;align-items:center!important}.align-items-sm-baseline{-ms-flex-align:baseline!important;align-items:baseline!important}.align-items-sm-stretch{-ms-flex-align:stretch!important;align-items:stretch!important}.align-content-sm-start{-ms-flex-line-pack:start!important;align-content:flex-start!important}.align-content-sm-end{-ms-flex-line-pack:end!important;align-content:flex-end!important}.align-content-sm-center{-ms-flex-line-pack:center!important;align-content:center!important}.align-content-sm-between{-ms-flex-line-pack:justify!important;align-content:space-between!important}.align-content-sm-around{-ms-flex-line-pack:distribute!important;align-content:space-around!important}.align-content-sm-stretch{-ms-flex-line-pack:stretch!important;align-content:stretch!important}.align-self-sm-auto{-ms-flex-item-align:auto!important;align-self:auto!important}.align-self-sm-start{-ms-flex-item-align:start!important;align-self:flex-start!important}.align-self-sm-end{-ms-flex-item-align:end!important;align-self:flex-end!important}.align-self-sm-center{-ms-flex-item-align:center!important;align-self:center!important}.align-self-sm-baseline{-ms-flex-item-align:baseline!important;align-self:baseline!important}.align-self-sm-stretch{-ms-flex-item-align:stretch!important;align-self:stretch!important}}@media (min-width:768px){.flex-md-row{-ms-flex-direction:row!important;flex-direction:row!important}.flex-md-column{-ms-flex-direction:column!important;flex-direction:column!important}.flex-md-row-reverse{-ms-flex-direction:row-reverse!important;flex-direction:row-reverse!important}.flex-md-column-reverse{-ms-flex-direction:column-reverse!important;flex-direction:column-reverse!important}.flex-md-wrap{-ms-flex-wrap:wrap!important;flex-wrap:wrap!important}.flex-md-nowrap{-ms-flex-wrap:nowrap!important;flex-wrap:nowrap!important}.flex-md-wrap-reverse{-ms-flex-wrap:wrap-reverse!important;flex-wrap:wrap-reverse!important}.flex-md-fill{-ms-flex:1 1 auto!important;flex:1 1 auto!important}.flex-md-grow-0{-ms-flex-positive:0!important;flex-grow:0!important}.flex-md-grow-1{-ms-flex-positive:1!important;flex-grow:1!important}.flex-md-shrink-0{-ms-flex-negative:0!important;flex-shrink:0!important}.flex-md-shrink-1{-ms-flex-negative:1!important;flex-shrink:1!important}.justify-content-md-start{-ms-flex-pack:start!important;justify-content:flex-start!important}.justify-content-md-end{-ms-flex-pack:end!important;justify-content:flex-end!important}.justify-content-md-center{-ms-flex-pack:center!important;justify-content:center!important}.justify-content-md-between{-ms-flex-pack:justify!important;justify-content:space-between!important}.justify-content-md-around{-ms-flex-pack:distribute!important;justify-content:space-around!important}.align-items-md-start{-ms-flex-align:start!important;align-items:flex-start!important}.align-items-md-end{-ms-flex-align:end!important;align-items:flex-end!important}.align-items-md-center{-ms-flex-align:center!important;align-items:center!important}.align-items-md-baseline{-ms-flex-align:baseline!important;align-items:baseline!important}.align-items-md-stretch{-ms-flex-align:stretch!important;align-items:stretch!important}.align-content-md-start{-ms-flex-line-pack:start!important;align-content:flex-start!important}.align-content-md-end{-ms-flex-line-pack:end!important;align-content:flex-end!important}.align-content-md-center{-ms-flex-line-pack:center!important;align-content:center!important}.align-content-md-between{-ms-flex-line-pack:justify!important;align-content:space-between!important}.align-content-md-around{-ms-flex-line-pack:distribute!important;align-content:space-around!important}.align-content-md-stretch{-ms-flex-line-pack:stretch!important;align-content:stretch!important}.align-self-md-auto{-ms-flex-item-align:auto!important;align-self:auto!important}.align-self-md-start{-ms-flex-item-align:start!important;align-self:flex-start!important}.align-self-md-end{-ms-flex-item-align:end!important;align-self:flex-end!important}.align-self-md-center{-ms-flex-item-align:center!important;align-self:center!important}.align-self-md-baseline{-ms-flex-item-align:baseline!important;align-self:baseline!important}.align-self-md-stretch{-ms-flex-item-align:stretch!important;align-self:stretch!important}}@media (min-width:992px){.flex-lg-row{-ms-flex-direction:row!important;flex-direction:row!important}.flex-lg-column{-ms-flex-direction:column!important;flex-direction:column!important}.flex-lg-row-reverse{-ms-flex-direction:row-reverse!important;flex-direction:row-reverse!important}.flex-lg-column-reverse{-ms-flex-direction:column-reverse!important;flex-direction:column-reverse!important}.flex-lg-wrap{-ms-flex-wrap:wrap!important;flex-wrap:wrap!important}.flex-lg-nowrap{-ms-flex-wrap:nowrap!important;flex-wrap:nowrap!important}.flex-lg-wrap-reverse{-ms-flex-wrap:wrap-reverse!important;flex-wrap:wrap-reverse!important}.flex-lg-fill{-ms-flex:1 1 auto!important;flex:1 1 auto!important}.flex-lg-grow-0{-ms-flex-positive:0!important;flex-grow:0!important}.flex-lg-grow-1{-ms-flex-positive:1!important;flex-grow:1!important}.flex-lg-shrink-0{-ms-flex-negative:0!important;flex-shrink:0!important}.flex-lg-shrink-1{-ms-flex-negative:1!important;flex-shrink:1!important}.justify-content-lg-start{-ms-flex-pack:start!important;justify-content:flex-start!important}.justify-content-lg-end{-ms-flex-pack:end!important;justify-content:flex-end!important}.justify-content-lg-center{-ms-flex-pack:center!important;justify-content:center!important}.justify-content-lg-between{-ms-flex-pack:justify!important;justify-content:space-between!important}.justify-content-lg-around{-ms-flex-pack:distribute!important;justify-content:space-around!important}.align-items-lg-start{-ms-flex-align:start!important;align-items:flex-start!important}.align-items-lg-end{-ms-flex-align:end!important;align-items:flex-end!important}.align-items-lg-center{-ms-flex-align:center!important;align-items:center!important}.align-items-lg-baseline{-ms-flex-align:baseline!important;align-items:baseline!important}.align-items-lg-stretch{-ms-flex-align:stretch!important;align-items:stretch!important}.align-content-lg-start{-ms-flex-line-pack:start!important;align-content:flex-start!important}.align-content-lg-end{-ms-flex-line-pack:end!important;align-content:flex-end!important}.align-content-lg-center{-ms-flex-line-pack:center!important;align-content:center!important}.align-content-lg-between{-ms-flex-line-pack:justify!important;align-content:space-between!important}.align-content-lg-around{-ms-flex-line-pack:distribute!important;align-content:space-around!important}.align-content-lg-stretch{-ms-flex-line-pack:stretch!important;align-content:stretch!important}.align-self-lg-auto{-ms-flex-item-align:auto!important;align-self:auto!important}.align-self-lg-start{-ms-flex-item-align:start!important;align-self:flex-start!important}.align-self-lg-end{-ms-flex-item-align:end!important;align-self:flex-end!important}.align-self-lg-center{-ms-flex-item-align:center!important;align-self:center!important}.align-self-lg-baseline{-ms-flex-item-align:baseline!important;align-self:baseline!important}.align-self-lg-stretch{-ms-flex-item-align:stretch!important;align-self:stretch!important}}@media (min-width:1200px){.flex-xl-row{-ms-flex-direction:row!important;flex-direction:row!important}.flex-xl-column{-ms-flex-direction:column!important;flex-direction:column!important}.flex-xl-row-reverse{-ms-flex-direction:row-reverse!important;flex-direction:row-reverse!important}.flex-xl-column-reverse{-ms-flex-direction:column-reverse!important;flex-direction:column-reverse!important}.flex-xl-wrap{-ms-flex-wrap:wrap!important;flex-wrap:wrap!important}.flex-xl-nowrap{-ms-flex-wrap:nowrap!important;flex-wrap:nowrap!important}.flex-xl-wrap-reverse{-ms-flex-wrap:wrap-reverse!important;flex-wrap:wrap-reverse!important}.flex-xl-fill{-ms-flex:1 1 auto!important;flex:1 1 auto!important}.flex-xl-grow-0{-ms-flex-positive:0!important;flex-grow:0!important}.flex-xl-grow-1{-ms-flex-positive:1!important;flex-grow:1!important}.flex-xl-shrink-0{-ms-flex-negative:0!important;flex-shrink:0!important}.flex-xl-shrink-1{-ms-flex-negative:1!important;flex-shrink:1!important}.justify-content-xl-start{-ms-flex-pack:start!important;justify-content:flex-start!important}.justify-content-xl-end{-ms-flex-pack:end!important;justify-content:flex-end!important}.justify-content-xl-center{-ms-flex-pack:center!important;justify-content:center!important}.justify-content-xl-between{-ms-flex-pack:justify!important;justify-content:space-between!important}.justify-content-xl-around{-ms-flex-pack:distribute!important;justify-content:space-around!important}.align-items-xl-start{-ms-flex-align:start!important;align-items:flex-start!important}.align-items-xl-end{-ms-flex-align:end!important;align-items:flex-end!important}.align-items-xl-center{-ms-flex-align:center!important;align-items:center!important}.align-items-xl-baseline{-ms-flex-align:baseline!important;align-items:baseline!important}.align-items-xl-stretch{-ms-flex-align:stretch!important;align-items:stretch!important}.align-content-xl-start{-ms-flex-line-pack:start!important;align-content:flex-start!important}.align-content-xl-end{-ms-flex-line-pack:end!important;align-content:flex-end!important}.align-content-xl-center{-ms-flex-line-pack:center!important;align-content:center!important}.align-content-xl-between{-ms-flex-line-pack:justify!important;align-content:space-between!important}.align-content-xl-around{-ms-flex-line-pack:distribute!important;align-content:space-around!important}.align-content-xl-stretch{-ms-flex-line-pack:stretch!important;align-content:stretch!important}.align-self-xl-auto{-ms-flex-item-align:auto!important;align-self:auto!important}.align-self-xl-start{-ms-flex-item-align:start!important;align-self:flex-start!important}.align-self-xl-end{-ms-flex-item-align:end!important;align-self:flex-end!important}.align-self-xl-center{-ms-flex-item-align:center!important;align-self:center!important}.align-self-xl-baseline{-ms-flex-item-align:baseline!important;align-self:baseline!important}.align-self-xl-stretch{-ms-flex-item-align:stretch!important;align-self:stretch!important}}.float-left{float:left!important}.float-right{float:right!important}.float-none{float:none!important}@media (min-width:576px){.float-sm-left{float:left!important}.float-sm-right{float:right!important}.float-sm-none{float:none!important}}@media (min-width:768px){.float-md-left{float:left!important}.float-md-right{float:right!important}.float-md-none{float:none!important}}@media (min-width:992px){.float-lg-left{float:left!important}.float-lg-right{float:right!important}.float-lg-none{float:none!important}}@media (min-width:1200px){.float-xl-left{float:left!important}.float-xl-right{float:right!important}.float-xl-none{float:none!important}}.overflow-auto{overflow:auto!important}.overflow-hidden{overflow:hidden!important}.position-static{position:static!important}.position-relative{position:relative!important}.position-absolute{position:absolute!important}.position-fixed{position:fixed!important}.position-sticky{position:-webkit-sticky!important;position:sticky!important}.fixed-top{position:fixed;top:0;right:0;left:0;z-index:1030}.fixed-bottom{position:fixed;right:0;bottom:0;left:0;z-index:1030}@supports ((position:-webkit-sticky) or (position:sticky)){.sticky-top{position:-webkit-sticky;position:sticky;top:0;z-index:1020}}.sr-only{position:absolute;width:1px;height:1px;padding:0;margin:-1px;overflow:hidden;clip:rect(0,0,0,0);white-space:nowrap;border:0}.sr-only-focusable:active,.sr-only-focusable:focus{position:static;width:auto;height:auto;overflow:visible;clip:auto;white-space:normal}.shadow-sm{box-shadow:0 .125rem .25rem rgba(0,0,0,.075)!important}.shadow{box-shadow:0 .5rem 1rem rgba(0,0,0,.15)!important}.shadow-lg{box-shadow:0 1rem 3rem rgba(0,0,0,.175)!important}.shadow-none{box-shadow:none!important}.w-25{width:25%!important}.w-50{width:50%!important}.w-75{width:75%!important}.w-100{width:100%!important}.w-auto{width:auto!important}.h-25{height:25%!important}.h-50{height:50%!important}.h-75{height:75%!important}.h-100{height:100%!important}.h-auto{height:auto!important}.mw-100{max-width:100%!important}.mh-100{max-height:100%!important}.min-vw-100{min-width:100vw!important}.min-vh-100{min-height:100vh!important}.vw-100{width:100vw!important}.vh-100{height:100vh!important}.stretched-link::after{position:absolute;top:0;right:0;bottom:0;left:0;z-index:1;pointer-events:auto;content:"""";background-color:rgba(0,0,0,0)}.m-0{margin:0!important}.mt-0,.my-0{margin-top:0!important}.mr-0,.mx-0{margin-right:0!important}.mb-0,.my-0{margin-bottom:0!important}.ml-0,.mx-0{margin-left:0!important}.m-1{margin:.25rem!important}.mt-1,.my-1{margin-top:.25rem!important}.mr-1,.mx-1{margin-right:.25rem!important}.mb-1,.my-1{margin-bottom:.25rem!important}.ml-1,.mx-1{margin-left:.25rem!important}.m-2{margin:.5rem!important}.mt-2,.my-2{margin-top:.5rem!important}.mr-2,.mx-2{margin-right:.5rem!important}.mb-2,.my-2{margin-bottom:.5rem!important}.ml-2,.mx-2{margin-left:.5rem!important}.m-3{margin:1rem!important}.mt-3,.my-3{margin-top:1rem!important}.mr-3,.mx-3{margin-right:1rem!important}.mb-3,.my-3{margin-bottom:1rem!important}.ml-3,.mx-3{margin-left:1rem!important}.m-4{margin:1.5rem!important}.mt-4,.my-4{margin-top:1.5rem!important}.mr-4,.mx-4{margin-right:1.5rem!important}.mb-4,.my-4{margin-bottom:1.5rem!important}.ml-4,.mx-4{margin-left:1.5rem!important}.m-5{margin:3rem!important}.mt-5,.my-5{margin-top:3rem!important}.mr-5,.mx-5{margin-right:3rem!important}.mb-5,.my-5{margin-bottom:3rem!important}.ml-5,.mx-5{margin-left:3rem!important}.p-0{padding:0!important}.pt-0,.py-0{padding-top:0!important}.pr-0,.px-0{padding-right:0!important}.pb-0,.py-0{padding-bottom:0!important}.pl-0,.px-0{padding-left:0!important}.p-1{padding:.25rem!important}.pt-1,.py-1{padding-top:.25rem!important}.pr-1,.px-1{padding-right:.25rem!important}.pb-1,.py-1{padding-bottom:.25rem!important}.pl-1,.px-1{padding-left:.25rem!important}.p-2{padding:.5rem!important}.pt-2,.py-2{padding-top:.5rem!important}.pr-2,.px-2{padding-right:.5rem!important}.pb-2,.py-2{padding-bottom:.5rem!important}.pl-2,.px-2{padding-left:.5rem!important}.p-3{padding:1rem!important}.pt-3,.py-3{padding-top:1rem!important}.pr-3,.px-3{padding-right:1rem!important}.pb-3,.py-3{padding-bottom:1rem!important}.pl-3,.px-3{padding-left:1rem!important}.p-4{padding:1.5rem!important}.pt-4,.py-4{padding-top:1.5rem!important}.pr-4,.px-4{padding-right:1.5rem!important}.pb-4,.py-4{padding-bottom:1.5rem!important}.pl-4,.px-4{padding-left:1.5rem!important}.p-5{padding:3rem!important}.pt-5,.py-5{padding-top:3rem!important}.pr-5,.px-5{padding-right:3rem!important}.pb-5,.py-5{padding-bottom:3rem!important}.pl-5,.px-5{padding-left:3rem!important}.m-n1{margin:-.25rem!important}.mt-n1,.my-n1{margin-top:-.25rem!important}.mr-n1,.mx-n1{margin-right:-.25rem!important}.mb-n1,.my-n1{margin-bottom:-.25rem!important}.ml-n1,.mx-n1{margin-left:-.25rem!important}.m-n2{margin:-.5rem!important}.mt-n2,.my-n2{margin-top:-.5rem!important}.mr-n2,.mx-n2{margin-right:-.5rem!important}.mb-n2,.my-n2{margin-bottom:-.5rem!important}.ml-n2,.mx-n2{margin-left:-.5rem!important}.m-n3{margin:-1rem!important}.mt-n3,.my-n3{margin-top:-1rem!important}.mr-n3,.mx-n3{margin-right:-1rem!important}.mb-n3,.my-n3{margin-bottom:-1rem!important}.ml-n3,.mx-n3{margin-left:-1rem!important}.m-n4{margin:-1.5rem!important}.mt-n4,.my-n4{margin-top:-1.5rem!important}.mr-n4,.mx-n4{margin-right:-1.5rem!important}.mb-n4,.my-n4{margin-bottom:-1.5rem!important}.ml-n4,.mx-n4{margin-left:-1.5rem!important}.m-n5{margin:-3rem!important}.mt-n5,.my-n5{margin-top:-3rem!important}.mr-n5,.mx-n5{margin-right:-3rem!important}.mb-n5,.my-n5{margin-bottom:-3rem!important}.ml-n5,.mx-n5{margin-left:-3rem!important}.m-auto{margin:auto!important}.mt-auto,.my-auto{margin-top:auto!important}.mr-auto,.mx-auto{margin-right:auto!important}.mb-auto,.my-auto{margin-bottom:auto!important}.ml-auto,.mx-auto{margin-left:auto!important}@media (min-width:576px){.m-sm-0{margin:0!important}.mt-sm-0,.my-sm-0{margin-top:0!important}.mr-sm-0,.mx-sm-0{margin-right:0!important}.mb-sm-0,.my-sm-0{margin-bottom:0!important}.ml-sm-0,.mx-sm-0{margin-left:0!important}.m-sm-1{margin:.25rem!important}.mt-sm-1,.my-sm-1{margin-top:.25rem!important}.mr-sm-1,.mx-sm-1{margin-right:.25rem!important}.mb-sm-1,.my-sm-1{margin-bottom:.25rem!important}.ml-sm-1,.mx-sm-1{margin-left:.25rem!important}.m-sm-2{margin:.5rem!important}.mt-sm-2,.my-sm-2{margin-top:.5rem!important}.mr-sm-2,.mx-sm-2{margin-right:.5rem!important}.mb-sm-2,.my-sm-2{margin-bottom:.5rem!important}.ml-sm-2,.mx-sm-2{margin-left:.5rem!important}.m-sm-3{margin:1rem!important}.mt-sm-3,.my-sm-3{margin-top:1rem!important}.mr-sm-3,.mx-sm-3{margin-right:1rem!important}.mb-sm-3,.my-sm-3{margin-bottom:1rem!important}.ml-sm-3,.mx-sm-3{margin-left:1rem!important}.m-sm-4{margin:1.5rem!important}.mt-sm-4,.my-sm-4{margin-top:1.5rem!important}.mr-sm-4,.mx-sm-4{margin-right:1.5rem!important}.mb-sm-4,.my-sm-4{margin-bottom:1.5rem!important}.ml-sm-4,.mx-sm-4{margin-left:1.5rem!important}.m-sm-5{margin:3rem!important}.mt-sm-5,.my-sm-5{margin-top:3rem!important}.mr-sm-5,.mx-sm-5{margin-right:3rem!important}.mb-sm-5,.my-sm-5{margin-bottom:3rem!important}.ml-sm-5,.mx-sm-5{margin-left:3rem!important}.p-sm-0{padding:0!important}.pt-sm-0,.py-sm-0{padding-top:0!important}.pr-sm-0,.px-sm-0{padding-right:0!important}.pb-sm-0,.py-sm-0{padding-bottom:0!important}.pl-sm-0,.px-sm-0{padding-left:0!important}.p-sm-1{padding:.25rem!important}.pt-sm-1,.py-sm-1{padding-top:.25rem!important}.pr-sm-1,.px-sm-1{padding-right:.25rem!important}.pb-sm-1,.py-sm-1{padding-bottom:.25rem!important}.pl-sm-1,.px-sm-1{padding-left:.25rem!important}.p-sm-2{padding:.5rem!important}.pt-sm-2,.py-sm-2{padding-top:.5rem!important}.pr-sm-2,.px-sm-2{padding-right:.5rem!important}.pb-sm-2,.py-sm-2{padding-bottom:.5rem!important}.pl-sm-2,.px-sm-2{padding-left:.5rem!important}.p-sm-3{padding:1rem!important}.pt-sm-3,.py-sm-3{padding-top:1rem!important}.pr-sm-3,.px-sm-3{padding-right:1rem!important}.pb-sm-3,.py-sm-3{padding-bottom:1rem!important}.pl-sm-3,.px-sm-3{padding-left:1rem!important}.p-sm-4{padding:1.5rem!important}.pt-sm-4,.py-sm-4{padding-top:1.5rem!important}.pr-sm-4,.px-sm-4{padding-right:1.5rem!important}.pb-sm-4,.py-sm-4{padding-bottom:1.5rem!important}.pl-sm-4,.px-sm-4{padding-left:1.5rem!important}.p-sm-5{padding:3rem!important}.pt-sm-5,.py-sm-5{padding-top:3rem!important}.pr-sm-5,.px-sm-5{padding-right:3rem!important}.pb-sm-5,.py-sm-5{padding-bottom:3rem!important}.pl-sm-5,.px-sm-5{padding-left:3rem!important}.m-sm-n1{margin:-.25rem!important}.mt-sm-n1,.my-sm-n1{margin-top:-.25rem!important}.mr-sm-n1,.mx-sm-n1{margin-right:-.25rem!important}.mb-sm-n1,.my-sm-n1{margin-bottom:-.25rem!important}.ml-sm-n1,.mx-sm-n1{margin-left:-.25rem!important}.m-sm-n2{margin:-.5rem!important}.mt-sm-n2,.my-sm-n2{margin-top:-.5rem!important}.mr-sm-n2,.mx-sm-n2{margin-right:-.5rem!important}.mb-sm-n2,.my-sm-n2{margin-bottom:-.5rem!important}.ml-sm-n2,.mx-sm-n2{margin-left:-.5rem!important}.m-sm-n3{margin:-1rem!important}.mt-sm-n3,.my-sm-n3{margin-top:-1rem!important}.mr-sm-n3,.mx-sm-n3{margin-right:-1rem!important}.mb-sm-n3,.my-sm-n3{margin-bottom:-1rem!important}.ml-sm-n3,.mx-sm-n3{margin-left:-1rem!important}.m-sm-n4{margin:-1.5rem!important}.mt-sm-n4,.my-sm-n4{margin-top:-1.5rem!important}.mr-sm-n4,.mx-sm-n4{margin-right:-1.5rem!important}.mb-sm-n4,.my-sm-n4{margin-bottom:-1.5rem!important}.ml-sm-n4,.mx-sm-n4{margin-left:-1.5rem!important}.m-sm-n5{margin:-3rem!important}.mt-sm-n5,.my-sm-n5{margin-top:-3rem!important}.mr-sm-n5,.mx-sm-n5{margin-right:-3rem!important}.mb-sm-n5,.my-sm-n5{margin-bottom:-3rem!important}.ml-sm-n5,.mx-sm-n5{margin-left:-3rem!important}.m-sm-auto{margin:auto!important}.mt-sm-auto,.my-sm-auto{margin-top:auto!important}.mr-sm-auto,.mx-sm-auto{margin-right:auto!important}.mb-sm-auto,.my-sm-auto{margin-bottom:auto!important}.ml-sm-auto,.mx-sm-auto{margin-left:auto!important}}@media (min-width:768px){.m-md-0{margin:0!important}.mt-md-0,.my-md-0{margin-top:0!important}.mr-md-0,.mx-md-0{margin-right:0!important}.mb-md-0,.my-md-0{margin-bottom:0!important}.ml-md-0,.mx-md-0{margin-left:0!important}.m-md-1{margin:.25rem!important}.mt-md-1,.my-md-1{margin-top:.25rem!important}.mr-md-1,.mx-md-1{margin-right:.25rem!important}.mb-md-1,.my-md-1{margin-bottom:.25rem!important}.ml-md-1,.mx-md-1{margin-left:.25rem!important}.m-md-2{margin:.5rem!important}.mt-md-2,.my-md-2{margin-top:.5rem!important}.mr-md-2,.mx-md-2{margin-right:.5rem!important}.mb-md-2,.my-md-2{margin-bottom:.5rem!important}.ml-md-2,.mx-md-2{margin-left:.5rem!important}.m-md-3{margin:1rem!important}.mt-md-3,.my-md-3{margin-top:1rem!important}.mr-md-3,.mx-md-3{margin-right:1rem!important}.mb-md-3,.my-md-3{margin-bottom:1rem!important}.ml-md-3,.mx-md-3{margin-left:1rem!important}.m-md-4{margin:1.5rem!important}.mt-md-4,.my-md-4{margin-top:1.5rem!important}.mr-md-4,.mx-md-4{margin-right:1.5rem!important}.mb-md-4,.my-md-4{margin-bottom:1.5rem!important}.ml-md-4,.mx-md-4{margin-left:1.5rem!important}.m-md-5{margin:3rem!important}.mt-md-5,.my-md-5{margin-top:3rem!important}.mr-md-5,.mx-md-5{margin-right:3rem!important}.mb-md-5,.my-md-5{margin-bottom:3rem!important}.ml-md-5,.mx-md-5{margin-left:3rem!important}.p-md-0{padding:0!important}.pt-md-0,.py-md-0{padding-top:0!important}.pr-md-0,.px-md-0{padding-right:0!important}.pb-md-0,.py-md-0{padding-bottom:0!important}.pl-md-0,.px-md-0{padding-left:0!important}.p-md-1{padding:.25rem!important}.pt-md-1,.py-md-1{padding-top:.25rem!important}.pr-md-1,.px-md-1{padding-right:.25rem!important}.pb-md-1,.py-md-1{padding-bottom:.25rem!important}.pl-md-1,.px-md-1{padding-left:.25rem!important}.p-md-2{padding:.5rem!important}.pt-md-2,.py-md-2{padding-top:.5rem!important}.pr-md-2,.px-md-2{padding-right:.5rem!important}.pb-md-2,.py-md-2{padding-bottom:.5rem!important}.pl-md-2,.px-md-2{padding-left:.5rem!important}.p-md-3{padding:1rem!important}.pt-md-3,.py-md-3{padding-top:1rem!important}.pr-md-3,.px-md-3{padding-right:1rem!important}.pb-md-3,.py-md-3{padding-bottom:1rem!important}.pl-md-3,.px-md-3{padding-left:1rem!important}.p-md-4{padding:1.5rem!important}.pt-md-4,.py-md-4{padding-top:1.5rem!important}.pr-md-4,.px-md-4{padding-right:1.5rem!important}.pb-md-4,.py-md-4{padding-bottom:1.5rem!important}.pl-md-4,.px-md-4{padding-left:1.5rem!important}.p-md-5{padding:3rem!important}.pt-md-5,.py-md-5{padding-top:3rem!important}.pr-md-5,.px-md-5{padding-right:3rem!important}.pb-md-5,.py-md-5{padding-bottom:3rem!important}.pl-md-5,.px-md-5{padding-left:3rem!important}.m-md-n1{margin:-.25rem!important}.mt-md-n1,.my-md-n1{margin-top:-.25rem!important}.mr-md-n1,.mx-md-n1{margin-right:-.25rem!important}.mb-md-n1,.my-md-n1{margin-bottom:-.25rem!important}.ml-md-n1,.mx-md-n1{margin-left:-.25rem!important}.m-md-n2{margin:-.5rem!important}.mt-md-n2,.my-md-n2{margin-top:-.5rem!important}.mr-md-n2,.mx-md-n2{margin-right:-.5rem!important}.mb-md-n2,.my-md-n2{margin-bottom:-.5rem!important}.ml-md-n2,.mx-md-n2{margin-left:-.5rem!important}.m-md-n3{margin:-1rem!important}.mt-md-n3,.my-md-n3{margin-top:-1rem!important}.mr-md-n3,.mx-md-n3{margin-right:-1rem!important}.mb-md-n3,.my-md-n3{margin-bottom:-1rem!important}.ml-md-n3,.mx-md-n3{margin-left:-1rem!important}.m-md-n4{margin:-1.5rem!important}.mt-md-n4,.my-md-n4{margin-top:-1.5rem!important}.mr-md-n4,.mx-md-n4{margin-right:-1.5rem!important}.mb-md-n4,.my-md-n4{margin-bottom:-1.5rem!important}.ml-md-n4,.mx-md-n4{margin-left:-1.5rem!important}.m-md-n5{margin:-3rem!important}.mt-md-n5,.my-md-n5{margin-top:-3rem!important}.mr-md-n5,.mx-md-n5{margin-right:-3rem!important}.mb-md-n5,.my-md-n5{margin-bottom:-3rem!important}.ml-md-n5,.mx-md-n5{margin-left:-3rem!important}.m-md-auto{margin:auto!important}.mt-md-auto,.my-md-auto{margin-top:auto!important}.mr-md-auto,.mx-md-auto{margin-right:auto!important}.mb-md-auto,.my-md-auto{margin-bottom:auto!important}.ml-md-auto,.mx-md-auto{margin-left:auto!important}}@media (min-width:992px){.m-lg-0{margin:0!important}.mt-lg-0,.my-lg-0{margin-top:0!important}.mr-lg-0,.mx-lg-0{margin-right:0!important}.mb-lg-0,.my-lg-0{margin-bottom:0!important}.ml-lg-0,.mx-lg-0{margin-left:0!important}.m-lg-1{margin:.25rem!important}.mt-lg-1,.my-lg-1{margin-top:.25rem!important}.mr-lg-1,.mx-lg-1{margin-right:.25rem!important}.mb-lg-1,.my-lg-1{margin-bottom:.25rem!important}.ml-lg-1,.mx-lg-1{margin-left:.25rem!important}.m-lg-2{margin:.5rem!important}.mt-lg-2,.my-lg-2{margin-top:.5rem!important}.mr-lg-2,.mx-lg-2{margin-right:.5rem!important}.mb-lg-2,.my-lg-2{margin-bottom:.5rem!important}.ml-lg-2,.mx-lg-2{margin-left:.5rem!important}.m-lg-3{margin:1rem!important}.mt-lg-3,.my-lg-3{margin-top:1rem!important}.mr-lg-3,.mx-lg-3{margin-right:1rem!important}.mb-lg-3,.my-lg-3{margin-bottom:1rem!important}.ml-lg-3,.mx-lg-3{margin-left:1rem!important}.m-lg-4{margin:1.5rem!important}.mt-lg-4,.my-lg-4{margin-top:1.5rem!important}.mr-lg-4,.mx-lg-4{margin-right:1.5rem!important}.mb-lg-4,.my-lg-4{margin-bottom:1.5rem!important}.ml-lg-4,.mx-lg-4{margin-left:1.5rem!important}.m-lg-5{margin:3rem!important}.mt-lg-5,.my-lg-5{margin-top:3rem!important}.mr-lg-5,.mx-lg-5{margin-right:3rem!important}.mb-lg-5,.my-lg-5{margin-bottom:3rem!important}.ml-lg-5,.mx-lg-5{margin-left:3rem!important}.p-lg-0{padding:0!important}.pt-lg-0,.py-lg-0{padding-top:0!important}.pr-lg-0,.px-lg-0{padding-right:0!important}.pb-lg-0,.py-lg-0{padding-bottom:0!important}.pl-lg-0,.px-lg-0{padding-left:0!important}.p-lg-1{padding:.25rem!important}.pt-lg-1,.py-lg-1{padding-top:.25rem!important}.pr-lg-1,.px-lg-1{padding-right:.25rem!important}.pb-lg-1,.py-lg-1{padding-bottom:.25rem!important}.pl-lg-1,.px-lg-1{padding-left:.25rem!important}.p-lg-2{padding:.5rem!important}.pt-lg-2,.py-lg-2{padding-top:.5rem!important}.pr-lg-2,.px-lg-2{padding-right:.5rem!important}.pb-lg-2,.py-lg-2{padding-bottom:.5rem!important}.pl-lg-2,.px-lg-2{padding-left:.5rem!important}.p-lg-3{padding:1rem!important}.pt-lg-3,.py-lg-3{padding-top:1rem!important}.pr-lg-3,.px-lg-3{padding-right:1rem!important}.pb-lg-3,.py-lg-3{padding-bottom:1rem!important}.pl-lg-3,.px-lg-3{padding-left:1rem!important}.p-lg-4{padding:1.5rem!important}.pt-lg-4,.py-lg-4{padding-top:1.5rem!important}.pr-lg-4,.px-lg-4{padding-right:1.5rem!important}.pb-lg-4,.py-lg-4{padding-bottom:1.5rem!important}.pl-lg-4,.px-lg-4{padding-left:1.5rem!important}.p-lg-5{padding:3rem!important}.pt-lg-5,.py-lg-5{padding-top:3rem!important}.pr-lg-5,.px-lg-5{padding-right:3rem!important}.pb-lg-5,.py-lg-5{padding-bottom:3rem!important}.pl-lg-5,.px-lg-5{padding-left:3rem!important}.m-lg-n1{margin:-.25rem!important}.mt-lg-n1,.my-lg-n1{margin-top:-.25rem!important}.mr-lg-n1,.mx-lg-n1{margin-right:-.25rem!important}.mb-lg-n1,.my-lg-n1{margin-bottom:-.25rem!important}.ml-lg-n1,.mx-lg-n1{margin-left:-.25rem!important}.m-lg-n2{margin:-.5rem!important}.mt-lg-n2,.my-lg-n2{margin-top:-.5rem!important}.mr-lg-n2,.mx-lg-n2{margin-right:-.5rem!important}.mb-lg-n2,.my-lg-n2{margin-bottom:-.5rem!important}.ml-lg-n2,.mx-lg-n2{margin-left:-.5rem!important}.m-lg-n3{margin:-1rem!important}.mt-lg-n3,.my-lg-n3{margin-top:-1rem!important}.mr-lg-n3,.mx-lg-n3{margin-right:-1rem!important}.mb-lg-n3,.my-lg-n3{margin-bottom:-1rem!important}.ml-lg-n3,.mx-lg-n3{margin-left:-1rem!important}.m-lg-n4{margin:-1.5rem!important}.mt-lg-n4,.my-lg-n4{margin-top:-1.5rem!important}.mr-lg-n4,.mx-lg-n4{margin-right:-1.5rem!important}.mb-lg-n4,.my-lg-n4{margin-bottom:-1.5rem!important}.ml-lg-n4,.mx-lg-n4{margin-left:-1.5rem!important}.m-lg-n5{margin:-3rem!important}.mt-lg-n5,.my-lg-n5{margin-top:-3rem!important}.mr-lg-n5,.mx-lg-n5{margin-right:-3rem!important}.mb-lg-n5,.my-lg-n5{margin-bottom:-3rem!important}.ml-lg-n5,.mx-lg-n5{margin-left:-3rem!important}.m-lg-auto{margin:auto!important}.mt-lg-auto,.my-lg-auto{margin-top:auto!important}.mr-lg-auto,.mx-lg-auto{margin-right:auto!important}.mb-lg-auto,.my-lg-auto{margin-bottom:auto!important}.ml-lg-auto,.mx-lg-auto{margin-left:auto!important}}@media (min-width:1200px){.m-xl-0{margin:0!important}.mt-xl-0,.my-xl-0{margin-top:0!important}.mr-xl-0,.mx-xl-0{margin-right:0!important}.mb-xl-0,.my-xl-0{margin-bottom:0!important}.ml-xl-0,.mx-xl-0{margin-left:0!important}.m-xl-1{margin:.25rem!important}.mt-xl-1,.my-xl-1{margin-top:.25rem!important}.mr-xl-1,.mx-xl-1{margin-right:.25rem!important}.mb-xl-1,.my-xl-1{margin-bottom:.25rem!important}.ml-xl-1,.mx-xl-1{margin-left:.25rem!important}.m-xl-2{margin:.5rem!important}.mt-xl-2,.my-xl-2{margin-top:.5rem!important}.mr-xl-2,.mx-xl-2{margin-right:.5rem!important}.mb-xl-2,.my-xl-2{margin-bottom:.5rem!important}.ml-xl-2,.mx-xl-2{margin-left:.5rem!important}.m-xl-3{margin:1rem!important}.mt-xl-3,.my-xl-3{margin-top:1rem!important}.mr-xl-3,.mx-xl-3{margin-right:1rem!important}.mb-xl-3,.my-xl-3{margin-bottom:1rem!important}.ml-xl-3,.mx-xl-3{margin-left:1rem!important}.m-xl-4{margin:1.5rem!important}.mt-xl-4,.my-xl-4{margin-top:1.5rem!important}.mr-xl-4,.mx-xl-4{margin-right:1.5rem!important}.mb-xl-4,.my-xl-4{margin-bottom:1.5rem!important}.ml-xl-4,.mx-xl-4{margin-left:1.5rem!important}.m-xl-5{margin:3rem!important}.mt-xl-5,.my-xl-5{margin-top:3rem!important}.mr-xl-5,.mx-xl-5{margin-right:3rem!important}.mb-xl-5,.my-xl-5{margin-bottom:3rem!important}.ml-xl-5,.mx-xl-5{margin-left:3rem!important}.p-xl-0{padding:0!important}.pt-xl-0,.py-xl-0{padding-top:0!important}.pr-xl-0,.px-xl-0{padding-right:0!important}.pb-xl-0,.py-xl-0{padding-bottom:0!important}.pl-xl-0,.px-xl-0{padding-left:0!important}.p-xl-1{padding:.25rem!important}.pt-xl-1,.py-xl-1{padding-top:.25rem!important}.pr-xl-1,.px-xl-1{padding-right:.25rem!important}.pb-xl-1,.py-xl-1{padding-bottom:.25rem!important}.pl-xl-1,.px-xl-1{padding-left:.25rem!important}.p-xl-2{padding:.5rem!important}.pt-xl-2,.py-xl-2{padding-top:.5rem!important}.pr-xl-2,.px-xl-2{padding-right:.5rem!important}.pb-xl-2,.py-xl-2{padding-bottom:.5rem!important}.pl-xl-2,.px-xl-2{padding-left:.5rem!important}.p-xl-3{padding:1rem!important}.pt-xl-3,.py-xl-3{padding-top:1rem!important}.pr-xl-3,.px-xl-3{padding-right:1rem!important}.pb-xl-3,.py-xl-3{padding-bottom:1rem!important}.pl-xl-3,.px-xl-3{padding-left:1rem!important}.p-xl-4{padding:1.5rem!important}.pt-xl-4,.py-xl-4{padding-top:1.5rem!important}.pr-xl-4,.px-xl-4{padding-right:1.5rem!important}.pb-xl-4,.py-xl-4{padding-bottom:1.5rem!important}.pl-xl-4,.px-xl-4{padding-left:1.5rem!important}.p-xl-5{padding:3rem!important}.pt-xl-5,.py-xl-5{padding-top:3rem!important}.pr-xl-5,.px-xl-5{padding-right:3rem!important}.pb-xl-5,.py-xl-5{padding-bottom:3rem!important}.pl-xl-5,.px-xl-5{padding-left:3rem!important}.m-xl-n1{margin:-.25rem!important}.mt-xl-n1,.my-xl-n1{margin-top:-.25rem!important}.mr-xl-n1,.mx-xl-n1{margin-right:-.25rem!important}.mb-xl-n1,.my-xl-n1{margin-bottom:-.25rem!important}.ml-xl-n1,.mx-xl-n1{margin-left:-.25rem!important}.m-xl-n2{margin:-.5rem!important}.mt-xl-n2,.my-xl-n2{margin-top:-.5rem!important}.mr-xl-n2,.mx-xl-n2{margin-right:-.5rem!important}.mb-xl-n2,.my-xl-n2{margin-bottom:-.5rem!important}.ml-xl-n2,.mx-xl-n2{margin-left:-.5rem!important}.m-xl-n3{margin:-1rem!important}.mt-xl-n3,.my-xl-n3{margin-top:-1rem!important}.mr-xl-n3,.mx-xl-n3{margin-right:-1rem!important}.mb-xl-n3,.my-xl-n3{margin-bottom:-1rem!important}.ml-xl-n3,.mx-xl-n3{margin-left:-1rem!important}.m-xl-n4{margin:-1.5rem!important}.mt-xl-n4,.my-xl-n4{margin-top:-1.5rem!important}.mr-xl-n4,.mx-xl-n4{margin-right:-1.5rem!important}.mb-xl-n4,.my-xl-n4{margin-bottom:-1.5rem!important}.ml-xl-n4,.mx-xl-n4{margin-left:-1.5rem!important}.m-xl-n5{margin:-3rem!important}.mt-xl-n5,.my-xl-n5{margin-top:-3rem!important}.mr-xl-n5,.mx-xl-n5{margin-right:-3rem!important}.mb-xl-n5,.my-xl-n5{margin-bottom:-3rem!important}.ml-xl-n5,.mx-xl-n5{margin-left:-3rem!important}.m-xl-auto{margin:auto!important}.mt-xl-auto,.my-xl-auto{margin-top:auto!important}.mr-xl-auto,.mx-xl-auto{margin-right:auto!important}.mb-xl-auto,.my-xl-auto{margin-bottom:auto!important}.ml-xl-auto,.mx-xl-auto{margin-left:auto!important}}.text-monospace{font-family:SFMono-Regular,Menlo,Monaco,Consolas,""Liberation Mono"",""Courier New"",monospace!important}.text-justify{text-align:justify!important}.text-wrap{white-space:normal!important}.text-nowrap{white-space:nowrap!important}.text-truncate{overflow:hidden;text-overflow:ellipsis;white-space:nowrap}.text-left{text-align:left!important}.text-right{text-align:right!important}.text-center{text-align:center!important}@media (min-width:576px){.text-sm-left{text-align:left!important}.text-sm-right{text-align:right!important}.text-sm-center{text-align:center!important}}@media (min-width:768px){.text-md-left{text-align:left!important}.text-md-right{text-align:right!important}.text-md-center{text-align:center!important}}@media (min-width:992px){.text-lg-left{text-align:left!important}.text-lg-right{text-align:right!important}.text-lg-center{text-align:center!important}}@media (min-width:1200px){.text-xl-left{text-align:left!important}.text-xl-right{text-align:right!important}.text-xl-center{text-align:center!important}}.text-lowercase{text-transform:lowercase!important}.text-uppercase{text-transform:uppercase!important}.text-capitalize{text-transform:capitalize!important}.font-weight-light{font-weight:300!important}.font-weight-lighter{font-weight:lighter!important}.font-weight-normal{font-weight:400!important}.font-weight-bold{font-weight:700!important}.font-weight-bolder{font-weight:bolder!important}.font-italic{font-style:italic!important}.text-white{color:#fff!important}.text-primary{color:#007bff!important}a.text-primary:focus,a.text-primary:hover{color:#0056b3!important}.text-secondary{color:#6c757d!important}a.text-secondary:focus,a.text-secondary:hover{color:#494f54!important}.text-success{color:#28a745!important}a.text-success:focus,a.text-success:hover{color:#19692c!important}.text-info{color:#17a2b8!important}a.text-info:focus,a.text-info:hover{color:#0f6674!important}.text-warning{color:#ffc107!important}a.text-warning:focus,a.text-warning:hover{color:#ba8b00!important}.text-danger{color:#dc3545!important}a.text-danger:focus,a.text-danger:hover{color:#a71d2a!important}.text-light{color:#f8f9fa!important}a.text-light:focus,a.text-light:hover{color:#cbd3da!important}.text-dark{color:#343a40!important}a.text-dark:focus,a.text-dark:hover{color:#121416!important}.text-body{color:#212529!important}.text-muted{color:#6c757d!important}.text-black-50{color:rgba(0,0,0,.5)!important}.text-white-50{color:rgba(255,255,255,.5)!important}.text-hide{font:0/0 a;color:transparent;text-shadow:none;background-color:transparent;border:0}.text-decoration-none{text-decoration:none!important}.text-break{word-break:break-word!important;overflow-wrap:break-word!important}.text-reset{color:inherit!important}.visible{visibility:visible!important}.invisible{visibility:hidden!important}@media print{*,::after,::before{text-shadow:none!important;box-shadow:none!important}a:not(.btn){text-decoration:underline}abbr[title]::after{content:"" ("" attr(title) "")""}pre{white-space:pre-wrap!important}blockquote,pre{border:1px solid #adb5bd;page-break-inside:avoid}thead{display:table-header-group}img,tr{page-break-inside:avoid}h2,h3,p{orphans:3;widows:3}h2,h3{page-break-after:avoid}@page{size:a3}body{min-width:992px!important}.container{min-width:992px!important}.navbar{display:none}.badge{border:1px solid #000}.table{border-collapse:collapse!important}.table td,.table th{background-color:#fff!important}.table-bordered td,.table-bordered th{border:1px solid #dee2e6!important}.table-dark{color:inherit}.table-dark tbody+tbody,.table-dark td,.table-dark th,.table-dark thead th{border-color:#dee2e6}.table .thead-dark th{color:inherit;border-color:#dee2e6}}";
	
КонецФункции

// Функция, возвращает текст скрипта библиотеки.
//
Функция ПолучитьСкриптБиблиотеки_331() Экспорт
	
	// https://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js
	Возврат "!function(e,t){""use strict"";""object""==typeof module&&""object""==typeof module.exports?module.exports=e.document?t(e,!0):function(e){if(!e.document)throw new Error(""jQuery requires a window with a document"");return t(e)}:t(e)}(""undefined""!=typeof window?window:this,function(e,t){""use strict"";var n=[],r=e.document,i=Object.getPrototypeOf,o=n.slice,a=n.concat,s=n.push,u=n.indexOf,l={},c=l.toString,f=l.hasOwnProperty,p=f.toString,d=p.call(Object),h={},g=function e(t){return""function""==typeof t&&""number""!=typeof t.nodeType},y=function e(t){return null!=t&&t===t.window},v={type:!0,src:!0,noModule:!0};function m(e,t,n){var i,o=(t=t||r).createElement(""script"");if(o.text=e,n)for(i in v)n[i]&&(o[i]=n[i]);t.head.appendChild(o).parentNode.removeChild(o)}function x(e){return null==e?e+"""":""object""==typeof e||""function""==typeof e?l[c.call(e)]||""object"":typeof e}var b=""3.3.1"",w=function(e,t){return new w.fn.init(e,t)},T=/^[\s\uFEFF\xA0]+|[\s\uFEFF\xA0]+$/g;w.fn=w.prototype={jquery:""3.3.1"",constructor:w,length:0,toArray:function(){return o.call(this)},get:function(e){return null==e?o.call(this):e<0?this[e+this.length]:this[e]},pushStack:function(e){var t=w.merge(this.constructor(),e);return t.prevObject=this,t},each:function(e){return w.each(this,e)},map:function(e){return this.pushStack(w.map(this,function(t,n){return e.call(t,n,t)}))},slice:function(){return this.pushStack(o.apply(this,arguments))},first:function(){return this.eq(0)},last:function(){return this.eq(-1)},eq:function(e){var t=this.length,n=+e+(e<0?t:0);return this.pushStack(n>=0&&n<t?[this[n]]:[])},end:function(){return this.prevObject||this.constructor()},push:s,sort:n.sort,splice:n.splice},w.extend=w.fn.extend=function(){var e,t,n,r,i,o,a=arguments[0]||{},s=1,u=arguments.length,l=!1;for(""boolean""==typeof a&&(l=a,a=arguments[s]||{},s++),""object""==typeof a||g(a)||(a={}),s===u&&(a=this,s--);s<u;s++)if(null!=(e=arguments[s]))for(t in e)n=a[t],a!==(r=e[t])&&(l&&r&&(w.isPlainObject(r)||(i=Array.isArray(r)))?(i?(i=!1,o=n&&Array.isArray(n)?n:[]):o=n&&w.isPlainObject(n)?n:{},a[t]=w.extend(l,o,r)):void 0!==r&&(a[t]=r));return a},w.extend({expando:""jQuery""+(""3.3.1""+Math.random()).replace(/\D/g,""""),isReady:!0,error:function(e){throw new Error(e)},noop:function(){},isPlainObject:function(e){var t,n;return!(!e||""[object Object]""!==c.call(e))&&(!(t=i(e))||""function""==typeof(n=f.call(t,""constructor"")&&t.constructor)&&p.call(n)===d)},isEmptyObject:function(e){var t;for(t in e)return!1;return!0},globalEval:function(e){m(e)},each:function(e,t){var n,r=0;if(C(e)){for(n=e.length;r<n;r++)if(!1===t.call(e[r],r,e[r]))break}else for(r in e)if(!1===t.call(e[r],r,e[r]))break;return e},trim:function(e){return null==e?"""":(e+"""").replace(T,"""")},makeArray:function(e,t){var n=t||[];return null!=e&&(C(Object(e))?w.merge(n,""string""==typeof e?[e]:e):s.call(n,e)),n},inArray:function(e,t,n){return null==t?-1:u.call(t,e,n)},merge:function(e,t){for(var n=+t.length,r=0,i=e.length;r<n;r++)e[i++]=t[r];return e.length=i,e},grep:function(e,t,n){for(var r,i=[],o=0,a=e.length,s=!n;o<a;o++)(r=!t(e[o],o))!==s&&i.push(e[o]);return i},map:function(e,t,n){var r,i,o=0,s=[];if(C(e))for(r=e.length;o<r;o++)null!=(i=t(e[o],o,n))&&s.push(i);else for(o in e)null!=(i=t(e[o],o,n))&&s.push(i);return a.apply([],s)},guid:1,support:h}),""function""==typeof Symbol&&(w.fn[Symbol.iterator]=n[Symbol.iterator]),w.each(""Boolean Number String Function Array Date RegExp Object Error Symbol"".split("" ""),function(e,t){l[""[object ""+t+""]""]=t.toLowerCase()});function C(e){var t=!!e&&""length""in e&&e.length,n=x(e);return!g(e)&&!y(e)&&(""array""===n||0===t||""number""==typeof t&&t>0&&t-1 in e)}var E=function(e){var t,n,r,i,o,a,s,u,l,c,f,p,d,h,g,y,v,m,x,b=""sizzle""+1*new Date,w=e.document,T=0,C=0,E=ae(),k=ae(),S=ae(),D=function(e,t){return e===t&&(f=!0),0},N={}.hasOwnProperty,A=[],j=A.pop,q=A.push,L=A.push,H=A.slice,O=function(e,t){for(var n=0,r=e.length;n<r;n++)if(e[n]===t)return n;return-1},P=""checked|selected|async|autofocus|autoplay|controls|defer|disabled|hidden|ismap|loop|multiple|open|readonly|required|scoped"",M=""[\\x20\\t\\r\\n\\f]"",R=""(?:\\\\.|[\\w-]|[^\0-\\xa0])+"",I=""\\[""+M+""*(""+R+"")(?:""+M+""*([*^$|!~]?=)""+M+""*(?:'((?:\\\\.|[^\\\\'])*)'|\""((?:\\\\.|[^\\\\\""])*)\""|(""+R+""))|)""+M+""*\\]"",W="":(""+R+"")(?:\\((('((?:\\\\.|[^\\\\'])*)'|\""((?:\\\\.|[^\\\\\""])*)\"")|((?:\\\\.|[^\\\\()[\\]]|""+I+"")*)|.*)\\)|)"",$=new RegExp(M+""+"",""g""),B=new RegExp(""^""+M+""+|((?:^|[^\\\\])(?:\\\\.)*)""+M+""+$"",""g""),F=new RegExp(""^""+M+""*,""+M+""*""),_=new RegExp(""^""+M+""*([>+~]|""+M+"")""+M+""*""),z=new RegExp(""=""+M+""*([^\\]'\""]*?)""+M+""*\\]"",""g""),X=new RegExp(W),U=new RegExp(""^""+R+""$""),V={ID:new RegExp(""^#(""+R+"")""),CLASS:new RegExp(""^\\.(""+R+"")""),TAG:new RegExp(""^(""+R+""|[*])""),ATTR:new RegExp(""^""+I),PSEUDO:new RegExp(""^""+W),CHILD:new RegExp(""^:(only|first|last|nth|nth-last)-(child|of-type)(?:\\(""+M+""*(even|odd|(([+-]|)(\\d*)n|)""+M+""*(?:([+-]|)""+M+""*(\\d+)|))""+M+""*\\)|)"",""i""),bool:new RegExp(""^(?:""+P+"")$"",""i""),needsContext:new RegExp(""^""+M+""*[>+~]|:(even|odd|eq|gt|lt|nth|first|last)(?:\\(""+M+""*((?:-\\d)?\\d*)""+M+""*\\)|)(?=[^-]|$)"",""i"")},G=/^(?:input|select|textarea|button)$/i,Y=/^h\d$/i,Q=/^[^{]+\{\s*\[native \w/,J=/^(?:#([\w-]+)|(\w+)|\.([\w-]+))$/,K=/[+~]/,Z=new RegExp(""\\\\([\\da-f]{1,6}""+M+""?|(""+M+"")|.)"",""ig""),ee=function(e,t,n){var r=""0x""+t-65536;return r!==r||n?t:r<0?String.fromCharCode(r+65536):String.fromCharCode(r>>10|55296,1023&r|56320)},te=/([\0-\x1f\x7f]|^-?\d)|^-$|[^\0-\x1f\x7f-\uFFFF\w-]/g,ne=function(e,t){return t?""\0""===e?""\ufffd"":e.slice(0,-1)+""\\""+e.charCodeAt(e.length-1).toString(16)+"" "":""\\""+e},re=function(){p()},ie=me(function(e){return!0===e.disabled&&(""form""in e||""label""in e)},{dir:""parentNode"",next:""legend""});try{L.apply(A=H.call(w.childNodes),w.childNodes),A[w.childNodes.length].nodeType}catch(e){L={apply:A.length?function(e,t){q.apply(e,H.call(t))}:function(e,t){var n=e.length,r=0;while(e[n++]=t[r++]);e.length=n-1}}}function oe(e,t,r,i){var o,s,l,c,f,h,v,m=t&&t.ownerDocument,T=t?t.nodeType:9;if(r=r||[],""string""!=typeof e||!e||1!==T&&9!==T&&11!==T)return r;if(!i&&((t?t.ownerDocument||t:w)!==d&&p(t),t=t||d,g)){if(11!==T&&(f=J.exec(e)))if(o=f[1]){if(9===T){if(!(l=t.getElementById(o)))return r;if(l.id===o)return r.push(l),r}else if(m&&(l=m.getElementById(o))&&x(t,l)&&l.id===o)return r.push(l),r}else{if(f[2])return L.apply(r,t.getElementsByTagName(e)),r;if((o=f[3])&&n.getElementsByClassName&&t.getElementsByClassName)return L.apply(r,t.getElementsByClassName(o)),r}if(n.qsa&&!S[e+"" ""]&&(!y||!y.test(e))){if(1!==T)m=t,v=e;else if(""object""!==t.nodeName.toLowerCase()){(c=t.getAttribute(""id""))?c=c.replace(te,ne):t.setAttribute(""id"",c=b),s=(h=a(e)).length;while(s--)h[s]=""#""+c+"" ""+ve(h[s]);v=h.join("",""),m=K.test(e)&&ge(t.parentNode)||t}if(v)try{return L.apply(r,m.querySelectorAll(v)),r}catch(e){}finally{c===b&&t.removeAttribute(""id"")}}}return u(e.replace(B,""$1""),t,r,i)}function ae(){var e=[];function t(n,i){return e.push(n+"" "")>r.cacheLength&&delete t[e.shift()],t[n+"" ""]=i}return t}function se(e){return e[b]=!0,e}function ue(e){var t=d.createElement(""fieldset"");try{return!!e(t)}catch(e){return!1}finally{t.parentNode&&t.parentNode.removeChild(t),t=null}}function le(e,t){var n=e.split(""|""),i=n.length;while(i--)r.attrHandle[n[i]]=t}function ce(e,t){var n=t&&e,r=n&&1===e.nodeType&&1===t.nodeType&&e.sourceIndex-t.sourceIndex;if(r)return r;if(n)while(n=n.nextSibling)if(n===t)return-1;return e?1:-1}function fe(e){return function(t){return""input""===t.nodeName.toLowerCase()&&t.type===e}}function pe(e){return function(t){var n=t.nodeName.toLowerCase();return(""input""===n||""button""===n)&&t.type===e}}function de(e){return function(t){return""form""in t?t.parentNode&&!1===t.disabled?""label""in t?""label""in t.parentNode?t.parentNode.disabled===e:t.disabled===e:t.isDisabled===e||t.isDisabled!==!e&&ie(t)===e:t.disabled===e:""label""in t&&t.disabled===e}}function he(e){return se(function(t){return t=+t,se(function(n,r){var i,o=e([],n.length,t),a=o.length;while(a--)n[i=o[a]]&&(n[i]=!(r[i]=n[i]))})})}function ge(e){return e&&""undefined""!=typeof e.getElementsByTagName&&e}n=oe.support={},o=oe.isXML=function(e){var t=e&&(e.ownerDocument||e).documentElement;return!!t&&""HTML""!==t.nodeName},p=oe.setDocument=function(e){var t,i,a=e?e.ownerDocument||e:w;return a!==d&&9===a.nodeType&&a.documentElement?(d=a,h=d.documentElement,g=!o(d),w!==d&&(i=d.defaultView)&&i.top!==i&&(i.addEventListener?i.addEventListener(""unload"",re,!1):i.attachEvent&&i.attachEvent(""onunload"",re)),n.attributes=ue(function(e){return e.className=""i"",!e.getAttribute(""className"")}),n.getElementsByTagName=ue(function(e){return e.appendChild(d.createComment("""")),!e.getElementsByTagName(""*"").length}),n.getElementsByClassName=Q.test(d.getElementsByClassName),n.getById=ue(function(e){return h.appendChild(e).id=b,!d.getElementsByName||!d.getElementsByName(b).length}),n.getById?(r.filter.ID=function(e){var t=e.replace(Z,ee);return function(e){return e.getAttribute(""id"")===t}},r.find.ID=function(e,t){if(""undefined""!=typeof t.getElementById&&g){var n=t.getElementById(e);return n?[n]:[]}}):(r.filter.ID=function(e){var t=e.replace(Z,ee);return function(e){var n=""undefined""!=typeof e.getAttributeNode&&e.getAttributeNode(""id"");return n&&n.value===t}},r.find.ID=function(e,t){if(""undefined""!=typeof t.getElementById&&g){var n,r,i,o=t.getElementById(e);if(o){if((n=o.getAttributeNode(""id""))&&n.value===e)return[o];i=t.getElementsByName(e),r=0;while(o=i[r++])if((n=o.getAttributeNode(""id""))&&n.value===e)return[o]}return[]}}),r.find.TAG=n.getElementsByTagName?function(e,t){return""undefined""!=typeof t.getElementsByTagName?t.getElementsByTagName(e):n.qsa?t.querySelectorAll(e):void 0}:function(e,t){var n,r=[],i=0,o=t.getElementsByTagName(e);if(""*""===e){while(n=o[i++])1===n.nodeType&&r.push(n);return r}return o},r.find.CLASS=n.getElementsByClassName&&function(e,t){if(""undefined""!=typeof t.getElementsByClassName&&g)return t.getElementsByClassName(e)},v=[],y=[],(n.qsa=Q.test(d.querySelectorAll))&&(ue(function(e){h.appendChild(e).innerHTML=""<a id='""+b+""'></a><select id='""+b+""-\r\\' msallowcapture=''><option selected=''></option></select>"",e.querySelectorAll(""[msallowcapture^='']"").length&&y.push(""[*^$]=""+M+""*(?:''|\""\"")""),e.querySelectorAll(""[selected]"").length||y.push(""\\[""+M+""*(?:value|""+P+"")""),e.querySelectorAll(""[id~=""+b+""-]"").length||y.push(""~=""),e.querySelectorAll("":checked"").length||y.push("":checked""),e.querySelectorAll(""a#""+b+""+*"").length||y.push("".#.+[+~]"")}),ue(function(e){e.innerHTML=""<a href='' disabled='disabled'></a><select disabled='disabled'><option/></select>"";var t=d.createElement(""input"");t.setAttribute(""type"",""hidden""),e.appendChild(t).setAttribute(""name"",""D""),e.querySelectorAll(""[name=d]"").length&&y.push(""name""+M+""*[*^$|!~]?=""),2!==e.querySelectorAll("":enabled"").length&&y.push("":enabled"","":disabled""),h.appendChild(e).disabled=!0,2!==e.querySelectorAll("":disabled"").length&&y.push("":enabled"","":disabled""),e.querySelectorAll(""*,:x""),y.push("",.*:"")})),(n.matchesSelector=Q.test(m=h.matches||h.webkitMatchesSelector||h.mozMatchesSelector||h.oMatchesSelector||h.msMatchesSelector))&&ue(function(e){n.disconnectedMatch=m.call(e,""*""),m.call(e,""[s!='']:x""),v.push(""!="",W)}),y=y.length&&new RegExp(y.join(""|"")),v=v.length&&new RegExp(v.join(""|"")),t=Q.test(h.compareDocumentPosition),x=t||Q.test(h.contains)?function(e,t){var n=9===e.nodeType?e.documentElement:e,r=t&&t.parentNode;return e===r||!(!r||1!==r.nodeType||!(n.contains?n.contains(r):e.compareDocumentPosition&&16&e.compareDocumentPosition(r)))}:function(e,t){if(t)while(t=t.parentNode)if(t===e)return!0;return!1},D=t?function(e,t){if(e===t)return f=!0,0;var r=!e.compareDocumentPosition-!t.compareDocumentPosition;return r||(1&(r=(e.ownerDocument||e)===(t.ownerDocument||t)?e.compareDocumentPosition(t):1)||!n.sortDetached&&t.compareDocumentPosition(e)===r?e===d||e.ownerDocument===w&&x(w,e)?-1:t===d||t.ownerDocument===w&&x(w,t)?1:c?O(c,e)-O(c,t):0:4&r?-1:1)}:function(e,t){if(e===t)return f=!0,0;var n,r=0,i=e.parentNode,o=t.parentNode,a=[e],s=[t];if(!i||!o)return e===d?-1:t===d?1:i?-1:o?1:c?O(c,e)-O(c,t):0;if(i===o)return ce(e,t);n=e;while(n=n.parentNode)a.unshift(n);n=t;while(n=n.parentNode)s.unshift(n);while(a[r]===s[r])r++;return r?ce(a[r],s[r]):a[r]===w?-1:s[r]===w?1:0},d):d},oe.matches=function(e,t){return oe(e,null,null,t)},oe.matchesSelector=function(e,t){if((e.ownerDocument||e)!==d&&p(e),t=t.replace(z,""='$1']""),n.matchesSelector&&g&&!S[t+"" ""]&&(!v||!v.test(t))&&(!y||!y.test(t)))try{var r=m.call(e,t);if(r||n.disconnectedMatch||e.document&&11!==e.document.nodeType)return r}catch(e){}return oe(t,d,null,[e]).length>0},oe.contains=function(e,t){return(e.ownerDocument||e)!==d&&p(e),x(e,t)},oe.attr=function(e,t){(e.ownerDocument||e)!==d&&p(e);var i=r.attrHandle[t.toLowerCase()],o=i&&N.call(r.attrHandle,t.toLowerCase())?i(e,t,!g):void 0;return void 0!==o?o:n.attributes||!g?e.getAttribute(t):(o=e.getAttributeNode(t))&&o.specified?o.value:null},oe.escape=function(e){return(e+"""").replace(te,ne)},oe.error=function(e){throw new Error(""Syntax error, unrecognized expression: ""+e)},oe.uniqueSort=function(e){var t,r=[],i=0,o=0;if(f=!n.detectDuplicates,c=!n.sortStable&&e.slice(0),e.sort(D),f){while(t=e[o++])t===e[o]&&(i=r.push(o));while(i--)e.splice(r[i],1)}return c=null,e},i=oe.getText=function(e){var t,n="""",r=0,o=e.nodeType;if(o){if(1===o||9===o||11===o){if(""string""==typeof e.textContent)return e.textContent;for(e=e.firstChild;e;e=e.nextSibling)n+=i(e)}else if(3===o||4===o)return e.nodeValue}else while(t=e[r++])n+=i(t);return n},(r=oe.selectors={cacheLength:50,createPseudo:se,match:V,attrHandle:{},find:{},relative:{"">"":{dir:""parentNode"",first:!0},"" "":{dir:""parentNode""},""+"":{dir:""previousSibling"",first:!0},""~"":{dir:""previousSibling""}},preFilter:{ATTR:function(e){return e[1]=e[1].replace(Z,ee),e[3]=(e[3]||e[4]||e[5]||"""").replace(Z,ee),""~=""===e[2]&&(e[3]="" ""+e[3]+"" ""),e.slice(0,4)},CHILD:function(e){return e[1]=e[1].toLowerCase(),""nth""===e[1].slice(0,3)?(e[3]||oe.error(e[0]),e[4]=+(e[4]?e[5]+(e[6]||1):2*(""even""===e[3]||""odd""===e[3])),e[5]=+(e[7]+e[8]||""odd""===e[3])):e[3]&&oe.error(e[0]),e},PSEUDO:function(e){var t,n=!e[6]&&e[2];return V.CHILD.test(e[0])?null:(e[3]?e[2]=e[4]||e[5]||"""":n&&X.test(n)&&(t=a(n,!0))&&(t=n.indexOf("")"",n.length-t)-n.length)&&(e[0]=e[0].slice(0,t),e[2]=n.slice(0,t)),e.slice(0,3))}},filter:{TAG:function(e){var t=e.replace(Z,ee).toLowerCase();return""*""===e?function(){return!0}:function(e){return e.nodeName&&e.nodeName.toLowerCase()===t}},CLASS:function(e){var t=E[e+"" ""];return t||(t=new RegExp(""(^|""+M+"")""+e+""(""+M+""|$)""))&&E(e,function(e){return t.test(""string""==typeof e.className&&e.className||""undefined""!=typeof e.getAttribute&&e.getAttribute(""class"")||"""")})},ATTR:function(e,t,n){return function(r){var i=oe.attr(r,e);return null==i?""!=""===t:!t||(i+="""",""=""===t?i===n:""!=""===t?i!==n:""^=""===t?n&&0===i.indexOf(n):""*=""===t?n&&i.indexOf(n)>-1:""$=""===t?n&&i.slice(-n.length)===n:""~=""===t?("" ""+i.replace($,"" "")+"" "").indexOf(n)>-1:""|=""===t&&(i===n||i.slice(0,n.length+1)===n+""-""))}},CHILD:function(e,t,n,r,i){var o=""nth""!==e.slice(0,3),a=""last""!==e.slice(-4),s=""of-type""===t;return 1===r&&0===i?function(e){return!!e.parentNode}:function(t,n,u){var l,c,f,p,d,h,g=o!==a?""nextSibling"":""previousSibling"",y=t.parentNode,v=s&&t.nodeName.toLowerCase(),m=!u&&!s,x=!1;if(y){if(o){while(g){p=t;while(p=p[g])if(s?p.nodeName.toLowerCase()===v:1===p.nodeType)return!1;h=g=""only""===e&&!h&&""nextSibling""}return!0}if(h=[a?y.firstChild:y.lastChild],a&&m){x=(d=(l=(c=(f=(p=y)[b]||(p[b]={}))[p.uniqueID]||(f[p.uniqueID]={}))[e]||[])[0]===T&&l[1])&&l[2],p=d&&y.childNodes[d];while(p=++d&&p&&p[g]||(x=d=0)||h.pop())if(1===p.nodeType&&++x&&p===t){c[e]=[T,d,x];break}}else if(m&&(x=d=(l=(c=(f=(p=t)[b]||(p[b]={}))[p.uniqueID]||(f[p.uniqueID]={}))[e]||[])[0]===T&&l[1]),!1===x)while(p=++d&&p&&p[g]||(x=d=0)||h.pop())if((s?p.nodeName.toLowerCase()===v:1===p.nodeType)&&++x&&(m&&((c=(f=p[b]||(p[b]={}))[p.uniqueID]||(f[p.uniqueID]={}))[e]=[T,x]),p===t))break;return(x-=i)===r||x%r==0&&x/r>=0}}},PSEUDO:function(e,t){var n,i=r.pseudos[e]||r.setFilters[e.toLowerCase()]||oe.error(""unsupported pseudo: ""+e);return i[b]?i(t):i.length>1?(n=[e,e,"""",t],r.setFilters.hasOwnProperty(e.toLowerCase())?se(function(e,n){var r,o=i(e,t),a=o.length;while(a--)e[r=O(e,o[a])]=!(n[r]=o[a])}):function(e){return i(e,0,n)}):i}},pseudos:{not:se(function(e){var t=[],n=[],r=s(e.replace(B,""$1""));return r[b]?se(function(e,t,n,i){var o,a=r(e,null,i,[]),s=e.length;while(s--)(o=a[s])&&(e[s]=!(t[s]=o))}):function(e,i,o){return t[0]=e,r(t,null,o,n),t[0]=null,!n.pop()}}),has:se(function(e){return function(t){return oe(e,t).length>0}}),contains:se(function(e){return e=e.replace(Z,ee),function(t){return(t.textContent||t.innerText||i(t)).indexOf(e)>-1}}),lang:se(function(e){return U.test(e||"""")||oe.error(""unsupported lang: ""+e),e=e.replace(Z,ee).toLowerCase(),function(t){var n;do{if(n=g?t.lang:t.getAttribute(""xml:lang"")||t.getAttribute(""lang""))return(n=n.toLowerCase())===e||0===n.indexOf(e+""-"")}while((t=t.parentNode)&&1===t.nodeType);return!1}}),target:function(t){var n=e.location&&e.location.hash;return n&&n.slice(1)===t.id},root:function(e){return e===h},focus:function(e){return e===d.activeElement&&(!d.hasFocus||d.hasFocus())&&!!(e.type||e.href||~e.tabIndex)},enabled:de(!1),disabled:de(!0),checked:function(e){var t=e.nodeName.toLowerCase();return""input""===t&&!!e.checked||""option""===t&&!!e.selected},selected:function(e){return e.parentNode&&e.parentNode.selectedIndex,!0===e.selected},empty:function(e){for(e=e.firstChild;e;e=e.nextSibling)if(e.nodeType<6)return!1;return!0},parent:function(e){return!r.pseudos.empty(e)},header:function(e){return Y.test(e.nodeName)},input:function(e){return G.test(e.nodeName)},button:function(e){var t=e.nodeName.toLowerCase();return""input""===t&&""button""===e.type||""button""===t},text:function(e){var t;return""input""===e.nodeName.toLowerCase()&&""text""===e.type&&(null==(t=e.getAttribute(""type""))||""text""===t.toLowerCase())},first:he(function(){return[0]}),last:he(function(e,t){return[t-1]}),eq:he(function(e,t,n){return[n<0?n+t:n]}),even:he(function(e,t){for(var n=0;n<t;n+=2)e.push(n);return e}),odd:he(function(e,t){for(var n=1;n<t;n+=2)e.push(n);return e}),lt:he(function(e,t,n){for(var r=n<0?n+t:n;--r>=0;)e.push(r);return e}),gt:he(function(e,t,n){for(var r=n<0?n+t:n;++r<t;)e.push(r);return e})}}).pseudos.nth=r.pseudos.eq;for(t in{radio:!0,checkbox:!0,file:!0,password:!0,image:!0})r.pseudos[t]=fe(t);for(t in{submit:!0,reset:!0})r.pseudos[t]=pe(t);function ye(){}ye.prototype=r.filters=r.pseudos,r.setFilters=new ye,a=oe.tokenize=function(e,t){var n,i,o,a,s,u,l,c=k[e+"" ""];if(c)return t?0:c.slice(0);s=e,u=[],l=r.preFilter;while(s){n&&!(i=F.exec(s))||(i&&(s=s.slice(i[0].length)||s),u.push(o=[])),n=!1,(i=_.exec(s))&&(n=i.shift(),o.push({value:n,type:i[0].replace(B,"" "")}),s=s.slice(n.length));for(a in r.filter)!(i=V[a].exec(s))||l[a]&&!(i=l[a](i))||(n=i.shift(),o.push({value:n,type:a,matches:i}),s=s.slice(n.length));if(!n)break}return t?s.length:s?oe.error(e):k(e,u).slice(0)};function ve(e){for(var t=0,n=e.length,r="""";t<n;t++)r+=e[t].value;return r}function me(e,t,n){var r=t.dir,i=t.next,o=i||r,a=n&&""parentNode""===o,s=C++;return t.first?function(t,n,i){while(t=t[r])if(1===t.nodeType||a)return e(t,n,i);return!1}:function(t,n,u){var l,c,f,p=[T,s];if(u){while(t=t[r])if((1===t.nodeType||a)&&e(t,n,u))return!0}else while(t=t[r])if(1===t.nodeType||a)if(f=t[b]||(t[b]={}),c=f[t.uniqueID]||(f[t.uniqueID]={}),i&&i===t.nodeName.toLowerCase())t=t[r]||t;else{if((l=c[o])&&l[0]===T&&l[1]===s)return p[2]=l[2];if(c[o]=p,p[2]=e(t,n,u))return!0}return!1}}function xe(e){return e.length>1?function(t,n,r){var i=e.length;while(i--)if(!e[i](t,n,r))return!1;return!0}:e[0]}function be(e,t,n){for(var r=0,i=t.length;r<i;r++)oe(e,t[r],n);return n}function we(e,t,n,r,i){for(var o,a=[],s=0,u=e.length,l=null!=t;s<u;s++)(o=e[s])&&(n&&!n(o,r,i)||(a.push(o),l&&t.push(s)));return a}function Te(e,t,n,r,i,o){return r&&!r[b]&&(r=Te(r)),i&&!i[b]&&(i=Te(i,o)),se(function(o,a,s,u){var l,c,f,p=[],d=[],h=a.length,g=o||be(t||""*"",s.nodeType?[s]:s,[]),y=!e||!o&&t?g:we(g,p,e,s,u),v=n?i||(o?e:h||r)?[]:a:y;if(n&&n(y,v,s,u),r){l=we(v,d),r(l,[],s,u),c=l.length;while(c--)(f=l[c])&&(v[d[c]]=!(y[d[c]]=f))}if(o){if(i||e){if(i){l=[],c=v.length;while(c--)(f=v[c])&&l.push(y[c]=f);i(null,v=[],l,u)}c=v.length;while(c--)(f=v[c])&&(l=i?O(o,f):p[c])>-1&&(o[l]=!(a[l]=f))}}else v=we(v===a?v.splice(h,v.length):v),i?i(null,a,v,u):L.apply(a,v)})}function Ce(e){for(var t,n,i,o=e.length,a=r.relative[e[0].type],s=a||r.relative["" ""],u=a?1:0,c=me(function(e){return e===t},s,!0),f=me(function(e){return O(t,e)>-1},s,!0),p=[function(e,n,r){var i=!a&&(r||n!==l)||((t=n).nodeType?c(e,n,r):f(e,n,r));return t=null,i}];u<o;u++)if(n=r.relative[e[u].type])p=[me(xe(p),n)];else{if((n=r.filter[e[u].type].apply(null,e[u].matches))[b]){for(i=++u;i<o;i++)if(r.relative[e[i].type])break;return Te(u>1&&xe(p),u>1&&ve(e.slice(0,u-1).concat({value:"" ""===e[u-2].type?""*"":""""})).replace(B,""$1""),n,u<i&&Ce(e.slice(u,i)),i<o&&Ce(e=e.slice(i)),i<o&&ve(e))}p.push(n)}return xe(p)}function Ee(e,t){var n=t.length>0,i=e.length>0,o=function(o,a,s,u,c){var f,h,y,v=0,m=""0"",x=o&&[],b=[],w=l,C=o||i&&r.find.TAG(""*"",c),E=T+=null==w?1:Math.random()||.1,k=C.length;for(c&&(l=a===d||a||c);m!==k&&null!=(f=C[m]);m++){if(i&&f){h=0,a||f.ownerDocument===d||(p(f),s=!g);while(y=e[h++])if(y(f,a||d,s)){u.push(f);break}c&&(T=E)}n&&((f=!y&&f)&&v--,o&&x.push(f))}if(v+=m,n&&m!==v){h=0;while(y=t[h++])y(x,b,a,s);if(o){if(v>0)while(m--)x[m]||b[m]||(b[m]=j.call(u));b=we(b)}L.apply(u,b),c&&!o&&b.length>0&&v+t.length>1&&oe.uniqueSort(u)}return c&&(T=E,l=w),x};return n?se(o):o}return s=oe.compile=function(e,t){var n,r=[],i=[],o=S[e+"" ""];if(!o){t||(t=a(e)),n=t.length;while(n--)(o=Ce(t[n]))[b]?r.push(o):i.push(o);(o=S(e,Ee(i,r))).selector=e}return o},u=oe.select=function(e,t,n,i){var o,u,l,c,f,p=""function""==typeof e&&e,d=!i&&a(e=p.selector||e);if(n=n||[],1===d.length){if((u=d[0]=d[0].slice(0)).length>2&&""ID""===(l=u[0]).type&&9===t.nodeType&&g&&r.relative[u[1].type]){if(!(t=(r.find.ID(l.matches[0].replace(Z,ee),t)||[])[0]))return n;p&&(t=t.parentNode),e=e.slice(u.shift().value.length)}o=V.needsContext.test(e)?0:u.length;while(o--){if(l=u[o],r.relative[c=l.type])break;if((f=r.find[c])&&(i=f(l.matches[0].replace(Z,ee),K.test(u[0].type)&&ge(t.parentNode)||t))){if(u.splice(o,1),!(e=i.length&&ve(u)))return L.apply(n,i),n;break}}}return(p||s(e,d))(i,t,!g,n,!t||K.test(e)&&ge(t.parentNode)||t),n},n.sortStable=b.split("""").sort(D).join("""")===b,n.detectDuplicates=!!f,p(),n.sortDetached=ue(function(e){return 1&e.compareDocumentPosition(d.createElement(""fieldset""))}),ue(function(e){return e.innerHTML=""<a href='#'></a>"",""#""===e.firstChild.getAttribute(""href"")})||le(""type|href|height|width"",function(e,t,n){if(!n)return e.getAttribute(t,""type""===t.toLowerCase()?1:2)}),n.attributes&&ue(function(e){return e.innerHTML=""<input/>"",e.firstChild.setAttribute(""value"",""""),""""===e.firstChild.getAttribute(""value"")})||le(""value"",function(e,t,n){if(!n&&""input""===e.nodeName.toLowerCase())return e.defaultValue}),ue(function(e){return null==e.getAttribute(""disabled"")})||le(P,function(e,t,n){var r;if(!n)return!0===e[t]?t.toLowerCase():(r=e.getAttributeNode(t))&&r.specified?r.value:null}),oe}(e);w.find=E,w.expr=E.selectors,w.expr["":""]=w.expr.pseudos,w.uniqueSort=w.unique=E.uniqueSort,w.text=E.getText,w.isXMLDoc=E.isXML,w.contains=E.contains,w.escapeSelector=E.escape;var k=function(e,t,n){var r=[],i=void 0!==n;while((e=e[t])&&9!==e.nodeType)if(1===e.nodeType){if(i&&w(e).is(n))break;r.push(e)}return r},S=function(e,t){for(var n=[];e;e=e.nextSibling)1===e.nodeType&&e!==t&&n.push(e);return n},D=w.expr.match.needsContext;function N(e,t){return e.nodeName&&e.nodeName.toLowerCase()===t.toLowerCase()}var A=/^<([a-z][^\/\0>:\x20\t\r\n\f]*)[\x20\t\r\n\f]*\/?>(?:<\/\1>|)$/i;function j(e,t,n){return g(t)?w.grep(e,function(e,r){return!!t.call(e,r,e)!==n}):t.nodeType?w.grep(e,function(e){return e===t!==n}):""string""!=typeof t?w.grep(e,function(e){return u.call(t,e)>-1!==n}):w.filter(t,e,n)}w.filter=function(e,t,n){var r=t[0];return n&&(e="":not(""+e+"")""),1===t.length&&1===r.nodeType?w.find.matchesSelector(r,e)?[r]:[]:w.find.matches(e,w.grep(t,function(e){return 1===e.nodeType}))},w.fn.extend({find:function(e){var t,n,r=this.length,i=this;if(""string""!=typeof e)return this.pushStack(w(e).filter(function(){for(t=0;t<r;t++)if(w.contains(i[t],this))return!0}));for(n=this.pushStack([]),t=0;t<r;t++)w.find(e,i[t],n);return r>1?w.uniqueSort(n):n},filter:function(e){return this.pushStack(j(this,e||[],!1))},not:function(e){return this.pushStack(j(this,e||[],!0))},is:function(e){return!!j(this,""string""==typeof e&&D.test(e)?w(e):e||[],!1).length}});var q,L=/^(?:\s*(<[\w\W]+>)[^>]*|#([\w-]+))$/;(w.fn.init=function(e,t,n){var i,o;if(!e)return this;if(n=n||q,""string""==typeof e){if(!(i=""<""===e[0]&&"">""===e[e.length-1]&&e.length>=3?[null,e,null]:L.exec(e))||!i[1]&&t)return!t||t.jquery?(t||n).find(e):this.constructor(t).find(e);if(i[1]){if(t=t instanceof w?t[0]:t,w.merge(this,w.parseHTML(i[1],t&&t.nodeType?t.ownerDocument||t:r,!0)),A.test(i[1])&&w.isPlainObject(t))for(i in t)g(this[i])?this[i](t[i]):this.attr(i,t[i]);return this}return(o=r.getElementById(i[2]))&&(this[0]=o,this.length=1),this}return e.nodeType?(this[0]=e,this.length=1,this):g(e)?void 0!==n.ready?n.ready(e):e(w):w.makeArray(e,this)}).prototype=w.fn,q=w(r);var H=/^(?:parents|prev(?:Until|All))/,O={children:!0,contents:!0,next:!0,prev:!0};w.fn.extend({has:function(e){var t=w(e,this),n=t.length;return this.filter(function(){for(var e=0;e<n;e++)if(w.contains(this,t[e]))return!0})},closest:function(e,t){var n,r=0,i=this.length,o=[],a=""string""!=typeof e&&w(e);if(!D.test(e))for(;r<i;r++)for(n=this[r];n&&n!==t;n=n.parentNode)if(n.nodeType<11&&(a?a.index(n)>-1:1===n.nodeType&&w.find.matchesSelector(n,e))){o.push(n);break}return this.pushStack(o.length>1?w.uniqueSort(o):o)},index:function(e){return e?""string""==typeof e?u.call(w(e),this[0]):u.call(this,e.jquery?e[0]:e):this[0]&&this[0].parentNode?this.first().prevAll().length:-1},add:function(e,t){return this.pushStack(w.uniqueSort(w.merge(this.get(),w(e,t))))},addBack:function(e){return this.add(null==e?this.prevObject:this.prevObject.filter(e))}});function P(e,t){while((e=e[t])&&1!==e.nodeType);return e}w.each({parent:function(e){var t=e.parentNode;return t&&11!==t.nodeType?t:null},parents:function(e){return k(e,""parentNode"")},parentsUntil:function(e,t,n){return k(e,""parentNode"",n)},next:function(e){return P(e,""nextSibling"")},prev:function(e){return P(e,""previousSibling"")},nextAll:function(e){return k(e,""nextSibling"")},prevAll:function(e){return k(e,""previousSibling"")},nextUntil:function(e,t,n){return k(e,""nextSibling"",n)},prevUntil:function(e,t,n){return k(e,""previousSibling"",n)},siblings:function(e){return S((e.parentNode||{}).firstChild,e)},children:function(e){return S(e.firstChild)},contents:function(e){return N(e,""iframe"")?e.contentDocument:(N(e,""template"")&&(e=e.content||e),w.merge([],e.childNodes))}},function(e,t){w.fn[e]=function(n,r){var i=w.map(this,t,n);return""Until""!==e.slice(-5)&&(r=n),r&&""string""==typeof r&&(i=w.filter(r,i)),this.length>1&&(O[e]||w.uniqueSort(i),H.test(e)&&i.reverse()),this.pushStack(i)}});var M=/[^\x20\t\r\n\f]+/g;function R(e){var t={};return w.each(e.match(M)||[],function(e,n){t[n]=!0}),t}w.Callbacks=function(e){e=""string""==typeof e?R(e):w.extend({},e);var t,n,r,i,o=[],a=[],s=-1,u=function(){for(i=i||e.once,r=t=!0;a.length;s=-1){n=a.shift();while(++s<o.length)!1===o[s].apply(n[0],n[1])&&e.stopOnFalse&&(s=o.length,n=!1)}e.memory||(n=!1),t=!1,i&&(o=n?[]:"""")},l={add:function(){return o&&(n&&!t&&(s=o.length-1,a.push(n)),function t(n){w.each(n,function(n,r){g(r)?e.unique&&l.has(r)||o.push(r):r&&r.length&&""string""!==x(r)&&t(r)})}(arguments),n&&!t&&u()),this},remove:function(){return w.each(arguments,function(e,t){var n;while((n=w.inArray(t,o,n))>-1)o.splice(n,1),n<=s&&s--}),this},has:function(e){return e?w.inArray(e,o)>-1:o.length>0},empty:function(){return o&&(o=[]),this},disable:function(){return i=a=[],o=n="""",this},disabled:function(){return!o},lock:function(){return i=a=[],n||t||(o=n=""""),this},locked:function(){return!!i},fireWith:function(e,n){return i||(n=[e,(n=n||[]).slice?n.slice():n],a.push(n),t||u()),this},fire:function(){return l.fireWith(this,arguments),this},fired:function(){return!!r}};return l};function I(e){return e}function W(e){throw e}function $(e,t,n,r){var i;try{e&&g(i=e.promise)?i.call(e).done(t).fail(n):e&&g(i=e.then)?i.call(e,t,n):t.apply(void 0,[e].slice(r))}catch(e){n.apply(void 0,[e])}}w.extend({Deferred:function(t){var n=[[""notify"",""progress"",w.Callbacks(""memory""),w.Callbacks(""memory""),2],[""resolve"",""done"",w.Callbacks(""once memory""),w.Callbacks(""once memory""),0,""resolved""],[""reject"",""fail"",w.Callbacks(""once memory""),w.Callbacks(""once memory""),1,""rejected""]],r=""pending"",i={state:function(){return r},always:function(){return o.done(arguments).fail(arguments),this},""catch"":function(e){return i.then(null,e)},pipe:function(){var e=arguments;return w.Deferred(function(t){w.each(n,function(n,r){var i=g(e[r[4]])&&e[r[4]];o[r[1]](function(){var e=i&&i.apply(this,arguments);e&&g(e.promise)?e.promise().progress(t.notify).done(t.resolve).fail(t.reject):t[r[0]+""With""](this,i?[e]:arguments)})}),e=null}).promise()},then:function(t,r,i){var o=0;function a(t,n,r,i){return function(){var s=this,u=arguments,l=function(){var e,l;if(!(t<o)){if((e=r.apply(s,u))===n.promise())throw new TypeError(""Thenable self-resolution"");l=e&&(""object""==typeof e||""function""==typeof e)&&e.then,g(l)?i?l.call(e,a(o,n,I,i),a(o,n,W,i)):(o++,l.call(e,a(o,n,I,i),a(o,n,W,i),a(o,n,I,n.notifyWith))):(r!==I&&(s=void 0,u=[e]),(i||n.resolveWith)(s,u))}},c=i?l:function(){try{l()}catch(e){w.Deferred.exceptionHook&&w.Deferred.exceptionHook(e,c.stackTrace),t+1>=o&&(r!==W&&(s=void 0,u=[e]),n.rejectWith(s,u))}};t?c():(w.Deferred.getStackHook&&(c.stackTrace=w.Deferred.getStackHook()),e.setTimeout(c))}}return w.Deferred(function(e){n[0][3].add(a(0,e,g(i)?i:I,e.notifyWith)),n[1][3].add(a(0,e,g(t)?t:I)),n[2][3].add(a(0,e,g(r)?r:W))}).promise()},promise:function(e){return null!=e?w.extend(e,i):i}},o={};return w.each(n,function(e,t){var a=t[2],s=t[5];i[t[1]]=a.add,s&&a.add(function(){r=s},n[3-e][2].disable,n[3-e][3].disable,n[0][2].lock,n[0][3].lock),a.add(t[3].fire),o[t[0]]=function(){return o[t[0]+""With""](this===o?void 0:this,arguments),this},o[t[0]+""With""]=a.fireWith}),i.promise(o),t&&t.call(o,o),o},when:function(e){var t=arguments.length,n=t,r=Array(n),i=o.call(arguments),a=w.Deferred(),s=function(e){return function(n){r[e]=this,i[e]=arguments.length>1?o.call(arguments):n,--t||a.resolveWith(r,i)}};if(t<=1&&($(e,a.done(s(n)).resolve,a.reject,!t),""pending""===a.state()||g(i[n]&&i[n].then)))return a.then();while(n--)$(i[n],s(n),a.reject);return a.promise()}});var B=/^(Eval|Internal|Range|Reference|Syntax|Type|URI)Error$/;w.Deferred.exceptionHook=function(t,n){e.console&&e.console.warn&&t&&B.test(t.name)&&e.console.warn(""jQuery.Deferred exception: ""+t.message,t.stack,n)},w.readyException=function(t){e.setTimeout(function(){throw t})};var F=w.Deferred();w.fn.ready=function(e){return F.then(e)[""catch""](function(e){w.readyException(e)}),this},w.extend({isReady:!1,readyWait:1,ready:function(e){(!0===e?--w.readyWait:w.isReady)||(w.isReady=!0,!0!==e&&--w.readyWait>0||F.resolveWith(r,[w]))}}),w.ready.then=F.then;function _(){r.removeEventListener(""DOMContentLoaded"",_),e.removeEventListener(""load"",_),w.ready()}""complete""===r.readyState||""loading""!==r.readyState&&!r.documentElement.doScroll?e.setTimeout(w.ready):(r.addEventListener(""DOMContentLoaded"",_),e.addEventListener(""load"",_));var z=function(e,t,n,r,i,o,a){var s=0,u=e.length,l=null==n;if(""object""===x(n)){i=!0;for(s in n)z(e,t,s,n[s],!0,o,a)}else if(void 0!==r&&(i=!0,g(r)||(a=!0),l&&(a?(t.call(e,r),t=null):(l=t,t=function(e,t,n){return l.call(w(e),n)})),t))for(;s<u;s++)t(e[s],n,a?r:r.call(e[s],s,t(e[s],n)));return i?e:l?t.call(e):u?t(e[0],n):o},X=/^-ms-/,U=/-([a-z])/g;function V(e,t){return t.toUpperCase()}function G(e){return e.replace(X,""ms-"").replace(U,V)}var Y=function(e){return 1===e.nodeType||9===e.nodeType||!+e.nodeType};function Q(){this.expando=w.expando+Q.uid++}Q.uid=1,Q.prototype={cache:function(e){var t=e[this.expando];return t||(t={},Y(e)&&(e.nodeType?e[this.expando]=t:Object.defineProperty(e,this.expando,{value:t,configurable:!0}))),t},set:function(e,t,n){var r,i=this.cache(e);if(""string""==typeof t)i[G(t)]=n;else for(r in t)i[G(r)]=t[r];return i},get:function(e,t){return void 0===t?this.cache(e):e[this.expando]&&e[this.expando][G(t)]},access:function(e,t,n){return void 0===t||t&&""string""==typeof t&&void 0===n?this.get(e,t):(this.set(e,t,n),void 0!==n?n:t)},remove:function(e,t){var n,r=e[this.expando];if(void 0!==r){if(void 0!==t){n=(t=Array.isArray(t)?t.map(G):(t=G(t))in r?[t]:t.match(M)||[]).length;while(n--)delete r[t[n]]}(void 0===t||w.isEmptyObject(r))&&(e.nodeType?e[this.expando]=void 0:delete e[this.expando])}},hasData:function(e){var t=e[this.expando];return void 0!==t&&!w.isEmptyObject(t)}};var J=new Q,K=new Q,Z=/^(?:\{[\w\W]*\}|\[[\w\W]*\])$/,ee=/[A-Z]/g;function te(e){return""true""===e||""false""!==e&&(""null""===e?null:e===+e+""""?+e:Z.test(e)?JSON.parse(e):e)}function ne(e,t,n){var r;if(void 0===n&&1===e.nodeType)if(r=""data-""+t.replace(ee,""-$&"").toLowerCase(),""string""==typeof(n=e.getAttribute(r))){try{n=te(n)}catch(e){}K.set(e,t,n)}else n=void 0;return n}w.extend({hasData:function(e){return K.hasData(e)||J.hasData(e)},data:function(e,t,n){return K.access(e,t,n)},removeData:function(e,t){K.remove(e,t)},_data:function(e,t,n){return J.access(e,t,n)},_removeData:function(e,t){J.remove(e,t)}}),w.fn.extend({data:function(e,t){var n,r,i,o=this[0],a=o&&o.attributes;if(void 0===e){if(this.length&&(i=K.get(o),1===o.nodeType&&!J.get(o,""hasDataAttrs""))){n=a.length;while(n--)a[n]&&0===(r=a[n].name).indexOf(""data-"")&&(r=G(r.slice(5)),ne(o,r,i[r]));J.set(o,""hasDataAttrs"",!0)}return i}return""object""==typeof e?this.each(function(){K.set(this,e)}):z(this,function(t){var n;if(o&&void 0===t){if(void 0!==(n=K.get(o,e)))return n;if(void 0!==(n=ne(o,e)))return n}else this.each(function(){K.set(this,e,t)})},null,t,arguments.length>1,null,!0)},removeData:function(e){return this.each(function(){K.remove(this,e)})}}),w.extend({queue:function(e,t,n){var r;if(e)return t=(t||""fx"")+""queue"",r=J.get(e,t),n&&(!r||Array.isArray(n)?r=J.access(e,t,w.makeArray(n)):r.push(n)),r||[]},dequeue:function(e,t){t=t||""fx"";var n=w.queue(e,t),r=n.length,i=n.shift(),o=w._queueHooks(e,t),a=function(){w.dequeue(e,t)};""inprogress""===i&&(i=n.shift(),r--),i&&(""fx""===t&&n.unshift(""inprogress""),delete o.stop,i.call(e,a,o)),!r&&o&&o.empty.fire()},_queueHooks:function(e,t){var n=t+""queueHooks"";return J.get(e,n)||J.access(e,n,{empty:w.Callbacks(""once memory"").add(function(){J.remove(e,[t+""queue"",n])})})}}),w.fn.extend({queue:function(e,t){var n=2;return""string""!=typeof e&&(t=e,e=""fx"",n--),arguments.length<n?w.queue(this[0],e):void 0===t?this:this.each(function(){var n=w.queue(this,e,t);w._queueHooks(this,e),""fx""===e&&""inprogress""!==n[0]&&w.dequeue(this,e)})},dequeue:function(e){return this.each(function(){w.dequeue(this,e)})},clearQueue:function(e){return this.queue(e||""fx"",[])},promise:function(e,t){var n,r=1,i=w.Deferred(),o=this,a=this.length,s=function(){--r||i.resolveWith(o,[o])};""string""!=typeof e&&(t=e,e=void 0),e=e||""fx"";while(a--)(n=J.get(o[a],e+""queueHooks""))&&n.empty&&(r++,n.empty.add(s));return s(),i.promise(t)}});var re=/[+-]?(?:\d*\.|)\d+(?:[eE][+-]?\d+|)/.source,ie=new RegExp(""^(?:([+-])=|)(""+re+"")([a-z%]*)$"",""i""),oe=[""Top"",""Right"",""Bottom"",""Left""],ae=function(e,t){return""none""===(e=t||e).style.display||""""===e.style.display&&w.contains(e.ownerDocument,e)&&""none""===w.css(e,""display"")},se=function(e,t,n,r){var i,o,a={};for(o in t)a[o]=e.style[o],e.style[o]=t[o];i=n.apply(e,r||[]);for(o in t)e.style[o]=a[o];return i};function ue(e,t,n,r){var i,o,a=20,s=r?function(){return r.cur()}:function(){return w.css(e,t,"""")},u=s(),l=n&&n[3]||(w.cssNumber[t]?"""":""px""),c=(w.cssNumber[t]||""px""!==l&&+u)&&ie.exec(w.css(e,t));if(c&&c[3]!==l){u/=2,l=l||c[3],c=+u||1;while(a--)w.style(e,t,c+l),(1-o)*(1-(o=s()/u||.5))<=0&&(a=0),c/=o;c*=2,w.style(e,t,c+l),n=n||[]}return n&&(c=+c||+u||0,i=n[1]?c+(n[1]+1)*n[2]:+n[2],r&&(r.unit=l,r.start=c,r.end=i)),i}var le={};function ce(e){var t,n=e.ownerDocument,r=e.nodeName,i=le[r];return i||(t=n.body.appendChild(n.createElement(r)),i=w.css(t,""display""),t.parentNode.removeChild(t),""none""===i&&(i=""block""),le[r]=i,i)}function fe(e,t){for(var n,r,i=[],o=0,a=e.length;o<a;o++)(r=e[o]).style&&(n=r.style.display,t?(""none""===n&&(i[o]=J.get(r,""display"")||null,i[o]||(r.style.display="""")),""""===r.style.display&&ae(r)&&(i[o]=ce(r))):""none""!==n&&(i[o]=""none"",J.set(r,""display"",n)));for(o=0;o<a;o++)null!=i[o]&&(e[o].style.display=i[o]);return e}w.fn.extend({show:function(){return fe(this,!0)},hide:function(){return fe(this)},toggle:function(e){return""boolean""==typeof e?e?this.show():this.hide():this.each(function(){ae(this)?w(this).show():w(this).hide()})}});var pe=/^(?:checkbox|radio)$/i,de=/<([a-z][^\/\0>\x20\t\r\n\f]+)/i,he=/^$|^module$|\/(?:java|ecma)script/i,ge={option:[1,""<select multiple='multiple'>"",""</select>""],thead:[1,""<table>"",""</table>""],col:[2,""<table><colgroup>"",""</colgroup></table>""],tr:[2,""<table><tbody>"",""</tbody></table>""],td:[3,""<table><tbody><tr>"",""</tr></tbody></table>""],_default:[0,"""",""""]};ge.optgroup=ge.option,ge.tbody=ge.tfoot=ge.colgroup=ge.caption=ge.thead,ge.th=ge.td;function ye(e,t){var n;return n=""undefined""!=typeof e.getElementsByTagName?e.getElementsByTagName(t||""*""):""undefined""!=typeof e.querySelectorAll?e.querySelectorAll(t||""*""):[],void 0===t||t&&N(e,t)?w.merge([e],n):n}function ve(e,t){for(var n=0,r=e.length;n<r;n++)J.set(e[n],""globalEval"",!t||J.get(t[n],""globalEval""))}var me=/<|&#?\w+;/;function xe(e,t,n,r,i){for(var o,a,s,u,l,c,f=t.createDocumentFragment(),p=[],d=0,h=e.length;d<h;d++)if((o=e[d])||0===o)if(""object""===x(o))w.merge(p,o.nodeType?[o]:o);else if(me.test(o)){a=a||f.appendChild(t.createElement(""div"")),s=(de.exec(o)||["""",""""])[1].toLowerCase(),u=ge[s]||ge._default,a.innerHTML=u[1]+w.htmlPrefilter(o)+u[2],c=u[0];while(c--)a=a.lastChild;w.merge(p,a.childNodes),(a=f.firstChild).textContent=""""}else p.push(t.createTextNode(o));f.textContent="""",d=0;while(o=p[d++])if(r&&w.inArray(o,r)>-1)i&&i.push(o);else if(l=w.contains(o.ownerDocument,o),a=ye(f.appendChild(o),""script""),l&&ve(a),n){c=0;while(o=a[c++])he.test(o.type||"""")&&n.push(o)}return f}!function(){var e=r.createDocumentFragment().appendChild(r.createElement(""div"")),t=r.createElement(""input"");t.setAttribute(""type"",""radio""),t.setAttribute(""checked"",""checked""),t.setAttribute(""name"",""t""),e.appendChild(t),h.checkClone=e.cloneNode(!0).cloneNode(!0).lastChild.checked,e.innerHTML=""<textarea>x</textarea>"",h.noCloneChecked=!!e.cloneNode(!0).lastChild.defaultValue}();var be=r.documentElement,we=/^key/,Te=/^(?:mouse|pointer|contextmenu|drag|drop)|click/,Ce=/^([^.]*)(?:\.(.+)|)/;function Ee(){return!0}function ke(){return!1}function Se(){try{return r.activeElement}catch(e){}}function De(e,t,n,r,i,o){var a,s;if(""object""==typeof t){""string""!=typeof n&&(r=r||n,n=void 0);for(s in t)De(e,s,n,r,t[s],o);return e}if(null==r&&null==i?(i=n,r=n=void 0):null==i&&(""string""==typeof n?(i=r,r=void 0):(i=r,r=n,n=void 0)),!1===i)i=ke;else if(!i)return e;return 1===o&&(a=i,(i=function(e){return w().off(e),a.apply(this,arguments)}).guid=a.guid||(a.guid=w.guid++)),e.each(function(){w.event.add(this,t,i,r,n)})}w.event={global:{},add:function(e,t,n,r,i){var o,a,s,u,l,c,f,p,d,h,g,y=J.get(e);if(y){n.handler&&(n=(o=n).handler,i=o.selector),i&&w.find.matchesSelector(be,i),n.guid||(n.guid=w.guid++),(u=y.events)||(u=y.events={}),(a=y.handle)||(a=y.handle=function(t){return""undefined""!=typeof w&&w.event.triggered!==t.type?w.event.dispatch.apply(e,arguments):void 0}),l=(t=(t||"""").match(M)||[""""]).length;while(l--)d=g=(s=Ce.exec(t[l])||[])[1],h=(s[2]||"""").split(""."").sort(),d&&(f=w.event.special[d]||{},d=(i?f.delegateType:f.bindType)||d,f=w.event.special[d]||{},c=w.extend({type:d,origType:g,data:r,handler:n,guid:n.guid,selector:i,needsContext:i&&w.expr.match.needsContext.test(i),namespace:h.join(""."")},o),(p=u[d])||((p=u[d]=[]).delegateCount=0,f.setup&&!1!==f.setup.call(e,r,h,a)||e.addEventListener&&e.addEventListener(d,a)),f.add&&(f.add.call(e,c),c.handler.guid||(c.handler.guid=n.guid)),i?p.splice(p.delegateCount++,0,c):p.push(c),w.event.global[d]=!0)}},remove:function(e,t,n,r,i){var o,a,s,u,l,c,f,p,d,h,g,y=J.hasData(e)&&J.get(e);if(y&&(u=y.events)){l=(t=(t||"""").match(M)||[""""]).length;while(l--)if(s=Ce.exec(t[l])||[],d=g=s[1],h=(s[2]||"""").split(""."").sort(),d){f=w.event.special[d]||{},p=u[d=(r?f.delegateType:f.bindType)||d]||[],s=s[2]&&new RegExp(""(^|\\.)""+h.join(""\\.(?:.*\\.|)"")+""(\\.|$)""),a=o=p.length;while(o--)c=p[o],!i&&g!==c.origType||n&&n.guid!==c.guid||s&&!s.test(c.namespace)||r&&r!==c.selector&&(""**""!==r||!c.selector)||(p.splice(o,1),c.selector&&p.delegateCount--,f.remove&&f.remove.call(e,c));a&&!p.length&&(f.teardown&&!1!==f.teardown.call(e,h,y.handle)||w.removeEvent(e,d,y.handle),delete u[d])}else for(d in u)w.event.remove(e,d+t[l],n,r,!0);w.isEmptyObject(u)&&J.remove(e,""handle events"")}},dispatch:function(e){var t=w.event.fix(e),n,r,i,o,a,s,u=new Array(arguments.length),l=(J.get(this,""events"")||{})[t.type]||[],c=w.event.special[t.type]||{};for(u[0]=t,n=1;n<arguments.length;n++)u[n]=arguments[n];if(t.delegateTarget=this,!c.preDispatch||!1!==c.preDispatch.call(this,t)){s=w.event.handlers.call(this,t,l),n=0;while((o=s[n++])&&!t.isPropagationStopped()){t.currentTarget=o.elem,r=0;while((a=o.handlers[r++])&&!t.isImmediatePropagationStopped())t.rnamespace&&!t.rnamespace.test(a.namespace)||(t.handleObj=a,t.data=a.data,void 0!==(i=((w.event.special[a.origType]||{}).handle||a.handler).apply(o.elem,u))&&!1===(t.result=i)&&(t.preventDefault(),t.stopPropagation()))}return c.postDispatch&&c.postDispatch.call(this,t),t.result}},handlers:function(e,t){var n,r,i,o,a,s=[],u=t.delegateCount,l=e.target;if(u&&l.nodeType&&!(""click""===e.type&&e.button>=1))for(;l!==this;l=l.parentNode||this)if(1===l.nodeType&&(""click""!==e.type||!0!==l.disabled)){for(o=[],a={},n=0;n<u;n++)void 0===a[i=(r=t[n]).selector+"" ""]&&(a[i]=r.needsContext?w(i,this).index(l)>-1:w.find(i,this,null,[l]).length),a[i]&&o.push(r);o.length&&s.push({elem:l,handlers:o})}return l=this,u<t.length&&s.push({elem:l,handlers:t.slice(u)}),s},addProp:function(e,t){Object.defineProperty(w.Event.prototype,e,{enumerable:!0,configurable:!0,get:g(t)?function(){if(this.originalEvent)return t(this.originalEvent)}:function(){if(this.originalEvent)return this.originalEvent[e]},set:function(t){Object.defineProperty(this,e,{enumerable:!0,configurable:!0,writable:!0,value:t})}})},fix:function(e){return e[w.expando]?e:new w.Event(e)},special:{load:{noBubble:!0},focus:{trigger:function(){if(this!==Se()&&this.focus)return this.focus(),!1},delegateType:""focusin""},blur:{trigger:function(){if(this===Se()&&this.blur)return this.blur(),!1},delegateType:""focusout""},click:{trigger:function(){if(""checkbox""===this.type&&this.click&&N(this,""input""))return this.click(),!1},_default:function(e){return N(e.target,""a"")}},beforeunload:{postDispatch:function(e){void 0!==e.result&&e.originalEvent&&(e.originalEvent.returnValue=e.result)}}}},w.removeEvent=function(e,t,n){e.removeEventListener&&e.removeEventListener(t,n)},w.Event=function(e,t){if(!(this instanceof w.Event))return new w.Event(e,t);e&&e.type?(this.originalEvent=e,this.type=e.type,this.isDefaultPrevented=e.defaultPrevented||void 0===e.defaultPrevented&&!1===e.returnValue?Ee:ke,this.target=e.target&&3===e.target.nodeType?e.target.parentNode:e.target,this.currentTarget=e.currentTarget,this.relatedTarget=e.relatedTarget):this.type=e,t&&w.extend(this,t),this.timeStamp=e&&e.timeStamp||Date.now(),this[w.expando]=!0},w.Event.prototype={constructor:w.Event,isDefaultPrevented:ke,isPropagationStopped:ke,isImmediatePropagationStopped:ke,isSimulated:!1,preventDefault:function(){var e=this.originalEvent;this.isDefaultPrevented=Ee,e&&!this.isSimulated&&e.preventDefault()},stopPropagation:function(){var e=this.originalEvent;this.isPropagationStopped=Ee,e&&!this.isSimulated&&e.stopPropagation()},stopImmediatePropagation:function(){var e=this.originalEvent;this.isImmediatePropagationStopped=Ee,e&&!this.isSimulated&&e.stopImmediatePropagation(),this.stopPropagation()}},w.each({altKey:!0,bubbles:!0,cancelable:!0,changedTouches:!0,ctrlKey:!0,detail:!0,eventPhase:!0,metaKey:!0,pageX:!0,pageY:!0,shiftKey:!0,view:!0,""char"":!0,charCode:!0,key:!0,keyCode:!0,button:!0,buttons:!0,clientX:!0,clientY:!0,offsetX:!0,offsetY:!0,pointerId:!0,pointerType:!0,screenX:!0,screenY:!0,targetTouches:!0,toElement:!0,touches:!0,which:function(e){var t=e.button;return null==e.which&&we.test(e.type)?null!=e.charCode?e.charCode:e.keyCode:!e.which&&void 0!==t&&Te.test(e.type)?1&t?1:2&t?3:4&t?2:0:e.which}},w.event.addProp),w.each({mouseenter:""mouseover"",mouseleave:""mouseout"",pointerenter:""pointerover"",pointerleave:""pointerout""},function(e,t){w.event.special[e]={delegateType:t,bindType:t,handle:function(e){var n,r=this,i=e.relatedTarget,o=e.handleObj;return i&&(i===r||w.contains(r,i))||(e.type=o.origType,n=o.handler.apply(this,arguments),e.type=t),n}}}),w.fn.extend({on:function(e,t,n,r){return De(this,e,t,n,r)},one:function(e,t,n,r){return De(this,e,t,n,r,1)},off:function(e,t,n){var r,i;if(e&&e.preventDefault&&e.handleObj)return r=e.handleObj,w(e.delegateTarget).off(r.namespace?r.origType+"".""+r.namespace:r.origType,r.selector,r.handler),this;if(""object""==typeof e){for(i in e)this.off(i,t,e[i]);return this}return!1!==t&&""function""!=typeof t||(n=t,t=void 0),!1===n&&(n=ke),this.each(function(){w.event.remove(this,e,n,t)})}});var Ne=/<(?!area|br|col|embed|hr|img|input|link|meta|param)(([a-z][^\/\0>\x20\t\r\n\f]*)[^>]*)\/>/gi,Ae=/<script|<style|<link/i,je=/checked\s*(?:[^=]|=\s*.checked.)/i,qe=/^\s*<!(?:\[CDATA\[|--)|(?:\]\]|--)>\s*$/g;function Le(e,t){return N(e,""table"")&&N(11!==t.nodeType?t:t.firstChild,""tr"")?w(e).children(""tbody"")[0]||e:e}function He(e){return e.type=(null!==e.getAttribute(""type""))+""/""+e.type,e}function Oe(e){return""true/""===(e.type||"""").slice(0,5)?e.type=e.type.slice(5):e.removeAttribute(""type""),e}function Pe(e,t){var n,r,i,o,a,s,u,l;if(1===t.nodeType){if(J.hasData(e)&&(o=J.access(e),a=J.set(t,o),l=o.events)){delete a.handle,a.events={};for(i in l)for(n=0,r=l[i].length;n<r;n++)w.event.add(t,i,l[i][n])}K.hasData(e)&&(s=K.access(e),u=w.extend({},s),K.set(t,u))}}function Me(e,t){var n=t.nodeName.toLowerCase();""input""===n&&pe.test(e.type)?t.checked=e.checked:""input""!==n&&""textarea""!==n||(t.defaultValue=e.defaultValue)}function Re(e,t,n,r){t=a.apply([],t);var i,o,s,u,l,c,f=0,p=e.length,d=p-1,y=t[0],v=g(y);if(v||p>1&&""string""==typeof y&&!h.checkClone&&je.test(y))return e.each(function(i){var o=e.eq(i);v&&(t[0]=y.call(this,i,o.html())),Re(o,t,n,r)});if(p&&(i=xe(t,e[0].ownerDocument,!1,e,r),o=i.firstChild,1===i.childNodes.length&&(i=o),o||r)){for(u=(s=w.map(ye(i,""script""),He)).length;f<p;f++)l=i,f!==d&&(l=w.clone(l,!0,!0),u&&w.merge(s,ye(l,""script""))),n.call(e[f],l,f);if(u)for(c=s[s.length-1].ownerDocument,w.map(s,Oe),f=0;f<u;f++)l=s[f],he.test(l.type||"""")&&!J.access(l,""globalEval"")&&w.contains(c,l)&&(l.src&&""module""!==(l.type||"""").toLowerCase()?w._evalUrl&&w._evalUrl(l.src):m(l.textContent.replace(qe,""""),c,l))}return e}function Ie(e,t,n){for(var r,i=t?w.filter(t,e):e,o=0;null!=(r=i[o]);o++)n||1!==r.nodeType||w.cleanData(ye(r)),r.parentNode&&(n&&w.contains(r.ownerDocument,r)&&ve(ye(r,""script"")),r.parentNode.removeChild(r));return e}w.extend({htmlPrefilter:function(e){return e.replace(Ne,""<$1></$2>"")},clone:function(e,t,n){var r,i,o,a,s=e.cloneNode(!0),u=w.contains(e.ownerDocument,e);if(!(h.noCloneChecked||1!==e.nodeType&&11!==e.nodeType||w.isXMLDoc(e)))for(a=ye(s),r=0,i=(o=ye(e)).length;r<i;r++)Me(o[r],a[r]);if(t)if(n)for(o=o||ye(e),a=a||ye(s),r=0,i=o.length;r<i;r++)Pe(o[r],a[r]);else Pe(e,s);return(a=ye(s,""script"")).length>0&&ve(a,!u&&ye(e,""script"")),s},cleanData:function(e){for(var t,n,r,i=w.event.special,o=0;void 0!==(n=e[o]);o++)if(Y(n)){if(t=n[J.expando]){if(t.events)for(r in t.events)i[r]?w.event.remove(n,r):w.removeEvent(n,r,t.handle);n[J.expando]=void 0}n[K.expando]&&(n[K.expando]=void 0)}}}),w.fn.extend({detach:function(e){return Ie(this,e,!0)},remove:function(e){return Ie(this,e)},text:function(e){return z(this,function(e){return void 0===e?w.text(this):this.empty().each(function(){1!==this.nodeType&&11!==this.nodeType&&9!==this.nodeType||(this.textContent=e)})},null,e,arguments.length)},append:function(){return Re(this,arguments,function(e){1!==this.nodeType&&11!==this.nodeType&&9!==this.nodeType||Le(this,e).appendChild(e)})},prepend:function(){return Re(this,arguments,function(e){if(1===this.nodeType||11===this.nodeType||9===this.nodeType){var t=Le(this,e);t.insertBefore(e,t.firstChild)}})},before:function(){return Re(this,arguments,function(e){this.parentNode&&this.parentNode.insertBefore(e,this)})},after:function(){return Re(this,arguments,function(e){this.parentNode&&this.parentNode.insertBefore(e,this.nextSibling)})},empty:function(){for(var e,t=0;null!=(e=this[t]);t++)1===e.nodeType&&(w.cleanData(ye(e,!1)),e.textContent="""");return this},clone:function(e,t){return e=null!=e&&e,t=null==t?e:t,this.map(function(){return w.clone(this,e,t)})},html:function(e){return z(this,function(e){var t=this[0]||{},n=0,r=this.length;if(void 0===e&&1===t.nodeType)return t.innerHTML;if(""string""==typeof e&&!Ae.test(e)&&!ge[(de.exec(e)||["""",""""])[1].toLowerCase()]){e=w.htmlPrefilter(e);try{for(;n<r;n++)1===(t=this[n]||{}).nodeType&&(w.cleanData(ye(t,!1)),t.innerHTML=e);t=0}catch(e){}}t&&this.empty().append(e)},null,e,arguments.length)},replaceWith:function(){var e=[];return Re(this,arguments,function(t){var n=this.parentNode;w.inArray(this,e)<0&&(w.cleanData(ye(this)),n&&n.replaceChild(t,this))},e)}}),w.each({appendTo:""append"",prependTo:""prepend"",insertBefore:""before"",insertAfter:""after"",replaceAll:""replaceWith""},function(e,t){w.fn[e]=function(e){for(var n,r=[],i=w(e),o=i.length-1,a=0;a<=o;a++)n=a===o?this:this.clone(!0),w(i[a])[t](n),s.apply(r,n.get());return this.pushStack(r)}});var We=new RegExp(""^(""+re+"")(?!px)[a-z%]+$"",""i""),$e=function(t){var n=t.ownerDocument.defaultView;return n&&n.opener||(n=e),n.getComputedStyle(t)},Be=new RegExp(oe.join(""|""),""i"");!function(){function t(){if(c){l.style.cssText=""position:absolute;left:-11111px;width:60px;margin-top:1px;padding:0;border:0"",c.style.cssText=""position:relative;display:block;box-sizing:border-box;overflow:scroll;margin:auto;border:1px;padding:1px;width:60%;top:1%"",be.appendChild(l).appendChild(c);var t=e.getComputedStyle(c);i=""1%""!==t.top,u=12===n(t.marginLeft),c.style.right=""60%"",s=36===n(t.right),o=36===n(t.width),c.style.position=""absolute"",a=36===c.offsetWidth||""absolute"",be.removeChild(l),c=null}}function n(e){return Math.round(parseFloat(e))}var i,o,a,s,u,l=r.createElement(""div""),c=r.createElement(""div"");c.style&&(c.style.backgroundClip=""content-box"",c.cloneNode(!0).style.backgroundClip="""",h.clearCloneStyle=""content-box""===c.style.backgroundClip,w.extend(h,{boxSizingReliable:function(){return t(),o},pixelBoxStyles:function(){return t(),s},pixelPosition:function(){return t(),i},reliableMarginLeft:function(){return t(),u},scrollboxSize:function(){return t(),a}}))}();function Fe(e,t,n){var r,i,o,a,s=e.style;return(n=n||$e(e))&&(""""!==(a=n.getPropertyValue(t)||n[t])||w.contains(e.ownerDocument,e)||(a=w.style(e,t)),!h.pixelBoxStyles()&&We.test(a)&&Be.test(t)&&(r=s.width,i=s.minWidth,o=s.maxWidth,s.minWidth=s.maxWidth=s.width=a,a=n.width,s.width=r,s.minWidth=i,s.maxWidth=o)),void 0!==a?a+"""":a}function _e(e,t){return{get:function(){if(!e())return(this.get=t).apply(this,arguments);delete this.get}}}var ze=/^(none|table(?!-c[ea]).+)/,Xe=/^--/,Ue={position:""absolute"",visibility:""hidden"",display:""block""},Ve={letterSpacing:""0"",fontWeight:""400""},Ge=[""Webkit"",""Moz"",""ms""],Ye=r.createElement(""div"").style;function Qe(e){if(e in Ye)return e;var t=e[0].toUpperCase()+e.slice(1),n=Ge.length;while(n--)if((e=Ge[n]+t)in Ye)return e}function Je(e){var t=w.cssProps[e];return t||(t=w.cssProps[e]=Qe(e)||e),t}function Ke(e,t,n){var r=ie.exec(t);return r?Math.max(0,r[2]-(n||0))+(r[3]||""px""):t}function Ze(e,t,n,r,i,o){var a=""width""===t?1:0,s=0,u=0;if(n===(r?""border"":""content""))return 0;for(;a<4;a+=2)""margin""===n&&(u+=w.css(e,n+oe[a],!0,i)),r?(""content""===n&&(u-=w.css(e,""padding""+oe[a],!0,i)),""margin""!==n&&(u-=w.css(e,""border""+oe[a]+""Width"",!0,i))):(u+=w.css(e,""padding""+oe[a],!0,i),""padding""!==n?u+=w.css(e,""border""+oe[a]+""Width"",!0,i):s+=w.css(e,""border""+oe[a]+""Width"",!0,i));return!r&&o>=0&&(u+=Math.max(0,Math.ceil(e[""offset""+t[0].toUpperCase()+t.slice(1)]-o-u-s-.5))),u}function et(e,t,n){var r=$e(e),i=Fe(e,t,r),o=""border-box""===w.css(e,""boxSizing"",!1,r),a=o;if(We.test(i)){if(!n)return i;i=""auto""}return a=a&&(h.boxSizingReliable()||i===e.style[t]),(""auto""===i||!parseFloat(i)&&""inline""===w.css(e,""display"",!1,r))&&(i=e[""offset""+t[0].toUpperCase()+t.slice(1)],a=!0),(i=parseFloat(i)||0)+Ze(e,t,n||(o?""border"":""content""),a,r,i)+""px""}w.extend({cssHooks:{opacity:{get:function(e,t){if(t){var n=Fe(e,""opacity"");return""""===n?""1"":n}}}},cssNumber:{animationIterationCount:!0,columnCount:!0,fillOpacity:!0,flexGrow:!0,flexShrink:!0,fontWeight:!0,lineHeight:!0,opacity:!0,order:!0,orphans:!0,widows:!0,zIndex:!0,zoom:!0},cssProps:{},style:function(e,t,n,r){if(e&&3!==e.nodeType&&8!==e.nodeType&&e.style){var i,o,a,s=G(t),u=Xe.test(t),l=e.style;if(u||(t=Je(s)),a=w.cssHooks[t]||w.cssHooks[s],void 0===n)return a&&""get""in a&&void 0!==(i=a.get(e,!1,r))?i:l[t];""string""==(o=typeof n)&&(i=ie.exec(n))&&i[1]&&(n=ue(e,t,i),o=""number""),null!=n&&n===n&&(""number""===o&&(n+=i&&i[3]||(w.cssNumber[s]?"""":""px"")),h.clearCloneStyle||""""!==n||0!==t.indexOf(""background"")||(l[t]=""inherit""),a&&""set""in a&&void 0===(n=a.set(e,n,r))||(u?l.setProperty(t,n):l[t]=n))}},css:function(e,t,n,r){var i,o,a,s=G(t);return Xe.test(t)||(t=Je(s)),(a=w.cssHooks[t]||w.cssHooks[s])&&""get""in a&&(i=a.get(e,!0,n)),void 0===i&&(i=Fe(e,t,r)),""normal""===i&&t in Ve&&(i=Ve[t]),""""===n||n?(o=parseFloat(i),!0===n||isFinite(o)?o||0:i):i}}),w.each([""height"",""width""],function(e,t){w.cssHooks[t]={get:function(e,n,r){if(n)return!ze.test(w.css(e,""display""))||e.getClientRects().length&&e.getBoundingClientRect().width?et(e,t,r):se(e,Ue,function(){return et(e,t,r)})},set:function(e,n,r){var i,o=$e(e),a=""border-box""===w.css(e,""boxSizing"",!1,o),s=r&&Ze(e,t,r,a,o);return a&&h.scrollboxSize()===o.position&&(s-=Math.ceil(e[""offset""+t[0].toUpperCase()+t.slice(1)]-parseFloat(o[t])-Ze(e,t,""border"",!1,o)-.5)),s&&(i=ie.exec(n))&&""px""!==(i[3]||""px"")&&(e.style[t]=n,n=w.css(e,t)),Ke(e,n,s)}}}),w.cssHooks.marginLeft=_e(h.reliableMarginLeft,function(e,t){if(t)return(parseFloat(Fe(e,""marginLeft""))||e.getBoundingClientRect().left-se(e,{marginLeft:0},function(){return e.getBoundingClientRect().left}))+""px""}),w.each({margin:"""",padding:"""",border:""Width""},function(e,t){w.cssHooks[e+t]={expand:function(n){for(var r=0,i={},o=""string""==typeof n?n.split("" ""):[n];r<4;r++)i[e+oe[r]+t]=o[r]||o[r-2]||o[0];return i}},""margin""!==e&&(w.cssHooks[e+t].set=Ke)}),w.fn.extend({css:function(e,t){return z(this,function(e,t,n){var r,i,o={},a=0;if(Array.isArray(t)){for(r=$e(e),i=t.length;a<i;a++)o[t[a]]=w.css(e,t[a],!1,r);return o}return void 0!==n?w.style(e,t,n):w.css(e,t)},e,t,arguments.length>1)}});function tt(e,t,n,r,i){return new tt.prototype.init(e,t,n,r,i)}w.Tween=tt,tt.prototype={constructor:tt,init:function(e,t,n,r,i,o){this.elem=e,this.prop=n,this.easing=i||w.easing._default,this.options=t,this.start=this.now=this.cur(),this.end=r,this.unit=o||(w.cssNumber[n]?"""":""px"")},cur:function(){var e=tt.propHooks[this.prop];return e&&e.get?e.get(this):tt.propHooks._default.get(this)},run:function(e){var t,n=tt.propHooks[this.prop];return this.options.duration?this.pos=t=w.easing[this.easing](e,this.options.duration*e,0,1,this.options.duration):this.pos=t=e,this.now=(this.end-this.start)*t+this.start,this.options.step&&this.options.step.call(this.elem,this.now,this),n&&n.set?n.set(this):tt.propHooks._default.set(this),this}},tt.prototype.init.prototype=tt.prototype,tt.propHooks={_default:{get:function(e){var t;return 1!==e.elem.nodeType||null!=e.elem[e.prop]&&null==e.elem.style[e.prop]?e.elem[e.prop]:(t=w.css(e.elem,e.prop,""""))&&""auto""!==t?t:0},set:function(e){w.fx.step[e.prop]?w.fx.step[e.prop](e):1!==e.elem.nodeType||null==e.elem.style[w.cssProps[e.prop]]&&!w.cssHooks[e.prop]?e.elem[e.prop]=e.now:w.style(e.elem,e.prop,e.now+e.unit)}}},tt.propHooks.scrollTop=tt.propHooks.scrollLeft={set:function(e){e.elem.nodeType&&e.elem.parentNode&&(e.elem[e.prop]=e.now)}},w.easing={linear:function(e){return e},swing:function(e){return.5-Math.cos(e*Math.PI)/2},_default:""swing""},w.fx=tt.prototype.init,w.fx.step={};var nt,rt,it=/^(?:toggle|show|hide)$/,ot=/queueHooks$/;function at(){rt&&(!1===r.hidden&&e.requestAnimationFrame?e.requestAnimationFrame(at):e.setTimeout(at,w.fx.interval),w.fx.tick())}function st(){return e.setTimeout(function(){nt=void 0}),nt=Date.now()}function ut(e,t){var n,r=0,i={height:e};for(t=t?1:0;r<4;r+=2-t)i[""margin""+(n=oe[r])]=i[""padding""+n]=e;return t&&(i.opacity=i.width=e),i}function lt(e,t,n){for(var r,i=(pt.tweeners[t]||[]).concat(pt.tweeners[""*""]),o=0,a=i.length;o<a;o++)if(r=i[o].call(n,t,e))return r}function ct(e,t,n){var r,i,o,a,s,u,l,c,f=""width""in t||""height""in t,p=this,d={},h=e.style,g=e.nodeType&&ae(e),y=J.get(e,""fxshow"");n.queue||(null==(a=w._queueHooks(e,""fx"")).unqueued&&(a.unqueued=0,s=a.empty.fire,a.empty.fire=function(){a.unqueued||s()}),a.unqueued++,p.always(function(){p.always(function(){a.unqueued--,w.queue(e,""fx"").length||a.empty.fire()})}));for(r in t)if(i=t[r],it.test(i)){if(delete t[r],o=o||""toggle""===i,i===(g?""hide"":""show"")){if(""show""!==i||!y||void 0===y[r])continue;g=!0}d[r]=y&&y[r]||w.style(e,r)}if((u=!w.isEmptyObject(t))||!w.isEmptyObject(d)){f&&1===e.nodeType&&(n.overflow=[h.overflow,h.overflowX,h.overflowY],null==(l=y&&y.display)&&(l=J.get(e,""display"")),""none""===(c=w.css(e,""display""))&&(l?c=l:(fe([e],!0),l=e.style.display||l,c=w.css(e,""display""),fe([e]))),(""inline""===c||""inline-block""===c&&null!=l)&&""none""===w.css(e,""float"")&&(u||(p.done(function(){h.display=l}),null==l&&(c=h.display,l=""none""===c?"""":c)),h.display=""inline-block"")),n.overflow&&(h.overflow=""hidden"",p.always(function(){h.overflow=n.overflow[0],h.overflowX=n.overflow[1],h.overflowY=n.overflow[2]})),u=!1;for(r in d)u||(y?""hidden""in y&&(g=y.hidden):y=J.access(e,""fxshow"",{display:l}),o&&(y.hidden=!g),g&&fe([e],!0),p.done(function(){g||fe([e]),J.remove(e,""fxshow"");for(r in d)w.style(e,r,d[r])})),u=lt(g?y[r]:0,r,p),r in y||(y[r]=u.start,g&&(u.end=u.start,u.start=0))}}function ft(e,t){var n,r,i,o,a;for(n in e)if(r=G(n),i=t[r],o=e[n],Array.isArray(o)&&(i=o[1],o=e[n]=o[0]),n!==r&&(e[r]=o,delete e[n]),(a=w.cssHooks[r])&&""expand""in a){o=a.expand(o),delete e[r];for(n in o)n in e||(e[n]=o[n],t[n]=i)}else t[r]=i}function pt(e,t,n){var r,i,o=0,a=pt.prefilters.length,s=w.Deferred().always(function(){delete u.elem}),u=function(){if(i)return!1;for(var t=nt||st(),n=Math.max(0,l.startTime+l.duration-t),r=1-(n/l.duration||0),o=0,a=l.tweens.length;o<a;o++)l.tweens[o].run(r);return s.notifyWith(e,[l,r,n]),r<1&&a?n:(a||s.notifyWith(e,[l,1,0]),s.resolveWith(e,[l]),!1)},l=s.promise({elem:e,props:w.extend({},t),opts:w.extend(!0,{specialEasing:{},easing:w.easing._default},n),originalProperties:t,originalOptions:n,startTime:nt||st(),duration:n.duration,tweens:[],createTween:function(t,n){var r=w.Tween(e,l.opts,t,n,l.opts.specialEasing[t]||l.opts.easing);return l.tweens.push(r),r},stop:function(t){var n=0,r=t?l.tweens.length:0;if(i)return this;for(i=!0;n<r;n++)l.tweens[n].run(1);return t?(s.notifyWith(e,[l,1,0]),s.resolveWith(e,[l,t])):s.rejectWith(e,[l,t]),this}}),c=l.props;for(ft(c,l.opts.specialEasing);o<a;o++)if(r=pt.prefilters[o].call(l,e,c,l.opts))return g(r.stop)&&(w._queueHooks(l.elem,l.opts.queue).stop=r.stop.bind(r)),r;return w.map(c,lt,l),g(l.opts.start)&&l.opts.start.call(e,l),l.progress(l.opts.progress).done(l.opts.done,l.opts.complete).fail(l.opts.fail).always(l.opts.always),w.fx.timer(w.extend(u,{elem:e,anim:l,queue:l.opts.queue})),l}w.Animation=w.extend(pt,{tweeners:{""*"":[function(e,t){var n=this.createTween(e,t);return ue(n.elem,e,ie.exec(t),n),n}]},tweener:function(e,t){g(e)?(t=e,e=[""*""]):e=e.match(M);for(var n,r=0,i=e.length;r<i;r++)n=e[r],pt.tweeners[n]=pt.tweeners[n]||[],pt.tweeners[n].unshift(t)},prefilters:[ct],prefilter:function(e,t){t?pt.prefilters.unshift(e):pt.prefilters.push(e)}}),w.speed=function(e,t,n){var r=e&&""object""==typeof e?w.extend({},e):{complete:n||!n&&t||g(e)&&e,duration:e,easing:n&&t||t&&!g(t)&&t};return w.fx.off?r.duration=0:""number""!=typeof r.duration&&(r.duration in w.fx.speeds?r.duration=w.fx.speeds[r.duration]:r.duration=w.fx.speeds._default),null!=r.queue&&!0!==r.queue||(r.queue=""fx""),r.old=r.complete,r.complete=function(){g(r.old)&&r.old.call(this),r.queue&&w.dequeue(this,r.queue)},r},w.fn.extend({fadeTo:function(e,t,n,r){return this.filter(ae).css(""opacity"",0).show().end().animate({opacity:t},e,n,r)},animate:function(e,t,n,r){var i=w.isEmptyObject(e),o=w.speed(t,n,r),a=function(){var t=pt(this,w.extend({},e),o);(i||J.get(this,""finish""))&&t.stop(!0)};return a.finish=a,i||!1===o.queue?this.each(a):this.queue(o.queue,a)},stop:function(e,t,n){var r=function(e){var t=e.stop;delete e.stop,t(n)};return""string""!=typeof e&&(n=t,t=e,e=void 0),t&&!1!==e&&this.queue(e||""fx"",[]),this.each(function(){var t=!0,i=null!=e&&e+""queueHooks"",o=w.timers,a=J.get(this);if(i)a[i]&&a[i].stop&&r(a[i]);else for(i in a)a[i]&&a[i].stop&&ot.test(i)&&r(a[i]);for(i=o.length;i--;)o[i].elem!==this||null!=e&&o[i].queue!==e||(o[i].anim.stop(n),t=!1,o.splice(i,1));!t&&n||w.dequeue(this,e)})},finish:function(e){return!1!==e&&(e=e||""fx""),this.each(function(){var t,n=J.get(this),r=n[e+""queue""],i=n[e+""queueHooks""],o=w.timers,a=r?r.length:0;for(n.finish=!0,w.queue(this,e,[]),i&&i.stop&&i.stop.call(this,!0),t=o.length;t--;)o[t].elem===this&&o[t].queue===e&&(o[t].anim.stop(!0),o.splice(t,1));for(t=0;t<a;t++)r[t]&&r[t].finish&&r[t].finish.call(this);delete n.finish})}}),w.each([""toggle"",""show"",""hide""],function(e,t){var n=w.fn[t];w.fn[t]=function(e,r,i){return null==e||""boolean""==typeof e?n.apply(this,arguments):this.animate(ut(t,!0),e,r,i)}}),w.each({slideDown:ut(""show""),slideUp:ut(""hide""),slideToggle:ut(""toggle""),fadeIn:{opacity:""show""},fadeOut:{opacity:""hide""},fadeToggle:{opacity:""toggle""}},function(e,t){w.fn[e]=function(e,n,r){return this.animate(t,e,n,r)}}),w.timers=[],w.fx.tick=function(){var e,t=0,n=w.timers;for(nt=Date.now();t<n.length;t++)(e=n[t])()||n[t]!==e||n.splice(t--,1);n.length||w.fx.stop(),nt=void 0},w.fx.timer=function(e){w.timers.push(e),w.fx.start()},w.fx.interval=13,w.fx.start=function(){rt||(rt=!0,at())},w.fx.stop=function(){rt=null},w.fx.speeds={slow:600,fast:200,_default:400},w.fn.delay=function(t,n){return t=w.fx?w.fx.speeds[t]||t:t,n=n||""fx"",this.queue(n,function(n,r){var i=e.setTimeout(n,t);r.stop=function(){e.clearTimeout(i)}})},function(){var e=r.createElement(""input""),t=r.createElement(""select"").appendChild(r.createElement(""option""));e.type=""checkbox"",h.checkOn=""""!==e.value,h.optSelected=t.selected,(e=r.createElement(""input"")).value=""t"",e.type=""radio"",h.radioValue=""t""===e.value}();var dt,ht=w.expr.attrHandle;w.fn.extend({attr:function(e,t){return z(this,w.attr,e,t,arguments.length>1)},removeAttr:function(e){return this.each(function(){w.removeAttr(this,e)})}}),w.extend({attr:function(e,t,n){var r,i,o=e.nodeType;if(3!==o&&8!==o&&2!==o)return""undefined""==typeof e.getAttribute?w.prop(e,t,n):(1===o&&w.isXMLDoc(e)||(i=w.attrHooks[t.toLowerCase()]||(w.expr.match.bool.test(t)?dt:void 0)),void 0!==n?null===n?void w.removeAttr(e,t):i&&""set""in i&&void 0!==(r=i.set(e,n,t))?r:(e.setAttribute(t,n+""""),n):i&&""get""in i&&null!==(r=i.get(e,t))?r:null==(r=w.find.attr(e,t))?void 0:r)},attrHooks:{type:{set:function(e,t){if(!h.radioValue&&""radio""===t&&N(e,""input"")){var n=e.value;return e.setAttribute(""type"",t),n&&(e.value=n),t}}}},removeAttr:function(e,t){var n,r=0,i=t&&t.match(M);if(i&&1===e.nodeType)while(n=i[r++])e.removeAttribute(n)}}),dt={set:function(e,t,n){return!1===t?w.removeAttr(e,n):e.setAttribute(n,n),n}},w.each(w.expr.match.bool.source.match(/\w+/g),function(e,t){var n=ht[t]||w.find.attr;ht[t]=function(e,t,r){var i,o,a=t.toLowerCase();return r||(o=ht[a],ht[a]=i,i=null!=n(e,t,r)?a:null,ht[a]=o),i}});var gt=/^(?:input|select|textarea|button)$/i,yt=/^(?:a|area)$/i;w.fn.extend({prop:function(e,t){return z(this,w.prop,e,t,arguments.length>1)},removeProp:function(e){return this.each(function(){delete this[w.propFix[e]||e]})}}),w.extend({prop:function(e,t,n){var r,i,o=e.nodeType;if(3!==o&&8!==o&&2!==o)return 1===o&&w.isXMLDoc(e)||(t=w.propFix[t]||t,i=w.propHooks[t]),void 0!==n?i&&""set""in i&&void 0!==(r=i.set(e,n,t))?r:e[t]=n:i&&""get""in i&&null!==(r=i.get(e,t))?r:e[t]},propHooks:{tabIndex:{get:function(e){var t=w.find.attr(e,""tabindex"");return t?parseInt(t,10):gt.test(e.nodeName)||yt.test(e.nodeName)&&e.href?0:-1}}},propFix:{""for"":""htmlFor"",""class"":""className""}}),h.optSelected||(w.propHooks.selected={get:function(e){var t=e.parentNode;return t&&t.parentNode&&t.parentNode.selectedIndex,null},set:function(e){var t=e.parentNode;t&&(t.selectedIndex,t.parentNode&&t.parentNode.selectedIndex)}}),w.each([""tabIndex"",""readOnly"",""maxLength"",""cellSpacing"",""cellPadding"",""rowSpan"",""colSpan"",""useMap"",""frameBorder"",""contentEditable""],function(){w.propFix[this.toLowerCase()]=this});function vt(e){return(e.match(M)||[]).join("" "")}function mt(e){return e.getAttribute&&e.getAttribute(""class"")||""""}function xt(e){return Array.isArray(e)?e:""string""==typeof e?e.match(M)||[]:[]}w.fn.extend({addClass:function(e){var t,n,r,i,o,a,s,u=0;if(g(e))return this.each(function(t){w(this).addClass(e.call(this,t,mt(this)))});if((t=xt(e)).length)while(n=this[u++])if(i=mt(n),r=1===n.nodeType&&"" ""+vt(i)+"" ""){a=0;while(o=t[a++])r.indexOf("" ""+o+"" "")<0&&(r+=o+"" "");i!==(s=vt(r))&&n.setAttribute(""class"",s)}return this},removeClass:function(e){var t,n,r,i,o,a,s,u=0;if(g(e))return this.each(function(t){w(this).removeClass(e.call(this,t,mt(this)))});if(!arguments.length)return this.attr(""class"","""");if((t=xt(e)).length)while(n=this[u++])if(i=mt(n),r=1===n.nodeType&&"" ""+vt(i)+"" ""){a=0;while(o=t[a++])while(r.indexOf("" ""+o+"" "")>-1)r=r.replace("" ""+o+"" "","" "");i!==(s=vt(r))&&n.setAttribute(""class"",s)}return this},toggleClass:function(e,t){var n=typeof e,r=""string""===n||Array.isArray(e);return""boolean""==typeof t&&r?t?this.addClass(e):this.removeClass(e):g(e)?this.each(function(n){w(this).toggleClass(e.call(this,n,mt(this),t),t)}):this.each(function(){var t,i,o,a;if(r){i=0,o=w(this),a=xt(e);while(t=a[i++])o.hasClass(t)?o.removeClass(t):o.addClass(t)}else void 0!==e&&""boolean""!==n||((t=mt(this))&&J.set(this,""__className__"",t),this.setAttribute&&this.setAttribute(""class"",t||!1===e?"""":J.get(this,""__className__"")||""""))})},hasClass:function(e){var t,n,r=0;t="" ""+e+"" "";while(n=this[r++])if(1===n.nodeType&&("" ""+vt(mt(n))+"" "").indexOf(t)>-1)return!0;return!1}});var bt=/\r/g;w.fn.extend({val:function(e){var t,n,r,i=this[0];{if(arguments.length)return r=g(e),this.each(function(n){var i;1===this.nodeType&&(null==(i=r?e.call(this,n,w(this).val()):e)?i="""":""number""==typeof i?i+="""":Array.isArray(i)&&(i=w.map(i,function(e){return null==e?"""":e+""""})),(t=w.valHooks[this.type]||w.valHooks[this.nodeName.toLowerCase()])&&""set""in t&&void 0!==t.set(this,i,""value"")||(this.value=i))});if(i)return(t=w.valHooks[i.type]||w.valHooks[i.nodeName.toLowerCase()])&&""get""in t&&void 0!==(n=t.get(i,""value""))?n:""string""==typeof(n=i.value)?n.replace(bt,""""):null==n?"""":n}}}),w.extend({valHooks:{option:{get:function(e){var t=w.find.attr(e,""value"");return null!=t?t:vt(w.text(e))}},select:{get:function(e){var t,n,r,i=e.options,o=e.selectedIndex,a=""select-one""===e.type,s=a?null:[],u=a?o+1:i.length;for(r=o<0?u:a?o:0;r<u;r++)if(((n=i[r]).selected||r===o)&&!n.disabled&&(!n.parentNode.disabled||!N(n.parentNode,""optgroup""))){if(t=w(n).val(),a)return t;s.push(t)}return s},set:function(e,t){var n,r,i=e.options,o=w.makeArray(t),a=i.length;while(a--)((r=i[a]).selected=w.inArray(w.valHooks.option.get(r),o)>-1)&&(n=!0);return n||(e.selectedIndex=-1),o}}}}),w.each([""radio"",""checkbox""],function(){w.valHooks[this]={set:function(e,t){if(Array.isArray(t))return e.checked=w.inArray(w(e).val(),t)>-1}},h.checkOn||(w.valHooks[this].get=function(e){return null===e.getAttribute(""value"")?""on"":e.value})}),h.focusin=""onfocusin""in e;var wt=/^(?:focusinfocus|focusoutblur)$/,Tt=function(e){e.stopPropagation()};w.extend(w.event,{trigger:function(t,n,i,o){var a,s,u,l,c,p,d,h,v=[i||r],m=f.call(t,""type"")?t.type:t,x=f.call(t,""namespace"")?t.namespace.split("".""):[];if(s=h=u=i=i||r,3!==i.nodeType&&8!==i.nodeType&&!wt.test(m+w.event.triggered)&&(m.indexOf(""."")>-1&&(m=(x=m.split(""."")).shift(),x.sort()),c=m.indexOf("":"")<0&&""on""+m,t=t[w.expando]?t:new w.Event(m,""object""==typeof t&&t),t.isTrigger=o?2:3,t.namespace=x.join("".""),t.rnamespace=t.namespace?new RegExp(""(^|\\.)""+x.join(""\\.(?:.*\\.|)"")+""(\\.|$)""):null,t.result=void 0,t.target||(t.target=i),n=null==n?[t]:w.makeArray(n,[t]),d=w.event.special[m]||{},o||!d.trigger||!1!==d.trigger.apply(i,n))){if(!o&&!d.noBubble&&!y(i)){for(l=d.delegateType||m,wt.test(l+m)||(s=s.parentNode);s;s=s.parentNode)v.push(s),u=s;u===(i.ownerDocument||r)&&v.push(u.defaultView||u.parentWindow||e)}a=0;while((s=v[a++])&&!t.isPropagationStopped())h=s,t.type=a>1?l:d.bindType||m,(p=(J.get(s,""events"")||{})[t.type]&&J.get(s,""handle""))&&p.apply(s,n),(p=c&&s[c])&&p.apply&&Y(s)&&(t.result=p.apply(s,n),!1===t.result&&t.preventDefault());return t.type=m,o||t.isDefaultPrevented()||d._default&&!1!==d._default.apply(v.pop(),n)||!Y(i)||c&&g(i[m])&&!y(i)&&((u=i[c])&&(i[c]=null),w.event.triggered=m,t.isPropagationStopped()&&h.addEventListener(m,Tt),i[m](),t.isPropagationStopped()&&h.removeEventListener(m,Tt),w.event.triggered=void 0,u&&(i[c]=u)),t.result}},simulate:function(e,t,n){var r=w.extend(new w.Event,n,{type:e,isSimulated:!0});w.event.trigger(r,null,t)}}),w.fn.extend({trigger:function(e,t){return this.each(function(){w.event.trigger(e,t,this)})},triggerHandler:function(e,t){var n=this[0];if(n)return w.event.trigger(e,t,n,!0)}}),h.focusin||w.each({focus:""focusin"",blur:""focusout""},function(e,t){var n=function(e){w.event.simulate(t,e.target,w.event.fix(e))};w.event.special[t]={setup:function(){var r=this.ownerDocument||this,i=J.access(r,t);i||r.addEventListener(e,n,!0),J.access(r,t,(i||0)+1)},teardown:function(){var r=this.ownerDocument||this,i=J.access(r,t)-1;i?J.access(r,t,i):(r.removeEventListener(e,n,!0),J.remove(r,t))}}});var Ct=e.location,Et=Date.now(),kt=/\?/;w.parseXML=function(t){var n;if(!t||""string""!=typeof t)return null;try{n=(new e.DOMParser).parseFromString(t,""text/xml"")}catch(e){n=void 0}return n&&!n.getElementsByTagName(""parsererror"").length||w.error(""Invalid XML: ""+t),n};var St=/\[\]$/,Dt=/\r?\n/g,Nt=/^(?:submit|button|image|reset|file)$/i,At=/^(?:input|select|textarea|keygen)/i;function jt(e,t,n,r){var i;if(Array.isArray(t))w.each(t,function(t,i){n||St.test(e)?r(e,i):jt(e+""[""+(""object""==typeof i&&null!=i?t:"""")+""]"",i,n,r)});else if(n||""object""!==x(t))r(e,t);else for(i in t)jt(e+""[""+i+""]"",t[i],n,r)}w.param=function(e,t){var n,r=[],i=function(e,t){var n=g(t)?t():t;r[r.length]=encodeURIComponent(e)+""=""+encodeURIComponent(null==n?"""":n)};if(Array.isArray(e)||e.jquery&&!w.isPlainObject(e))w.each(e,function(){i(this.name,this.value)});else for(n in e)jt(n,e[n],t,i);return r.join(""&"")},w.fn.extend({serialize:function(){return w.param(this.serializeArray())},serializeArray:function(){return this.map(function(){var e=w.prop(this,""elements"");return e?w.makeArray(e):this}).filter(function(){var e=this.type;return this.name&&!w(this).is("":disabled"")&&At.test(this.nodeName)&&!Nt.test(e)&&(this.checked||!pe.test(e))}).map(function(e,t){var n=w(this).val();return null==n?null:Array.isArray(n)?w.map(n,function(e){return{name:t.name,value:e.replace(Dt,""\r\n"")}}):{name:t.name,value:n.replace(Dt,""\r\n"")}}).get()}});var qt=/%20/g,Lt=/#.*$/,Ht=/([?&])_=[^&]*/,Ot=/^(.*?):[ \t]*([^\r\n]*)$/gm,Pt=/^(?:about|app|app-storage|.+-extension|file|res|widget):$/,Mt=/^(?:GET|HEAD)$/,Rt=/^\/\//,It={},Wt={},$t=""*/"".concat(""*""),Bt=r.createElement(""a"");Bt.href=Ct.href;function Ft(e){return function(t,n){""string""!=typeof t&&(n=t,t=""*"");var r,i=0,o=t.toLowerCase().match(M)||[];if(g(n))while(r=o[i++])""+""===r[0]?(r=r.slice(1)||""*"",(e[r]=e[r]||[]).unshift(n)):(e[r]=e[r]||[]).push(n)}}function _t(e,t,n,r){var i={},o=e===Wt;function a(s){var u;return i[s]=!0,w.each(e[s]||[],function(e,s){var l=s(t,n,r);return""string""!=typeof l||o||i[l]?o?!(u=l):void 0:(t.dataTypes.unshift(l),a(l),!1)}),u}return a(t.dataTypes[0])||!i[""*""]&&a(""*"")}function zt(e,t){var n,r,i=w.ajaxSettings.flatOptions||{};for(n in t)void 0!==t[n]&&((i[n]?e:r||(r={}))[n]=t[n]);return r&&w.extend(!0,e,r),e}function Xt(e,t,n){var r,i,o,a,s=e.contents,u=e.dataTypes;while(""*""===u[0])u.shift(),void 0===r&&(r=e.mimeType||t.getResponseHeader(""Content-Type""));if(r)for(i in s)if(s[i]&&s[i].test(r)){u.unshift(i);break}if(u[0]in n)o=u[0];else{for(i in n){if(!u[0]||e.converters[i+"" ""+u[0]]){o=i;break}a||(a=i)}o=o||a}if(o)return o!==u[0]&&u.unshift(o),n[o]}function Ut(e,t,n,r){var i,o,a,s,u,l={},c=e.dataTypes.slice();if(c[1])for(a in e.converters)l[a.toLowerCase()]=e.converters[a];o=c.shift();while(o)if(e.responseFields[o]&&(n[e.responseFields[o]]=t),!u&&r&&e.dataFilter&&(t=e.dataFilter(t,e.dataType)),u=o,o=c.shift())if(""*""===o)o=u;else if(""*""!==u&&u!==o){if(!(a=l[u+"" ""+o]||l[""* ""+o]))for(i in l)if((s=i.split("" ""))[1]===o&&(a=l[u+"" ""+s[0]]||l[""* ""+s[0]])){!0===a?a=l[i]:!0!==l[i]&&(o=s[0],c.unshift(s[1]));break}if(!0!==a)if(a&&e[""throws""])t=a(t);else try{t=a(t)}catch(e){return{state:""parsererror"",error:a?e:""No conversion from ""+u+"" to ""+o}}}return{state:""success"",data:t}}w.extend({active:0,lastModified:{},etag:{},ajaxSettings:{url:Ct.href,type:""GET"",isLocal:Pt.test(Ct.protocol),global:!0,processData:!0,async:!0,contentType:""application/x-www-form-urlencoded; charset=UTF-8"",accepts:{""*"":$t,text:""text/plain"",html:""text/html"",xml:""application/xml, text/xml"",json:""application/json, text/javascript""},contents:{xml:/\bxml\b/,html:/\bhtml/,json:/\bjson\b/},responseFields:{xml:""responseXML"",text:""responseText"",json:""responseJSON""},converters:{""* text"":String,""text html"":!0,""text json"":JSON.parse,""text xml"":w.parseXML},flatOptions:{url:!0,context:!0}},ajaxSetup:function(e,t){return t?zt(zt(e,w.ajaxSettings),t):zt(w.ajaxSettings,e)},ajaxPrefilter:Ft(It),ajaxTransport:Ft(Wt),ajax:function(t,n){""object""==typeof t&&(n=t,t=void 0),n=n||{};var i,o,a,s,u,l,c,f,p,d,h=w.ajaxSetup({},n),g=h.context||h,y=h.context&&(g.nodeType||g.jquery)?w(g):w.event,v=w.Deferred(),m=w.Callbacks(""once memory""),x=h.statusCode||{},b={},T={},C=""canceled"",E={readyState:0,getResponseHeader:function(e){var t;if(c){if(!s){s={};while(t=Ot.exec(a))s[t[1].toLowerCase()]=t[2]}t=s[e.toLowerCase()]}return null==t?null:t},getAllResponseHeaders:function(){return c?a:null},setRequestHeader:function(e,t){return null==c&&(e=T[e.toLowerCase()]=T[e.toLowerCase()]||e,b[e]=t),this},overrideMimeType:function(e){return null==c&&(h.mimeType=e),this},statusCode:function(e){var t;if(e)if(c)E.always(e[E.status]);else for(t in e)x[t]=[x[t],e[t]];return this},abort:function(e){var t=e||C;return i&&i.abort(t),k(0,t),this}};if(v.promise(E),h.url=((t||h.url||Ct.href)+"""").replace(Rt,Ct.protocol+""//""),h.type=n.method||n.type||h.method||h.type,h.dataTypes=(h.dataType||""*"").toLowerCase().match(M)||[""""],null==h.crossDomain){l=r.createElement(""a"");try{l.href=h.url,l.href=l.href,h.crossDomain=Bt.protocol+""//""+Bt.host!=l.protocol+""//""+l.host}catch(e){h.crossDomain=!0}}if(h.data&&h.processData&&""string""!=typeof h.data&&(h.data=w.param(h.data,h.traditional)),_t(It,h,n,E),c)return E;(f=w.event&&h.global)&&0==w.active++&&w.event.trigger(""ajaxStart""),h.type=h.type.toUpperCase(),h.hasContent=!Mt.test(h.type),o=h.url.replace(Lt,""""),h.hasContent?h.data&&h.processData&&0===(h.contentType||"""").indexOf(""application/x-www-form-urlencoded"")&&(h.data=h.data.replace(qt,""+"")):(d=h.url.slice(o.length),h.data&&(h.processData||""string""==typeof h.data)&&(o+=(kt.test(o)?""&"":""?"")+h.data,delete h.data),!1===h.cache&&(o=o.replace(Ht,""$1""),d=(kt.test(o)?""&"":""?"")+""_=""+Et+++d),h.url=o+d),h.ifModified&&(w.lastModified[o]&&E.setRequestHeader(""If-Modified-Since"",w.lastModified[o]),w.etag[o]&&E.setRequestHeader(""If-None-Match"",w.etag[o])),(h.data&&h.hasContent&&!1!==h.contentType||n.contentType)&&E.setRequestHeader(""Content-Type"",h.contentType),E.setRequestHeader(""Accept"",h.dataTypes[0]&&h.accepts[h.dataTypes[0]]?h.accepts[h.dataTypes[0]]+(""*""!==h.dataTypes[0]?"", ""+$t+""; q=0.01"":""""):h.accepts[""*""]);for(p in h.headers)E.setRequestHeader(p,h.headers[p]);if(h.beforeSend&&(!1===h.beforeSend.call(g,E,h)||c))return E.abort();if(C=""abort"",m.add(h.complete),E.done(h.success),E.fail(h.error),i=_t(Wt,h,n,E)){if(E.readyState=1,f&&y.trigger(""ajaxSend"",[E,h]),c)return E;h.async&&h.timeout>0&&(u=e.setTimeout(function(){E.abort(""timeout"")},h.timeout));try{c=!1,i.send(b,k)}catch(e){if(c)throw e;k(-1,e)}}else k(-1,""No Transport"");function k(t,n,r,s){var l,p,d,b,T,C=n;c||(c=!0,u&&e.clearTimeout(u),i=void 0,a=s||"""",E.readyState=t>0?4:0,l=t>=200&&t<300||304===t,r&&(b=Xt(h,E,r)),b=Ut(h,b,E,l),l?(h.ifModified&&((T=E.getResponseHeader(""Last-Modified""))&&(w.lastModified[o]=T),(T=E.getResponseHeader(""etag""))&&(w.etag[o]=T)),204===t||""HEAD""===h.type?C=""nocontent"":304===t?C=""notmodified"":(C=b.state,p=b.data,l=!(d=b.error))):(d=C,!t&&C||(C=""error"",t<0&&(t=0))),E.status=t,E.statusText=(n||C)+"""",l?v.resolveWith(g,[p,C,E]):v.rejectWith(g,[E,C,d]),E.statusCode(x),x=void 0,f&&y.trigger(l?""ajaxSuccess"":""ajaxError"",[E,h,l?p:d]),m.fireWith(g,[E,C]),f&&(y.trigger(""ajaxComplete"",[E,h]),--w.active||w.event.trigger(""ajaxStop"")))}return E},getJSON:function(e,t,n){return w.get(e,t,n,""json"")},getScript:function(e,t){return w.get(e,void 0,t,""script"")}}),w.each([""get"",""post""],function(e,t){w[t]=function(e,n,r,i){return g(n)&&(i=i||r,r=n,n=void 0),w.ajax(w.extend({url:e,type:t,dataType:i,data:n,success:r},w.isPlainObject(e)&&e))}}),w._evalUrl=function(e){return w.ajax({url:e,type:""GET"",dataType:""script"",cache:!0,async:!1,global:!1,""throws"":!0})},w.fn.extend({wrapAll:function(e){var t;return this[0]&&(g(e)&&(e=e.call(this[0])),t=w(e,this[0].ownerDocument).eq(0).clone(!0),this[0].parentNode&&t.insertBefore(this[0]),t.map(function(){var e=this;while(e.firstElementChild)e=e.firstElementChild;return e}).append(this)),this},wrapInner:function(e){return g(e)?this.each(function(t){w(this).wrapInner(e.call(this,t))}):this.each(function(){var t=w(this),n=t.contents();n.length?n.wrapAll(e):t.append(e)})},wrap:function(e){var t=g(e);return this.each(function(n){w(this).wrapAll(t?e.call(this,n):e)})},unwrap:function(e){return this.parent(e).not(""body"").each(function(){w(this).replaceWith(this.childNodes)}),this}}),w.expr.pseudos.hidden=function(e){return!w.expr.pseudos.visible(e)},w.expr.pseudos.visible=function(e){return!!(e.offsetWidth||e.offsetHeight||e.getClientRects().length)},w.ajaxSettings.xhr=function(){try{return new e.XMLHttpRequest}catch(e){}};var Vt={0:200,1223:204},Gt=w.ajaxSettings.xhr();h.cors=!!Gt&&""withCredentials""in Gt,h.ajax=Gt=!!Gt,w.ajaxTransport(function(t){var n,r;if(h.cors||Gt&&!t.crossDomain)return{send:function(i,o){var a,s=t.xhr();if(s.open(t.type,t.url,t.async,t.username,t.password),t.xhrFields)for(a in t.xhrFields)s[a]=t.xhrFields[a];t.mimeType&&s.overrideMimeType&&s.overrideMimeType(t.mimeType),t.crossDomain||i[""X-Requested-With""]||(i[""X-Requested-With""]=""XMLHttpRequest"");for(a in i)s.setRequestHeader(a,i[a]);n=function(e){return function(){n&&(n=r=s.onload=s.onerror=s.onabort=s.ontimeout=s.onreadystatechange=null,""abort""===e?s.abort():""error""===e?""number""!=typeof s.status?o(0,""error""):o(s.status,s.statusText):o(Vt[s.status]||s.status,s.statusText,""text""!==(s.responseType||""text"")||""string""!=typeof s.responseText?{binary:s.response}:{text:s.responseText},s.getAllResponseHeaders()))}},s.onload=n(),r=s.onerror=s.ontimeout=n(""error""),void 0!==s.onabort?s.onabort=r:s.onreadystatechange=function(){4===s.readyState&&e.setTimeout(function(){n&&r()})},n=n(""abort"");try{s.send(t.hasContent&&t.data||null)}catch(e){if(n)throw e}},abort:function(){n&&n()}}}),w.ajaxPrefilter(function(e){e.crossDomain&&(e.contents.script=!1)}),w.ajaxSetup({accepts:{script:""text/javascript, application/javascript, application/ecmascript, application/x-ecmascript""},contents:{script:/\b(?:java|ecma)script\b/},converters:{""text script"":function(e){return w.globalEval(e),e}}}),w.ajaxPrefilter(""script"",function(e){void 0===e.cache&&(e.cache=!1),e.crossDomain&&(e.type=""GET"")}),w.ajaxTransport(""script"",function(e){if(e.crossDomain){var t,n;return{send:function(i,o){t=w(""<script>"").prop({charset:e.scriptCharset,src:e.url}).on(""load error"",n=function(e){t.remove(),n=null,e&&o(""error""===e.type?404:200,e.type)}),r.head.appendChild(t[0])},abort:function(){n&&n()}}}});var Yt=[],Qt=/(=)\?(?=&|$)|\?\?/;w.ajaxSetup({jsonp:""callback"",jsonpCallback:function(){var e=Yt.pop()||w.expando+""_""+Et++;return this[e]=!0,e}}),w.ajaxPrefilter(""json jsonp"",function(t,n,r){var i,o,a,s=!1!==t.jsonp&&(Qt.test(t.url)?""url"":""string""==typeof t.data&&0===(t.contentType||"""").indexOf(""application/x-www-form-urlencoded"")&&Qt.test(t.data)&&""data"");if(s||""jsonp""===t.dataTypes[0])return i=t.jsonpCallback=g(t.jsonpCallback)?t.jsonpCallback():t.jsonpCallback,s?t[s]=t[s].replace(Qt,""$1""+i):!1!==t.jsonp&&(t.url+=(kt.test(t.url)?""&"":""?"")+t.jsonp+""=""+i),t.converters[""script json""]=function(){return a||w.error(i+"" was not called""),a[0]},t.dataTypes[0]=""json"",o=e[i],e[i]=function(){a=arguments},r.always(function(){void 0===o?w(e).removeProp(i):e[i]=o,t[i]&&(t.jsonpCallback=n.jsonpCallback,Yt.push(i)),a&&g(o)&&o(a[0]),a=o=void 0}),""script""}),h.createHTMLDocument=function(){var e=r.implementation.createHTMLDocument("""").body;return e.innerHTML=""<form></form><form></form>"",2===e.childNodes.length}(),w.parseHTML=function(e,t,n){if(""string""!=typeof e)return[];""boolean""==typeof t&&(n=t,t=!1);var i,o,a;return t||(h.createHTMLDocument?((i=(t=r.implementation.createHTMLDocument("""")).createElement(""base"")).href=r.location.href,t.head.appendChild(i)):t=r),o=A.exec(e),a=!n&&[],o?[t.createElement(o[1])]:(o=xe([e],t,a),a&&a.length&&w(a).remove(),w.merge([],o.childNodes))},w.fn.load=function(e,t,n){var r,i,o,a=this,s=e.indexOf("" "");return s>-1&&(r=vt(e.slice(s)),e=e.slice(0,s)),g(t)?(n=t,t=void 0):t&&""object""==typeof t&&(i=""POST""),a.length>0&&w.ajax({url:e,type:i||""GET"",dataType:""html"",data:t}).done(function(e){o=arguments,a.html(r?w(""<div>"").append(w.parseHTML(e)).find(r):e)}).always(n&&function(e,t){a.each(function(){n.apply(this,o||[e.responseText,t,e])})}),this},w.each([""ajaxStart"",""ajaxStop"",""ajaxComplete"",""ajaxError"",""ajaxSuccess"",""ajaxSend""],function(e,t){w.fn[t]=function(e){return this.on(t,e)}}),w.expr.pseudos.animated=function(e){return w.grep(w.timers,function(t){return e===t.elem}).length},w.offset={setOffset:function(e,t,n){var r,i,o,a,s,u,l,c=w.css(e,""position""),f=w(e),p={};""static""===c&&(e.style.position=""relative""),s=f.offset(),o=w.css(e,""top""),u=w.css(e,""left""),(l=(""absolute""===c||""fixed""===c)&&(o+u).indexOf(""auto"")>-1)?(a=(r=f.position()).top,i=r.left):(a=parseFloat(o)||0,i=parseFloat(u)||0),g(t)&&(t=t.call(e,n,w.extend({},s))),null!=t.top&&(p.top=t.top-s.top+a),null!=t.left&&(p.left=t.left-s.left+i),""using""in t?t.using.call(e,p):f.css(p)}},w.fn.extend({offset:function(e){if(arguments.length)return void 0===e?this:this.each(function(t){w.offset.setOffset(this,e,t)});var t,n,r=this[0];if(r)return r.getClientRects().length?(t=r.getBoundingClientRect(),n=r.ownerDocument.defaultView,{top:t.top+n.pageYOffset,left:t.left+n.pageXOffset}):{top:0,left:0}},position:function(){if(this[0]){var e,t,n,r=this[0],i={top:0,left:0};if(""fixed""===w.css(r,""position""))t=r.getBoundingClientRect();else{t=this.offset(),n=r.ownerDocument,e=r.offsetParent||n.documentElement;while(e&&(e===n.body||e===n.documentElement)&&""static""===w.css(e,""position""))e=e.parentNode;e&&e!==r&&1===e.nodeType&&((i=w(e).offset()).top+=w.css(e,""borderTopWidth"",!0),i.left+=w.css(e,""borderLeftWidth"",!0))}return{top:t.top-i.top-w.css(r,""marginTop"",!0),left:t.left-i.left-w.css(r,""marginLeft"",!0)}}},offsetParent:function(){return this.map(function(){var e=this.offsetParent;while(e&&""static""===w.css(e,""position""))e=e.offsetParent;return e||be})}}),w.each({scrollLeft:""pageXOffset"",scrollTop:""pageYOffset""},function(e,t){var n=""pageYOffset""===t;w.fn[e]=function(r){return z(this,function(e,r,i){var o;if(y(e)?o=e:9===e.nodeType&&(o=e.defaultView),void 0===i)return o?o[t]:e[r];o?o.scrollTo(n?o.pageXOffset:i,n?i:o.pageYOffset):e[r]=i},e,r,arguments.length)}}),w.each([""top"",""left""],function(e,t){w.cssHooks[t]=_e(h.pixelPosition,function(e,n){if(n)return n=Fe(e,t),We.test(n)?w(e).position()[t]+""px"":n})}),w.each({Height:""height"",Width:""width""},function(e,t){w.each({padding:""inner""+e,content:t,"""":""outer""+e},function(n,r){w.fn[r]=function(i,o){var a=arguments.length&&(n||""boolean""!=typeof i),s=n||(!0===i||!0===o?""margin"":""border"");return z(this,function(t,n,i){var o;return y(t)?0===r.indexOf(""outer"")?t[""inner""+e]:t.document.documentElement[""client""+e]:9===t.nodeType?(o=t.documentElement,Math.max(t.body[""scroll""+e],o[""scroll""+e],t.body[""offset""+e],o[""offset""+e],o[""client""+e])):void 0===i?w.css(t,n,s):w.style(t,n,i,s)},t,a?i:void 0,a)}})}),w.each(""blur focus focusin focusout resize scroll click dblclick mousedown mouseup mousemove mouseover mouseout mouseenter mouseleave change select submit keydown keypress keyup contextmenu"".split("" ""),function(e,t){w.fn[t]=function(e,n){return arguments.length>0?this.on(t,null,e,n):this.trigger(t)}}),w.fn.extend({hover:function(e,t){return this.mouseenter(e).mouseleave(t||e)}}),w.fn.extend({bind:function(e,t,n){return this.on(e,null,t,n)},unbind:function(e,t){return this.off(e,null,t)},delegate:function(e,t,n,r){return this.on(t,e,n,r)},undelegate:function(e,t,n){return 1===arguments.length?this.off(e,""**""):this.off(t,e||""**"",n)}}),w.proxy=function(e,t){var n,r,i;if(""string""==typeof t&&(n=e[t],t=e,e=n),g(e))return r=o.call(arguments,2),i=function(){return e.apply(t||this,r.concat(o.call(arguments)))},i.guid=e.guid=e.guid||w.guid++,i},w.holdReady=function(e){e?w.readyWait++:w.ready(!0)},w.isArray=Array.isArray,w.parseJSON=JSON.parse,w.nodeName=N,w.isFunction=g,w.isWindow=y,w.camelCase=G,w.type=x,w.now=Date.now,w.isNumeric=function(e){var t=w.type(e);return(""number""===t||""string""===t)&&!isNaN(e-parseFloat(e))},""function""==typeof define&&define.amd&&define(""jquery"",[],function(){return w});var Jt=e.jQuery,Kt=e.$;return w.noConflict=function(t){return e.$===w&&(e.$=Kt),t&&e.jQuery===w&&(e.jQuery=Jt),w},t||(e.jQuery=e.$=w),w});";
КонецФункции

#КонецОбласти

#КонецОбласти
