
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='Оборудование:'") + Символы.НПП  + Строка(Идентификатор);
	
	времПорт            	= Неопределено;
	времСервер          	= Неопределено;
	времКодПродукта        	= Неопределено;
	времКлюч	        	= Неопределено;
	времСтруктурнаяЕдиница 	= Неопределено;
	времАдресПубликации     = Неопределено;

	Параметры.ПараметрыОборудования.Свойство("Сервер"          		, времСервер);
	Параметры.ПараметрыОборудования.Свойство("Порт"            		, времПорт);
	Параметры.ПараметрыОборудования.Свойство("КодПродукта"     	 	, времКодПродукта);
	Параметры.ПараметрыОборудования.Свойство("Ключ"          		, времКлюч);
	Параметры.ПараметрыОборудования.Свойство("СтруктурнаяЕдиница"	, времСтруктурнаяЕдиница);
	Параметры.ПараметрыОборудования.Свойство("АдресПубликации"    	, времАдресПубликации);	
	
	Сервер          	= ?(времСервер	        = Неопределено,   "https://app.mango-office.ru/vpbx"	, времСервер);
	Порт            	= ?(времПорт            = Неопределено,   80			, времПорт);
	КодПродукта        	= ?(времКодПродукта     = Неопределено,   ""			, времКодПродукта);
	Ключ	          	= ?(времКлюч	        = Неопределено,   ""			, времКлюч);
	СтруктурнаяЕдиница 	= ?(времСтруктурнаяЕдиница = Неопределено, Неопределено	, времСтруктурнаяЕдиница);
	АдресПубликации     = СменитьПубликацию(Ложь);
	
	Если ПроверитьПодключениеВнешнейСистемы(Перечисления.ТипыВнешнихСистем.IPТелефония) Тогда
		ИспользоватьРетранслятор = Истина;
		АдресПубликации = СменитьПубликацию(Истина); 
	Иначе
		ИспользоватьРетранслятор = Ложь;		
	КонецЕсли; 	
	
	Параметры.ПараметрыОборудования.Свойство("КоллтрекингАдресСервера", КоллтрекингАдресСервера);
	Параметры.ПараметрыОборудования.Свойство("КоллтрекингToken"   	  , КоллтрекингToken);
	Параметры.ПараметрыОборудования.Свойство("КоллтрекингНомерВиджета", КоллтрекингНомерВиджета);	
	Параметры.ПараметрыОборудования.Свойство("ИспользоватьКоллтрекинг", ИспользоватьКоллтрекинг);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("Сервер"                 , Сервер);
	НовыеЗначениеПараметров.Вставить("Порт"                   , Порт);
	НовыеЗначениеПараметров.Вставить("КодПродукта"            , КодПродукта);
	НовыеЗначениеПараметров.Вставить("Ключ"			          , Ключ);
	НовыеЗначениеПараметров.Вставить("СтруктурнаяЕдиница"     , СтруктурнаяЕдиница);
	НовыеЗначениеПараметров.Вставить("АдресПубликации"        , АдресПубликации);	
	НовыеЗначениеПараметров.Вставить("ИспользоватьКоллтрекинг", ИспользоватьКоллтрекинг);
	НовыеЗначениеПараметров.Вставить("КоллтрекингАдресСервера", КоллтрекингАдресСервера);
	НовыеЗначениеПараметров.Вставить("КоллтрекингНомерВиджета", КоллтрекингНомерВиджета);
	НовыеЗначениеПараметров.Вставить("КоллтрекингToken"       , КоллтрекингToken);

	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключено к ретранслятору при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ИспользоватьРетрансляторПриИзменении(Элемент)
	
	ОписаниеОшибки   = "";
	ВыполненоУспешно = Ложь;
	Модифицированность = Истина;
	
	ДопПараметры = Новый Структура("operator_IP_telephony", "MANGO");
	
	Если ИспользоватьРетранслятор Тогда 
		
		ВыполненоУспешно = ПодключитьВнешнююСистему(ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.IPТелефония"), ОписаниеОшибки, ДопПараметры);	
		
		Если ВыполненоУспешно Тогда			
			АдресПубликации = СменитьПубликацию(Истина);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Источники заявок: " + ОписаниеОшибки); 		
		КонецЕсли;
		
	Иначе		
		
		ВыполненоУспешно = ОтключитьВнешнююСистему(ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.IPТелефония"), ОписаниеОшибки, ДопПараметры);
		
		Если ВыполненоУспешно Тогда  			
			АдресПубликации = СменитьПубликацию(Ложь);
		ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Источники заявок: " + ОписаниеОшибки); 		
		КонецЕсли;
		
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	
	ОчиститьСообщения();
	СообщениеОшибки  = "";
	
	Результат = IPТелефония.MANGO_ТестированиеСервера(Сервер, Порт, КодПродукта, Ключ, СообщениеОшибки);
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден. Ошибка:" + Символы.ПС + " %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", СообщениеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТескКоллтрекинга(Команда)
	
	Если Не ИспользоватьКоллтрекинг Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Коллтрекинг не используется. Необходимо включить.");
	КонецЕсли;
	
	КоллтрекингАдресСервера = СтрЗаменить(КоллтрекингАдресСервера, "https://", "");
		
	СообщениеОшибки = "";
	Результат = IPТелефония.MANGO_ТестированиеКоллтрекинга(КоллтрекингАдресСервера, КоллтрекингToken, КоллтрекингНомерВиджета, СообщениеОшибки);
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Тест успешно выполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Тест не пройден. Ошибка:" + Символы.ПС + " %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", СообщениеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура, ПолучитьВнешнююСистему.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Функция ПроверитьПодключениеВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат ЗначениеЗаполнено(Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы));

КонецФункции

&НаСервере
// Функция - Подключить внешнюю систему.
// 
Функция ПодключитьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Истина, ОписаниеОшибки, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат СоздатьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки, ДополнительныеПараметры);
	
КонецФункции

&НаСервере
// Функция - Отключить внешнюю систему.
// 
Функция ОтключитьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда 		
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Ложь, ОписаниеОшибки, ДополнительныеПараметры);
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
// Функция - Создать внешнюю систему.
//
Функция СоздатьВнешнююСистему(ТипВнешнейСистемы, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ВнешняяСистема   = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(ТипВнешнейСистемы,,,КодПродукта);
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();	
	РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, УидСессии,,, ДополнительныеПараметры);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Ложь, Ложь);
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
	Иначе
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Истина, Истина);
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
			
КонецФункции

&НаСервереБезКонтекста
// Функция, включает/отключает внешнюю систему.
//
Функция ОбновитьВнешнююСистему(ВнешняяСистема, Используется = Истина, ОписаниеОшибки = Неопределено, ДополнительныеПараметры = Неопределено)
	
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();		
	РезультатЗапроса = ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется, УидСессии,,, ДополнительныеПараметры);		
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Используется, Используется);				
	Иначе	
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;	
	КонецЕсли;
	
	Возврат РезультатЗапроса.ВыполненоУспешно;
		
КонецФункции

&НаСервереБезКонтекста
// Процедура - Сменить публикацию
//
Функция СменитьПубликацию(Флаг = Ложь)
	
	АдресРетранслятора  = "http://cloud.stoma1c.ru/api";
	HTTPСервис = "/hs/Click2Call";
	//HTTPСервис = СтрЗаменить(HTTPСервис, "{apikey}", ПолучитьВнешнююСистему());	
	
	Если Флаг Тогда
		Возврат "" + АдресРетранслятора + HTTPСервис;
	Иначе 
		АдресПубликации = Константы.ВнешняяПубликацияАдрес.Получить();		
		АдресПубликации = СокрЛП(АдресПубликации);
		АдресПубликации = ?(СтрЗаканчиваетсяНа(АдресПубликации, "/"),  Лев(АдресПубликации, СтрДлина(АдресПубликации)-1), АдресПубликации);
		Возврат "" + АдресПубликации + HTTPСервис;
	КонецЕсли;		
	
КонецФункции

#КонецОбласти