
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОтборСотрудник", ПараметрКоманды);
	ПараметрыФормы.Вставить("ПерейтиГрафикРаботыСотрудника", Истина);

	ОткрытьФорму("Обработка.ПланированиеИндивидуальногоГрафика.Форма.ФормаПланирования", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти