
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='ФР'") + " """ + Строка(Идентификатор) + """";

	времНомерСекции 			   = Неопределено;
	времКодСимволаЧастичногоОтреза = Неопределено;
	времМодель				       = Неопределено;
	времИмяПринтера    			   = Неопределено;
	времТаблицаШапкаЧека		   = Неопределено;
	времТаблицаПодвалЧека          = Неопределено;
	времШирина                     = Неопределено;
	времПредварительныйПросмотр    = Неопределено;
	времВыборПринтера              = Неопределено;

	Параметры.ПараметрыОборудования.Свойство("НомерСекции"               , времНомерСекции);
	Параметры.ПараметрыОборудования.Свойство("КодСимволаЧастичногоОтреза", времКодСимволаЧастичногоОтреза);
	Параметры.ПараметрыОборудования.Свойство("Модель"                    , времМодель);
	Параметры.ПараметрыОборудования.Свойство("ИмяПринтера"               , времИмяПринтера);
	Параметры.ПараметрыОборудования.Свойство("ТаблицаШапкаЧека"          , времТаблицаШапкаЧека);
	Параметры.ПараметрыОборудования.Свойство("ТаблицаПодвалЧека"         , времТаблицаПодвалЧека);
	Параметры.ПараметрыОборудования.Свойство("ШиринаЧека"                , времШирина);
    Параметры.ПараметрыОборудования.Свойство("ПредварительныйПросмотр"   , времПредварительныйПросмотр);
	Параметры.ПараметрыОборудования.Свойство("ВыборПринтера"             , времВыборПринтера);   
	

	НомерСекции                = ?(времНомерСекции                = Неопределено, 0, времНомерСекции);
	КодСимволаЧастичногоОтреза = ?(времКодСимволаЧастичногоОтреза = Неопределено, 22, времКодСимволаЧастичногоОтреза);
	Модель                     = ?(времМодель                     = Неопределено, Элементы.Модель.СписокВыбора[0], времМодель);
	ИмяПринтера                = ?(времИмяПринтера                = Неопределено, "", времИмяПринтера); 
	ШиринаЧека                 = ?(времШирина                     = Неопределено, 58, времШирина); 
	ПредварительныйПросмотр    = ?(времПредварительныйПросмотр    = Неопределено, ЛОжь, времПредварительныйПросмотр);
	ВыборПринтера              = ?(времВыборПринтера              = Неопределено, Ложь, времВыборПринтера);
	Если  времТаблицаШапкаЧека = Неопределено  Тогда
		ПолучитьТаблицуШапки();
	Иначе
		Для Каждого СтрокаТЧ из времТаблицаШапкаЧека Цикл		
		НоваяСтрока = ТаблицаШапкаЧека.Добавить();
		НоваяСтрока.ШапкаЧека = СтрокаТЧ;
	КонецЦикла;
	КонецЕсли;
	
	Если времТаблицаПодвалЧека = Неопределено Тогда
		ПолучитьТаблицуПодвала();
	Иначе  
		Для Каждого СтрокаТЧ из времТаблицаПодвалЧека Цикл		
		НоваяСтрока = ТаблицаПодвалЧека.Добавить();
		НоваяСтрока.ПодвалЧека = СтрокаТЧ;
	КонецЦикла;

	//	ТаблицаПодвалЧека.Загрузить(времТаблицаПодвалЧека);
	КонецЕсли;
	
	Драйвер = НСтр("ru='Не требуется'");
	Версия  = НСтр("ru='1.0'");  
	
	Элементы.ИмяПринтера.Доступность = Не ПредварительныйПросмотр;
	
	УстановитьВидимость();

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура представляет обработчик события "Нажатие" кнопки
// "ОК" командной панели "ОсновныеДействияФормы".
//
// Параметры:
//  Кнопка - <КнопкаКоманднойПанели>
//         - Кнопка, с которой связано данное событие (кнопка "ОК").
//
Процедура ЗаписатьИЗакрытьВыполнить()

   Закрыть(СохранениеПараметров());

КонецПроцедуры // ОсновныеДействияФормыОК()

&НаСервере
// Процедура, выполняет сохранение параметров формы
//
Функция СохранениеПараметров()

	ПараметрыОборудования = Новый Структура();
	ПараметрыОборудования.Вставить("НомерСекции"				, НомерСекции); 
	ПараметрыОборудования.Вставить("КодСимволаЧастичногоОтреза"	, КодСимволаЧастичногоОтреза);
	ПараметрыОборудования.Вставить("Модель"						, Модель);
	ПараметрыОборудования.Вставить("ИмяПринтера"				, ИмяПринтера);
	ПараметрыОборудования.Вставить("ТаблицаШапкаЧека"			, ТаблицаШапкаЧека.Выгрузить().ВыгрузитьКолонку("ШапкаЧека"));
	ПараметрыОборудования.Вставить("ТаблицаПодвалЧека"			, ТаблицаПодвалЧека.Выгрузить().ВыгрузитьКолонку("ПодвалЧека"));
	ПараметрыОборудования.Вставить("ШиринаЧека"					, ШиринаЧека);
	ПараметрыОборудования.Вставить("ПредварительныйПросмотр"	, ПредварительныйПросмотр);
	ПараметрыОборудования.Вставить("ВыборПринтера"				, ВыборПринтера);
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("Идентификатор", Идентификатор);
	ПараметрыЗакрытия.Вставить("ПараметрыОборудования", ПараметрыОборудования);
	
	Возврат ПараметрыЗакрытия;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ИмяПринтераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СпПринтеров = Новый СписокЗначений;
	WSHNetwork = Новый COMОбъект("WScript.Network");
	colDrives = WSHNetwork.EnumPrinterConnections();
	Если colDrives.Count()=0 Тогда
		ПоказатьПредупреждение(,"Нет принтеров",5);
	Иначе
		Для Index = 0 По colDrives.Count()-1 Цикл
			СпПринтеров.Добавить(colDrives.item(Index), colDrives.item(Index + 1));
			Index = Index + 1;
		КонецЦикла;
	КонецЕсли;
	Если СпПринтеров.Количество()>0 Тогда
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ИмяПринтераПослеВыбора", ЭтотОбъект), СпПринтеров);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Имя принтера после выбора
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ИмяПринтераПослеВыбора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ИмяПринтера = ВыбранныйЭлемент;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура для получения таблицы шапки чека
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  <ТаблицаШапкаЧека> - Результат выполнения операции.
//
Процедура ПолучитьТаблицуШапки()
	
	СтрокаРаздела = ТаблицаШапкаЧека.Добавить();
	СтрокаРаздела.ШапкаЧека = "          Магазин 'Тест'";
	СтрокаРаздела = ТаблицаШапкаЧека.Добавить();
	СтрокаРаздела.ШапкаЧека = "          г.Москва";
	СтрокаРаздела = ТаблицаШапкаЧека.Добавить();
	СтрокаРаздела.ШапкаЧека = "";
		
КонецПроцедуры // ПолучитьТаблицуШапки()

&НаСервере
// Процедура для получения таблицы подвала чека
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  <ТаблицаПодвалЧека> - Результат выполнения операции.
//
Процедура ПолучитьТаблицуПодвала()
	
	СтрокаРаздела = ТаблицаПодвалЧека.Добавить();
	СтрокаРаздела.ПодвалЧека = "";
	СтрокаРаздела = ТаблицаПодвалЧека.Добавить();
	СтрокаРаздела.ПодвалЧека = "      БЛАГОДАРИМ ЗА ПОКУПКУ!";
	СтрокаРаздела = ТаблицаПодвалЧека.Добавить();
	СтрокаРаздела.ПодвалЧека = "         ВСЕГДА ВАМ РАДЫ!";	;

КонецПроцедуры // ПолучитьТаблицуПодвала()

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ПредварительныйПросмотрПриИзменении(Элемент)
	
	ВыборПринтера = Не ПредварительныйПросмотр;	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ВыборПринтераПриИзменении(Элемент)
	
	Если ВыборПринтера Тогда
		ИмяПринтера = "";
	КонецЕсли;
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет установку доступности элементов
//
Процедура УстановитьВидимость()
	
	Элементы.ПредварительныйПросмотр.Доступность	= Истина;
	Элементы.ВыборПринтера.Доступность				= Не ПредварительныйПросмотр;	
	Элементы.ИмяПринтера.Доступность				= Не ПредварительныйПросмотр И Не ВыборПринтера;
		
КонецПроцедуры

#КонецОбласти
