
#Область СлужебныйПрограммныйИнтерфейс

// Обработчик заполнения объекта внешними данными
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Родитель") Тогда
			ЭтотОбъект.Родитель      = ДанныеЗаполнения.Родитель;
			ЭтотОбъект.Специализация = ДанныеЗаполнения.Родитель.Специализация;
		КонецЕсли;		 
		Если ДанныеЗаполнения.Свойство("Специализация") Тогда
			ЭтотОбъект.Специализация = ДанныеЗаполнения.Специализация;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.ТипЗначения = Новый ОписаниеТипов("Строка");	
		ЭтотОбъект.ТипПараметра = Перечисления.ТипыПараметровШаблоновОбследований.Статический;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик перед записью объекта 
Процедура ПередЗаписью(Отказ)	
	
	#Если НЕ МобильноеПриложениеСервер Тогда	
	Если НЕ Предопределенный
			И ЗначениеЗаполнено(Родитель)
			И Родитель = ПланыВидовХарактеристик.ПараметрыОбследований.Предопределенные Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перенос элементов в группу предопределенных параметров запрещен!");
		
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
