
#Область СлужебныеПроцедурыИФункции

// Функция определяет значения реквизитов выбранной организации.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Ссылка на организацию
//
// Возвращаемое значение:
//	Структура - реквизиты выбранной организации
//
Функция ПолучитьРеквизитыОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Организации.Наименование КАК Наименование,
	                      |	ВЫРАЗИТЬ(Организации.ПолноеНаименование КАК СТРОКА(1000)) КАК ПолноеНаименование,
	                      |	Организации.ИНН КАК ИНН,
	                      |	Организации.КПП КАК КПП,
	                      |	Организации.КодПоОКПО КАК КодПоОКПО,
	                      |	Организации.ЮрФизЛицо КАК ЮрФизЛицо,
	                      |	Организации.ОГРН
	                      |ИЗ
	                      |	Справочник.Организации КАК Организации
	                      |ГДЕ
	                      |	Организации.Ссылка = &Организация");
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Представление = Выборка.Наименование;
		Наименование = Выборка.Наименование;
		ПолноеНаименование = Выборка.ПолноеНаименование;
		ИНН = Выборка.ИНН;
		КПП = Выборка.КПП;
		ОГРН = Выборка.ОГРН;
		КодПоОКПО = Выборка.КодПоОКПО;
		ЮрФизЛицо = Выборка.ЮрФизЛицо;
		// Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		//	Свидетельство = "Свидетельство " + Выборка.СвидетельствоСерияНомер + " от " + Формат(Выборка.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
		// Иначе
		//	Свидетельство = "";
		// КонецЕсли;
	Иначе
		Представление = "";
		Наименование = "";
		ПолноеНаименование = "";
		ИНН = "";
		КПП = "";
		ОГРН = "";
		КодПоОКПО = "";
		ЮрФизЛицо = Перечисления.ЮрФизЛицо.ПустаяСсылка();
		// Свидетельство = "";
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Представление, Наименование, ПолноеНаименование, ИНН, КПП, ОГРН, КодПоОКПО, ЮрФизЛицо, Свидетельство",
		Представление,
		Наименование,
		ПолноеНаименование,
		ИНН,
		КПП,
		ОГРН,
		КодПоОКПО,
		ЮрФизЛицо//,
		// Свидетельство
	);
	
	Возврат СтруктураРеквизитов;

КонецФункции // ПолучитьРеквизитыОрганизации()

// Функция, возвращает систему налообложения.
//
Функция ПолучитьСистемуНалогообложения(Организация) Экспорт
		
	Если Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	ИначеЕсли Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция, возвращает кассира организации.
//
Функция ПолучитьКассираОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.ФИОКассира КАК Кассир
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|	И Организации.ФИОКассира <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	// Выборка = Запрос.Выполнить().Выбрать();
	//
	// Если Выборка.Следующий() Тогда
	//	Возврат Выборка.Кассир;
	// КонецЕсли;
	Возврат Запрос.Параметры.Организация.ФИОКассира;
	Возврат Неопределено;	
	
КонецФункции

// Возвращает организацию по умолчанию.
// Если в ИБ есть только одна организация, которая не помечена на удаление и не является предопределенной,
// то будет возвращена ссылка на нее, иначе будет возвращена пустая ссылка.
//
// Возвращаемое значение:
//     СправочникСсылка.Организации - ссылка на организацию.
//
Функция ОрганизацияПоУмолчанию() Экспорт
	
	Организация = ПустаяСсылка();
	
	// Запрос = Новый Запрос;
	// Запрос.Текст =
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	//|	Организации.Ссылка КАК Организация
	//|ИЗ
	//|	Справочник._ДемоОрганизации КАК Организации
	//|ГДЕ
	//|	НЕ Организации.ПометкаУдаления
	//|	И НЕ Организации.Предопределенный";
	//
	// Выборка = Запрос.Выполнить().Выбрать();
	// Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
	//	Организация = Выборка.Организация;
	// КонецЕсли;
	
	Организация = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация;
	
	Возврат Организация;

КонецФункции

// Функция, ПолучитьПодчиненныеГоловнойОрганизации.
//
Функция ПолучитьПодчиненныеГоловнойОрганизации(ГоловнаяОрганизация) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ
	|	И Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|	И Организации.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
	
	Возврат МассивОрганизаций;
	 
КонецФункции // ПолучитьПодчиненныеГоловнойОрганизации        

// Функция - Получить головную организацию.
//
Функция ПолучитьГоловнуюОрганизацию(ИНН, НеГоловную = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ
	|	И Организации.ИНН = &ИНН
	|	И Организации.ЭтоГруппа = ЛОЖЬ
	|	И Организации.ЭтоГоловнаяОрганизация = ИСТИНА";
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	Если НеГоловную Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Организации.ЭтоГоловнаяОрганизация = ИСТИНА", "");
	КонецЕсли;
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.Организация, Справочники.Организации.ПустаяСсылка());
	 
КонецФункции // ПолучитьГоловнуюОрганизацию 

// Процедура - Обработка получения полей представления.
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("Наименование");
	Поля.Добавить("ПометкаУдаления");
	Поля.Добавить("ЭтоГоловнаяОрганизация");

КонецПроцедуры

// Процедура - Обработка получения представления.
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Наименование 
	+ ?(Данные.ЭтоГоловнаяОрганизация = Истина, НСтр("ru=' (головная)';en=' (head)'"), "")
	+ ?(Данные.ПометкаУдаления = Истина, НСтр("ru=' (удален)';en=' (deleted)'"), "");
	
КонецПроцедуры

#КонецОбласти