
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Хост = ЗащитаКлиентСервер.ПолучитьЗначениеИзСтрокиПараметровПодключения("host");
	Порт = ЗащитаКлиентСервер.ПолучитьЗначениеИзСтрокиПараметровПодключения("port");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыСоединенияСЛК(СтрокаПараметров)
	
	Константы.ПараметрыСоединенияСЛК.Установить(СтрокаПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьЗначения(Команда)
	
	ЗначениеКонстанты = "host="
						+ ?(ЗначениеЗаполнено(Хост), Хост, "localhost")
						+ ?(ЗначениеЗаполнено(Порт), ";port=" + Порт, "");
	
	СохранитьПараметрыСоединенияСЛК(ЗначениеКонстанты);
	
	Закрыть();
	
КонецПроцедуры

 #КонецОбласти



