#Область ОбработчикиСобытийФормы

// Процедура - обработчик команды ЗагрузитьИзФайла.
//
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ОбщегоНазначенияКлиентСтоматология.ЗагрузитьДанныеИзФайлаВыписки(
		УникальныйИдентификатор,
		Объект.ФайлЗагрузки,
		Объект.Организация,
		Объект.БанковскийСчет,
		Объект.СтатьяДДСВходящий,
		Объект.СтатьяДДСИсходяший,
		Объект.ПроводитьЗагружаемые,
		Объект.ЗаполнятьДолгиАвтоматически,
		Объект.Программа,
		Объект.Кодировка,
		Объект.ВерсияФормата
	);
	
КонецПроцедуры // ЗагрузитьИзФайла()

// Процедура - обработчик команды СохранитьНовыеПоручения.
//
&НаКлиенте
Процедура СохранитьНовыеПоручения(Команда)
	
	ОткрытьФорму(
		"Обработка.КлиентБанк.Форма.ФормаВыгрузка",
		Новый Структура(
			"Организация, БанковскийСчетОрганизации, ФайлВыгрузки, Программа, Кодировка, ВерсияФормата",
			Объект.Организация,
			Объект.БанковскийСчет,
			Объект.ФайлВыгрузки,
			Объект.Программа,
			Объект.Кодировка,
			Объект.ВерсияФормата
		)
	);
	
КонецПроцедуры // СохранитьНовыеПоручения()

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьФильтрБанкСчетов();
	
	Если НЕ ЗначениеЗаполнено(Объект.Кодировка) Тогда
		Объект.Кодировка = "Windows";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ВерсияФормата) Тогда
		Объект.ВерсияФормата = "1.02";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.СтатьяДДСВходящий) Тогда
		Объект.СтатьяДДСВходящий = Перечисления.ВидыОпераций.ОплатаОтКлиента;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.СтатьяДДСИсходяший) Тогда
		Объект.СтатьяДДСИсходяший = Перечисления.ВидыОпераций.ОплатаПоставщику;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура сохраняет настройки формы.
//
&НаСервере
Процедура СохранитьНастройкиФормы()
	
	Настройки = Новый Соответствие;
	Настройки.Вставить("ФайлЗагрузки", Объект.ФайлЗагрузки);
	Настройки.Вставить("ФайлВыгрузки", Объект.ФайлВыгрузки);
	Настройки.Вставить("Программа", Объект.Программа);
	Настройки.Вставить("СтатьяДДСИсходяший", Объект.СтатьяДДСИсходяший);
	Настройки.Вставить("СтатьяДДСВходящий", Объект.СтатьяДДСВходящий);
	Настройки.Вставить("ПроводитьЗагружаемые", Объект.ПроводитьЗагружаемые);
	Настройки.Вставить("ЗаполнятьДолгиАвтоматически", Объект.ЗаполнятьДолгиАвтоматически);
	Настройки.Вставить("Кодировка", Объект.Кодировка);
	Настройки.Вставить("ВерсияФормата", Объект.ВерсияФормата);
	
	ХранилищеСистемныхНастроек.Сохранить("Обработка.КлиентБанк.Форма.ОсновнаяФорма/" + ?(ЗначениеЗаполнено(Объект.БанковскийСчет), ПолучитьНавигационнуюСсылку(Объект.БанковскийСчет), "БанковскийСчетНеУказан"), "ВыгрузкаВСбербанк", Настройки);
	
КонецПроцедуры // СохранитьНастройкиФормы()

// Процедура - обработчик команды ФильтрПоСчетуНажатие.
//
&НаКлиенте
Процедура ФильтрПоСчетуНажатие(Элемент)	
	ОткрытьФорму("Справочник.БанковскиеСчета.Форма.ФормаВыбора", Новый Структура("ТекущаяСтрока, Владелец", Объект.БанковскийСчет, ТекущаяСтруктурнаяЕденица()), ЭтаФорма);	
КонецПроцедуры // ФильтрПоСчетуНажатие()

&НаСервереБезКонтекста
// Получить текущию СЕ 
//
Функция ТекущаяСтруктурнаяЕденица()
   Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;	
КонецФункции

// Процедура - обработчик события ОбработкаВыбора формы.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		Объект.БанковскийСчет = ВыбранноеЗначение;
		ОбновитьФильтрБанкСчетов();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

// Загружает настройки формы.
// Если загрузка настроек осуществляется при изменении реквизита формы,
// например, для новой организации, то обязательно проверить подлючено ли 
// расширение для работы с файлами.
//
// Признаком отсутствия подключения будит информация в реквизитах объекта обработки:
// ФайлВыгрузки, ФайлЗагрузки
//
&НаСервере
Процедура ЗагрузитьНастройкиФормы()
	
	Настройки = ХранилищеСистемныхНастроек.Загрузить("Обработка.КлиентБанк.Форма.ОсновнаяФорма/" + ?(ЗначениеЗаполнено(Объект.БанковскийСчет), ПолучитьНавигационнуюСсылку(Объект.БанковскийСчет), "БанковскийСчетНеУказан"), "ВыгрузкаВСбербанк");
	
	Если Настройки <> Неопределено Тогда
		Объект.ФайлВыгрузки = Настройки.Получить("ФайлВыгрузки");
		Объект.ФайлЗагрузки = Настройки.Получить("ФайлЗагрузки");
		Объект.Программа = Настройки.Получить("Программа");
		Объект.СтатьяДДСИсходяший = Настройки.Получить("СтатьяДДСИсходяший");
		Объект.СтатьяДДСВходящий = Настройки.Получить("СтатьяДДСВходящий");
		Объект.ПроводитьЗагружаемые = Настройки.Получить("ПроводитьЗагружаемые");
		Если Настройки.Получить("ЗаполнятьДолгиАвтоматически") = Неопределено Тогда
			Объект.ЗаполнятьДолгиАвтоматически = Истина;
		Иначе
			Объект.ЗаполнятьДолгиАвтоматически = Настройки.Получить("ЗаполнятьДолгиАвтоматически");
		КонецЕсли;
		Объект.Кодировка = Настройки.Получить("Кодировка");
		Если НЕ ЗначениеЗаполнено(Объект.Кодировка) Тогда
			Объект.Кодировка = "Windows";
		КонецЕсли;
		Объект.ВерсияФормата = Настройки.Получить("ВерсияФормата");
		Если НЕ ЗначениеЗаполнено(Объект.ВерсияФормата) Тогда
			Объект.ВерсияФормата = "1.02";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьНастройкиФормы()

// Обновляет фильтр банковских счетов.
//
&НаСервере
Процедура ОбновитьФильтрБанкСчетов()
	
	Объект.Организация = Объект.БанковскийСчет.Владелец;
	
	ЗагрузитьНастройкиФормы();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(БанковскиеСчета.Владелец) = ТИП(Справочник.Организации)
	|	И НЕ БанковскиеСчета.ПометкаУдаления");
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	
	НесколькоСчетов = ВыборкаРезультата.Следующий();
	
	ЗначениеФильтраЗаполнено = ЗначениеЗаполнено(Объект.БанковскийСчет);
	
	// Настройка видимости.
	Если НесколькоСчетов Тогда
		Элементы.ПоВсемСчетам.Видимость = ЗначениеФильтраЗаполнено;
		Элементы.ФильтрПоСчету.Видимость = Истина;
	Иначе
		Элементы.ПоВсемСчетам.Видимость = Ложь;
		Элементы.ФильтрПоСчету.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		Элементы.ФильтрПоСчету.Заголовок = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Банковский счет: %1'"),
				Объект.БанковскийСчет);
	Иначе
		Элементы.ФильтрПоСчету.Заголовок = НСтр("ru='Банковский счет: По всем'")
	КонецЕсли;
	
КонецПроцедуры // ОбновитьФильтрБанкСчетов()

// Обновляет фильтр банковских счетов при записи нового банковского счета.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		СтандартнаяОбработка = Ложь;
		ОбновитьФильтрБанкСчетов();
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаписиНового()

// Отмена выбора банковского счета.
//
&НаКлиенте
Процедура ПоВсемСчетам(Команда)
	
	Объект.БанковскийСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
	ОбновитьФильтрБанкСчетов();
	
КонецПроцедуры // ПоВсемСчетам()

// Процедура - обработчик команды Настройка.
//
&НаКлиенте
Процедура Настройка(Команда)
	
	ОткрытьФорму("Обработка.КлиентБанк.Форма.ФормаНастройка",
		Новый Структура(
			"Кодировка, Программа, ВерсияФормата, СтатьяДДСВходящий, СтатьяДДСИсходяший, ПроводитьЗагружаемые, ЗаполнятьДолгиАвтоматически, УникальныйИдентификатор, ФайлВыгрузки, ФайлЗагрузки",
			Объект.Кодировка, Объект.Программа, Объект.ВерсияФормата, Объект.СтатьяДДСВходящий, Объект.СтатьяДДСИсходяший, Объект.ПроводитьЗагружаемые, Объект.ЗаполнятьДолгиАвтоматически, УникальныйИдентификатор, Объект.ФайлВыгрузки, Объект.ФайлЗагрузки
		)
	);
	
КонецПроцедуры // Настройка()

// Процедура - обработчик события ОбработкаОповещения формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастроек" + УникальныйИдентификатор Тогда
		Объект.ФайлЗагрузки = Параметр.ФайлЗагрузки;
		Объект.ФайлВыгрузки = Параметр.ФайлВыгрузки;
		Объект.Кодировка = Параметр.Кодировка;
		Объект.ВерсияФормата = Параметр.ВерсияФормата;
		Объект.Программа = Параметр.Программа;
		Объект.СтатьяДДСВходящий = Параметр.СтатьяДДСВходящий;
		Объект.СтатьяДДСИсходяший = Параметр.СтатьяДДСИсходяший;
		Объект.ПроводитьЗагружаемые = Параметр.ПроводитьЗагружаемые;
		Объект.ЗаполнятьДолгиАвтоматически = Параметр.ЗаполнятьДолгиАвтоматически;
		СохранитьНастройкиФормы();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти