
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипВнешнейСистемы				 = Перечисления.ТипыВнешнихСистем.CoMagic;
		Объект.КлючПриложения					 = Строка(Новый УникальныйИдентификатор);
		СформироватьНаименование();
//		Элементы.ГруппаИнструкция.Видимость		 = Истина;
		Элементы.ПоказатьИнструкцию.Видимость	 = Ложь;
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	Иначе
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();		
		Если ЗначениеЗаполнено(ПараметрыВнешнейСистемы) И ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда
			ПараметрыВнешнейСистемы.Свойство("Токен"		, ЭтотОбъект.Токен);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСоответствияДоменамСЕ();
	
	УидСессии = ЛичныйКабинет.УидТекущейСессии();
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если ЭтотОбъект.Токен = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Токен"" обязательно для заполнения.",,,, Отказ);
	КонецЕсли;

	ПроверитьНастройкиЛичногоКабинетаПередЗаписью(Отказ);

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект);
	Справочники.ВнешниеСистемы.ПодключитьВнешнююСистему(РеквизитФормыВЗначение("Объект"), Отказ, УИДСессии);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
	ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	Оповестить("ЗаписанаВнешняяСистема", ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, копирует URL.
//
Процедура СкопироватьКлючПриложения(Команда)
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(Объект.КлючПриложения);	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Скопировано';en='Copied'"));	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ПоказатьИнструкцию(Команда)
	
	Элементы.ПоказатьИнструкцию.Пометка = Не Элементы.ПоказатьИнструкцию.Пометка;
	Элементы.ГруппаИнструкция.Видимость = Элементы.ПоказатьИнструкцию.Пометка;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, обработчик оповещения.
//
Процедура ПослеВопросаОРегистрацииВЛК(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Обработка.ЛичныйКабинет.Форма");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет соответствия доменным именам структурных единиц.
//
Процедура ЗаполнитьСоответствияДоменамСЕ()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ЭтоГруппа
	|	И НЕ СтруктурныеЕдиницы.ПометкаУдаления");
	
	СписокСЕ = Запрос.Выполнить().Выгрузить();
		
	МассивСтруктурныхЕдиниц = Новый Массив;
		
	СтруктураПараметров = Объект.Ссылка.Параметры.Получить();
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") И СтруктураПараметров.Свойство("МассивСтруктурныхЕдиниц") Тогда				
		МассивСтруктурныхЕдиниц = СтруктураПараметров.МассивСтруктурныхЕдиниц;		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из СписокСЕ Цикл
		
		НоваяСтрока = ЭтотОбъект.СоответствиеДоменовСЕ.Добавить();
		НоваяСтрока.СтруктурнаяЕдиница = СтрокаТЧ.Ссылка;
		
		Если ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) Тогда
			
			Для Каждого ЭлементМ Из МассивСтруктурныхЕдиниц Цикл
				
				Если СтрокаТЧ.Ссылка = ЭлементМ.СтруктурнаяЕдиница Тогда
					НоваяСтрока.ДоменноеИмя = ЭлементМ.ДоменноеИмя;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	МассивСтруктурныхЕдиниц = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СоответствиеДоменовСЕ Цикл			
		МассивСтруктурныхЕдиниц.Добавить(Новый Структура("СтруктурнаяЕдиница, ДоменноеИмя", СтрокаТч.СтруктурнаяЕдиница, СтрокаТч.ДоменноеИмя)); 			
	КонецЦикла;	
	
	ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы = Неопределено Тогда
		ПараметрыВнешнейСистемы = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыВнешнейСистемы.Свойство("МассивСтруктурныхЕдиниц") Тогда
		ПараметрыВнешнейСистемы.МассивСтруктурныхЕдиниц = МассивСтруктурныхЕдиниц;
	Иначе
		ПараметрыВнешнейСистемы.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	КонецЕсли;
	
	ПараметрыВнешнейСистемы.Вставить("Токен"			, ЭтотОбъект.Токен);

	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы); 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, проверяет публикацию информационной базы.
//
Функция ПроверитьПубликациюИнформационнойБазы()
	
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(Константы.ВнешняяПубликацияАдрес.Получить());
	
	Если РезультатПроверки.ВыполненоУспешно Тогда
		Возврат РезультатПроверки.ПубликацияВерна;  
	КонецЕсли;  
	
	Если НЕ (РезультатПроверки.ВыполненоУспешно И РезультатПроверки.ПубликацияВерна = Истина) Тогда
		
		ТекстСообщения = НСтр("ru='При проверке публикации возникла ошибка: ';
							|en='With checking publications originated mistake:'") + РезультатПроверки.ОписаниеОшибки;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, устанавливает служебного пользователя.
//
Процедура УстановитьСлужебногоПользователя()
		
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет проверку перед записью объекта.
//
Процедура ПроверитьНастройкиЛичногоКабинетаПередЗаписью(Отказ)
	
	Если Не ЭтоОблако Тогда
		
		РезультатПроверки = ПроверитьПубликациюИнформационнойБазы();
		Если Не РезультатПроверки Тогда
			
			ИмяФормыОбработки = "Обработка.ЛичныйКабинет.Форма.ФормаНастройкиВнешнейПубликации";
			ОткрытьФорму(ИмяФормыОбработки,,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Пояснение		 = НСтр("ru = 'Необходимо настроить внешнюю публикацию'");
			СтатусОповещения = СтатусОповещенияПользователя.Важное;
			ПоказатьОповещениеПользователя(,,Пояснение, БиблиотекаКартинок.Предупреждение32, СтатусОповещения);
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УидСессии) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОРегистрацииВЛК", ЭтотОбъект);
		ТекстВопроса = Нстр("ru = 'Необходимо авторизоваться в личном кабинете. Открыть личный кабинет?';
							|en = 'Is necessary to log in to your account. Open private cabinet?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();

	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
//
Процедура УдалитьИЗакрыть(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Вы точно хотите пометить на удаление данный элемент справочника?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, 
        КодВозвратаДиалога.Да
    );    
 
	
КонецПроцедуры

 &НаКлиенте
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
	    ПометитьНаУдаление();
		
		ПараметрыОповещения = Новый Структура;
        ПараметрыОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
		ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);

		Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление()
	
		ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
		ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
		ВнешняяСистемаОбъект.Используется = Ложь;
		
		Попытка
			ВнешняяСистемаОбъект.Записать();
		Исключение 
 		КонецПопытки;
		
КонецПроцедуры

#КонецОбласти
